{"title": "51.pdf", "contents": "In recent years, several studies have pointed out the importance of pain-related fear in the development and maintenance of chronic pain.\nRecently, a version of this questionnaire has been developed for administration among the general population (TSK-G).\nThe one-factor TSK-G also appeared valid after comparison with scores on measures of catastrophizing and general health status.\n(1990), scientific attention for the concept of pain-related fear in relation to chronic pain has increased.\nOne of the clinical fields of interest in this respect concerns disability as a consequence of chronic low back pain.\nSeveral studies have shown the relevance of fear-avoidance beliefs in this field (Lethem et al.\nThis model presents a possible pathway by which injured patients either become mired in a negative spiral leading to disability, or successfully recover.\nwho is convinced that his/her body is extremely vulnerable, weak, and must be carefully protected from overstrain) is likely to be fearful of movement/(re)injury when experiencing pain.\nOn the other hand, a patient who does not catastrophize about pain will be more likely to resume daily activities and recover successfully.\nHowever, from a prevention point of view it would be worthwhile to find out whether the fear of movement/(re)injury also occurs in the general population.\nResearch indeed showed that the presence of fear-avoidance beliefs about work in the acute state of low back pain predicted disability 4 weeks later (Fritz et al.\nIn addition, a study by Buer and Linton (2002) showed that fear-avoidance beliefs and pain catastrophizing already existed in the general population of nonpatients.\nBesides fear-avoidance beliefs in the general population, health care providers also tend to hold fear-avoidance beliefs.\n1990), the Fear Avoidance Beliefs Questionnaire (FABQ; Waddell et al.\nThe TSK has been specifically designed to measure fear of movement/(re)injury in patients with low back pain and consists of 17 statements, which have to be rated on a 4-point scale ranging from strongly disagree to strongly agree.\n77) and having predictive validity.\nScores on the TSK were better predictors of disability levels in chronic low back pain patients than were, for example, pain intensity or biomedical findings (Vlaeyen et al.\n(1995b) conducted a principal component analysis with oblique rotation on all 17 items.\nbeled harm, fear of (re)injury, importance of exercise, and avoidance of activity.\n2% of the total variance.\n(1996) performed a principal component analysis with Varimax rotation and found two factors, labeled activity avoidance and pathological somatic focus, explaining 49% of the total variance.\n(2004) compared four-factor models for the TSK using confirmatory factor analysis in chronic low back pain and fibromyalgia patients, namely a one-factor model (17 items), the four-factor model of Vlaeyen et al.\n(1995b), a one-factor model without reversed items, and the two-factor model of Clark et al.\nThe results showed that for both chronic low back pain patients and fibromyalgia patients, the two-factor model of Clark et al.\nMoreover, the two-factor model was found to be invariant across both patient groups, indicating that the model is robust in both the samples of patients with pain.\nThe purpose of the current study was (1) to determine the factor structure of the TSK-G, (2) to determine the internal consistency of the TSK-G factors, and (3) to examine the validity of the TSK-G by comparing scores on the TSK-G with data gathered.\nThe study consisted of two parts.\nFirst, a booklet of questionnaires was sent to a random sample of 8000 persons aged 25 and above, living in the Netherlands, stratified by 10 years age group and sex.\nThis sample was drawn from the Dutch population register of 1998.\nPeople who did not return the booklet received a maximum of two reminders (after 3 and after 6 weeks).\nIn total, 3664 persons returned the questionnaire.\nAs a part of this first booklet, people were also asked to state if they were willing to complete a follow-up questionnaire.\nThose who agreed received a second booklet 6 months after the first.\nFor the current study, data only from the first booklet were used.\nFurthermore, persons only between 25 and 65 years of age were included in the analyses.\nSubjects who had missing values on the TSK-G in the first booklet were excluded, leaving a total of 2240 persons with valid data.\nAnalyses were carried out separately for people with and without back complaints at the moment of completing the questionnaire or in the year before, because the presence of back pain is assumed to influence the results.\nThus, the sample consisted of 1029 persons with back complaints and 1211 persons without back complaints.\nThe booklet consisted of 28 pages in full color, with items regarding the presence of musculoskeletal complaints, consequences of these complaints, determinants, other physical complaints, and sociodemographic variables.\nThe Pain Catastrophizing Scale (PCS) is a 13item questionnaire, in which patients reflect upon past experiences of pain and have to indicate on a 5-point scale (ranging from not at all to constantly) to which degree they experienced painrelated thoughts and feelings.\nA higher score on the PCS points towards a higher degree of pain catastrophizing cognitions.\nThe PCS has been found to be sufficiently reliable and valid (Severeijns et al.\n2002; Sullivan et al.\n1995; Van Damme et al.\nThe RAND-36 (Zee and Sanderman, 1993) was included in the booklet as a measure of general health status.\nIt is a short version of the RAND Health Insurance Study Questionnaire consisting of 36 items divided over 9 subscales: (1) physical functioning, (2) social functioning, (3) role restrictions due to physical problems, (4) role restrictions due to emotional problems, (5) mental health, (6) vitality, (7) pain, (8) perceived general health, and (9) perceived changes in health status.\nA higher score on these subscales denotes a better health status.\nThe RAND-36 bears close resemblance to the SF-36.\nInteresting for this study are the subscales 1, 2, 3, 7, and 8 (physical functioning, social functioning, role restrictions due to physical problems, pain, and perceived general health), because based on previous research fear of movement/(re)injury is expected to be related to limitations in physical as well as social functioning, and possibly even to pain (Vlaeyen and Linton, 2000).\nThe TSK has been specifically designed to measure fear of movement/(re)injury (Kori et al.\nThe TSK consists of 17 statements, which have to be rated on a 4-point scale ranging from strongly disagree to strongly agree.\nThe Dutch version of the TSK has been shown to be sufficiently reliable and valid (Goubert et al.\n2004; Vlaeyen et al.\nFor the TSK-G, items have been rephrased in such a way that people without low back pain can complete them.\nA higher score on the TSK-G reflects a higher degree of fear of movement/(re)injury.\nSince a recent experience with low back pain could influence scores on the TSK-G, it was decided to carry out the analyses for the people with and without complaints, separately.\nExploratory factor analysis was carried out with a Principal Axis Factor Analysis (PAF) with an oblique rotation, using SPSS 11.\nFactors were extracted until the Eigenvalue dropped below 1 or until the Eigenvalue hardly changed between two subsequent factors, visible as a levelling off in the Scree plot.\nIf an item loaded on more than one factor, the item was removed if the difference in loading was below 0.\nModifications were carried out until changes in Chi-square of the modifications dropped below 4, or until the NonNormed Fit Index (NNFI) reached the level of 0.\nValidity was studied by firstly examining relationships with other variables such as pain catastrophizing and selected subscales referring to general health status using Pearson correlation coefficients.\nAs described before, a total of 2240 persons were included in the analyses.\nBefore starting with the exploratory factor analysis both samples were randomly split in half.\nFor the exploratory factor analysis a sample of 515 persons with low back complaints and 605 persons without low back complaints was available.\nBefore factor analysis, inter-item correlations were computed.\nThese showed that the four reversed key items (4, 8, 12, and 16) had generally low intercorrelations with the other TSK-G items.\nFurthermore, preliminary factor analyses with all 17 TSK-G-items showed that these four items were never included in factors with other items, but always formed separate factors by themselves.\nWhen looking at the content of these items, this is unexpected.\n2004), and since feedback from clinical experience has also shown that patients find these reversed key items confusing, it was decided not to include them in any further analysis.\nFor the sample of persons with back complaints the KaiserMeyerOlkin measure (0.\nWith back complaints (N = 517) Without back complaints (N = 609).\nNo Item Mean (SD) Factor loadings Mean (SD) Factor loadings.\n2 If I had low back pain and I were to try to overcome it, my pain would increase 2.\n4 Back pain decreases when a person stays physically active 2.\n6 If I had long-term low back pain, the rest of my life would become endangered 1.\n7 Back pain means the body is injured 2.\n489 8 If back pain increases through physical activity, that doesnt mean that it is dangerous 2.\n536 10 The safest way to prevent back pain from worsening, is being careful not to make any unnecessary movements 2.\n12 If I had back pain, I would try to stay physically active 3.\n14 For a person with back complaints it is not advisable to be physically active 1.\n15 I cant do all the things normal people do, because I think I can easily get back complaints 1.\n16 Even though something would cause me a lot of back pain, I dont immediately think it is dangerous 2.\n17 I should not have to exercise if I would have back pain 1.\n000) both justified continuation of the analysis.\nSubsequent factor analysis showed that item 11 had an insufficient factor loading.\nThe remaining 12 items made up one factor.\nFactor loadings and reasons for exclusion for these items are shown in Table I.\n79, which is sufficient.\n000) were again both sufficient.\n6%, and Cronbachs alpha was 0.\nFactor loadings and reasons for exclusion are again shown in Table I.\nA confirmatory factor analysis was carried out using the LISREL 8.\nThe one-factor model that was described above was tested for the.\n5Cronbachs alpha of the 17-item TSK-G was.\n75 for the sample with low back complaints and.\nFor the sample of persons with low back complaints, results provided by LISREL showed that the one-factor model fitted reasonably to the data (Non-Normed Fit Index (NNFI) = 0.\nAfter adding an error covariance between items 13 and 14, the NNFI reached the level of 0.\nChi-square for this model was 161.\nNext, the same procedure was followed for the second half of the sample of persons without low back complaints.\nThe NNFI reached the level of 0.\nChi-square for the final model was 130.\n4 (df = 50; p < 0.\nBoth the first and final models were identified.\nTo determine the validity of the TSK-G, sumscores were compared to scores on measures of pain catastrophizing and selected subscales of general health status.\nAs a measure of pain catastrophizing a sumscore on the PCS was calculated.\nSince both samples with and without low back pain showed the same factor structure, it was decided to join both samples and carry out the following analyses on the group as a whole.\nHowever, in the regression analyses, having low back pain or not was added as a covariate.\nOther covariates in the regression analyses were gender and age.\nAs can be seen, a higher degree of pain-related fear is associated with a higher degree of pain catastrophizing and lower general health status.\nFinally, it appears that being male was associated with less pain catastrophizing and a better general health status.\nThe purpose of the current study was (1) to determine the factor structure of the TSK-G, (2) to determine the internal consistency of the TSK-G factors, and (3) to examine the validity of the TSK-G by comparing scores on the TSK-G with data gathered in the same study on pain catastrophizing and.\nRegression Analyses With TSK-G-Scores As a Predictor for Pain Catastrophizing and Subscales of General Health Status.\nRole restrictions due to physical problem Pain Perceived general health.\nSimilar to previous psychometric research with the TSK, it appears that the four reversed key items of the TSK-G provide problems for persons completing the questionnaire.\nSince this is a consistent finding in studies with the TSK, it might be worthwhile to rephrase these items in the same direction as the other items, and study whether they contribute to the reliability and validity of the TSK.\nThe content of these four items does seem relevant upon the first glance.\nFrom the remaining 13 items of the TSK-G, only one was excluded during exploratory factor analysis because of a factor loading that was too low.\nIn the adapted item from the TSK-G, less emphasis is put on the potential threat of something being wrong with the back.\nThus, it might be that this item taps less into the concept of pain-related fear, and because of this is excluded from factor analysis.\nPerhaps a better adaptation for the TSK-G would read There is back pain, because there is some-.\nSumming up, exploratory factor analysis showed that the TSK-G consists of one factor, made up out of 12 items, and this structure was the same for people with and without low back complaints in the year before completing the questionnaire.\nInternal consistency (Cronbachs alpha) was 0.\n79 for the people with low back complaints and 0.\n78 for the people without low back complaints.\nConfirmatory factor analysis on the second half of the sample of persons with and without low back complaints showed similar results to the exploratory analysis.\nFor the persons with low back complaints an adequately fitting model was found with the addition of one error covariance.\nFor the people without low back complaints, four error covariances were added before the model fitted sufficiently.\nThe addition of several covariances might be an indication that the factor structure needs adaptation, since it shows that there is variance unexplained by the proposed model.\nThis is especially necessary if these covariances show a distinct pattern.\nHowever, no pattern was observed in this case.\nThe validity of the TSK-G was determined by comparing scores on this measure with scores for pain catastrophizing and scores for the subscales physical functioning, social functioning, role restrictions due to a physical problem, pain, and perceived general health from the RAND-36.\nPearson correlation coefficients showed that a higher degree of painrelated fear was associated with a higher degree of catastrophizing cognitions and poorer health as measured on the subscales of the RAND-36.\nThe magnitude of the correlations is not really high, but scores are not compared to a gold standard but to measures of concepts that are expected to be related.\nFurthermore, the correlation with the PCS is the highest, and this is also the measure that, from a biopsychosocial model, is conceptually the closest (Vlaeyen and Linton, 2000).\nRegression analyses also showed TSK-G scores to be consistently associated with scores on pain catastrophizing and general health as measured by the RAND-36 subscales.\nIt was the strongest predictor with regard to pain catastrophizing, physical and social functioning, and perceived general health, when controlling for age, gender, and whether or not a person had had back complaints during the last year.\nHowever, the regression models explained only a relatively small amount of the variance on the dependent variables.\nUntil now, only a few studies with the TSK-G have been carried out.\n(2002) used the data from the DMC3-study to determine whether future back complaints could be predicted from scores on the TSK-G.\nAll 17 items were used to calculate a sumscore, which was predictive of low back pain and disability measured with the follow-up questionnaire of the DMC3-study (Picavet et al.\nalso used a sumscore of all 17 TSK-G items in an experiment on the predictive value of pain-related fear with regard to somatosensory hypervigilance in chronic low back pain patients.\nPatients completed the regular TSK, whereas healthy controls completed the TSK-G.\nAs expected, scores of the healthy controls were found to be in between scores of lowfearful and high-fearful patients (Peters et al.\nThe problem with both these studies is that till that time the psychometric properties of the TSK-G had not been studied.\nAlthough not very likely, it is possible that the results would have been different if the conclusions of the current study had been known.\nSeveral studies have shown low back pain to be a medical, social, and economical problem (Waddell, 1998).\nThe largest part of this problem is accounted for by a relatively small group of people with chronic complaints (Nachemson, 1992).\nAttention of clinicians has therefore shifted towards prevention of chronicity.\nThe TSK-G can be useful in determining people at risk for developing chronic back complaints.\nThe current study gives preliminary data with regard to the TSK-G.\nMore extensive data are needed on the predictive value of the (one factor; 12 item) TSK-G for developing (chronic) low back complaints.\nLooking at the TSK-G scores from the current study, it seems that they are a few points lower than those of acute (Sieben et al.\n2002; Swinkels Meewisse et al.\n2003), as well as chronic (Crombez et al.\n1999; Peters et al.\n2002; Vlaeyen et al.\nFurther research is needed to determine which people might be at risk for developing chronic low back pain problems,.\nbut it could be assumed that cut-off points should probably also be a few points lower than those based on the regular TSK.\nScores on the TSK-G were normally distributed, were similar for people with and without low back complaints, and varied almost along the full range of the scale.\nCut-off points on the 12-item TSK-G (with 17-item TSK-G scores between parentheses) based on the 2240 people included in the current study would be 21 (32) points for a median-split.\nFor a division based on lower and upper tertile the cut-off points would be 18 (29) and 24 (36) points respectively.\nAnother method for determining cut-off points on the TSK-G is the receiver operating characteristic (ROC) method (Hanley and McNiell, 1982).\nFor the use of this method, prospective data are needed on TSK-G scores and whether or not people have developed chronic low back pain.\nBy making a graph of true positives versus false positives for several cut-off points, the optimal cutoff point can be determined.\nThis method could not be used in the current study, since no data were available on the development of chronic low back pain.\nAdditionally, it would be interesting to determine whether the regular TSK and the TSK-G can be related to each other.\nIt might be expected that this is the case, since the TSK-G is merely an adaptation of the items from the TSK, and so the scale can be administered to people without complaints.\nHowever, it needs to be studied first whether scores gathered on the TSK-G are still useful as a measure of painrelated fear when a person has developed low back complaints, or if the regular TSK should then be administered.\nIn conclusion, the factor structure of the TSK-G appears to be similar for people with and without low back complaints.\nThe TSK-G consists of one internally consistent factor, made up of 12 items.\nHigh TSK scores predict pain catastrophizing, pain intensity, and pain-related health indices, even when controlling for the presence of low back pain.\nIt is recommended to use TSK-G as a measure of pain-related fear in general population studies.\nThe authors thank the National Institute for Public Health and the Environment for kindly providing the data for this study.\nThis study was supported by Grant No.\n904-59-108 of the Council for Medical and Health Research of the Netherlands Organization for Scientific Research (MW-NWO), and by Grant No.\n5214 of the National Fund for Public Mental Health.\nFear-avoidance beliefs and catastrophizing: Occurrence and risk factor in back pain and A.\nKinesiophobia and chronic pain: Psychometric characteristics and factor analysis of the Tampa Scale.\nPain-related fear is more disabling than pain itself: Evidence on the role of pain-related fear in chronic back pain disability.\nThe role of fear-avoidance beliefs in acute low back pain: Relationships with current and future disability and work status.\nConfirmatory factor analysis of the Tampa Scale for Kinesiophobia: Invariant twofactor model across low back pain patients and fibromyalgia patients.\nKinesiophobia: A new view of chronic pain behavior.\nOutline of a fear-avoidance model of exaggerated pain perception: I.\nAre fear-avoidance beliefs related to the inception of an episode of back pain? A prospective study.\nThe back pain beliefs of health care providers: Are we fear-avoidant? J.\nThe Pain Anxiety Symptoms Scale: Development and validation of a scale to measure fear of pain.\nIs pain-related fear a predictor of somatosensory hypervigilance in chronic low back pain patients? Behav.\nMusculoskeletal pain in the Netherlands: Prevalences, consequences and risk groups, the DMC(3)-study.\nKlachten van het bewegingsapparaat in de Nederlandse bevolking.\nPain catstrophizing and kinesiophobia: Predictors of chronic low back pain.\nThe Tampa Scale for Kinesiophobia: Further examination of psychometric properties in patients with chronic low back pain and fibromyalgia.\nPain catastrophizing and general health status in a large Dutch community sample.\nPain-related fear in acute low back pain: The first two weeks of a new episode.\nThe pain catastrophizing scale: Development and validation.\nA confirmatory factor analysis of the Pain Catastrophizing Scale: Invariant factor structure across clinical and non-clinical populations.\nThe modified Tampa Scale for Kinesiophobia: for its use in non-pain samples.\nFear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nThe role of fear of movement/(re)injury in pain disability.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nA Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fear-avoidance beliefs in chronic low back pain and disability."}