{"title": "52.pdf", "contents": "Abstract: Cognitive-behavioral models of chronic low back pain (CLBP) predict that dysfunctional assumptions about the harmfulness of activities may maintain pain-related fear and disability levels.\nThis study examined the psychometric properties of a short electronic version of the PHODA (PHODA-SeV).\nThe test-retest reliability and stability of the PHODA-SeV over a 2-week time interval are good, with discrepancies between 2 measurements over 20 points suggesting true change.\nThe construct validity is supported by the finding that both self-reported pain severity and fear of movement/(re)injury were uniquely related to the PHODA-SeV.\nValidity is further corroborated by the finding that patients who have received exposure in vivo, that aimed to systematically reduce the perceived harmfulness of activities, had significantly lower PHODA-SeV scores after treatment than patients receiving graded activity that did not address these assumptions.\nThe findings support the PHODA-SeV as a valid and reliable measure of the perceived harmfulness of activities in patients with CLBP.\nPerspective: This article describes a pictorial measurement tool (PHODA-SeV) for the assessment of the perceived harmfulness of activities in patients with chronic low back pain.\nThe PHODA-SeV has good psychometric properties and can be used to elaborate on the contribution of beliefs about harmful consequences of activities to pain and disability.\nany people will experience acute low back pain (LBP) during their lifetime, of whom fortunately only few will develop chronic low back pain (CLBP).\n59,61 There are several cognitive behavioral models that try to explain the development and maintenance.\nof CLBP in a subgroup of patients by assigning a central role to the concept of pain-related fear.\n25,33,55,57,60 Painrelated fear has been linked to the development of a new LBP episode in currently pain-free people,24,27,34,47.\nand it may be a risk factor for the development of chronic complaints out of an acute episode.\n7,24,34,43 Not only is pain-related fear associated with disability during the chronic stage,1,16,18,24 but the treatments that aim to reduce pain-related fear in these patients have also been found to be effective.\nPain-related fear is a general, overarching construct, encompassing various specific fears.\nFor example, a more specific fear is fear of movement/(re)injury, which signifies the fear that certain movements may be harmful to.\nthe back by causing (re)injury.\n57 The Tampa Scale for Kinesiophobia (TSK)30 is a brief questionnaire that measures the extent to which patients with chronic pain experience fear of movement/(re)injury.\nAlthough psychometric studies have supported the reliability and validity of the TSK,19,37 a limitation is that it does not provide information about which specific movements or activities a patient fears or avoids.\nFor this objective, the Photograph Series of Daily Activities (PHODA)23 may be more appropriate.\nThe PHODA is an instrument that includes photographs of various daily activities.\nBack pain patients have to indicate to what extent they perceive these daily activities to be harmful to the back.\nHence, the PHODA is a straightforward tool that specifically focuses on a patients judgements about the harmful consequences of certain movements.\nIn addition to being used to guide treatment decisions, the PHODA has been used as a measurement instrument in several studies that examined the effectiveness of exposure in vivo in CLBP.\n6,11,12,28,48,50-53 Despite these previous applications, the psychometric properties of the PHODA have never been studied.\nDespite the PHODA holding promise, its administration is not completely standardized, and its application can be rather time-consuming, both because it consists of 100 photographs and because there is no automatic data storage.\nThis study aims to develop and then report on the psychometric properties of a shortened electronic version derived from the original PHODA (PHODA-SeV; both versions of the PHODA can be ordered by e-mail: PHODA@HSZuyd.\nMore specifically, this study aims to investigate the factor structure, internal consistency, test-retest reliability, stability, and construct validity of the PHODA-SeV.\nFurthermore, preliminary normative data about the PHODA-SeV are presented.\nParticipants and Procedure All participants were derived via their referral for participation, or actual participation, in a randomized clinical trial (RCT) that studied the effectiveness of exposure in vivo as compared to graded activity in patients with CLBP (ISRCTN88087718).\nThe institutional ethics committee approved the research protocol, and all participants provided informed consent.\nDifferent subgroups of this study sample were included for the various analyses of this study.\nIn total, 113 patients with CLBP, who were referred by physicians from various rehabilitation facilities in the Netherlands, completed the PHODA-SeV as part of the initial screening procedure for participation in the RCT.\nOf the patients performing this screening procedure, 85 satisfied the selection criteria, and were included in.\nThe inclusion criteria were: (1) to have back pain for at least 3 months, (2) to have back pain that was not caused by a serious spinal injury,58 (3) to be between 18 and 65 years old, (4) and to report at least some fear of movement/(re)injury (TSK 33).\nExclusion criteria were: (1) to have too little disability (Roland Disability Questionnaire 4), (2) to be illiterate, (3) to be pregnant, (4) to report substance abuse, (5) to be involved in any litigation concerning disability income, (6) to have specific medical disorders or cardiovascular diseases preventing participation in physical exercise, and (7) to present with serious psychopathology (as determined with Dutch norms of the SCL-90).\nThe included participants then completed 2 measurements before start of treatment with a test-retest interval of 2 weeks, during which they also completed the PHODA-SeV.\nBecause PHODA-SeV data of the second pretreatment measurement were lost for 1 participant due to computer failure, 84 participants with both pretreatment measurements remained.\nThe included patients (N  85) were randomized, with prestratification on the basis of the degree of pain catastrophizing and disability, either to exposure in vivo (N  42) or to graded activity (N  43).\nThe PHODA-SeV was again administered at the end of treatment.\nDue to refusal to complete post-treatment measurement (N  2 out of the 10 who prematurely terminated exposure in vivo, and N  8 out of the 14 who prematurely terminated graded activity), pretreatment and post-treatment measurements of the PHODA-SeV were available for N  40 in the exposure in vivo group and for N  35 in the graded activity group.\nThe original PHODA23 was developed out of a need for a diagnostic tool to determine the perceived harmfulness of different physical activities and movements.\nThe point of departure in this development consisted of 8 possible movements (lifting, bending, turning, reaching, falling, intermittent load, unexpected movement, and long-lasting load in stance or sit with limited dynamics), which were derived from basic movements (extending, inflecting, rotating, lateral inflecting, compression, and traction) and 2 manners of moving (static and dynamic).\nThese 8 possible movements were then set against 4 areas of daily occupations (activities of daily living, housekeeping, work, and sport and leisure time) and converted into recognizable and frequent activities instead of in terms of their biomechanics.\nThe resulting list of movements and activities was tested, corrected, and supplemented by several experts on CLBP (human movement scientists, physical therapists, and psychologists).\nFinally, this resulted in 100 photographs of daily activities.\nThe patient, who sits in front of a computer monitor, is exposed to the photographs, and is requested to drag each photograph along a harmfulness thermometer ranging from 0 (not harmful al all) to 100 (extremely harmful).\nThe following verbal instruction is given before the start of the test: Please observe each photograph carefully, and try to imagine yourself performing the same movement.\nEach photograph is given a rating according to its position on the thermometer.\nDue to the electronic administration, this assessment tool is highly standardized and the data are automatically stored into an electronic database.\nThe basic properties of the original PHODA (such as the instruction, the possibility for the patient to move the pictures along the harmfulness thermometer at any time, the fact that all pictures remain visible along the fear thermometer) are maintained, except for the interaction with the therapist.\nThe time to complete the PHODA-SeV is approximately 10 minutes.\nThe Dutch version56 of the Tampa Scale for Kinesiophobia (TSK)30 was administered as a self-report measure of fear of movement/(re)injury.\nThe TSK consists of 17 statements that can be rated on a 4-point scale ranging from strongly disagree to strongly agree.\nThe total score is calculated after inversion of items 4, 8, 12, and 16, which are phrased in reversed key.\nThe Dutch version of the TSK has been shown to have adequate.\nSeveral studies demonstrated the TSK to have an invariant two-factor structure among various pain diagnoses.\nPain catastrophizing is defined as an exaggerated negative orientation towards actual or anticipated pain experiences.\nThe total score ranges between 0 and 52.\nThe PCS has been shown to consist of 3, highly internally consistent, subscales31,41,46, and to have a good test-retest reliability.\nValidity of the PCS was supported by the finding that people who score high on catastrophizing report more negative pain-related thoughts, more emotional distress, and more pain when undergoing a painful procedure than those low on catastrophizing.\n41 Moreover, the PCS shows a positive association with another measure of catastrophizing.\nThe Dutch version of the Roland Morris Disability Questionnaire (RDQ)3,17,39 was used to determine the level of functional disability.\nThe RDQ aims to measure the severity of perceived disability by questioning about limitations concerning 24 activities of daily living that can be answered by either yes or no.\nThe RDQ has a high testretest reliability39 and is responsive to change.\n20,36 Validity of the RDQ was supported by its associations with other self-reported and performance based disability measures.\nParticipants were asked to indicate their current pain intensity on a 100-mm visual analogue scale ranging from no pain at all to unbearable pain, which was part of the McGill Pain Questionnaire (MPQ).\nThe test-retest reliability was determined by calculating a Pearson correlation over the 2 pretreatment measurements.\nAlso, the stability of the PHODA-SeV was studied by testing the equality of the mean scores of both measurements by the paired t test, and checking equality of the variances at both time points.\nWe furthermore plotted the difference between the 2 measurements against their mean, as suggested by Bland and Altman.\n5 Using the average and standard deviation of the intra-individual difference between the 2 measurements, we computed the limits of agreement and a confidence interval for those limits.\nThe construct validity of the PHODA-SeV was investigated in 2 ways.\nFirst, we determined with Pearson correlation coefficients whether the PHODA-SeV was associated with a measure of fear of movement/(re)injury (TSK), pain catastrophizing (PCS), functional disability (RDQ), and current pain intensity (MPQ current pain intensity).\nFor these analyses, we used the inclusion group (N  84).\nFurthermore, to adjust for common variance between these constructs, a multiple linear regression analysis was performed with the PHODA-SeV as the dependent variable and the TSK, PCS, RDQ, and MPQ current pain intensity as independent variables.\nThe second method we used to determine the construct validity of the PHODA-SeV was to investigate whether patients who received exposure in vivo treatment demonstrated lower post-treatment PHODA-SeV scores than those who received graded activity.\nExposure in vivo treatment is designed specifically to address and diminish the perceived harmfulness of activities, as opposed to graded activity, which is designed to address the reinforcing consequences of pain behavior.\nTherefore differential decreases in perceived harmfulness of activities are to be expected between these groups (for a detailed description of rationales and mechanisms of exposure treatment and graded activity see Vlaeyen et al and Sanders, respectively).\nComplete case analyses were used, including patients who either completed or prematurely terminated treatment and who performed the post-treatment measurement.\nThe exposure in vivo group (N  40) as well as the graded activity group (N  35) were therefore included in these analyses.\nWe verified first whether those who dropped out were comparable to those who completed treatment by univariate comparisons for pretest PHODA-SeV, treatment group, age, gender, and education.\nWe performed an ANCOVA with post-treatment PHODA-SeV score as the dependent variable, group as between subject variable, and pretreatment score included as the covariate, as this method has more power than ANOVA of the post-test or ANOVA of change.\nTo establish norms for the PHODA-SeV, data of the screening group (N  113) were included in the analyses.\nFirst, we tested dependence of the PHODA-SeV score on various background variables, by means of a multiple linear regression analysis with the PHODA-SeV as the dependent variable, and age, gender, duration of complaints, and educational level as independent variables.\nIf none of these variables was related to the PHODA-SeV score, norms were based on the score distribution in the total screening group.\nA normality check was performed to test whether the PHODA-SeV scores were normally distributed.\nIn case of a normal distribution, it is sufficient to present the mean score and standard deviation of the group, to which individual scores can be compared by computing the corresponding z score.\nIn case of a non-normal distribution, deciles of the PHODA-SeV score distribution need to be presented.\nSociodemographics The characteristics of the various participant groups are displayed in Table 1.\nData about education, work status, and complaints were unavailable for 9 participants of the screening group.\nValid percentages are therefore displayed where applicable.\nFactor Structure and Internal Consistency The item statistics are displayed in Table 2.\nA normality check for each of the 40 PHODA-SeV items showed no substantive deviations (apart from positive skewness for photograph 94 which had the lowest mean).\n93, suggesting that factor analysis was appropriate.\n09, respectively), the large drop in eigenvalue between factor 1 and 2 (18.\n16) in contrast to only small changes between the subsequent factors (max, 0.\n48), as well as the point of inflection of the curve of the screeplot, clearly indicate a 1 factor structure.\nThis single factor explained 51.\nThe internal consistency of the total score on the PHODA-SeV, as indicated by Cronbachs , was.\nThe corrected item-total correlations were high (ranging between.\n82), indicating that each item was moderately to highly related to the other items.\nTest-Retest Reliability and Stability The distribution of the PHODA-SeV scores showed no serious deviation from normality at either pretest measurement (skewness, respectively,.\nA Summary of Sample Statistics.\nThe categories of work status were not mutually exclusive, due to which more than one category could apply for 1 participant.\n*Included for analyses of factor structure and internal consistency and normative data.\nIncluded for analyses of test-retest reliability and stability and construct validity with questionnaires.\nIncluded for analyses of construct validity by comparing treatments.\nthe numbers above show, the standard deviation was also very similar at both measurements.\nThe Pearson correlation between both PHODA-SeV measurements was.\n44, which did not significantly deviate from 0, the limits of agreement were 17.\nTherefore, conservatively stated, the limits of agreement lay between  20 points, indicating that a change that exceeds 20 points can be regarded as a real change instead of just natural variation in scores, at least assuming a retest time interval of 2 weeks.\n2 Shoveling soil with bent back 75.\n78 98 Falling backward on the grass 71.\n83 4 Lifting flowerpot with slightly bent back 71.\n77 20 Lifting beer crate out of car with slightly bent back 67.\n78 99 Mowing the lawn manually 62.\n84 29 Vacuum cleaning under coffee table with bent back 61.\n82 100 Drilling a hole in a stone wall above the head 56.\n81 47 Taking a box filled with bottles from a shelf above the head 55.\n81 33 Mopping floor with a squeegee with slightly bent back 55.\n78 18 Lifting a filled basket while walking up the stairs 55.\n81 22 Carrying a shopping bag with one hand while walking 54.\n75 85 Carrying a child (5 y) on the hip 53.\n79 26 Carrying rubbish bag with one hand while walking 51.\n71 7 Picking up shoes from floor with bent back 50.\n69 44 Back muscle exercise bending forward on a fitness device 49.\n68 73 Cleaning the windows with arm stretched above the head 46.\n78 27 Clearing out the dishwasher with bent back 45.\n72 40 Back twist exercise on a fitness device 45.\n74 51 Abdominal muscle exercises on the floor with fitness device 43.\n70 28 Taking a box from the sink cupboard above the head 42.\n73 59 Getting out of bed by first placing one foot on the ground 41.\n69 36 Leg stretch exercise on a fitness device 40.\n66 95 Cycling from a low kerb 37.\n71 3 Lifting flowerpot squatting down 37.\n56 11 Taking book from shelf behind oneself (with twisted back) 35.\n66 8 Picking up shoes from floor squatting down 35.\n58 14 Ironing in standing position 34.\n70 92 Doing the dishes in standing position 33.\n66 96 Looking aside while cycling 30.\n69 60 Walking up the stairs 25.\n58 74 Riding a bicycle in a street with speed bumps 23.\n59 61 Walking down the stairs 23.\n57 15 Ironing in sitting position 22.\n59 94 Walking through the forest 17.\n80 or greater), suggesting that the PHODA-SeV assessed something related to, but also distinct from, the other measures, especially the TSK.\nTo disentangle which of these constructs is uniquely related to the measure of perceived harmfulness of activities while correcting for shared variance, a multiple linear regression was performed (Table 4).\n50), suggesting that there was no problem of collinearity.\nThese results indicate that the perceived harmfulness of physical activities is associated with the level of fear of movement/ (re)injury as well as the current level of pain severity.\nSecond, we investigated the construct validity of the PHODA-SeV by comparing post-treatment PHODA-SeV scores of those who received graded activity treatment with those who received exposure in vivo.\nSince 26 of 85 patients dropped out during treatment, 10 of whom refused to complete post-treatment measurement, we first tested whether the dropouts were comparable to those who completed treatment.\nUnivariate comparisons revealed that dropouts did not differ between groups (2.\n69), and that drop-outs did not differ from those completing treatment in gender (2.\nAs expected given the randomized treatment assignment, the 2 treatment groups were similar on the pretest PHODA-SeV score (mean of 55.\n35 for the graded activity group, and mean  52.\n53) as well as other relevant measures (TSK, PCS, RDQ, age, gender, duration of complaints, education: All P  0.\nPosttreatment PHODA-SeV scores were 42.\n07) for the graded activity group and 20.\n65) for the exposure in vivo group.\nANCOVA demonstrated this effect to be significant (P.\n001) and substantial (d  1.\nThus, there was a large difference between both groups in post-treatment PHODA-SeV scores, with those who received exposure in vivo demonstrating lower scores than those who received graded activity.\nFurthermore, it was found that in the exposure in vivo condition 25 out of 40 patients (63%) demonstrated a pretest to post-test change in PHODA-SeV score beyond the limits of agreement, whereas this was only the case for 12 out of 35 patients (34%) in the graded activity condition.\nNote, however, that the pre-post time interval was larger than the 2 weeks interval from which the limits of agreement were obtained.\nThe aim of this study was to investigate the psychometric properties of a short electronic version of the PHODA as a measure of the perceived harmfulness of daily activities in patients with CLBP.\nAdvantages of this PHODASeV over the original PHODA are its standardized administration, the fact that it is less time-consuming, and its automatic data storage.\nThe PHODA-SeV measures a single factor and has a high internal consistency.\nThe testretest reliability of the PHODA-SeV over a 2-week timeinterval is excellent.\nLimits of agreement lies within 20 points, which is satisfactory when considering the 0100 scoring range.\nDeciles of the Total Score on the PHODA-SeV (N  113).\n75 Mean sum score 46.\nThe PHODA-SeV score is computed by dividing the sum of all 40 items of the PHODA-SeV by 40 and thus ranges from 0 to 100, just as each item does.\n846 Psychometric Properties of the PHODA-SeV.\ntect actual changes, the change should exceed the natural variation of 20 points before it can be concluded that a real change has occurred.\nHowever, it is important to recognize the rather short time interval (2 weeks) over which the stability was determined.\nOver longer time intervals, the natural variation may be expected to be larger.\nThe construct validity of the PHODA-SeV is supported by consistent relationships with related constructs, such as self-report measures of fear of movement/(re)injury, pain catastrophizing, functional disability, and current pain intensity.\nMore specifically, after correction for the common variance between these constructs, it appeared that the PHODA-SeV is specifically related to the degree of fear of movement/(re)injury as well as to pain intensity.\nThis indicates that the more that activities are rated as harmful, the higher the level of fear of movement/ (re)injury, and vice versa.\nFurthermore, this indicates that people experiencing more pain may be more worried that certain activities may aggravate their already painful, and potentially damaged, back than people experiencing less pain.\nAnother explanation may be that these patients, despite the careful instruction of the aim of the PHODA-SeV, placed the photographs along the thermometer according to the expected pain that the activities would induce, which might have been primed by their current pain levels.\nConstruct validity was further corroborated by the finding that patients in the exposure in vivo treatment condition, aimed at systematically reducing the perceived harmfulness of physical activities, had much lower post-treatment PHODA-SeV scores than the patients in the graded activity condition, during which the perceived harmfulness of physical activities was not challenged.\nThere are some limitations that need to be considered in interpreting these results.\nFirst, for the factor analyses the observation to record ratio (N  113 with 40 observations per participant) may have been suboptimal.\nHowever, this may not pose a problem especially because of an excellent Kaiser-Meyer-Olkin measure.\nAlso, since too small a group would complicate the factor pattern, the straightforward pattern that was found supports a single factor structure.\nFurthermore, simple factor structures with high loadings, as is the case with the PHODASeV, require smaller sample size for sufficient power than complex structures with moderate loadings.\nTo confirm the single factor structure of the PHODA-SeV, it will need to be cross validated among other samples of (CLBP) pain patients.\nSecond, given the restrictions in range on the TSK and RDQ, secondary to inclusion criteria, the construct validity correlations may actually underestimate the true relationships with PHODA-SeV, since range restriction attenuates correlations.\nThe third limitation is that this study only used self-report measures, which may be influenced by self-presentational strategies.\nIt would be worthwhile to test the construct validity of the PHODA-SeV by relating it to behavioural task performance.\nBecause fear of movement/(re)injury, as measured by the TSK or Fear Avoidance Beliefs Questionnaire,60 has consistently been found to be related to.\ndiminished task performance,1,2,16,18,32 replication of this with the PHODA-SeV would provide extended support for its construct validity.\nDespite these limitations, it may be concluded that the reliability and validity of the PHODA-SeV are good to excellent.\nThe decile scores (Table 5) of the PHODASeV can provide researchers and clinicians with a frame of reference for the ratings of other patients with CLBP in rehabilitation and pain clinic settings.\nAlthough this is the first study providing such a frame of reference for PHODA-SeV scores, these data should be considered as preliminary, since the sample size on which the data are based is small.\nFurther research is needed to establish normative data of the PHODA-SeV based on larger sample sizes.\nAnother note of importance in interpreting these normative data is that these are based on a population with quite severe complaints.\nThe participants suffered from CLBP for more than 10 years on average (Table 1), were referred for rehabilitation care, and more than half were on sick leave or received disability pension.\nYet, since the distribution of PHODA-SeV scores showed a large variation that covered almost the entire possible scale range, and since the duration of complaints did not influence the total score, it is possible that these normative score may also apply to chronic pain populations with less severe complaints.\nThis study used a short electronic version of the PHODA, and it can therefore be questioned whether these results can be generalized to the original PHODA.\nBecause of the well considered selection of 40 activities from the original ones, and because of the extremely high internal consistency, it is likely that these results extend to the complete PHODA.\nMoreover, due to the good to excellent properties of the PHODA-SeV, it can be suggested that this shortened edition may actually be more useful than the complete version.\nIn this study, the PHODA-SeV was administered as a measurement tool.\nIt is thus unknown whether the results of this study generalize to the PHODA-SeV used for clinical purposes, during which ample interaction between the clinician and patient is possible.\nHowever, since the instruction and other basic properties of the PHODA were maintained during administration of the PHODA-SeV, there is no obvious reason to expect different results in applications as clinical diagnostic instrument.\nWe would like to express our gratitude to Rosanne Jansen for programming the PHODA-SeV and to Jeroen de Jong for selecting the items of the PHODA-SeV.\nFurthermore, we are grateful to Sita van Riet and Magda van Duinen for their assistance in the data collection, and to the therapists delivering the cognitive-behavioral treatments.\nWe are also thankful to the 2 anonymous reviewers for providing valuable suggestions for improvement to the manuscript.\nAl-Obaidi SM, Nelson RM, Al-Awadhi S, Al-Shuwaie N: The role of anticipation and fear of pain in the persistence of avoidance behavior in patients with chronic low back pain.\nBland JM, Altman DG: Statistics notes: transforming data.\nCrombez G, Eccleston C, Baeyens F, Eelen P: When somatic information threatens, catastrophic thinking enhances attentional interference.\nCrombez G, Vlaeyen JW, Heuts PH, Lysens R: Pain-related fear is more disabling than pain itself: Evidence on the role of pain-related fear in chronic back pain disability.\nde Jong JR, Goubert L, Vlaeyen JWS, Crombez G: Exposure in vivo bij chronische lage-rugpijn: Exposure in vivo in chronic low back pain.\nde Jong JR, Vlaeyen JWS, Onghena P, Goossens MJEB, Geilen M, Mulder H: Fear of movement/(re)injury in chronic low back pain: Education of exposure in vivo as mediator to fear reduction? Clin J Pain 21:9-17, 2005.\nGeisser ME, Haig AJ, Theisen ME: Activity avoidance and function in persons with chronic back pain.\nJ Occup Rehabil 10:215-227, 2000.\nGommans IHB, Koes BW, van Tulder MW: Validiteit en responsiviteit van de Nederlandstalige Roland Disability Questionnaire.\nGoubert L, Crombez G, Lysens R: Effects of varied-stimulus exposure on overpredictions of pain and behavioural performance in low back pain patients.\nGoubert L, Crombez G, Van Damme S, Vlaeyen JWS, Bijttebier P, Roelofs J: Confirmatory factor analysis of the Tampa Scale for Kinesiophobia: Invariant two-factor model across low back pain patients and fibromyalgia patients.\nGrotle M, Brox JI, Vollestad NK: Concurrent comparison of responsiveness in pain and functional status measurements used for patients with low back pain.\nPain 110: 228-235, 2004.\nJ Behav Med 28:415-424, 2005.\nLeeuw M, Goossens MEJB, Linton SJ, Crombez G, Boersma K, Vlaeyen JWS: The fear avoidance model of musculoskeletal pain: Current state of scientific evidence.\nLethem J, Slade PD, Troup JD, Bentley G: Outline of a fear-avoidance model of exaggerated pain perception: I.\nLindstrom I, Ohlund C, Eek C, Wallin L, Peterson LE, Fordyce WE, Nachemson AL: The effect of graded activity on patients with subacute low back pain: A randomized prospective clinical study with an operant-conditioning behavioral approach.\nLinton SJ, Overmeer T, Janson M, Vlaeyen JWS, de Jong JR: Graded in-vivo exposure treatment for fear-avoidant pain patients with functional disability: A case study.\nPfingsten M, Leibing E, Harter W, Krner-Herwig B, Hempel D, Kronshage U, Hildebrandt J: Fear-avoidance behavior and anticipation of pain in patients with chronic low back pain: A randomized controlled study.\nPicavet HS, Vlaeyen JWS, Schouten JS: Pain catastrophizing and kinesiophobia: predictors of chronic low back pain.\nReneman MF, Jorritsma W, Schellekens JMH, Goeeken LNH: Concurrent validity of questionnaire and performancebased disability measurements in patients with chronic nonspecific low back pain.\nRocchi MB, Sisti D, Benedetti P, Valentini M, Bellagamba S, Federici A: Critical comparison of nine different self-administered questionnaires for the evaluation of disability caused by low back pain.\nEur Medicophys 41:275-281, 2005.\nRoelofs J, Goubert L, Vlaeyen JWS, Crombez G: The Tampa Scale for Kinesiophobia: Further examination of psychometric properties in patients with chronic low back pain and fibromyalgia.\nRoelofs J, Sluiter JK, Frings-Dresen MHW, Goossens MEJB: Thibault P: Boersma K: Vlaeyen JWS: Fear of movement and (re)injury in chronic musculoskeletal pain: evidence for an invariant two-factor model of the Tampa Scale for Kinesiophobia across pain diagnoses and Dutch, Swedisch, and Canadian samples.\nRoland M, Morris R: A study of the natural history of back pain, I: Development of a reliable and sensitive measure of disability in low back pain.\nSullivan MJL, Bishop SR, Pivik J: The Pain Catastrophizing Scale: Development and validation.\nPsychological Assessment 7:524-532, 1995.\nSwinkels-Meewisse IE, Roelofs J, Verbeek AL, Oostendorp RA, Vlaeyen JWS: Fear of movement/(re)injury, disability and participation in acute low back pain.\nSwinkels-Meewisse IEJ, Roelofs J, Schouten EGW, Verbeek ALM, Oostendorp RAB, Vlaeyen JWS: Fear of movement/(re)Injury predicting chronic disabling low back pain: a prospective inception cohort study.\nJ Clin Epidemiol 59:920-925, 2006.\nVan Breukelen GJP, Vlaeyen JWS: Norming clinical questionnaires with multiple regression: The Pain Cognit List Psychol Assess 17:336-344, 2005.\nVan Damme S, Crombez G, Bijttebier P, Goubert L, Van Houdenhove B: A confirmatory factor analysis of the Pain Catastrophizing Scale: Invariant factor structure across clinical and non-clinical populations.\npain related fear in the development of low back pain in young workers: Evidence from the BelCoBack Study; results after one year of follow up.\nVlaeyen JW, De Jong JR, Onghena P, Kerckhoffs-Hanssen M, Kole-Snijders AM: Can pain-related fear be reduced? The application of cognitivebehavioural exposure in vivo.\nPain Res Manag 7:144-153, 2002.\nVlaeyen JWS, de Jong J, Geilen M, Heuts PHTG, van Breukelen G: The treatment of fear of movement/(re)injury in chronic low back pain: Further evidence on the effectiveness of exposure in vivo.\nVlaeyen JWS, Kole Snijders AMJ, Boeren RGB, van Eek H: Fear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nJ Occup Rehabil 5:235-252, 1995.\nVlaeyen JWS, Linton SJ: Fear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nWaddell G, Newton M, Henderson I, Somerville D, Main CJ: A Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fear-avoidance beliefs in chronic low back pain and disability.\nWalker BF: The prevalence of low back pain: a systematic review of the literature from 1966 to 1998.\n849 ORIGINAL REPORT/Leeuwa et al."}