{"title": "53.pdf", "contents": "Low back pain (LBP) is the most prevalent health care problem in industrialized nations, demonstrating a dramatic increase in epidemiology and associated costs (Linton, 1998).\nmost back pain patients no relevant structural impairment can be found, so non-specific back pain exists in more than 90% of the cases (Fordyce, 1995).\nA central assumption of patients with LBP is that activity will exacerbate pain, leading to avoidance of activities.\nThis has been shown as a major contribution to maintenance of LBP.\nFearful avoidance of physical activities is a major factor in low back pain (LBP) and disability.\ndeveloped the Fear-Avoidance Beliefs Questionnaire (FABQ) focusing on patients beliefs about how physical activity and work affect LBP.\nThree-hundred and two consecutive LBP outpatients participating on a functional restoration programme filled in the FABQ.\nFactor analysis yielded three factors which accounted for nearly 65% of the total variance of the questionnaire.\n9% of the variance) remained the same as in the English version, the second factor of the original version split into two: one related to, work as cause of pain (43.\n4% of the variance) and the other to patients assumptions of their probable return to work (11.\n8% of the variance).\nTestre-test reliability score was fair to good for the whole scale (r=0.\nRegression analysis demonstrated that fearavoidance beliefs account for the highest proportion of variance (35%) regarding disability in activities of daily living and work loss.\nPatients out of work demonstrated more fear-avoidance beliefs in comparison to those who were still working.\nIt can be concluded that the German version of the FAQB is a reliable and valid instrument, but it shows a different factor structure from the original English version.\nThe FABQ has been proven to identify patients with maladaptive beliefs which have to be focused on in proper treatment.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nAccording to cognitivebehavioural theory this circle is maintained by the reduction of anxiety, which is achieved through avoidance of feared activities.\n(1993) developed  the  Fear-Avoidance  Beliefs Questionnaire (FABQ), a 16-item self-report questionnaire focusing on patients beliefs about how physical activity and work affect low back pain.\nThe FABQ yields two subscales, one for beliefs about physical activity and the other for beliefs about work.\nThe latter was consistently the stronger predictor of disability and work loss (Klenerman et al.\nThe FABQ has proven its validity by predicting disability in daily activities (Waddell et al.\n, 1993), work loss due to back pain (Waddell et al.\n, 1993), treatment outcome (Klenerman et al.\n, 1995) and performance level in behavioural tests (Crombez et al.\nFear-avoidance beliefs were the best predictors of return to work after a functional restoration treatment program (Pfingsten et al.\nThe purpose of this study was to analyse and validate the translated, German version of the FABQ.\nAccording to our knowledge no replication of the original psychometric analysis of the FABQ (Waddell et al.\nThe whole clinical sample consists of 302 consecutive LBP outpatients with non-specific, chronic musculoskeletal pain and with none or minor organic findings.\nThe mean age was 44.\nUsing an 11point numerical rating scale, mean pain intensity was 6.\n9), with an average duration of pain of 71.\nFifty-eight of the 302 patients were not working, because of being unemployed, being students/ trainees or housewives/housemen.\nIn order to achieve a clear distinction between a working and a non-working group of patients, this subgroup was excluded from data analysis concerning work-related questions.\nOne-hundred and twenty (47.\nOne-hundred and twenty-nine patients (52.\n5%) have still been working despite having back pain.\nAll patients presented different stages of disability.\nThis ranged from high disability with longstanding absence from work (up to 128 weeks) to lower disability (still working).\nThirty patients took part in the testre-test reliability analysis.\nThis sample was comparable to the rest of the group concerning gender, age, pain intensity, pain duration, disability and work loss.\nBefore entering the functional restoration program, patients were asked to complete the following questionnaires:.\nThe  Hannover  Functional  Ability Questionnaire (FFbH-R; Kohlmann and Raspe, 1994) is a German 12-item self-report questionnaire to assess functional capacity in daily activities (i.\nAnswers (yes = 2; only with great effort = 1; no, or only with help = 0) were summed up and transformed into a relative score (functional capacity 0100%).\nThe scale was designed for LBP patients and is comparable to the Quebec Back Pain Disability Scale (Kopec et al.\nDepression and anxiety was assessed using the German version of the Hospital Anxiety and Depression Scale (HADS; Zigmond and Snaith, 1983;Hermann et al.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nThe German version of the FABQ is identical in terms of instruction and format with the English version.\nThe 16 items were answered on a seven-point Likert scale (strongly disagree  strongly agree).\nThe translation into German was already carried out in 1994 by the first author and checked by a native speaker who was unaware of the FABQ.\nTestre-test reliability of the FABQ was calculated on 30 patients using product moment correlation.\nFactor structure was evaluated using factor analysis (principal-component, varimax rotation) on 302 patients.\nThe relationship of the FABQ scales to other variables was identified by correlational analyses (Spearmans Rho) and hierarchical multiple regression on 249 patients.\nIn case of multiple testing Bonferronis adjustment of the -level was used.\nA coefficient of r=0.\n87 was found for all items taken together.\n83, subscale 2: r=0.\n89 and subscale 3: r=0.\n95 for scale 1 and r=0.\nHowever, one must take into account that a much shorter interval of testing (48 h) was carried out in their study.\nNo item had to be excluded from the questionnaire because of lack of understanding.\nOnly item 8 (I have to claim compensation for my pain) demonstrated a skewed distribution: nearly 50% of the answers accounted for 0 (completely disagree).\nFactor analysis was conducted to examine the factorial structure of the questionnaire.\nItems were accepted on the final factors if they had a loading of more than 0.\n50 on the corresponding factor and no more than 0.\n35 on any other factor.\nThe analysis revealed an unambiguous threefactor solution (eigenvalues 6.\nEach of the three factors consists of five items (see Table 1 for M, SD and median).\nThe items represent patients beliefs about characteristics of the work environment which could be responsible for their current low back pain (work as a cause).\n8% of the variance and consists of items which relate to patients assumptions about their probable return to work (work prognosis).\nSubscale scores were calculated by adding the corresponding items of each factor.\nWhile the latter intercorrelations can be interpreted as indicating independency, the intercorrelation between subscales 1.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\n67) reveals a closer relationship.\nInternal consistency (Cronbachs ) for the total scale was =0.\n91, with values for subscale 1 of =0.\n89, subscale 2 of =0.\n94 and subscale 3 of =0.\nIn order to investigate the construct validity, correlations of FABQ-subscales with clinical variables was conducted (Table 2).\nCorrelational analysis was limited to those 249 patients of.\nwhom information about their working situation could be assessed (see methods).\nWe expected the FABQ subscales to significantly correlate with measures of disability (activities of daily life, work loss) and psychological symptoms (depression and anxiety).\nAs seen in Table 2, the relation to pain intensity was found to be moderate but statistically significant for all three FABQ subscales.\nFactor 1 (variance explained 43.\n89a Work as a cause Items Loading Mean SD median 6.\nwork aggravated pain 0.\nwork too heavy 0.\nwork makes pain worse 0.\nwork might harm my back 0.\nshould not do my work 0.\ncannot do my normal work 0.\nwait until pain is treated 0.\nno return within 3 months 0.\nno return at all 0.\ncaused by physical activity 0.\nphysical activity worsens pain 0.\nphysical activity might harm 0.\nbetter no physical activity 0.\ncannot do physical activity 0.\nDuration of pain 0.\n03 NS Intensity of pain 0.\n24 *** Depression (HAD depression) 0.\nDisability: work loss (weeks) 0.\nlow and non-significant relations of the FABQ subscales to depressive symptoms (HADS) could be demonstrated.\nA strong relationship of fear-avoidance beliefs and measures of disability was found, with subscale 2 (work prognosis) revealing the highest correlations.\nThese findings were similar for both disability variables: work loss and functional disability (FFbH-R).\nIn multiple regression analyses (Table 3), prediction of both disability variables (criteria) was tested by including sociodemographic variables (age, gender), symptom variables (pain intensity, pain duration, depressive symptoms, anxiety) and fear-avoidance beliefs (FABQ subscales).\nResults demonstrated that fear-avoidance beliefs accounted for the highest proportion of variance for both variables of disability (see Table 3).\nSubscale 2 (work prognosis) explained the highest proportion of variance in both disability variables, followed by subscale FABQ3 (physical activity).\nPain intensity was a significant predictor in only one analysis, but was less powerful than the FABQ3.\nNone of the other variables contributed to the explanation.\nPatients out of work demonstrated a significantly higher level in all three FABQ subscales (see Table 4).\nThe highest difference could be seen in subscale 2 (work prognosis).\nThe intention of this study was to analyse and validate the German version of the FearAvoidance Beliefs Questionnaire (Waddell et al.\n, 1993) in a sample of LBP outpatients.\nPsychometric properties of the questionnaire turned out to be fair to good, with an internal consistency of 0.\n91 for the total scale and a testre-test reliability of all items of r=0.\nThese properties of the total scale were similar to those reported by Waddell et al.\nIn their validation study of 1993, Waddell et al.\nidentified two subscale scores of the FABQ: one for beliefs about physical activity and the other for beliefs about work.\nResults of hierarchical multiple linear regression analyses with disability in activities of daily.\nliving (FFbH-R) and length of being out of work (in weeks) as dependent variable (n=249).\n35**  Disability (FFbH-R) FABQ3 0.\n22* Pain intensity 0.\n28*** Still working/out of work 129/120 FABQ2: 1.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\n(1993) we identified a three-factor solution accounting for 64.\nWhile the activity subscale, accounting for 9% of the variance, remained the same as in the original version, the work subscale of the original version was split into two separate factors in the German version.\nThe separate scoring on both subscales provides important information justifying a change to the subscale structure of the test: items of the first work subscale (work as a cause) represent a widespread, quite normal assumption that back pain may be a consequence of working conditions.\nThese beliefs may have only minor influence on perpetuating avoidance behaviour.\nWe assume that the new subscale 2 (prognosis work) has much more significance in identifying patients with problematic beliefs, which will probably strongly influence their future behaviour.\nContent validity analysis demonstrated unique characteristics of both work-related factors since the latter (work prognosis) was a much stronger predictor of disability and failure to return to work after treatment.\nThey asked patients prior to treatment if they believed they would be able to return to work after finishing the treatment.\nIn both studies the patients poor expectations were one of the strongest predictors of failure to return to work.\npatients, who are convinced that they will continue to have back pain and remain disabled, are likely to fulfill their own prophecy.\nIn a recent study on 86 patients with low back pain, subscale 2 of the FABQ (work prognosis) was found to be the best predictor for the return to work after a functional restoration programme (Pfingsten et al.\nThe second best predictor was the change in the FABQ subscale 3 (physical activity): those who returned to work demonstrated a significant decrease in beliefs about physical activity causing harm.\nThose patients who did not return to work after treatment demonstrated no change in FABQ subscale 3 and thus still had the assumption that physical activity will cause more pain and probably re-injury.\nThese beliefs have to be directed in the treatment process.\nThese patients presumably will profit from therapy in which back pain is treated as a consequence of an inadequate avoidance behaviour resulting from the motivation to reduce (assumed) pain.\nIn other words, back pain should be treated as a phobia, as Lethem et al.\n(1990) have already pointed out.\nIn accordance with the results of Waddell et al.\n(1993), regression analyses regarding disability as a criterion variable, fear-avoidance beliefs added a completely separate dimension of variance explained.\nIn this way, it is the patients beliefs rather than the underlying physical reality that determines disability behaviour.\nIn contrast to the findings of Waddell et al.\n(1993), who found that the two factors of the FABQ are largely independent of any pain measures, we found that this could only be confirmed regarding duration of pain.\nIntensity of pain demonstrated a significant correlation to all three FABQ subscales.\n(1993), depressive symptoms had a moderate relationship to both subscales (r=0.\nFurthermore, FABQ subscales showed no significant correlation to general symptoms of anxiety (HADS).\n(1997) our results confirmed that fear-avoidance beliefs do not correspond with other measures of emotional state such as depression and anxiety.\nSimilarly, our findings suggest that current emotional measures, such as depression and anxiety, may be too general to explain a substantial portion of variance of disability.\nThus, FABQ scales represent an independent contribution to the prediction of disability.\nThe internal consistencies of the subscales 1 and 2 were fair and quite similar to those of the total score.\nSimilar results in internal consistency for this subscale were reported by Waddell et al.\nBecause of the hypothesized importance of this subscale in predicting disability and avoidance behaviour this lower consistency of the subscale 3 may be accepted.\n(1995) had demonstrated that chronic back pain could be initiated by psychological factors which already exist in the early stages of experiencing pain.\nFear of pain and its avoidance are needed to be taken into account in both the assessment and the management of musculoskeletal disorders in the early stages of the natural history of back pain.\nThe early identification of at risk-patients is a major purpose of clinical assessment.\nPain-related fear and avoidance must be considered as risk factors.\nThe FABQ is a questionnaire with good psychometric properties and is able to identify patients whose level of disability is not related to pain intensity or emotional state but to pain-related.\nIn conclusion, the FABQ is a very promising measure of pain-related anxiety in patients with low back pain.\nOn the other hand, we strongly believe that the threefactor solution, as described in our study, has considerable advantages in more precisely identifying problematic patients beliefs and attitudes which probably will determine their future behaviour.\nOf course, it will be necessary to re-analyse the FABQ in another sample and scrutinize the factor structure.\nDo they show sensitivity to treatment? Do changes in FABQ scales due to therapy correlate with different measures of outcome and what is the pattern of correlation? Are the reported results equally valid for other groups of chronic pain patients (e.\nother musculoskeletal pain or sympathetic reflex dystrophy)? In any case, the reported findings allow some optimism regarding the future use of the FABQ in pain research and practice.\nThe study was supported by a grant from the Deutsche Forschungsmeinschaft (DFG) (KR 756/102).\nPain related fear is more disabling than pain itself.\nBack Pain in the Workplace.\nThe dominant role of psychosocial risk factors in the development of chronic low back disability.\nSpine 1995; 20: 27022709.\nThe prediction of chronicity in patients with an acute attack of low back pain in a general practice setting.\nDie patientennahe Diagnostik von Funktionseinschrnkungen im Alltag.\nThe Quebec Back Pain Disability Scale.\nKinisophobia: a new view of chronic pain behaviour.\nOutline of a fear-avoidance model of exaggerated pain perception.\nThe socioeconomic impact of chronic back pain.\nA comparison of cognitive measures in low back pain.\nFear-avoidance behaviour and anticipation of pain in patients with chronic low back paina randomized controlled study.\nSpine (submitted) Pfingsten M, Leibing E, Franz C, Bansemer D, Busch O, Hildebrandt J.\nAvoidance behaviour and its role in sustaining chronic pain.\nBehav Res Ther 1987; 25: 273279.\nReturn to work after rehabilitation: the significance of the patients own prediction.\nScand J Rehabil Med 1986; 18: 2933.\nA fear-avoidance beliefs questionnaire (FABQ) and the role of fear-avoidance beliefs in chronic low-back pain and disability.\nThe Hospital Anxiety and Depression Scale.\nEuropean Journal of Pain (2000), 4.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License."}