{"title": "10.pdf", "contents": "People move differently in pain.\nAlthough this statement is unquestioned, the underlying mechanisms are surprisingly poorly understood.\nExisting theories are relatively simplistic, and although their predictions are consistent with a range of experimental and clinical observations, there are many observations that cannot be adequately explained.\nHere, we seek to consider the motor adaptation to pain from the micro (single motoneuron) to macro (coordination of whole-muscle behaviour) levels and to provide a basis for a new theory to explain the motor changes in pain.\nContemporary theories of the motor adaptation to pain.\nTwo major theories have emerged to explain the changes in movement that accompany pain.\nThese are the vicious cycle [70] and pain adaptation theories [48].\nThe vicious cycle theory hypothesizes that muscle activity increases in a stereotypical manner in pain, regardless of task, yet sustained activity leads to ischaemia and accumulation of algesic agents, producing pain [70].\nA range of mechanisms underlying the increased activity has been proposed, including increased sensitivity of muscle spindles via inputs from group III and IV afferents (nociceptive muscle afferents) onto gamma motoneurons [39].\nThis is supported by increased response to stretch reflexes in human jaw [87,100,101] and calf muscles [57], and cat hind limb muscles [91].\nThe pain adaptation theory, first proposed by Lund et al.\n[48], explained more variable changes in muscle activity with pain.\nThe theory, which is based on experimental observations, proposed that activity of muscles that are painful or that produce a painful movement reduces during voluntary efforts, whereas that of opposing/antagonist muscles increases [48].\nThis adaptation reduces the amplitude and velocity of the painful movement, and it decreases the force produced by the muscle.\nA range of data underpins this theory.\nFor instance, experimentally induced muscle pain in humans decreases maximal force [23,55], and when pain is induced in a jaw muscle, the velocity and amplitude of jaw movement decreases [86].\ndepending on function of the muscle, comes from studies of induced pain in muscles such as the erector spinae during gait [2] and forward bending [105].\nIn these cases, activity increased when the muscle is normally inactive and decreased when the muscle is normally active.\nFurthermore, during dynamic leg movements, muscle pain decreased agonist muscle electromyographic activity (EMG) and increased antagonist muscle EMG [24].\nAt a micro level, observations of reduced motoneuron discharge rate (a determinant of muscle force) during constant force contractions were interpreted to be consistent with this theory [15,80].\nThe pain adaptation theory proposed that the inhibitory and excitatory inputs were mediated at the spinal cord (via interneurons or direct inputs from nociceptive afferents onto motoneurons) or brain stem, although the mechanisms were not clearly defined.\nPain does not have a uniform effect on excitability of the motor pathway.\nA critical inconsistency is evidence of variable changes in muscle activity.\nAlthough injection of glutamate into the temporomandibular joint in rats induces a prolonged increase in EMG activity of muscles that close (masseter) and open (digastric) the jaw [7], induced pain in humans can increase [11,79,86], decrease [11,14] or not change [16,56,77] muscle activity.\nFurthermore, if EMG increases, it does not last the duration of the painful stimulus [85].\nFinally, changes in muscle activation cannot be accounted for by effects at the muscle spindle because activity of jaw-opening muscles is modified by pain, despite the absence of muscle spindles [69].\nA more comprehensive theory is required that accounts for variable patterns of increased and decreased muscle activity.\nAn underlying premise of the pain adaptation theory is that of uniform inhibition of motor drive to muscles that are painful or produce a painful movement.\nAlthough this premise is supported.\nc o m/ lo c a te / p a in.\nFurthermore, measures of excitability along the motor pathway from the motor cortex to the motoneuron are variable.\nThe Hoffman reflex (H reflex) is the electrical analogue of the stretch reflex whereby a muscle response is evoked by reflex excitation of the motoneuron in response to an afferent volley (mainly 1a afferents from muscle spindles) excited by electrical peripheral nerve stimulation.\nH reflex amplitude is reduced in wrist flexor muscles during homonymous muscle pain [46] but is not changed in human leg [56], hand [17], or jaw muscle pain [84].\nHowever, the H reflex does not provide a pure measure of motoneuron excitability because its size is affected by mechanisms in addition to changes in motoneuron excitability.\nThe stretch reflex, which depends on various factors including motoneuron excitability, spindle sensitivity, gamma motoneuron drive to the intrafusal muscle fibres, and presynaptic effects on the Ia afferent synapse, increases [87,100,101] or decreases [4,88] in pain.\nThe response of a muscle to electrical stimulation of the descending corticospinal axons at the cervicomedullary junction has been studied [21,55].\nBecause this input to motoneurons is not affected by presynaptic inputs [64], it provides a more accurate measure of motoneuron excitability.\nBy means of this method, biceps brachii muscle pain has been shown to facilitate the motoneurons to flexor and extensor muscles, contradicting the pain adaptation theorys prediction of opposite effects on antagonist muscles.\nFurther, sustained discharge of group III and IV afferents does not maintain changes in motoneuron responsiveness to cervicomedullary stimulation after fatiguing muscle contractions [21].\nThese observations question the uniform inhibition of motoneurons innervating a painful muscle.\nTranscranial magnetic stimulation (TMS) over the motor cortex has been used to study the responsiveness of the corticomotor system, including the cortex.\nMotor-evoked potentials (MEPs) to TMS decrease [17,42,46,55,98], increase [1,11,12], or do not change [71] during local muscle pain.\nRecent work highlights that the effect of pain on corticomotor responsiveness can vary between muscles.\nAlthough changes in the response to TMS of the motor cortex have been interpreted to reflect excitability of cortical networks, these responses are affected by both cortical and motoneuron excitability.\nThese data suggest opposite effects at cortical and spinal sites.\nThis is not predicted by the pain adaptation theory.\nThis comparison allows interpretation of changes at the cortex.\nRecent work investigating intracortical inhibitory and facilitatory circuits shows increased inhibition and decreased facilitation after pain [76], again focussing attention on the cortical components.\nIn summary, data of excitability along the corticomotor pathway fail to support the predictions of existing models that there will be uniform inhibition (pain adaptation) or facilitation (vicious cycle) of muscles that are either the source of pain or that produce a painful movement.\nResponses vary between muscles and tasks, and this must be accounted for in theories that explain the adaptation to pain.\nChanges in motor control during pain are not always stereotypical or predictable.\n, [36,37,50]), changes in behaviour of other muscles are unique to the individual and possibly to the task [36,99].\nNew theories must account for the variability.\nThis occurs regardless of movement direction and despite the trivial moment arms of these muscles to generate torque, which means they have trivial potential to act as agonists or antagonists to movement.\nFurthermore, because these muscles contribute to control of spine motion, the vicious cycle theory may predict their activity would increase to splint a painful spine.\nHowever, this is opposite to the reduced activity observed in clinical and experimental pain [18,36,37,50].\nExisting theories do not account for changes in all classes of movement.\nThe pain adaptation theory only makes predictions regarding voluntary movements and ignores changes in other automatic functions such as postural control.\nThe proponents of that theory argued that pain causes little change in postural functions [48].\nHowever, the literature increasingly refutes this claim.\nThere is evidence of changes in balance [6,59] and whole-muscle behaviour in anticipatory [36,37,47] and reactive postural [51,53] mechanisms in experimental and clinical pain.\nPostural adjustments can precede arm movement to overcome the perturbation to the body (e.\n, early erector spinae activity to overcome the trunk flexion perturbation from arm flexion [38]).\nIf the muscle producing this adjustment was painful and therefore inhibited (e.\nTheories cannot explain the maintenance of force when motoneuron discharge reduces in pain.\nFirst, because the experimental tasks required force matching between contractions with and without pain, the adaptation in motor unit discharge did not decrease the force output.\nSecond, because motoneuron discharge rate is a determinant of force, reduced discharge rate during pain must be accompanied by other changes in motor output in order to maintain force.\ncle activity is a reflection of processes to change the manner in which the muscle generates force rather than uniform inhibition of a painful muscle.\nNew theory for the motor adaptation to pain.\nA theory to explain the adaptation to pain must account for each issue highlighted above, particularly the variability between individuals and tasks.\nWe propose a new theory based on existing data at the micro (motoneuron discharge) and macro (whole-muscle behaviour) levels.\nThe theory has 5 key elements that expand on the basic premise that the adaptation to pain aims to reduce pain and protect the painful part, but with a more flexible solution than currently proposed (Fig.\nWe propose that the adaptation to pain (1) involves redistribution of activity within and between muscles; (2) changes the mechanical behaviour such as modified movement and stiffness; (3) leads to protection from further pain or injury, or from threatened pain or injury; (4) is not explained by simple changes in excitability but involves changes at multiple levels of the motor system, and these changes may be complementary, additive, or competitive; and (5) has short-term benefit but has potential long-term consequences due to factors such as increased load, decreased movement, and decreased variability.\nChanges in motor cortical map with pain.\n(A) Mapping of the motor cortex using transcranial magnetic stimulation (TMS).\nDescending volleys excite the spinal motoneurons to produce a motor-evoked potential (MEP) in the contralateral transversus abdominis (TrA) muscle.\n(B) Average normalised motor cortical maps generated from the MEPs evoked at points on a grid over the cortex on the left and right hemisphere are shown for a healthy and low back pain (LBP) group.\nPain leads to redistribution of activity within and between muscles.\nThis could not occur with uniform inhibition of the whole motoneuron pool and may be explained by either a change in motoneuron recruitment order to recruit larger units at lower forces (perhaps to enhance the rate of force development as part of a fright/flight response), or by a change in the distribution of activity within a muscle (perhaps to preferentially activate muscle fibres with a specific force direction to change load distribution on the painful structure).\nEarlier recruitment of larger units may have the benefit of enabling faster development of force to facilitate escape of the individual from threat such as pain or injury.\nHigher drive, and activation of higher-threshold units, would then be required at a lower force.\nRecordings of flexor pollicis longus (FPL) single motor unit electromyography (EMG) are shown with their discharge rates and spike-trigger averaged electrical profile.\nThree motor units recruited during no-pain and pain trials (A, C, E) decreased their discharge rate during pain.\nUnit D was derecruited during pain.\nThree new units (B, F, G) that were not active in the no-pain conditions were recruited during pain.\nThese features indicate a change in the population of active units during pain in order to maintain force output.\nA new distribution of force or net force direction would change load distribution and may be less painful or less injurious for the painful tissue.\nIndividual motor units within a muscle have slightly different directions of force production as a result of variation in muscle fibre angle and attachments [5,82] and may be associated with contractions of different type or orientation [68,89,90,104].\nThis spatial redistribution of activity may occur in conjunction with a change in recruitment order, or it could be misinterpreted as a change in recruitment order because units may be activated at a lower force (appearing as a change in recruitment order) in the new direction if it is the muscle fibres preferred direction of force.\nConsistent with the proposed change in population of active units, several studies show spatial redistribution of activity between regions of muscle.\nFor instance, of 53 vasti muscle EMG recording sites (up to 7 per subject) during pain induced by injection of hypertonic saline into the infrapatellar fat pad, 38% had a >20% increase in EMG amplitude and 25% had a >20%.\nSpatial redistribution of activity has also been recorded with array electrodes, revealing a shift of activity away from the site of pain injection in the upper trapezius [52].\nSpatial redistribution would not be detected with a single pair of surface electrodes placed over the whole muscle.\nThis could contribute to variability between studies [2,3,13,15,29,77].\nIn some body systems, particularly those with substantial redundancy such as the trunk muscles, spatial redistribution of activity has been observed between muscles.\nAdaptation to pain changes mechanical behaviour.\nA central premise of the new theory is that the redistribution of activity within and between muscles changes the mechanical outcome of contraction.\n(A) Isometric knee extension force was measured from two force transducers (force medial [FM] and force lateral [FL]) positioned at 90 to each other and attached above the subjects ankle.\nDuring pain, the angle changed either medial or lateral to this control angle.\nThis included reduced discharge rate of units active before and during pain, derecruitment of some units, and recruitment of a new population of units.\nRedistribution of activity between trunk muscles also changes kinematics and mechanical properties of the spine.\nDuring walking, the normal counterrotation of the thorax and abdomen is changed to more en bloc movement in clinical [45] and experimental pain [44]; stiffness (i.\nIn each of these cases, the gross features of the task are maintained, but the quality is affected, and this may have consequences for the individual.\nAdaptation to pain leads to protection from pain or injury, or threatened pain or injury.\nThe change in distribution of activity within and between muscles and the resultant change in mechanical behaviour is proposed to protect against further pain, injury, or both.\nThis is consistent with the theoretical proposal of Murray and Peck [63] that the nervous system may search for a movement pattern that is less painful during painful mastication.\nSuch adaptation would also be expected with the threat of pain, injury, or both, in the absence of current pain, injury, or both.\nChanges in distribution of activity within [94] and between muscles [62] have been reported when pain is threatened (anticipation of painful electrical shocks).\nMany different adaptations in muscle activity may achieve protection.\nIn addition to the examples presented above, this would include inhibition of agonist muscles to reduce voluntary movement force and displacement (predicted by the pain adaptation theory [48]); increased muscle activity to splint the painful part (predicted by the vicious cycle theory [70]); and other observations, such as a lowered threshold for flexor withdrawal reflexes as a result of central sensitisation [102,103].\nThe unique feature proposed in the new theory is that rather than a stereotypical change that is the same in all conditions, we propose the nervous system has a range of options to achieve the goal of protection, and this may involve increased, decreased, or redistributed activity.\nThis will involve more complex neural processes than those proposed by the existing theories that advocate stereotypical change.\nAdaptation to pain involves changes at multiple levels of the motor system.\nAlthough changes in excitability of motoneurons may underlie or contribute to changes in muscle activity during pain [55], this is not sufficient to explain the complexity of adaptation.\nChanges at the multiple sites along the motor pathway may be complementary, additive, or competitive.\nAs mentioned earlier, motoneuron excitability can be increased but accompanied by decreased cortical excitability [55] and increased intracortical inhibition [76].\nThe mechanisms at each site may be different.\n(A) In sitting, a load was released from one side of the trunk by deactivating an electromagnet to perturb the trunk.\n(B) Linear second-order feedback-control model.\nF is an input force acting on mass M.\nThe resulting velocity (_x) and displacement (x) are then fed back with gains B (damping) and K (stiffness), respectively, to achieve the desired output displacement x (x  acceleration).\n(C) Effective trunk stiffness was increased and damping was decreased for people with low back pain (LBP) compared to control participants.\nAdapted from Hodges et al.\nmotoneurons [40] or functional plasticity in the spinal cord elicited by nociceptive primary afferent inputs (i.\n, central sensitisation [102]), whereas cortical changes may be due to changes in motor planning, such as the recruitment of a more protective strategy in advance of movement (e.\n, manipulation of the sequence of trunk muscle activation before arm movement in anticipation of threatened pain in the absence of nociceptor discharge [62]) or reorganisation of cortical regions [92] (Fig.\nAdaptation to pain has short-term benefit, but with potential longterm consequences.\nA final aspect of the theory is that although the adaptation achieves a short-term goal of protection from further pain, injury, or both, the adaptation may have consequences that could lead to further problems in the long term [35].\nWe argue that if it is assumed that movements are performed in an optimal or efficient manner in a nonpain state, departure from this state may not be ideal.\nThis could be due to increased or modified load, decreased movement, decreased variability, or other changes.\n4) or increase load [54] on the painful part, and this may have detrimental effects in the long term.\nFurthermore, modified mechanics of the proximal lower limb joints during gait to avoid painful ankle dorsiflexion after ankle sprain [20] could lead to further problems as a result of decreased shock absorption from modified joint position at heel strike.\nSpinal movement is necessary to dampen forces.\n5), which may enhance force impact on the spine.\nFinally, some variability in performance of movement has the advantage of varying the areas of joint load, muscle activity, and ligament stress.\nThe proposed negative outcomes of adaptations are not likely to be immediate and would require a period of maintenance/repetition to influence tissue health.\nAlthough pain provides a potent stimulus to change the movement strategy to protect the painful or injured part, resolution of pain or injury does not necessarily provide a stimulus to return to the initial pattern.\nIn terms of motoneuron recruitment, discharge rate of active units recovers with resolution of pain, but the redistribution of activity within a muscle does not [94].\nAt the level of whole-muscle behaviour, some individuals, particularly those with unhealthy attitudes about pain, are less likely to restore muscle recruitment patterns to a prepain state [61].\n, 73% of those with an acute episode of back pain experience a recurrence within 1 year [67]).\nAlthough it is possible that the failure of the adaptation to pain to resolve after the initial episode may contribute to the ongoing problems, an alternative view is that the adaptation compensates for a failure of support by injured passive joint structures and is therefore necessary for normal function [66,99].\nThere is likely to be a delicate balance between positive and negative aspects of the adaptation.\nLongitudinal studies are required to confirm whether nonresolution of adaptation is associated with long-term consequences.\nWe present a new theory for the motor adaptation to pain that is consistent with clinical and experimental observations and provides a range of testable hypotheses.\nA key aspect that requires further clarification is that although the adaptation has immediate potential benefit for the system, there may be long-term consequences for the health of the individual.\nOur theory presents candidate targets for new and refined treatments for rehabilitation of people in pain.\nThere are no conflicts of interest.\nActivity of masticatory muscles in subjects with different orofacial pain conditions.\nMotor control: concepts and issues.\nVariations in balance and body sway in middle-aged adults: subjects with healthy backs compared with subjects with low back dysfunction.\nEvidence that excitatory amino acid receptors within the temporomandibular joint region are involved in the reflex activation of the jaw muscles.\nDelayed onset of electromyographic activity of vastus medialis obliquus relative to vastus lateralis in subjects with patellofemoral pain syndrome.\nEMG scanning in the diagnosis of chronic pain.\nCorticospinal drive during painful voluntary contractions at constant force output.\nCorticospinal excitability during painful self-stimulation in humans: a transcranial magnetic stimulation study.\nMuscle pain induces taskdependent changes in cervical agonist/antagonist activity.\nExperimental muscle pain decreases voluntary EMG activity but does not affect the muscle potential evoked by transcutaneous electrical stimulation.\nExperimental muscle pain reduces initial motor unit discharge rates during sustained submaximal contractions.\nEffect of experimental muscle pain on motor unit firing rate and conduction velocity.\nTransient inhibition of the human motor cortex by capsaicin-induced pain.\nChanges recruitment of the abdominal muscles in people with low back pain: ultrasound measurement of muscle activity.\nIpsilateral hip abductor weakness after inversion ankle sprain.\nSupraspinal factors in human muscle fatigue: evidence for suboptimal output from the motor cortex.\n[22] Garnett R, Stephens JA.\nChanges in the recruitment threshold of motor units produced by cutaneous stimulation in man.\nInhibition of maximal voluntary contraction force by experimental muscle pain: a centrally mediated mechanism.\nEffects of experimental muscle pain on muscle activity and co-ordination during static and dynamic motor function.\nInternal organization in the human jaw muscles.\nRelations between structure and function in the design of skeletal muscles.\nExcitability and inhibitability of motoneurons of different sizes.\nExperimental quadriceps muscle pain impairs knee joint control during walking.\nTrunk muscle activity is increased during experimental back pain, but the pattern varies between individuals.\nChanges in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nChanges in motor unit firing rate in synergist muscles cannot explain the maintenance of force during constant force painful contractions.\nPain and motor control of the lumbopelvic region: effect and possible mechanisms.\nExperimental muscle pain changes feedforward postural responses of the trunk muscles.\nInefficient muscular stabilisation of the lumbar spine associated with low back pain: a motor control evaluation of transversus abdominis.\nFeedforward contraction of transversus abdominis in not influenced by the direction of arm movement.\nPathophysiological mechanisms involved in genesis and spread of muscular tension in occupational muscle pain and in chronic musculoskeletal pain syndromes: a hypothesis.\nSynaptic responses of lumbar alphamotoneurones to chemical algesic stimulation of skeletal muscle in spinal cats.\nSynaptic effects from chemically activated fine muscle afferents upon alpha-motoneurones in decerebrate and spinal cats.\nModulation of upper extremity motoneurone excitability following noxious finger tip stimulation in man: a study with transcranial magnetic stimulation.\nEffects of experimentally induced pain and fear of pain on trunk coordination and back muscle activity during walking.\nPelvis thorax coordination in the transverse plane during walking in persons with nonspecific low back pain.\nInhibition of motor system excitability at cortical and spinal level by tonic muscle pain.\nThe pain-adaptation model: a discussion of the relationship between chronic musculoskeletal pain and motor activity.\nWhy do some patients keep hurting their back? Evidence of ongoing back muscle dysfunction during remission from recurrent back pain.\nPeople with recurrent low back pain respond differently to trunk loading despite remission from symptoms.\nSudden load as an aetiologic factor in low back pain.\nSpine loading in patients with low back pain during asymmetric lifting exertions.\nGroup III and IV muscle afferents differentially affect the motor cortex and motoneurones in humans.\nThe influence of experimental muscle pain on the human soleus stretch reflex during sitting and walking.\nExperimental muscle pain increases the human stretch reflex.\nMotor unit syncronization is reduced in anterior knee pain.\nHip strategy for balance control in quiet standing is reduced in people with low back pain.\nFailure to use movement in postural strategies leads to increased spinal displacement in low back pain.\nReduced variability of postural strategy prevents normalisation of motor changes induced by back pain  a risk factor for chronic trouble? Behav Neurosci 2006;120:4746.\nDoes anticipation of back pain predispose to back trouble? Brain 2004;127:233947.\nOrofacial pain and jaw muscle activity: a new model.\nJ Orofac Pain 2007;21:26378.\nIs presynaptic inhibition distributed to corticospinal fibres in man? J Physiol (London) 1994;477:4758.\nThe stabilizing system of the spine.\nAcute low back pain: systematic review of its prognosis.\nA critical review of the evidence for a painspasmpain cycle in spinal disorders.\nSelectivity of the central control of sensory information in the mammalian spinal cord.\nExperimental jaw-muscle pain has a differential effect on different jaw movement tasks.\nShort-interval intracortical inhibition is increased following experimentally induced muscle pain.\nExperimental muscle pain increases trapezius muscle activity during sustained isometric contractions of arm muscles.\nCompound group I excitatory input is differentially distributed to motoneurons of the human tibialis anterior.\nInhibition of motor unit firing during experimental muscle pain in humans.\nCorticospinal excitability in patients with chronic low back pain.\nSpatial variations in motor unit forces of the FDI.\nExperimental jawmuscle pain does not change heteronymous H-reflexes in the human temporalis muscle.\nBilateral experimental muscle pain changes electromyographic activity of human jaw-closing muscles during mastication.\nEffects of local and remote muscle pain on human jaw reflexes evoked by fast stretches at different clenching levels.\nModulation of stretch-evoked reflexes in single motor units in human masseter muscle by experimental pain.\nChanges in recruitment order of motor units in the human biceps muscle.\nEffects on the fusimotor-muscle spindle system induced by intramuscular injections of hypertonic saline.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nMotoneurone recruitment is altered with pain induced in non-muscular tissue.\nChanges in motor unit recruitment strategy during pain alters force direction.\nInhibition of biceps brachii muscle motor area by painful heat stimulation of the skin.\nInhibition of the human primary motor area by painful heat stimulation of the skin.\nTrunk muscle activation in low-back pain patients: an analysis of the literature.\nExcitatory actions of experimental muscle pain on early and late components of human jaw stretch reflexes.\nEMG-force relationships are influenced by experimental jaw-muscle pain.\nEvidence for a central component of post-injury pain hypersensitivity.\nInjury-induced plasticity of the flexor reflex in chronic decerebrate rats.\nThe sartorius muscle: anatomic considerations for reconstructive surgeons.\nVoluntary and reflex control of human back muscles during induced pain.\nJ Physiol (London) 1999;520:591604."}