{"title": "19.pdf", "contents": "School of Exercise and Nutritional Sciences, College of Health and Human Services, San Diego State University, 5500 Campanile Drive, San Diego, CA, 921827251, United States.\nBackground: Limited research exists on lumbar spine and lower extremity movement during functional tasks in people with and without low back pain (LBP).\nObjective: To determine differences in lumbar spine and lower extremity kinematics in people with and without LBP during the down phase of a pick up task.\nDesign: Cross-sectional, observational study.\n2 kg/m2); 18 with and 17 without LBP were matched based on age, gender and BMI.\nKinematics of the lumbar spine and lower extremities were measured using 3D motion capture, while subjects picked up an object off the floor.\nPeople with LBP were examined and assigned to movement-based LBP subgroups.\nRepeated measures ANOVA tests were conducted to determine the effect of group and region on lumbar spine and lower extremity kinematics.\nResults: Compared to controls, subjects with LBP displayed greater upper and less lower lumbar flexion (P < 0.\n05), and more lumbar flexion during the first 25% of the pick up task (P < 0.\nThere were no group differences in frontal or axial plane lumbar spine kinematics.\nSubjects with LBP displayed more frontal plane movement at the knee than control subjects (P < 0.\nConclusions: When evaluating movement during a functional task, the clinician should consider regional differences in the lumbar spine, pattern of movement, and lower extremity movement.\nLow back pain (LBP) is a common musculoskeletal condition that affects one third of the American population at any given point in time and up to 80% of Americans will experience LBP at some point during their lifetime (Andersson, 1999).\nChronic low back pain is most common in working-age adults and is associated with a high number of comorbidities such as depression, anxiety, sleep disorders, and other musculoskeletal and neuromuscular.\nFurthermore, LBP is the fifth leading cause of doctor's visits annually with 56.\n8% of those visits for nonspecific LBP (Freburger et al.\nThe combination of comorbidities, high rates of prescription drug use, and frequent doctor's visits associated with LBP create a significant financial burden on the healthcare system and economy (Gore et al.\nWhen evaluating a patient with LBP, physiotherapists often use a movement-based approach to determine what movements may be related to the LBP problem or improve LBP symptoms in order to guide diagnosis and treatment (Sahrmann, 2002).\nExamining characteristics of functional movements may be of particular importance in people with LBP since functional movements are often repeated across the day, and when impaired, could contribute to the development or persistence of pain.\nmovement-based impairments during functional activities in people with LBP can provide a basis for modifying these activities during treatment.\nSeveral factors need to be considered when interpreting spine kinematics during functional activities.\nRecent studies provide strong evidence that there are regional differences in kinematics between the upper (L1-L3) and lower lumbar spine (L4-L5) (Dankaerts et al.\nThere is further evidence to support dividing people with LBP into subgroups when examining movement because of the variability in strategies used to accomplish a task and subgroup differences in movement pattern (Dankaerts et al.\n, 2006; Gombatto et al.\nexamined kinematics during sitting and reported that differences between LBP and control groups were only evident when the subjects were divided into LBP subgroups, and that movement-based measures can predict subgroup classification (Dankaerts et al.\nlower) and LBP subgroups are important factors to consider when interpreting spinal kinematics.\nSeveral investigators have examined lumbar spine and hip kinematics during functional tasks.\nThe purpose of this study was to examine differences in threedimensional lumbar spine and lower extremity kinematics in people with and without LBP during the functional task of picking up an object from the floor.\nBecause of the close coupling of the lower extremity and lumbar spine during the pick up task and that the lower extremities were free to move during the task, we also hypothesized that people with LBP would display greater lower extremity flexion compared to controls, in order to accomplish the task.\nA secondary purpose was to examine kinematic differences among movement-based LBP subgroups during the task.\nA cross-sectional observational design was utilized to examine differences in kinematics between people with and without LBP.\nThe study was approved by the Human Subjects Research Committee at Nazareth College (Rochester, NY) and subjects provided written informed consent prior to participating.\nA sample of thirty-five people between the ages of 18e65 was recruited and tested in the Movement Analysis Laboratory at Nazareth College (Rochester, NY) from January 2011 through May 2013.\nEighteen subjects with LBP were recruited from two different outpatient orthopedic clinics where they were seeking treatment.\nSeventeen control subjects were recruited from the college campus and surrounding community, including physicians offices.\nSubjects with LBP were included if they reported a primary complaint of LBP for which they sought physical therapy treatment, and were tested prior to commencing treatment.\nSubjects without LBP were included if they had no history of LBP, and were matched to a subject in the LBP group based on age, gender, height, weight, and BMI.\nPeople were excluded from participating if they had a history of serious spinal or medical conditions, physical or mental disabilities, pregnancy, or with a BMI greater than 30 kg/m2.\nSubjects with LBP completed self-report questionnaires including a demographics form, Modified Oswestry Disability Index (ODI), Fear-Avoidance Beliefs Questionnaire (FABQ), and a numeric rating scale (NRS) for symptoms of LBP.\nSubjects with LBP rated their current symptoms and symptoms over the last seven days using an 11-point NRS (0  no pain, 10  worst imaginable pain).\n) was used to measure kinematics of the trunk and lower extremities while each subject performed three trials of a pickup task.\nRetroreflective markers were placed on predetermined anatomical landmarks of the spine, pelvis, and lower extremities (Fig.\nThe upper lumbar segment was defined by 2 markers 4 cm lateral to the spinous processes of L1 and a single marker on the spinous process of L3.\nThe lower lumbar segment was defined by 2 markers 4 cm lateral to the spinous processes of L4 and a single marker on the spinous process of L5.\nThe pelvis was defined by the markers placed on the posterior superior iliac spine, anterior superior iliac spine, posterior pelvis and iliac crests bilaterally.\nThree markers were placed on each thigh and lower leg segments bilaterally for lower extremity segments.\nCalibration markers were placed on the medial and lateral femoral condyles bilaterally for joint center calculations.\nThe functional method was used to calculate the location of hip joint centers, and an anatomical method was used to calculate knee joint center (Schwartz and Rozumalski, 2005).\nA small object of negligible weight (digital metronome) was placed on the floor six inches in front of each subject.\nThe subject was instructed to pick up the object as they normally would, at a self-selected speed and using a self-selected hand.\nSubjects were then asked to use the same hand to pick up the object across all three trials of the pickup task.\nboth hands to pick up the object.\nTo control for hand selection during the task, pick up hand was used as a covariate for all data analyses.\nDuring each trial, each subject with LBP was queried to determine whether LBP symptoms increased, decreased, or remained the same as a result of the pick up task.\nSubjects were considered to have increased symptoms with the task if they reported increased LBP with any one of the three trials.\nAfter motion capture testing, a clinical examination was conducted for all subjects with LBP, by a licensed physical therapist with advanced training in the Movement System Impairment (MSI) classification system (first author).\nSubjects were placed into movement-based subgroups (Rotation, Extension with Rotation, Flexion with Rotation) based on the direction of movement impairments and associated LBP symptoms.\nThe MSI system has been tested and found to be reliable and valid when classifying subjects with LBP into movement-based subgroups (Harris-Hayes and Van Dillen, 2009; Van Dillen et al.\nData from the optical motion capture system was postprocessed in Nexus (Vicon, Inc) and then exported to Visual-3D (C-motion, Inc.\nSegment angles were examined and movement time was defined from the start to the end of the down phase of each movement trial.\nMeasuring angular excursion provides an index of the range of movement, in a particular plane of motion, that the subject was required to control during the task.\nBecause movement strategies and pickup hand varied across individuals, to normalize across all subjects, excursion was calculated to characterize the total amount of sagittal plane (extension to flexion), frontal plane (lateral bending from left to right), and axial plane (rotation from right to left) movement during the task.\nIndependent samples t-tests were used to test for differences between the LBP and control groups for age, gender, height, weight, BMI, and pick up movement time (Table 1).\nMixed model ANOVA tests were used to examine the effect of group (LBP, control) and lumbar region (upper, lower) on spine segment excursion and pattern of motion (movement quartiles) in each plane during the pickup task.\nMixed model ANOVA tests were used to examine the effect of group and segment (hip, knee) on lower extremity excursion in each plane.\nTo examine the effect of movement-based subgroup on kinematics during the pickup task, a subgroup analysis was conducted for only the LBP group (N  17).\nA repeated measures ANOVA test was used to determine the effect of MSI subgroup (Rotation, Rotation with Extension, Rotation with Flexion) on lumbar spine excursion.\n, 2015), b full body kinematic model.\ndata analysis was performed using SPSS software (Version 22.\nPost-hoc tests were conducted for significant interaction effects.\nThere were no significant differences between groups in age, gender, height, weight, BMI, or pickup movement time (Table 1).\nLow back pain symptom characteristics are reported in Table 2.\nBased on subjective report, 70% of subjects reported having a LBP problem >6 months duration, while 30% of subjects reported having a LBP problem of <6 months duration.\nThree subjects with LBP reported increased LBP with the pick up task.\nIn the sagittal plane, there was a significant group by lumbar region interaction effect (P < 0.\nSubjects in the LBP group displayed greater movement in the upper lumbar region (4) and less in the lower lumbar region (6) than control subjects (Fig.\nBoth groups displayed more lower than upper lumbar region movement in the sagittal plane (P < 0.\nThere were no significant effects of group or region on frontal or transverse plane lumbar spine excursion (Ps > 0.\nSpecifically, post-hoc t-tests revealed that subjects in the LBP group displayed more upper lumbar flexion during the first 25% of the task than control subjects (P < 0.\nUpper lumbar region movement patterns were not different between groups in the frontal or transverse planes (Ps > 0.\nLower lumbar region movement patterns were not different between groups in any plane (Ps > 0.\nIn the frontal plane, there was a significant main effect of group, and a group by region interaction effect (Ps < 0.\nSubjects in the LBP group displayed more frontal plane movement than control subjects.\nSpecifically, post-hoc t-tests revealed that people with LBP displayed more knee movement in the frontal plane than control subjects (P < 0.\nThere were no significant effects of group or region on lower extremity kinematics in the sagittal or axial planes (Ps > 0.\nSubjects in the Rotation with Flexion subgroup displayed more upper lumbar flexion and lateral bending compared to other subgroups, and people in the Rotation subgroup displayed more lower lumbar lateral bending than other subgroups.\nSimilar to the prior research, we determined that subjects in both groups displayed more lower than upper lumbar spine movement in the sagittal plane during the pickup task.\nSubjects with LBP displayed less lower but more upper lumbar flexion than control subjects in the sagittal plane.\nFindings from the current study may be different from previous studies, because the severity of LBP for subjects in the symptomatic group varies across studies.\nThe sample examined in the current study, however, is relevant to a clinical population because all subjects with LBP were seeking physical therapy treatment.\nevaluated tasks from the sitting position, with a relatively fixed pelvis (Shum et al.\nSeveral investigators have examined pattern of lumbar spine motion during a forward bending test movement (Esola et al.\n,1996; Gatton and Pearcy, 1999; Kanayama et al.\n, 1996; Lee and Wong, 2002).\nIn the current study, when examining pattern of lumbar spine motion during a functional task involving forward bending, groups displayed differences in sagittal plane movement pattern in.\nSubjects in the LBP group displayed significantly more upper lumbar flexion in the first 25% of the motion than control subjects.\nsimilarity in findings between the studies may suggest that people with LBP display similar movement patterns during a clinical test of forward bending and related functional activity (pick up task).\nSubjects with LBP display significantly more frontal plane movement at the knee than control subjects.\nGreater frontal plane knee movement during functional activities that are repeated across the day, may increase stresses at these lower extremity joints, and be a potential explanation for increased risk of lower extremity injury in people with LBP (Leung et al.\nThere are several potential explanations fordifferences in lumbar spine and lower extremity movement between subjects with and without LBP.\n0 years; Table 2), subjects in the LBP group may limit their motion in the lower lumbar region and alter their movement pattern to consciously or subconsciously avoid pain.\nSecond, over time, subjects with LBP may have alterations in tissue mechanics, limiting lower lumbar region movement and redistributing this motion to the upper lumbar spine and lower extremities (Chan et al.\n, 2012; Freddolini et al.\nLast, movement patterns may differ for subjects with LBP who have received previous therapy, during which they have been encouraged to increase lower extremity and decrease lumbar spine movement when picking up an object off the floor.\nAlthough we did not have adequate power to detect subgroup differences, subjects in movement-based subgroups appeared to move in predictable ways during the pick up task.\nOne limitation of the current study is that a single functional task may not be impaired or provoke pain in all subjects with LBP.\nAny subject who was seeking care at one of the participating clinics was offered the opportunity to participate.\nTherefore, the sample was heterogeneous with regard to low back pain severity and chronicity.\nThis heterogeneity may have affected our results, because people with acute LBP may display differences in movement characteristics when compared to people with chronic LBP.\nHowever, this sample was very pragmatic of the population of patients seeking care in physical therapy.\nIn the current sample, only three people with LBP reported increased pain during the pickup task.\nThese three individuals reported higher levels of current pain on the NRS (3.\n0 for the remainder of the LBP group), but had a shorter history of LBP and fewer episodes of pain in the past 12 months.\nA second limitation is that the power to detect movement-based subgroup differences was limited by sample size.\nHowever the current data supports that future research is needed with larger sample sizes to investigate kinematic differences among LBP subgroups during functional activities.\nLast, common to surface marker measurement approaches, there is the potential for skin motion artifact that may impacts kinematic measures.\nHowever, it is unlikely that skin motion artifact would be systematically different between the groups and explain the findings reported on in the current study.\nFurther, because of the magnitude of measurement error (~2) relative to the degree of movement in the frontal and axial planes (~4e6), it is possible that there was a group difference in these planes of movement during the task that could not be detected with the motion capture measures.\nlower) during the down phase of a pickup task.\nAlthough there were no significant group differences in total excursion within each lumbar spine region, subjects with LBP displayed significantly more upper lumbar region flexion than control subjects during the early phases of the task.\nLast, subjects with LBP display more frontal plane knee movement than controls during the pick up task.\nClinicians need to consider lumbar spine regional differences, pattern of movement, and lower extremity motion when evaluating movement during functional tasks in people with LBP and modifying movement during intervention.\ncollection, analysis, interpretation, writing the report, or the decision to submit the article for publication.\nThe authors would like to thank Rebekah Sirtoli for her work on recruitment, data entry, and data processing for this project, and James Ebeling for assistance with creating the figure of the spine model used in this study.\nEpidemiological features of chronic low-back pain.\nDynamic changes of elasticity, cross-sectional area, and fat infiltration of multifidus at different postures in men with chronic low back pain.\nDifferences in sitting postures are associated with nonspecific chronic low back pain disorders when patients are subclassified.\nDiscriminating healthy controls and two clinical subgroups of nonspecific chronic low back pain patients using trunk muscle activation and lumbosacral kinematics of postures and movements: a statistical classification model.\nThe rising prevalence of chronic low back pain.\nKinematics and movement sequencing during flexion of the lumbar spine.\nLumbar spine kinematics during walking in people with and people without low back pain.\nPatterns of lumbar region movement during trunk lateral bending in 2 subgroups of people with low back pain.\nDifferences in lower-lumbar regionrotation between people with and without low back pain during walking: a pilot study.\nPeople with and Without Low Back Pain a Pilot Study.\nThe burden of chronic low back pain: clinical comorbidities, treatment patterns, and health care costs in usual care settings.\nThe inter-tester reliability of physical therapists classifying low back pain problems based on the movement system impairment classification system.\nPhase lag of the intersegmental motion in flexion-extension of the lumbar and lumbosacral spine.\nLumbar disc disorders and low-back pain: socioeconomic factors and consequences.\nRelationship between the movements of the lumbar spine and hip.\nThe relationship between the piriformis muscle, low back pain, lower limb injuries and motor control training among elite football players.\nRegional differences in lumbar spinal posture and the influence of low back pain.\nThe effects of experimentally induced low back pain on spine rotational stiffness and local dynamic stability.\nMovement Impairment Syndromes of the Lumbar Spine.\nReliability and validity of a new objective tool for low back pain functional assessment.\nEffect of low back pain on the kinematics and joint coordination of the lumbar spine and hip during sit-to-stand and standto-sit.\nSymptomatic and asymptomatic movement coordination of the lumbar spine and hip during an everyday activity.\nMovement coordination of the lumbar spine and hip during a picking up activity in low back pain subjects.\nSymmetry of timing of hip and lumbopelvic rotation motion in 2 different subgroups of people with low back pain."}