{"title": "20.pdf", "contents": "Non-specific chronic low back pain (NSCLBP) is a major health problem, affecting about one fifth of the population worldwide.\nTo avoid further pain or injury, patients with NSCLBP seem to adopt a stiffer movement pattern during everyday living activities.\nHowever, it remains unknown how NSCLBP affects the lumbar lordosis angle (LLA) during repetitive activities such as walking or running.\nThis pilot study therefore aimed at exploring possible NSCLBP-related alterations in LLAs during walking and running by focusing on discrete parameters as well as continuous data.\nThirteen patients with NSCLBP and 20 healthy pain-free controls were enrolled and underwent a fullbody movement analysis involving various everyday living activities such as standing, walking and running.\nPatients with NSCLBP indicated reduced average LLAs during standing, walking and running and a tendency for lower LLA-ROM during walking.\nFurthermore, patients indicated a reversed movement pattern during running, with increasing instead of a decreasing LLAs after foot strike.\nThis study provides preliminary evidence that NSCLBP might affect LLAs during walking and running.\nThese results can be used as a basis for future large-scale investigations involving hypothesis testing.\nLow back pain (LBP) is a major global health problem, with up to 84% of the population having at least one episode of LBP during their lifetime and 23% developing a chronic form (Balague et al.\nIn about 9 out of 10 patients with chronic LBP, the pathoanatomical cause cannot be determined and the term nonspecific chronic LBP (NSCLBP) is used (Machado et al.\nClinical guidelines recommend patient education, medication as well as exercise therapy and spinal manipulation to treat NSCLBP (Balague et al.\nHowever, the effect sizes for most treatment options compared to placebo were relatively small, indicating a need for more.\nIn order to develop better treatment and prevention strategies, a profound understanding of the underlying mechanisms of NSCLBP is of high importance.\nAdaptions in trunk movement and their potential impact on LBP are gaining more and more attention as evolving evidence indicates that certain spinal movement strategies during daily activities might predispose individuals to persistent back problems in the long term through disruption of the load sharing of spinal tissues and muscle fatigue, promoting pro-nociceptive mechanisms and injury (Hodges and Smeets, 2015; van Dieen et al.\nAs such, throughout the past decade, several research groups have attempted to better understand lumbar spine function in NSCLBP, especially by studying everyday living activities such as walking, chair rising, object lifting, stepping up and running (Christe et al.\n, 2019; Gombatto et al.\nCorresponding author at: Bern University of Applied Sciences, Department of Health Professions, Murtenstrasse 10, 3008 Bern, Switzerland.\nJournal of Biomechanics 108 (2020) 109883.\nContents lists available at ScienceDirect.\n, 2018; Hernandez et al.\n, 2015; Papi et al.\n, 2019; Pelegrinelli et al.\n, 2020; van den Hoorn et al.\nHowever, these studies were based on differently defined rigid trunk segments and none of them considered the lumbar lordosis angle, which is a parameter that complements the findings of the above mentioned studies by providing additional information that might not be detected using rigid segments (Schmid et al.\nMoreover, the lumbar lordosis angle is a clinical parameter that is familiar to every clinician and might hence be fairly easily addressed in prevention or treatment protocols.\nAmong several types of physical activity, walking and running are of the least expensive and most broadly accessible forms of physical activity and were shown to be associated with various health benefits (Hamer and Chida, 2008; Pedisic et al.\nEven though patients with LBP seem not to be less active than healthy individuals (Griffin et al.\n, 2012), it is still not fully understood how LBP affects lumbar spine movement or vice versa during walking and running.\nFor these reasons, this pilot study aimed at exploring possible differences in lumbar lordosis angles during walking and running between patients with NSCLBP and healthy pain-free controls by focusing on discrete parameters as well as continuous data.\nThirteen patients with NSCLBP and 20 healthy controls were included in this pilot study (Table 1).\n(2016) suggested a minimum sample size of n = 12 per group when assuming a target effect size of 0.\nPatients had to suffer from NSCLBP for at least three months and the healthy controls had to be free of pain with no prior history of NSCLBP.\nExclusion criteria for both groups were a history of specific LBP or nerve root pain, any disorders affecting the gait or running patterns, severe psychological disorders, anamnestically known pregnancy and breastfeeding less than 6 months postnatal as well as a body mass index (BMI) > 30 kg/m2.\nThe study protocol was approved by the local ethics committee and all participants provided written informed consent.\nAll participants were invited for a visit at the movement analysis laboratory.\nParticipants were then asked to perform a variety of everyday living activities including upright standing for 10 s as well as walking and running on a 10-meter level walkway at a normal self-selected speed.\nMarker positions were tracked using a three-dimensional optical motion capture system with 10 infrared cameras (VICON, Oxford, UK; sampling rate: 200 Hz).\nThe standing activity was performed once, whereas the walking and running activities were repeated until five valid trials were recorded.\nData pre-processing was conducted using the software package Vicon Nexus 2.\n6 (Vicon UK, Oxford, UK), which included the reconstruction and filtering of the marker trajectories as well as event setting to identify the respective walking and running cycles.\nLumbar lordosis angles were then calculated using a custom-built MATLAB-routine (R2019a, MathWorks Inc.\n, Natick, MA, USA) as described previously (Schmid et al.\nIn brief, we applied a combination of a quadratic polynomial and a circle fit function to the sagittal plane trajectories of the markers from L1 to S1 and used the central angle theorem to derive the lumbar lordosis angle (expressed in degrees).\nOutcome parameters were defined as average lumbar lordosis angles during upright standing, walking and running, RoM (absolute difference between maximum and minimum angle) of the lumbar lordosis angles during walking and running as well as continuous lumbar lordosis angles during walking and running (time-normalized to 101 data points).\nAll calculations were carried out using MATLAB (R2019a, MathWorks Inc.\n, Natick, MA, USA).\nTo explore possible differences in lumbar lordosis angles (discrete parameters and continuous data) between patients with NSCLBP and healthy pain-free controls, we calculated means and standard deviations as well as mean differences with 95%, 90%, 85%, 80% and 75% confidence intervals (CI) as suggested by Lee et al.\nTable 1 Demographics of the healthy pain-free controls and the patients with non-specific chronic low back pain (NSCLBP).\n1 (14) N/A ODI2 [%] N/A 19.\n1 Visual analog scale (VAS).\n2 Oswestry Disability Index (ODI).\n/ Journal of Biomechanics 108 (2020) 109883.\nThis pilot study aimed at exploring possible alterations in lumbar lordosis angles during walking and running in patients with NSCLBP compared to healthy pain-free controls.\nThe results indicated that patients with NSCLBP possibly adopt a generally less lordotic lumbar posture as well as a reduced motion during walking and a reversed movement pattern during running.\nThe attenuated lumbar lordosis angles in patients with NSCLBP are in line with the findings of a recent meta-analysis of 796 patients with LBP and 927 healthy controls (Chun et al.\n2015), the observed lordosis attenuation in NSCLBP patients might be interpreted as a protective or compensatory mechanisms.\nIn fact, it was reported that individuals with chronic LBP increase their abdominal muscle activity particularly during the single stance phases of walking (Pakzad et al.\n, 2016), which coincides with the phases where the patients with NSCLBP in our study seemed to avoid an increase in lumbar lordosis.\nThe reversed movement pattern observed in our patients during running can probably be interpreted as an overcorrection of the trunk stiffening strategy and should be further investigated.\nEspecially during an activity with relatively high impacts such as running, these biomechanical changes might be of high clinical importance.\nIt is important to mention though that about one fourth (23%) of the patients presented a normal lumbar lordosis movement pattern, i.\na movement pattern that was comparable to the majority of healthy controls.\nOn the other side, one fifth (20%) of healthy controls presented a movement pattern that resembled the majority of patients with NSCLBP, i.\na reversed movement pattern, indicating different trunk motor control strategies among groups.\nthe interplay between fear-avoidance beliefs and spinal motion in individual participants.\nStudies investigating spinal motion during object lifting in patients with NSCLBP as well as in healthy pain-free adults showed that individuals who believed that lifting an object with a round back is dangerous had altered lumbar spine kinematics (Matheve et al.\n, 2019; Schmid et al.\nassessments of fear-avoidance beliefs, this explanation attempt remains speculative.\nA limiting factor of this study was that in a few cases (5 healthy controls during standing, walking and running; 1 patient during standing and walking), our 10-camera motion capture system was not able to fully identify all the lumbar spine markers and hence, no lumbar lordosis angles could be calculated in these cases.\nFor future studies, it is therefore advised to use more cameras or cameras with a higher resolution in order to avoid data loss due to technical limitations.\nFurthermore, even though the average ages of the two groups did not show statistically significant differences, patients appeared to be slightly older than the healthy controls, which could have influenced the outcomes.\nHowever, it is not expected that this age difference would explain a reversed movement pattern during running.\nIn summary, this study provides evidence that NSCLBP might affect the lumbar lordosis angle during walking and running.\nThese results can be used as a basis for future large-scale investigations involving hypothesis testing.\nTo further explore the reversed movement pattern during running, it does not make sense to use RoM as an outcome parameter but rather mean differences of the lumbar lordosis angles at about 25% and 75% of the running cycle.\nDiagnosis and treatment of low back pain: a joint clinical practice guideline from the American College of Physicians and the American Pain Society.\nChronic low back pain patients walk with locally altered spinal kinematics.\nMulti-segment analysis of spinal kinematics during sit-to-stand in patients with chronic low back pain.\nLumbar and thoracic kinematics during step-up: Comparison of three-dimensional angles between patients with chronic low back pain and asymptomatic individuals.\nThe relationships between low back pain and lumbar lordosis: a systematic review and metaanalysis.\nA comparison of five low back disability questionnaires: reliability and responsiveness.\nLumbar spine kinematics during walking in people with and people without low back pain.\nDifferences in kinematics of the lumbar spine and lower extremities between people with and without low back pain during the down phase of a pick up task, an observational study.\nDo patients with chronic low back pain have an altered level and/or pattern of physical activity compared to healthy individuals? A systematic review of the literature.\nNon-specific chronic low back pain: differences in spinal kinematics in subgroups during functional tasks.\nDifferences in lumbar spine and lower extremity kinematics during a step down functional task in people with and people without low back pain.\nInteraction between pain, movement, and physical activity: short-term benefits, long-term consequences, and targets for treatment.\nInterpretation of visual analog scale ratings and change scores: a reanalysis of two clinical trials of postoperative pain.\nEffect sizes of nonsurgical treatments of non-specific low-back pain.\nThe statistical interpretation of pilot trials: should significance thresholds be reconsidered?.\nAnalgesic effects of treatments for non-specific low back pain: a meta-analysis of placebocontrolled randomized trials.\nDevelopment of a German version of the Oswestry Disability Index.\nPart 1: cross-cultural adaptation, reliability, and validity.\nLumbar range of motion in chronic low back pain is predicted by task-specific, but not by general measures of pain-related fear.\nLow back pain affects trunk as well as lower limb movements during walking and running.\nPain catastrophizing and trunk muscle activation during walking in patients with chronic low back pain.\nSpinal segments do not move together predictably during daily activities.\nIs running associated with a lower risk of all-cause, cardiovascular and cancer mortality, and is the more the better? A systematic review and meta-analysis.\nSpinal kinematics during gait in healthy individuals across different age groups.\n08  Lifting with a round-back is dangerous! How beliefs might affect lumbar spine motion during object lifting in pain-free individuals.\nQuantifying spinal gait kinematics using an enhanced optical motion capture approach in adolescent idiopathic scoliosis.\nIs lumbar lordosis related to low back pain development during prolonged standing?.\nMechanical coupling between transverse plane pelvis and thorax rotations during gait is higher in people with low back pain.\nLow-back pain patients learn to adapt motor behavior with adverse secondary consequences.\nEstimating the sample size for a pilot randomised trial to minimise the overall trial sample size for the external pilot and main trial for a continuous outcome variable."}