{"title": "22.pdf", "contents": "Patients with low back pain and asymptomatic individuals were evaluated while performing controlled and free-dynamic lifting tasks in a laboratory setting.\nAn important, yet unresolved, issue associated with low back pain is whether patients with low back pain experience spine loading that differs from that of individuals who are asymptomatic for low back pain.\nIn this study, 22 patients with low back pain and 22 asymptomatic individuals performed controlled and free-dynamic exertions.\nPatients with low back pain experienced 26% greater spine compression and 75% greater lateral shear (normalized to moment) than the asymptomatic group during the controlled exertions.\nWhen permitted to move freely, the patients with low back pain compensated kinematically in an attempt to minimize external moment exposure.\nIncreased muscle coactivation and greater body mass resulted in significantly increased absolute spine loading for the patients with low back pain, especially when lifting from low vertical heights.\nThis loading is further exacerbated by the increases in body weight that often accompany low back pain.\nPatient weight control and proper workplace design can minimize the additional spine loading associated with low back pain.\nAn important, yet unresolved, issue associated with low back pain (LBP) is whether the spine loadings of patients with LBP differ from those of individuals who are asymptomatic for LBP.\nwhich spine loading occurs in patients with LBP to allow identification of situations that might lead to further spine damage.\nThere have been several attempts toward a better understanding of the biomechanical differences between patients with LBP and asymptomatic individuals.\nStudies have explored the strength differences between patients with LBP and asymptomatic individuals22,24,30,48,49,51,58.\nAlthough most of these studies have identified differences in strength production capacity, they do not offer much insight into the nature of the loading imposed on the spine.\nOther studies6,9,25,26,54,55,57,58 have attempted to document the back muscle electromyographic (EMG) activities.\nAlthough increased coactivity (guarding) in patients with LBP have been documented by several researchers,6,9,2628.\nDeterministic biomechanical models have been developed that estimate spine loads in uninjured individuals by assuming that specific internal structures must support an external load moment and contribute to internal spine loading.\n7,8,14,53,59 However, it is well known that patients with LBP have greater levels of guarding, recruit their muscles in a significantly different manner, move slower, and have altered flexionrelaxation responses, as compared with asymptomatic patients46,28,34,42,46,60.\nThese facts suggest that patients with LBP may use very different muscle activation patterns to generate internal load support, making deterministic models inappropriate for patients with LBP.\nClearly, to predict spine loads in patients with LBP, the clinician must be able account for atypical recruitment patterns of the trunk muscles.\nAlthough EMGassisted biomechanical models could be well suited to such a task, these models need to assess the relative contribution of multiple muscles accurately, which usually requires an EMG calibration (e.\nRecently, studies in the authors laboratory have developed an EMG calibration procedure based on submaximal exertions that nevertheless can estimate maximal EMG.\nGiven this development in EMG calibration, a study intended to compare spine loads of patients with LBP with those of asymptomatic individuals was designed.\nPartial funding for this study was supplied by a grant from the Ohio Bureau of Workers Compensation.\nidentical postures, and another permitting subjects to adjust their postures so the researchers could gain insight into how patients with LBP compensate for their pain limitations under realistic conditions.\nOf the 44 participants in this study, 22 (12 males and 10 females) had LBP at the time of the testing and were recruited from the orthopedic practice of one of the authors (P.\nIn addition, 22 ageand gender-matched individuals who had been asymptomatic during the previous year were recruited.\nAll the participants were involved in both phases of the testing.\nWhile in this posture, the participants were asked to control sagittal extension exertion by ramping up to a predetermined force exertion level for 2 seconds.\nThree exertion targets (40, 60, and 80 Nm) and injury group membership (LBP vs asymptomatic) served as the independent variables for this phase of the study.\nThe dependent variables for this phase consisted of trunk muscle EMG activity, trunk kinetic information, and the resulting spine loads.\nPhase 2 testing was intended to evaluate whether kinematic compensation occurred in patients with LBP, as compared with asymptomatic participants.\nThe independent variables in this study were group membership (LBP vs asymptomatic), weight lifted, and lift origin.\nAnthropometry for Individuals With Low Back Pain (LBP) and Asymptomatic Individuals.\nAsymptomatic Low Back Pain.\n* Significant differences between individuals with LBP and asymptomatic individuals for females, males, and overall.\nDescription of the Group of Patients With Low Back Pain (LBP).\n* Scale is from 0 (no pain) to 10 (worse pain).\ngins varying in vertical height and horizontal distance from the spine: shoulder height at a moment arm of 30.\n5 cm, waist height at 30.\n5 cm, mid-shin height at 30.\nThe lifts ended with the body in an upright position and the weight located at elbow height.\nThe dependent variables for this phase comprised the EMG activity of 10 trunk muscles, trunk and hip kinetic and kinematic information, and the resulting spine loads.\nElectromyographic activity was collected with the use of bipolar silversilver chloride electrodes.\nThe electrodes recorded activity at the 10 major trunk muscle sites consisting of right and left muscle pairs of erector spinae, latissimus dorsi, rectus abdominis, external oblique muscles, and internal oblique muscles.\ntrode placements have been described previously.\n41 The raw EMG signals were preamplified, high-pass filtered at 30 Hz, low-pass filtered at 1000 Hz, rectified, and smoothed with a 20-ms sliding window filter.\nSkin impedances were maintained below 100 K.\nElectromyographic calibration normalization testing and Phase 1 testing were performed using an asymmetric reference frame.\nThe asymmetric reference frame provided static resistance against the upper body and monitored torque production about L5S1,19 which was displayed on a computer so participants could control the magnitude.\nDuring Phase 2 testing, trunk kinematics were documented with a lumbar motion monitor.\nThe device design, accuracy, and application have been reported previously.\n33 Ground reaction forces were monitored via a force plate in conjunction with a set of electrogoniometers13 (Figure 2).\nAll signals were collected simultaneously at 100 Hz using customized Windows-based software developed in the Biodynamics Laboratory (Columbus, OH).\nA new EMG calibration procedure reported recently does not require maximal exertion for calibration of the EMG signal.\n31,32 This new technique estimates the slope of the EMGforce relation and predicts an expected maximum contraction for anchoring the maximum value (Figure 3).\nThe EMGforce relation (slope) is established by a series of low-level exertions performed in flexion, extension, and axial twisting.\n, 10, 20, and 30 Nm).\nSubject performing the free-dynamic lifts during Phase 2.\nGraph showing the linear slope relation between forces generated and muscle electromyographic activity with a reference point, either maximum voluntary contraction (MVC) or expected maximum contraction (EMC).\nThe dots represent muscle activity at a given exerted moment, and the shaded area shows typical variability in the MVC because of inaccuracies.\nEMC defines the midpoint of this region.\nThe expected maximum contraction, as a substitute for maximum voluntary contraction, was derived from regression equations describing the relations between maximum exerted trunk moments and anthropometric measurements for 120 subjects.\nThis method has been thoroughly reported and validated.\n01), with the asymptomatic group within normal range.\nThe model has been validated for forward bending,16,45 lateral bending,36 and twisting35 exertions and adjusted for anatomic gender differences.\n20,38 For this study, adjustments to muscle location and size relative to each subjects body mass index also were made61 because the LBP group was considerably heavier than the asymptomatic group, yet similar in stature.\nTwo additional biomechanical measures were defined in this study.\nThe coactivity index was defined as the activity of the antagonist muscles relative to agonist muscle activities.\nOn arriving at the Biodynamics Laboratory, the subjects first were informed about the study procedures, their prerogative to refuse performance of a particular lift, and their need to inform experimenters about any further discomfort.\nConsent to participate was acquired via a document approved by the University Institutional Review Board.\nSecond, anthropometric measurements were collected, and surface electrodes then were applied using standard placement procedures.\nNext, the participant was positioned in the pelvic support structure in the asymmetric reference frame, and the EMG calibration procedure was performed.\nThis procedure was followed by the Phase 1 experiment, in which the subjects completed the three targeted extension exertions.\nAfter a rest period, Phase 2 test conditions were completed twice for each load weight condition.\nAll six lift region conditions (Figure 2) were completed for each weight before the increase to the next weight.\n, lowest expected lift moment) first before the participant progressed to more demanding lifts at each weight level.\nIn this test, the participants were required to keep their feet stationary on the force plate, but were free to move the rest of the body as they wished.\nRepeated measures analyses of variance (ANOVA) were performed for the spine load variables to explore whether differences exist between individuals with LBP and asymptomatic individuals.\nWhen statistically significant independent variables were identified, post hoc analyses (Tukey multiple pairwise comparisons) were performed to determine the source of the significant effects.\nidentified were considered statistically significant at a P value less than 0.\nPhase 1 Evaluation of the controlled exertions indicated that the LBP group experienced significantly greater (47%) absolute compression and lateral shear (103%) than the asymptomatic group (Table 3).\nWhen the spine loadings were adjusted for the greater body mass of the LBP group (via moment normalization), significant increases in compression (26.\n3%) and lateral shear (75.\nIn addition, the LBP group exhibited statistically significant increases in muscle activities for all 10 muscles, averaging 123% of the asymptomatic group values (Figure 5).\n46) than the index for the asymptomatic group (0.\nThese analyses indicate that when subjects with LBP.\n92 Muscle coactivity Coactivity index 0.\n84 Sagittal trunk velocity () 21.\n0 Absolute spinal loads Lateral shear (n) 110.\n0 Anteroposterior shear (n) 609.\n6 Compression (n) 2825.\n1 Normalized spinal loads Lateral shear (n/Nm) 1.\n36 Cumulative spinal loads Lateral shear (104 n) 0.\n66 Anteroposterior shear (104 n) 6.\n06 Compression (104 n) 32.\nPeak spinal loads predicted by the electromyogram-assisted model.\nPeak spinal loads normalized to the sagittal trunk moment.\nThe summed value of the instantaneous spinal load during the entire trial.\nand asymptomatic subjects perform the same exact exertion, the absolute and relative biomechanical costs to the patients with LBP are much greater.\nAs expected (but not shown), increases in exertion levels also resulted in significant linear increases in both absolute and normalized spine loads.\nNo interactions between group membership and exertion levels were significant.\nPhase 2 Under the free-dynamic lifting conditions, the patients with LBP experienced approximately 20% greater magnitude of external moment and about 21% greater absolute spine compression (Table 3).\nThey also experienced significantly larger cumulative compression, lateral shear, and anteroposterior shear.\nKinematic analyses indicated that the participants with LBP significantly reduced their trunk and hip kinematics in terms of sagittal position and velocity, as compared with the asymptomatic group, when lifting from origins farther away from the spine (greater moment arms), and when lifting from locations with a lower vertical origin (Figure 6).\nThey therefore did not bend as far forward as the asymptomatic group, yet their increased torso mass caused a net increase in external moment.\nHowever, this was accomplished at the cost of greatly restricted movement.\nThis study represents the first quantitative EMG-assisted biomechanical evaluation of spine loading differences between individuals with and those without LBP.\nThe use of a new EMG calibration procedure in conjunction with a well-developed EMG-assisted model allowed the authors to show that LBP subjects experience significantly greater spine loads than asymptomatic individuals when subjected to the same postural loading conditions.\nAfter normalization for differences in body mass, patients with LBP experienced 26% more compression and 75% more lateral shear than their asymptomatic counterparts.\nThese loads can further increase when the impact from the additional body weight of patients with LBP is considered.\nIn the current study, when the body mass of the patients with LBP also was considered, absolute compression values represented almost a 50% increase over those for the asymptomatic group and more than a 100% increase in lateral shear over that for the asymptomatic group under all exertion conditions.\nUnder unrestricted lifting conditions, the participants with LBP kinematically compensated for their back pain, thereby minimizing external moment exposure.\nHowever, the LBP groups coactivity along with their increased body mass offset any spine loading benefits that might have been derived from these kinematic reductions in movements.\nTherefore, under realistic situations, patients with LBP typically experience significantly greater spine loads.\nThis logic was confirmed by comparing a subsample of five LBP-asymptomatic subject pairs matched for both height and weight.\nUnder Phase 1 conditions, this LBP group subset experienced 28% and 38% greater normalized and absolute compression, respectively.\nHowever, under Phase 2 conditions, the LBD group reduced their flexion by 30% and their torso velocity by 60%.\nThese changes reduced the external moment to levels that were less than those of their matched asymptomatic group counterparts, but resulted in virtually identical spine loads.\nHence, although the LBP group compensated by reducing the moment imposed about the torso, their increased trunk muscle coactivaiton offset the gains derived through moment reduction.\nThe larger body mass of the typical patient with LBP11,12,29 would further increase spine loading.\nThe degree of spine loading experienced by the LBP group was strongly dependent on the lift origin height and the moment arm distance, with greater spine loading occurring at lower lift heights and farther from the spine.\nThese also are the regions that would be expected to impose greater moments on the spines of the LBP group because of their greater torso mass.\nFurthermore, these same conditions were associated with greater differences in coactivations, and most likely were those related to guarding.\nThese findings suggest a strong musculoskeletal system reaction to the patients body weight during a lift when the moment is great or the lift must be performed at a low level.\nThese findings suggest two implications.\nFirst, body weight appears to play a major role in spine loading for the LBP group, imposing much greater spine loading than would be expected for asymptomatic subjects of equal size.\nThe findings suggest that patients with LBP could benefit greatly from weight control during the recovery process.\nSecond, when patients with LBP return to a workplace that requires materials handling, it is even more important that the workplace be designed to accommodate their capabilities than it would be for asymptomatic individuals.\nLBP, it is important to arrange the workplace so that loads can be lifted at waist height with the lift origin close to the body.\nBecause guarding and trunk muscle coactivation appear to exert a strong influence on the magnitude of spine loading, it might be expected that patients with LBP and greater impairment might generate more coactivation, and therefore greater spine loading.\nIn the current study, follow-up analyses identified many significant trends between the extent of low back disorder, as measured by the authors functional analysis test, and both peak and cumulative spine loading.\nTable 4 summarizes these relations for various lift origins, showing that nonlinear models can explain up to 45% of the variance between impairment and spine compression.\nThere is a monotonic, yet nonlinear, relation between spine loading and degree of impairment as measured in this study.\n34,42 Because the functional analysis test is a measure of the musculoskeletal systems ability to recruit muscles synergistically in an efficient manner,34 patients may derive more benefit from kinematic conditioning than from strength conditioning.\nThese increases in spine loading associated with LBP may accelerate degeneration of the spine.\nrecently showed that even minor damage to a vertebral body endplate leads to progressive structural changes in the intervertebral discs.\nIn addition, because the patients with LBP performed the lifting tasks over a longer period, there may also have been an additional risk because of cumulative spine loading.\nFor the tasks described in our study, the cumulative lateral shear, anteroposterior, and compressive loads were 44%, 59%, and 57% higher, respectively, for patients with LBP.\nRecent studies have suggested that increased LBP risk can indeed be related to cumulative loading.\nTherefore, given the current findings, it would be expected that the risk of further spine damage would be even greater when patients with LBP are exposed to greater levels of cumulative loading.\nFirst, the exposure to loading occurred over a short (2-hour) test period.\nUnder realistic, longer exposure to lifting conditions, the detrimental effects of spine loading may be much greater.\nFurther testing is needed to resolve this issue.\nSecond, the current LBP population consisted primarily of patients with pain from suspected muscular origins.\nA similar study needs to be conducted in which patients with structural disorders are tested to determine whether they would respond in a similar fashion.\nThird, future studies may want to explore spine loading for patients with acute, as compared with chronic, LBP.\nThe LBP population in the current study did not offer statistical power sufficient for exploring this issue.\nFourth, the new normalization technique is based on the assumption that both LBP and asymptomatic individuals have the same muscle control strategies.\nFuture research needs to establish whether a difference may exist.\nFinally, spine loading was evaluated in this study for a limited range of materials-handling tasks.\nFuture studies could use similar spine-loading analysis techniques to investigate spine loads associated with other forms of work performed by patients with LBP.\nThis might include more complex lifts, pushingpulling, carrying, lifting while the feet are moved, or seated work tasks.\nIn conclusion, this is the first EMG-driven biomechanical evaluation of spine loading in patients with LBP, as compared with spine loading in asymptomatic individuals.\natic subjects during materials-handling tasks.\nSpine loading increased with increasing impairment, primarily as result of increased trunk muscle coactivation.\nPatients with low back pain produced higher spine loads during highly controlled exertions than their asymptomatic counterparts.\nDuring free-dynamic lifting, patients with low back pain were found to compensate by reducing flexion and motion, thus reducing trunk moment.\nHowever, the impact of body mass and increased muscle coactivity was greater than the kinematic compensation because patients with low back pain had higher spinal compression, particularly when lift origins were below the waist.\nComparison of lumbar paravertebral EMG patterns in chronic low back pain patients and nonpatient controls.\nCorrelation of chronic low back pain behavior and muscle function examination of the flexionrelaxation response.\nArena JG, Sherman RA, Bruno GM, et al.\nTemporal stability of paraspinal electromyographic recordings in low back pain and nonpain subjects.\nBiomechanical model calculation of muscle contraction forces: a double linear programming method.\nA computerized biomechanical model: development of and use in studying gross body actions.\nUse of surface EMG coactivational pattern for functional evaluation of trunk muscles in subjects with and without low back pain.\nThe evaluation of spinal loads during lowering and lifting.\nThe influence of personal variables on work-related low back disorders and implications for future research.\nLifestyle and low back pain: the influence of smoking and obesity.\nexternal spinal loads during unconstrained free-dynamic lifting.\nA dynamic biomechanical evaluation of lifting maximum acceptable loads.\nGranata KP, Marras WS.\nThe influence of trunk muscle coactivity on dynamic spinal loads.\nVariation in spinal load and trunk dynamics during repeated lifting exertions.\nA method for measuring external loads during dynamic lifting exertions.\nMoment arm distances of female and male trunk loading muscles.\nPredictors of isokinetic back muscle strength in patients with low back pain.\nQuantification of lumbar function: Part 4.\nCumulative load as a risk factor for back pain.\nHuman trunk strength profile in flexion and extension.\nLariviere C, Gagnon D, Loisel P.\nThe effect of load on the coordination of the trunk for subjects with and without chronic low back pain during flexion extension and lateral bending tasks.\nBody weight and low back pain: a systematic literature review of 56 journal articles reporting on 65 epidemiologic studies.\nMeasurement of muscle strength of the trunk and the lower extremities in subjects with history of low back pain.\nA non-MVC EMG normalization techniques for the trunk musclulature: Part 1.\nA non-MVC EMG normalization techniques for the trunk musclulature: Part 2.\nValidation and use to predict spinal loads.\nAccuracy of a three-dimensional lumbar motion monitor for recording dynamic trunk motion characteristics.\nThe quantification of low back disorder using motion measures: methodology and validation.\nA biomechanical assessment and model of axial twisting in the thoracolumbar spine.\nSpine loading during trunk lateral bending motions.\nThe development of an EMG-assisted model to assess spine loading during whole-body free-dynamic lifting.\nSize and direction of female and male trunk loading muscles.\nImpairment magnification during dynamic trunk motions.\nA comprehensive evaluation of trunk response to asymmetric trunk motion.\nElectromyographic studies of the lumbar trunk musculature during the generation of low-level trunk acceleration.\nThe classification of anatomicand symptom-based low back disorders using motion measure models.\nNetworks of internal trunk-loading activities under controlled trunk-motion conditions.\nA three-dimensional motion model of loads on the lumbar spine: I.\nA three-dimensional motion model of loads on the lumbar spine: II.\nFlexibility and velocity of the normal and impaired lumbar spine.\nTrunk muscle endurance measurement: isometric contrasted to isokinetic testing in normal subjects.\nQuantification of lumbar function: Part 2.\nSagittal plane trunk strength in chronic low back pain patients.\nMirka GA, Marras WS.\nTrunk strength testing with isomachines: Part 2.\nExperimental evaluation of the Cybex II Back Testing System in normal subjects and patients with chronic low back pain.\nA comparison of peak vs cumulative physical work exposure risk factors for the reporting of low back pain in the automotive industry.\nMuscle lines-of-action affect predicted forces in optimization-based spine muscle modeling.\nThree-dimensional kinematics and trunk.\nmuscle myoelectric activity in the young lumbar spine: a database.\nMuscle response pattern to sudden trunk loading in healthy individuals and in patients with chronic low back pain.\nSimulift: a simulation model of human trunk motion.\nLumbar muscle fatigue and chronic lower back pain.\nSpectral electromyographic assessment of back muscles in patients with low back pain undergoing rehabilitation.\nAnalysis of loads on the lumbar spine.\nCorrelation of objective measure of trunk motion and muscle function with low back disability ratings.\nTrunk muscle parameters determined from MRI for lean to obese males.\nMarras, PhD Biodynamics Laboratory Ohio State University, 1971 Neil Avenue Columbus, OH 43210 E-mail: marras."}