{"title": "24.pdf", "contents": "Approximately thirty-four percent of people who experience acute low back pain (LBP) will have recurrent episodes.\nRecurrent unilateral LBP patients, who were symptom free during testing, and a group of healthy volunteers, participated.\nEMG onsets of the short and long fibres, relative to that of deltoid, were compared between groups, muscles, and sides.\nIn association with a postural perturbation, short fibre EMG onset occurred later in participants with recurrent unilateral LBP than in healthy participants (p = 0.\nThe short fibres were active earlier than long fibres on both sides in the healthy participants (p < 0.\n001) and on the non-painful side in the LBP group (p = 0.\nActivity of deep back muscles is different in people with a recurrent unilateral LBP, despite the resolution of symptoms.\nBecause deep back muscle activity is critical for normal spinal control, the current results provide the first evidence of a candidate mechanism for recurrent episodes.\n2008 International Association for the Study of Pain.\nLow back pain (LBP) is a common and disabling health problem with 6090% of people experiencing an episode in their lifetime [9].\nFurthermore, despite receiving intervention, and becoming pain-free, 34% will experience an additional episode of LBP requiring further intervention [47].\nThis patient population, and those with persistent LBP, account for 80% of the costs related to the management of LBP [46,47].\nRegardless of an initial return to function and a recovery, some people continue to have recurrent episodic LBP.\nUnfortunately, we do not know why LBP becomes recurrent in some people and not in others.\nA likely contributor to the recurrence of LBP is a change in control of the back muscles.\nThe lumbar back muscles contribute to the control of spinal motion and stability [3,7,31,38,48], and are critical for spinal health [39,40].\nFurthermore, changes in lumbar back muscle control have been observed in people with chronic LBP [23,26,30,4144] and in people with LBP with sciatica.\nFor example, the deep back muscles are less active in people with chronic LBP than in healthy controls while returning to standing from full trunk flexion [30].\nHowever, the superficial back muscles are more active in people with LBP than in healthy controls during trunk movements [44], including an absence of the normal back muscle relaxation at full trunk flexion (the socalled flexionrelaxation phenomenon) [42].\nSuch changes in the back muscle activity are thought to reflect a change in the control strategy adopted by the nervous system.\nOn the one hand, this adaptation appears to compromise the control of the spine.\nThe reduction in deep back muscle activity would be expected to reduce the control, or fine tuning, of segmental motion that has been shown in biomechanical models and the experimentally injured lumbar spine [22,48].\nOn the other hand, the increased activity of superficial back muscles may serve to limit tensile forces and motion of injured/painful structures in the back [45].\nOne question that remains unanswered is: What happens to the control of the deep back muscles during remission from symptoms in people with recurrent LBP?.\nThis question is important because if the change in deep back muscle activity persists during remission, it could alter the control of segmental motion, and could be a factor in the recurrence of LBP.\nmuscles have been implicated in LBP, those in the back muscles are amongst the most consistent.\nArm movement provides a predictable spinal perturbation, and the associated back muscle activation reflects the preparatory postural strategy.\nBased on the histochemical [49] and morphological [12] changes in the back muscles of people with LBP, we hypothesized that changes in motor control would be more pronounced in the short fibres of the deep back muscles than in the long fibres, and that these changes would be greater on the previously painful side than on the asymptomatic side.\nFifteen people with recurrent (multiple episodes of LBP separated by periods of remission) unilateral LBP (7 male, mean (SD) age = 27 (7) years, height = 172 (8) cm and weight = 71 (14) kg) and 19 control subjects (9 male, age = 26 (5) years, height = 173 (9) cm and weight = 67 (11) kg) with no history of back pain participated in the study.\nTo be considered to have recurrent LBP, patients were to have experienced an initial episode of unilateral LBP (symptoms from T12 to the upper buttock) at least 3 months prior with subsequent bouts of back pain, severe enough to limit their normal activity and make them seek treatment (medication, physiotherapy, chiropractic, etc.\nEach participant was examined physically by an experienced clinician to verify an asymmetrical pattern of movement and/or symptom reproduction that supported the patients report of unilateral LBP.\nParticipants in the control group were to have had no LBP in the 2 years prior to participation in the study and no history of LBP that required intervention or limited functional abilities prior to that period.\nPeople who had any previous spinal surgery, major spinal deformities, respiratory or neurological conditions, or any orthopaedic condition which would have limited their ability to complete the experimental tasks were excluded from both groups.\nWritten informed consent was obtained.\nAll procedures were approved by the Institutional Research Ethics Committee and conducted in accordance with the Declaration of Helsinki.\nWe used a well established method [32] to record electromyographic activity (EMG) of the deep and superficial back muscles on both sides of the spine, at the L5 spinal level.\nFor insertion of the intramuscular electrodes, participants were positioned in either supported sitting or side lying.\nThe L5 vertebral lamina and the target muscles were clearly identified.\nThe electrode that recorded long muscle fibre EMG was inserted 40 mm lateral to the midline and directed anteromedially until the tip of the needle was visualized in the superficial back muscle (Fig.\nParticipants reported only mild transient.\ndiscomfort during the insertions and if any significant discomfort was reported after the removal of the needle, the electrode was removed and a new electrode was inserted.\nThis was done to ensure that participants were pain-free during the experiment.\nPairs of surface electrodes (Ag/AgCl discs, 10 mm and 5 mm in diameter, with an interelectrode distance of 20 mm) were placed over the anterior deltoid muscle and posterior deltoid muscles of both arms.\nThe ground electrode was placed over the right iliac crest.\nData were exported for the analysis with Matlab 6.\n5 (Mathworks, Natic, MA, USA).\nAngular displacement of the right and left arms was measured using a potentiometer attached to a lightweight bar, which was strapped to the arm at wrist level so as not to restrict the movement [20].\nMovement data were recorded to confirm that the required arm movement distance was achieved.\nParticipants stood relaxed with their arms by their sides.\nThey were instructed to rapidly flex or extend at the shoulder to 45, with their elbow straight, in response to an auditory cue (Fig.\nTones of a different pitch were used to cue for flexion and extension.\nSubjects were instructed to react as quickly as possible to the cue by rapidly moving their arm in the correct direction.\nIn between trials, subjects were told relax, and wait for the cue.\nThe auditory cue occurred randomly, between 0 and 1.\n25 s, after the investigator activated a manual trigger.\n(C) Subjects performed a choice reaction time task (rapid shoulder flexion or extension) in response to an auditory cue.\nthe arm was performed in response to each auditory cue.\nThe direction of movement was randomized and counterbalanced such that fifteen repetitions were performed in each direction for each arm.\nThe investigator was blind to the identity of the muscle being evaluated.\nThere was no difference in the different intramuscular recordings that could alert the investigator to the identity of the muscle.\nThe EMG onset of the short and long fibres of the lumbar multifidus, relative to that of deltoid, were used for analysis.\nTrials were excluded if the onset of back muscle activity occurred either 100 ms before or 200 ms after that of deltoid, because activations outside of those times are unlikely to be related to the arm movement [1].\nAny data point greater than 2 SD from the mean was considered an outlier, and was removed from the analysis.\nThe onsets of the short and long muscle fibres, relative to that of deltoid, were compared between Groups (independent variable; patients and controls), Muscles (independent variable; short and long), Direction (repeated measures factor; flexion and extension) and Side (repeated measures factor; ipsilateral and contralateral to the moving arm).\n097), so data from the left and right arms were pooled.\n674) in the control group, so these data were also pooled in the main analysis.\nTo test the hypothesis that the differences in muscle activity would be greater on the previously painful side than on the non-painful side in the patient group, we undertook a MANOVA with Pain Side (previously painful and non-painful) and Muscle (short and long) as independent variables and with Direction (flexion and extension) as a repeated measures factor.\nWhen participants in the control group rapidly flexed or extended their arm, the onset of EMG was earlier for the short muscle fibres than it was for the long muscle fibres (Interaction: Group Muscle, p = 0.\nRectified electromyographic (EMG) data from a representative (A) healthy and (B) low back pain (LBP) participant (right-sided LBP) during arm flexion and extension.\nThe dashed vertical line represents the onset of deltoid EMG.\nThe grey boxes indicate the differences between the EMG onset of the short and long fibres of the lumbar multifidus.\nThe mean latency of short (SF) and long fibres (LF) of the lumbar multifidus EMG onsets relative to the onset of activity in the deltoid muscle.\nData for the healthy (open symbols) and LBP participants (filled symbols) during shoulder flexion (circles) and extension (squares) are shown.\nThe dashed vertical line represents the onset of deltoid EMG (*p < 0.\n011 Direction 3 146.\n000 Group  Muscle 1 5.\n022 Direction  Group 3 3.\n011 Direction  Muscle 3 0.\nD of F  degrees of freedom.\n022; post hoc, p = 0.\nIn both groups, the onset of short and long muscle fibres EMG was earlier with flexion of the arm than with extension (main effect: Direction, p < 0.\n2 and 3 and Table 1).\nThe onset of short muscle fibre EMG in the patient group was later than it was in the control group, for both shoulder flexion and extension (Interaction: Group  Muscle p = 0.\n022; post hoc, p = 0.\n2 and 3 and Table 1).\nThere was no difference in the onset of the long muscle fibres between the groups (post hoc: p = 0.\nWe investigated the control of the short and long fibres of a deep back muscle in people with recurrent unilateral LBP who were pain-free at the time of testing, and a group of healthy participants, by recording intramuscular EMG during a postural task.\nThe EMG onset of the short fibres of the deep back muscle relative to the arm muscle, deltoid, occurred later in people with recurrent LBP than in healthy participants.\nFurthermore, the timing of the muscle activity (short fibres active before long fibres) that was observed in the healthy participants and on the non-painful side in the patient group was not present on the previously painful side.\nThese changes in the control of the deep back muscles are consistent with the findings of morphological studies [12,49] that suggest that the changes in the back muscles in people with LBP are more profound in the short fibres and on the side of symptoms.\nA change in the control of the deep back muscles is important, because it is likely to have consequences for spinal function.\nControl of movement and stability has been argued to be critical for healthy function of the spine [39,40].\nThe deep back muscles investigated in this study have been reported to contribute up to 2/3 of the control of lumbar intersegmental motion [48], which suggests that impaired control of these muscles is likely to compromise spinal function.\nThe persistence of these changes during remission of LBP, as identified here, implies persistent altered loading on spinal structures during remission, which may be a cause of recurrent episodes.\nLongitudinal studies are required to confirm this.\nDelayed activation of the deep back muscles, and failure of the short fibres to activate prior to the long fibres, could be mediated by changes at any level of the motor system  from the motoneurone to the motor planning.\nAt the spinal level, there is some evidence that pain can inhibit extensor motoneurone activity in animals [25].\nHowever, it is not clear whether this occurs in humans, or whether it persists after the resolution of symptoms.\nAt the cortical level, experimentally induced muscle pain has been shown to reduce the excitability of the primary motor cortex [27].\nFurthermore, the recent data from an animal study [13] suggest that spinal injury specifically reduces excitability of corticomotor inputs to the short fibres of the lumbar multifidus.\nHowever, it is unclear whether this change in excitability underlies the changes in multifidus activation observed here.\nAlternatively, changes in timing of muscle activation, such as those observed here, may reflect changes in motor planning [16,33].\nSuch changes in planning could be due to inaccurate [29] or ignored [6] sensory information from the spine, or to a change in strategy adopted by the nervous system.\nIt has been argued that people with LBP may prioritize patterns of muscle activation in an attempt to avoid pain provocation [18,45].\nSeveral authors have hypothesized that increased load either due to increased paraspinal muscle activity (including strategies to protect the spine [18]or due to physical activity [5] or sustained postures [10]) may lead to persistence or recurrence of symptoms.\nHowever, the patients in this study adopted patterns of muscle activation that were accompanied by reduced activity of the deep back muscles, that could have the cost of decreased fine tuning of segmental motion [22] and may be related to recurrence.\nComparison of the mean short (SF) and long fibres (LF) of the lumbar multifidus EMG onsets relative to deltoid collapsed across directions between the painful (black circles) and non-painful sides (white circles) in people with recurrent unilateral LBP.\nError bars represent 95% confidence intervals.\nother work [45], it is possible that the activity of the other large trunk muscles may have been increased in our participants as a component of an alternative protective strategy.\nIt is important to consider that a persons beliefs about their back pain [34] and their expectations of future episodes [35] can also influence the type of motor strategy they use to control the back muscles.\nThat is, deep back and abdominal muscle EMG is delayed when healthy participants anticipate experimentally induced LBP [35].\nFurthermore, those changes did not spontaneously resolve in some people, which were related to unhelpful beliefs about back pain [34].\nThe current finding corroborates that work and suggests that an alternative postural strategy, and subsequently changes in control of the deep back muscles, could be adopted by some individuals following the initial bout of LBP that remain despite the resolution of symptoms [19].\nSuch a change in strategy may indicate ongoing problems as alterations in control of the back muscles lead to changes in joint loading and the dynamic properties of the spine [15].\nHowever, further work is needed to determine whether these factors underlie the changes in multifidus activation observed here.\nInterpretation of the current findings requires consideration of several limitations.\nWhether insertion of intramuscular electrodes has an effect on the activity of the paraspinal muscles has not been unequivocally established.\nAlthough others have argued that insertion of electrodes does not change coordination [21], this has not been evaluated in people with LBP.\nPerformance of a choice reaction task during stressful conditions can affect the pattern of back muscle activation [36], but we endeavoured to minimise stress, participants did not appear stressed, and they were given positive feedback about their performance.\nAlthough it is clear that the study was adequately powered to detect a difference in short fibres of the lumbar multifidus, we may not have had sufficient numbers to be confident that the long fibres did not differ between the groups.\nHowever, this does not affect the main conclusion of our paper that people in remission from LBP have persistent changes in back muscle activation.\nAlthough important, these limitations do not compromise the main findings of the study.\nThis study has clear clinical implications.\nFirst, it is clear that resolution of back pain does not imply a return to normal control of the deep back muscles.\nThis finding corroborates data that show that reducedcross-sectionalarea of the deep back musclesremains insome patients following an acute episode of LBP despite the resolution of symptoms [12].\nNotably, a clinical trial suggested that therapeutic exercise designed to improve the control of the deep trunk muscles in people with acute/subacute LBP can both restore the symmetry of the cross-sectional area of the back muscles and reduce recurrence [11].\nFurthermore, a similar therapeutic exercise programme reduced pain and improved functional measures in patients with chronic low back pain and a radiologic diagnosis of spondylolysis or spondylolisthesis [37].\nSecond, it is clear that spinal dysfunction is associated with these changes in muscle morphology and control.\nUsing an animal model, rapid segmental atrophy of the lumbar multifidus has been observed following experimentally induced injury to the lumbar intervertebral disc [14].\nHowever, it remains to be determined if changes in morphology and control contribute to persistence or recurrence of pain.\nThird, the current findings also suggest that the sole foci on symptoms and functional performance as outcome measures following an acute episode of LBP need to be reconsidered.\nPerhaps a clinically viable measure of back muscle control is required as an outcome measure of recovery following an acute episode of LBP.\nPreliminary investigation suggests that high resolution ultrasound imaging may be useful in this regard [24], but further work is required.\nIn summary, the current experiment presents evidence that even though they are pain-free and thus between episodes of LBP, recurrent unilateral LBP patients do not control their back muscles in the.\nThesefindings raisethe possibility that this abnormal pattern of muscle control, in the absence of pain, may leave the spine vulnerable to (re)injury and hence predispose to recurrent episodes.\nFinally, this finding implies that pain and functional performance should not be the only outcome measures of interest after an acute episode of LBP.\nDirectional specificity of postural muscles in feed-forward postural reactions during fast voluntary arm movements.\nExp Brain Res 1995;103:32332.\nControl elements of voluntary movements.\n[3] Bogduk N, Macintosh JE, Pearcy MJ.\nA universal model of the lumbar back muscles in the upright position.\nDisuse and physical deconditioning in the first year after the onset of back pain.\nMechanical stability of the in vivo lumbar spine: implications for injury and chronic low back pain.\nProperties of postural adjustments associated with rapid arm movements.\nLong-term effects of specific stabilizing exercises for first-episode low back pain.\nEvidence of lumbar multifidus muscle wasting ipsilateral to symptoms in patients with acute/ subacute low back pain.\nCorticomotor excitability of paraspinal muscles is affected differentially by intervertebral disc lesion.\nRapid atrophy of the lumbar multifidus follows experimental disc or nerve root injury.\nChanges in the mechanical properties of the trunk during remission from low back pain may be associated with recurrence.\nChanges in motor planning of feedforward postural responses of the trunk muscles in low back pain.\nPain and motor control of the lumbopelvic region: effect and possible mechanisms.\nAltered trunk muscle recruitment in people with low back pain with upper limb movement at different speeds.\nTransversus abdominis and the superficial abdominal muscles are controlled independently in a postural task.\nInsertion of fine-wire electrodes does not alter EMG patterns in normal adults.\nMuscular and kinematic behavior of the lumbar spine during flexionextension.\nThe comparison of trunk muscles EMG activation between subjects with and without chronic low back pain during flexionextension and lateral bending tasks.\nInhibition of motor system excitability at cortical and spinal level by tonic muscle pain.\nDisc herniation-related back pain impairs feed-forward control of paraspinal muscles.\nLumbar paraspinal muscle function, perception of lumbar position, and postural control in disc herniation-related back pain.\nKinetic potential of the lumbar trunk musculature about three orthogonal orthopaedic axes in extreme postures.\n[33] Moseley GL, Hodges PW.\nReduced variability of postural strategy prevents normalization of motor changes induced by back pain: a risk factor for chronic trouble? Behav Neurosci 2006;120:4746.\nPain differs from non-painful attentiondemanding or stressful tasks in its effect on postural control patterns of trunk muscles.\nEvaluation of specific stabilizing exercise in the treatment of chronic low back pain with radiologic diagnosis of spondylolysis or spondylolisthesis.\nSpinal stability and intersegmental muscle forces.\nImpaired postural control of the lumbar spine is associated with delayed muscle response times in patients with chronic idiopathic low back pain.\nA comparative study between healthy subjects and patients with chronic low back pain.\nTrunk muscle recruitment patterns in patients with low back pain enhance the stability of the lumbar spine.\nTrunk muscle activation in low-back pain patients, an analysis of the literature.\nThe role of socioeconomic factors in chronicity.\nWork disability and costs caused by recurrence of low back pain: longer and more costly than in first episodes.\nStability increase of the lumbar spine with different muscle groups.\nA biomechanical in vitro study.\nMolecular evidence for local denervation of paraspinal muscles in failed-back surgery/ postdiscotomy syndrome."}