{"title": "29.pdf", "contents": "ISSLS Prize Winner: Smudging the Motor Brain in  Young Adults With Recurrent Low Back Pain.\nTo investigate whether recurrent low back pain (LBP) is  associated with changes in motor cortical representation of different  paraspinal muscle fascicles.\nSummary of Background Data.\nFascicles of the lumbar  paraspinal muscles are differentially activated during function.\nHuman studies indicate this may be associated with a spatially  separate array of neuronal networks at the motor cortex.\nLoss of  discrete control of paraspinal muscle fascicles in LBP may be  because of changes in cortical organization.\nData were collected from 9 individuals with recurrent  unilateral LBP and compared with 11 healthy participants from an  earlier study.\nFine-wire electrodes selectively recorded myoelectric  activity from short/deep fascicles of deep multifi dus (DM ) and long/ superfi cial fascicles of  longissimus erector spinae (LES), bilaterally.\nMotor cortical organization was investigated using transcranial  magnetic stimulation at different scalp sites to evoke responses in  paraspinal muscles.\nLocation of cortical representation (center of  gravity; CoG) and motor excitability (map volume) were compared  between healthy and LBP groups.\nIndividuals with LBP had a more posterior location of  LES center of gravity, which overlapped with that for DM on both  hemispheres.\nIn healthy individuals, LES center of gravity was  located separately at a more anterior location to that for DM.\nMap  volume was reduced in LBP compared to healthy individual across  muscles.\nThe fi ndings highlight that LBP is associated with  a loss of discrete cortical organization of inputs to back muscles.\nIncreased overlap in motor cortical representation of DM and  LES may underpin loss of differential activation in this group.\nThe  results further unravel the neurophysiological mechanisms of motor.\now back pain (LBP) is associated with altered back muscle  activation,  1    3  but the mechanisms are poorly understood.\nAlthough changes in muscle morphology,  4    6  denervation  from nerve root lesions,  7  and refl ex inhibition  6  are implicated,  changes in descending control by supraspinal centers may contribute.\n8    11  Unraveling the mechanisms that underpin motor  changes with LBP has important implications for rehabilitation.\nFor instance, interventions to reverse muscle atrophy  12   would differ from those to alter muscle recruitment.\n13  Recent  insights into motor cortex organization using noninvasive  magnetic brain stimulation provide a unique opportunity to  explore neural mechanisms associated with movement changes in pain.\n8  ,  11    An observation that may provide insight into the mechanisms underlying motor control changes with pain is altered  coordination between functionally distinct paraspinal muscle  fascicles.\nShort/deep and long/superfi cial back muscle fascicles  are differentially activated in healthy individuals in a range of  tasks.\n14    16  For instance, change in spinal curvature from fl at  to more lordosed postures increases activity of the medially  positioned multifi dus muscle,  whereas, this change has limited  effect on the iliocostalis muscle.\n15  ,  16  Furthermore, predictable  challenges to the trunk are associated with earlier activation of  the short/deep fascicles of deep multifi dus (DM) than the long/ superfi cial paraspinal muscles.\n14  ,  17  Such discrete activation  argues for fi ne control of the complex array of back muscle  fascicles in healthy individuals.\nDifferential control of paraspinal muscles is compromised  in LBP.\nIn this group, paraspinal muscle fascicles tend to be  recruited  en masse with similar activation of iliocostalis and  DM with changes in spinal curvature in sitting,  18  and simultaneous activation of deep and superfi cial multifi dus with trunk  perturbation.\n14  The mechanisms for loss of discrete control  are unclear, but one possibility can be gleaned from another  painful condition associated with loss of discrete controlfocal hand dystonia.\nIn that condition, loss of discrete cortical  organization of somatosensory regions associated with each  fi nger  19  ( i.\nFrom the   * Centre for Clinical Research Excellence in Spinal Pain, Injury and  Health, School of Health and Rehabilitation Sciences, The University of  Queensland, Brisbane, Australia  ;  and    Department of Rehabilitation Sciences  and Physiotherapy, Ghent University, Ghent, Belgium.\nThe manuscript submitted does not contain information about medical  device(s)/drug(s).\nNo benefi ts in  any form have been or will be received from a commercial party related  directly or indirectly to the subject of this manuscript.\nchanges in recurrent LBP and suggest motor rehabilitation that  includes training of differential activation of the paraspinal muscles  may be required to restore optimal control in LBP.\nChanges in brain organization may underlie changes in paraspinal muscle activation.\nRecent brain mapping studies using transcranial magnetic  stimulation (TMS) suggest separate regions of the motor cortex underpin discrete activation in healthy individuals.\nAlthough organization of these cortical networks  has not been studied in LBP, responsiveness (excitability) of  corticomotor pathways to paraspinal muscles using TMS is  reduced  11  and the motor cortical map for other trunk muscles  is reorganized.\n8  Those studies showed an association between  cortical changes and changes in pain intensity,  11  or motor control.\n8  Central mechanisms may contribute to defi cits in differential control of paraspinal muscles.\nThis study aimed to investigate organization of areas of the  motor cortex associated with inputs to different paraspinal  muscle fascicles in individuals with recurring episodes of LBP.\nIdentifi cation of smudging between discrete cortical networks  with outputs to paraspinal muscle fascicles would provide  novel and convincing evidence of supraspinal mechanisms  underlying motor adaptation with pain.\nParticipants   Nine right-handed individuals with recurrent LBP were recruited and data were compared to that for 11 right-handed  healthy participants reported previously.\n20  Participants were  included in the LBP group if they had nonspecifi c episodic  unilateral LBP (  buttock pain) lasting longer than 3 months  with periods of symptom aggravation and remission.\nLBP participants had minimal pain at time of  testing and symptoms were not aggravated by experimental  procedures.\nPain-free participants were included in the earlier  study if they had no history of back or lower limb pain or  injury that limited their function and/or required treatment  from a health profession.\nParticipants were excluded from  both groups if they had any major circulatory, neurological,  respiratory disorders, recent or current pregnancies, previous  spinal surgery, analgesic or anti-infl ammatory medication  in the past month, or participation in trunk muscle exercise  in the past 12 months.\nSubjects sat comfortably with their arms crossed and feet on the fl oor.\nThree  maximum voluntary contractions of the paraspinal muscles  against resistance for approximately 3 seconds were used  to determine submaximal contraction intensity.\nThe highest  root-mean-square EMG for 1 second was identifi ed from the  DM bilaterally.\nThe target DM activation during TMS was  set at approximately 20% of this value (feedback provided  on a monitor) and achieved by leaning forward with the back  straight.\nThe coil handle was oriented along the  sagittal plane to induce currents in an anterior direction.\nThis  coil orientation provides consistent paraspinal MEPs with  minimal concurrent excitation of the opposite hemisphere.\n22   Subjects wore a tight-fi tting bathing cap and the vertex  was  determined using the International 10/20 system.\n24  Using a  stimulator intensity of 100%, stimuli were delivered over  premarked scalp sites on a 5   7-cm grid over each hemisphere  (05 cm lateral, and from 5-cm anterior to 2-cm posterior to  the vertex;  Figure 1 ).\n8  Five stimuli were delivered at each cross  on the grid (interstimulus interval:   5 s).\n25  Participants rested  for 1 minute after stimulation of each site to minimize fatigue.\nData Analysis   EMG was full-wave rectifi ed and MEPs were averaged at each  scalp site.\n*Note individual with low back pain (LBP) rated their average pain intensity  over the last 6 months on a visual analog scale (VAS).\nNote pain duration is  the total time that participants had experienced recurrent LBP and including  periods of aggravation and remission.\nNo difference was detected between  the two groups in age, weight, and height (The Student  t test,  P  > 0.\nUnauthorized reproduction of this article is prohibited.\nMEP amplitude was  calculated as the root-mean-square EMG amplitude between  the onset and offset, and background root-mean-square EMG  from 55 to 5 m prior to stimulation was subtracted.\nMEP amplitudes were averaged at each scalp site across subjects after  normalization to the peak response to produce a topographical map ( Figure 1 ).\nRemoval of small amplitude MEPs  minimally affects TMS maps.\nMap volume (measure of total motor cortical excitability)  was calculated as the sum of normalized MEP amplitudes  across scalp sites with responses.\nCenter of gravity (CoG)  was calculated using the formula CoG  = z i x i /z i ; z i y i /z i  (x i  mediolateral location; y i  anteroposterior location;.\nThis measure provides an  amplitude-weighted indication of map position.\nAlthough  map volume is sensitive to changes in corticomotor excitability, the CoG is a valid and repeatable measure of a muscles  motor cortex representation.\nMap volume, CoG location, and MEP onset at the optimal site were  compared between muscles, group, and side using repeated  measures analyses of variance.\nThe Duncan test was used for   post hoc analyses.\nA separate analysis compared CoG location, map volume, and MEP onset between the painful and  nonpainful sides (Pain) for the LBP group.\nThe relationship  between pain intensity/duration and cortical measures (CoG  coordinates and map volume) were investigated using the  Pearson correlation.\nSignifi cance was set at  P  < 0.\nIt was diffi cult  to elicit MEPs ipsilateral to the stimulated hemisphere in all  but one LBP participant.\nAs MEPs contralateral to the stimulated cortex were consistently elicited, mapping was only undertaken using this data.\n20  CoG location did  not differ between left and right sides ( P  = 0.\n69), or between  painful and nonpainful sides in the LBP group ( P  = 0.\nIn  healthy individuals, DM CoG was located posteriorly to that  for LES (interaction  pain   muscle:  P  < 0.\n001,  post hoc :  P   < 0.\n001;  Figure 3 ).\nIn contrast, for the LBP group, DM CoG  was located similarly to that for LES ( Figures 3 ,  4 ; post hoc:  P   > 0.\nThis is explained by a more posterior location of the  LES CoG in the LBP group compared to controls (post hoc:  P   < 0.\nMapping of the motor cortex using transcranial magnetic  stimulation (TMS).\nA, Stimuli over the motor cortex excite intracortical neurons that provide synaptic input to corticospinal cells.\nB, Recordings were made from short/deep fascicles of multifi dus (DM)  and  longissimus erector spinae (LES) at the L4 level.\nC, The descending  volley excites the spinal motoneurons and results in a motor-evoked  potential (MEP), mainly in the contralateral muscles.\nD, MEPs were  recorded in both muscles from stimuli applied at each point on the  grid placed over the scalp and aligned to the vertex (Cz).\nE , A threedimensional map of MEP amplitude was created for each muscle from  the individual and then group data.\nCopyright  2011 Lippincott Williams & Wilkins.\nUnauthorized reproduction of this article is prohibited.\nIndividuals with recurrent  LBP had overlapped motor cortical areas for DM and LES,  which contrasts recent evidence of discretely organized cortical inputs to these muscles in healthy individuals.\n20  This provides novel evidence of a neural substrate that may underlie  reduced potential to differentially activate parts of the paraspinal muscles during function in LBP.\nSmudging of Motor Cortical Organization and  Reduced Motor Excitability in LBP   Paraspinal muscles receive descending input from the motor  cortex and corticospinal pathways.\nFor instance, motor cortical stimulation in cats elicits fl exion of the contralateral forelimb and anticipatory postural adjustments in the supporting forelimb.\n29  Human data  demonstrate reduced trunk muscle postural activity with limb  movements when motor cortex is inhibited with submotorthreshold TMS.\n8  ,  9  This suggests motor cortex contribution to a range of  motor functions including postural activity of trunk muscles.\nLBP is associated with adaptive changes in organization of  cortical neuronal networks.\n8  ,  9  ,  11  This shows these pain-related  cortical changes include smudging of cortical representation  of functionally distinct paraspinal muscles fascicles.\nThe posterior shift in LES representation refl ects motor cortex reorganization and cannot be accounted for by changes in excitability.\n26  ,  27    Smudging of motor cortical organization has functional  implications for neural control of paraspinal muscles.\nIt may  reduce the potential to independently control these muscles.\nThe degree of differential motor control is related to discrete organization of motor cortical networks; for example,  discrete representation of individual fi ngers on the primary  motor and sensory cortices are related to independent fi ne  control of fi nger movements.\n31  Reduced differentiation of  this discrete organization, such as smudging between areas.\nFigure 5  shows map volume for healthy and LBP groups.\nMap volume was reduced in LBP compared to controls (main  effect  pain:  P  < 0.\n021), although this  did not differ between muscles ( P  = 0.\nReduced map volume suggests reduced corticomotor excitability in LBP, but this was not correlated with pain intensity  ( r 2  < 0.\nThe latency to onset of MEPs was shorter for DM compared to LES in both groups (muscle:  P  < 0.\n001;  post hoc P   < 0.\nThere was no difference in MEP  onset between painful and nonpainful side in the LBP group  ( P  > 0.\n0 m; LBP DM  = 15.\nIndividual data for center of gravity (CoG) of short/deep  fi bres of multifi dus (DM; circles) and  longissimus erector spinae (LES;  squares) in healthy and low back pain (LBP).\nData for left/right and  pain/nonpainful sides were not different and are not separately identifi ed in the fi gure.\nGroup data for center of gravity (CoG) of short/deep fi bres  of multifi dus (DM) and  longissimus erector spinae (LES) in healthy and  low back pain (LBP).\nMean and 95% confi dence interval (averaged  across sides) are shown.\nMap volume of short/deep fi bres of multifi dus (DM) and   longissimus erector spinae (LES) for healthy (white) and low back pain  (LBP; black) groups.\nMean and 95% confi dence intervals are shown.\nNote reduced map volume in LBP group compared with healthy  individuals.\nR indicates right; L, left.\n39  Thus, although reduced corticomotor excitability  would seem to contradict the suggestion of enhanced activation of long/superfi cial fascicles (such as the LES) to protect  the spine from further injury, the reduced responsiveness to  TMS could simply refl ect the complex interaction of effects of  pain along the motor pathway.\nThe possibility that reduced  map volume refl ects a more focal cortical network cannot be  confi rmed as reduced excitability of spinal motoneurons cannot be excluded.\nFortunately, changes of map organization,  the key observation in this study, do not refl ect changes in  excitability and interpretation is less problematic.\nAlthough current data provide evidence of changes to the  motor cortex and corticospinal tracts, the exact mechanisms  of how pain induces such changes require further investigation.\nChanges in other parts of the nervous system could contribute to altered motor coordination ( e.\n, basal ganglia, cerebellar, and spinal circuits).\n41  Exactly how different networks  of the sensorimotor system contribute to changes in motor  coordination requires further work.\nRelationship Between Cortical Changes and Pain   Previous work has identifi ed a relationship between pain and  cortical changes.\nAmplitudes of changes in the sensory representation of the back  42  and motor threshold  11  are related  to pain duration.\nNo relationship was identifi ed in our data.\nThis could be because of the small sample size or lesser pain  intensity than previous studies.\n43  ,  44  The lack of  association between pain and motor cortical parameters may  refl ect this complex interaction.\nMethodological Issues   The main limitation of the study is the small sample size.\nYet,  despite the small sample, fi ndings were consistent across subjects and yielded signifi cant results.\nFor practical reasons, subjects were only required to match DM EMG during TMS.\nWe  did not control LES EMG.\nAlthough this may increase intersubject variability in motor cortical excitability for LES, this  does not compromise our main fi nding as CoG measures are  less affected by motor excitability.\n26  Furthermore, this study  involved young adults and studies of older adult population  should be considered.\nClinical Implications   A loss of differential activation of paraspinal muscle fascicles  is likely to compromise fi ne-tuned segmental control and alter  loading of spinal structures,  34  potentially increasing the risk of  LBP recurrence.\n33  ,  34  As our data show that such motor changes  may be mediated by loss of discrete organization at the motor  cortex, it could be argued that a goal of LBP rehabilitation,  at least initially, should include motor training to restore  cortical organization.\nAlthough it is beyond this study to  speculate on how best to restore cortical organization, studies  in focal hand dystonia suggest redifferentiation of discrete  fi nger representation is possible with training of isolated fi nger.\n19  Smudging of motor  cortical representations of DM and LES may explain observations of reduced discrete activation of different paraspinal  muscle fascicles in LBP.\n14  ,  18  We did not investigate paraspinal  muscle activity in functional tasks.\nThus, we cannot directly  investigate the relationship between organization and function.\nNevertheless, this work provides the basis for studies  into the relationship between cortical remodeling and altered  trunk muscle coordination.\nMotor cortex reorganization supports the notion that the  nervous system adopts a new strategy for movement/stability  with LBP.\n32  It has been hypothesized that in the presence of  pain and/or injury, the nervous system implements new motor  strategies to protect the part from further injury/pain.\n33  ,  34   This is often mediated by increased trunk muscle activity, particularly large superfi cial muscles, to splint the spine.\nThis is  supported by several observations.\nFirst, when pain is induced  in healthy individuals, trunk muscle EMG increases in keeping with the goal to protect the spine, although the pattern  varies between individuals.\n35  Second, biomechanical modeling suggests various patterns of muscle activity observed in  LBP increase trunk stability.\n36  In this case, fi ne coordination  between different fascicles of the paraspinal muscles may no  longer be used  in lieu of a simplifi ed protective strategy.\nThat  is, nervous system remodeling (including smudging of motor  cortex) may simplify the motor strategy to a more  en masse  paraspinal muscle recruitment.\nReorganization of LES but not  DM appears consistent with the proposal that reorganization  of inputs to long/superfi cial fascicles underpins the adaptive  search for a new motor strategy.\n34  ,  37    Motor maps exhibited the same organization bilaterally in  LBP, despite selection of patients on the basis of unilateral  symptoms.\nThe isolation of some motor control changes to  the painful side  14  may question the association between motor control and symmetrical changes in cortical organization.\nHowever, many changes in motor control are not systematically related to the side of pain.\nFor instance, unilateral experimental pain induces variation in motor coordination that  is not exclusive to the pain side.\n35  The nervous system appears  to select a protective solution that is generic, regardless of  the location/side of pain.\n,  bilateral LBP, specifi c spinal pathology).\nDM and LES map volume was reduced in LBP.\nThis suggests either reduced corticomotor excitability or that neural  networks with input to these muscles occupy a smaller area of  cortex.\nReduced excitability has been interpreted from earlier  data of increased paraspinal muscle motor threshold to TMS  11   ( i.\n, greater stimulation intensity to evoke a response).\n38  Recent animal  39   and human  40  studies highlight opposite changes at the cortex  and spinal cord, making interpretation impossible without  techniques that isolate measures to a specifi c site.\nIn animal  studies, responsiveness to stimulation over the brain increased.\n19  In addition, motor training with specifi c activation of deep abdominal muscles can reverse pain-associated  reorganization at the motor cortex  9  and this is associated  with improved motor behavior.\n9  ,  13  ,  45  A recent study of a small  group with LBP shows training that targets DM can improve  coordination of the paraspinal muscle fascicles during functional tasks toward that observed in healthy individuals.\n46  Although motor rehabilitation should not be exclusive to DM,  changes in paraspinal muscle activation after motor training  provide a marker for further investigations to study whether  these improvements are associated with redifferentiation of  muscle representation at the motor cortex (and improvement  in clinical symptoms).\nDiff erential activation is associated with discrete organization of neuronal networks at the motor cortex.\nLoss of discrete organization of diff erent fascicles  of the paraspinal muscles at the motor cortex is  observed in individuals with recurrent low back pain.\nReorganization at the motor cortex may underpin  this loss of diff erential activation in low back pain.\nAcknowledgment   The authors thank Mr Ian Peeters for assistance with data  analysis.\nDanneels  LA ,  Coorevits   PL  ,  Cools  AM , et al.\nDifferences in multifi dus and iliocostalis lumborum activity between healthy subjects  and patients with sub-acute and chronic low back pain.\nEur Spine J   2002 ; 11 : 13  19.\nMacDonald   DA  ,   Moseley  GL ,   Hodges   PW.\nThe lumbar multifi dus: does the evidence support clinical beliefs ?  Man Ther   2006 ; 11 : 254  63.\nSmith   AJ ,   OSullivan  PB  ,  Campbell   A , et al.\nThe relationship  between back muscle endurance and physical, lifestyle, and psychological factors in adolescents.\nClinical Science award 2000: CT imging of trunk muscles in chronic  low back pain patients and healthy control subjects.\nEvidence of lumbar multifi dus muscle wasting ipsilateral to symptoms in patients with acute/ subacute low back pain.\nParaspinal denervation and the spinal degenerative cascade.\nReorganization of the motor cortex is associated with postural control defi cits in recurrent low back  pain.\nDriving plasticity in the motor cortex in recurrent low back pain.\nDisc herniationrelated back pain impairs feed-forward control of paraspinal muscles.\nCorticospinal excitability in patients with chronic low back pain.\nEffects of  three different training modalities on the cross sectional area of the  lumbar multifi dus muscle in patients with chronic low back pain.\nImmediate changes in feedforward postural  adjustments following voluntary motor training.\nWhy do some patients keep hurting their back? Evidence of ongoing back muscle  dysfunction during remission from recurrent back pain.\nEffect of different  upright sitting postures on spinal-pelvic curvature and trunk muscle  activation in a pain-free population.\nDifferent ways to balance  the spine: subtle changes in sagittal spinal curves affect regional  muscle activity.\nSpine  2009 ; 34 : E208  14.\nDeep and superfi cial fi bers  of the lumbar multifi dus muscle are differentially active during voluntary arm movements.\nHow do we Sit and How  Should we Sit?  International Society of Posture and Gait Research.\nA primate genesis model of  focal dystonia and repetitive stain injury: I.\nLearning-induced dedifferentiation of the representation of the hand in the primary somatosensory cortex in adult monkeys.\nIndividual fascicles of the paraspinal muscles are activated by discrete cortical networks in humans.\nCorticospinal control of  human erector spinae muscles.\nMapping the cortical representation of the lumbar paravertebral muscles.\nReport of the committee on methods of clinical examination in electroencephalography: 1957.\nTranscranial magnetic stimulation mapping of the motor cortex in normal subjects.\nUy  J ,   Ridding   MC ,  Miles  TS.\nStability of maps of human motor  cortex made with transcranial magnetic stimulation.\nLocalization of the motor  hand area using transcranial magnetic stimulation and functional  magnetic resonance imaging.\nResponses in human intercostal and  truncal muscles to motor cortical and spinal stimulation.\nPostural and kinetic co-ordination following cortical stimuli which induce fl exion movements in the cats  limb.\nBrain Res  1978 ; 149 : 25  37.\nHodges  PW  ,  Butler   JE ,  Taylor  JL , et al.\nMotor cortex may be involved in feedforward postural responses of the deep trunk muscles.\nChanges in motor planning of feedforward postural  responses of the trunk muscles in low back pain.\nTrunk muscle activation in  low-back pain patients, an analysis of the literature.\nPain and motor control of the lumbopelvic region: effect and possible mechanisms.\nTrunk Muscle  Activity is Increased During Experimental Back Pain, But the Pattern Varies Between Individuals.\nRelative contribution of trunk muscles  to the stability of the lumbar spine during isometric exertions.\nTrunk muscle recruitment patterns in patients with low back pain enhance the stability  of the lumbar spine.\nNoninvasive stimulation of the human  corticospinal tract.\nCorticomotor excitability of  back muscles is affected by intervertebral disc lesion in pigs.\nOutput of human motoneuron  pools to corticospinal inputs during voluntary contractions.\nSpinal  and supraspinal postural networks.\nFear of movement/(re)injury in chronic low back pain and its relation to behavioural performance.\nPersistence of improvements in postural strategies following motor control training in people with recurrent low  back pain.\nMotor training of the  lumbar paraspinal muscles induces immediate changes in motor  coordination in patients with recurrent low back pain.\nJ Pain  2010 ;   11 : 1120  8."}