{"title": "7.pdf", "contents": "Background: Lumbar muscle dysfunction due to pain might be related to altered lumbar muscle  structure.\nMacroscopically, muscle degeneration in low back pain (LBP) is characterized by a  decrease in cross-sectional area and an increase in fat infiltration in the lumbar paraspinal muscles.\nInconsistencies  in results from different studies make it difficult to draw firm conclusions on which structural  changes are present in the different types of non-specific LBP.\nInsights regarding structural muscle  alterations in LBP are, however, important for prevention and treatment of non-specific LBP.\nObjective: The goal of this article is to review which macroand/or microscopic structural  alterations of the lumbar muscles occur in case of non-specific chronic low back pain (CLBP),  recurrent low back pain (RLBP), and acute low back pain (ALBP).\nStudy Design: Systematic review.\nSetting: All selected studies were case-control studies.\nMethods: A systematic literature search was conducted in the databases PubMed and Web of  Science.\nOnly full texts of original studies regarding structural alterations (atrophy, fat infiltration,  and fiber type distribution) in lumbar muscles of patients with non-specific LBP compared to  healthy controls were included.\nAll included articles were scored on methodological quality.\nResults: Fifteen studies were found eligible after screening title, abstract, and full text for inclusion  and exclusion criteria.\nIn CLBP, moderate evidence of atrophy was found in the multifidus; whereas,  results in the paraspinal and the erector spinae muscle remain inconclusive.\nAlso moderate evidence  occurred in RLBP and ALBP, where no atrophy was shown in any lumbar muscle.\nConflicting results  were seen in undefined LBP groups.\nResults concerning fat infiltration were inconsistent in CLBP.\nOn the other hand, there is moderate evidence in RLBP that fat infiltration does not occur, although  a larger muscle fat index was found in the erector spinae, multifidus, and paraspinal muscles,  reflecting an increased relative amount of intramuscular lipids in RLBP.\nHowever, no studies were  found investigating fat infiltration in ALBP.\nRestricted evidence indicates no abnormalities in fiber  type in the paraspinal muscles in CLBP.\nNo studies have examined fiber type in ALBP and RLBP.\nConclusions: The results indicate atrophy in CLBP in the multifidus and paraspinal muscles but  not in the erector spinae.\nStructural Changes of Lumbar Muscles in  Non-Specific Low Back Pain.\nAddress Correspondence:  Lieven Danneels, PhD, PT Rehabilitation Sciences and  Physiotherapy Ghent Campus Heymans (UZ) 3B3 De Pintelaan 185, Ghent,  Belgium E-mail:  Lieven.\nDorien Goubert, PT1,2, Jessica Van Oosterwijck, PhD, PT1,2, Mira Meeus, PhD, PT1,2,3,  and Lieven Danneels, PhD, PT1.\nPain Physician 2016; 19:E985-E1000   ISSN 2150-1149.\nPain Physician: September/October 2016: 19:E985-E1000.\nof (non-)specific LBP (8,21-23), whereas others could  not find an association between the occurrence of  (non-)specific LBP and structural changes in paraspinal  muscles (24-28).\nIn order to prevent  ambiguities, this review will solely focus on the nonspecific LBP population, and will present the results  separately for ALBP, RLBP, and CLBP.\nThis  systematic review attempted to select those articles  which described Which structural alterations (O) occur  in lumbar muscles (P) of patients suffering from nonspecific LBP (I).\nStudies were included if they reported  changes in CSA, fat infiltration, and fiber type distribution of the lumbar muscles in human adults suffering  from non-specific LBP, compared to healthy controls  which are pain-free (C).\nFor this purpose, only casecontrol studies (S) were included.\numbar muscle degeneration is a common feature  in low back pain (LBP) (1,2).\nMacroscopically  this muscle degeneration is characterized by a  decrease in cross-sectional area (CSA) (1,3-7) and an  increase in the amount of fat content (2,8-10) of the  lumbar paraspinal muscles.\nThis could be due to the generalization  of previous observations across different types of LBP  (specific vs non-specific LBP, and acute vs recurrent vs  chronic LBP), while it is likely that each type of LBP is  characterized by its own clinical picture and etiology.\nIn addition to macroscopic changes, it has been  proposed that microscopic changes as well can occur  in patients with non-specific LBP.\nFor instance, microtraumata of the deep muscular tissues can arise when  the motion of the vertebra exceeds its physiological  boundaries, which occurs when the demand for spinal  muscle control is high (11-14).\nThese micro-traumata  could form a pain source during an episode of acute  LBP (ALBP) or recurrent LBP (RLBP).\nFurthermore, it has  been reported that patients with severe chronic LBP  (CLBP) have a higher portion of type IIX (fast twitch glycolytic, previously called type IIB) at the expense of type  I (slow twitch oxidative) fibers (15).\nIn healthy people,  the paraspinal muscles have been shown to contain  more type I fibers, compared to other musculoskeletal  muscles (16).\nHence, the changes in fiber type, as seen  in severe CLBP, could lead to lowered fatigue resistance  of the paraspinal muscles which in turn results in higher  vulnerability of the lumber spine (16).\nAs shown by Falla and Farina (18), pain can affect  muscle structure by compromising muscle function.\nComprised muscle function due to pain can consequently lead to altered muscle structure (18).\nThis  theory could explain why macroscopic muscle degeneration in non-specific LBP is often established in paraspinal muscles, and in particular the multifidus muscle,  as these muscles play an important role in providing  lumbar stability (19).\nOn the other hand, muscular inhibition and atrophy might be a direct consequence of  pain, as pain-related nerve inhibition reduces lumbar  muscle activity in order to prevent tissue damage (20).\nIndeed, some studies have found evidence that structural changes are strongly associated with the presence.\nAfterwards full texts of the remaining articles were screened against these criteria to  ensure eligibility.\nTo be included, an article had to fulfill the following criteria: (1) case-control study (patients with nonspecific ALBP, RLBP, or CLBP compared to healthy participants); (2) only living human adults ( 18 years old);  (3) evaluating at least one of the following outcomes  of LBP: CSA, fat infiltration, fiber type; (4) of the lumbar muscles.\nOnly full texts written in English, Dutch,  French, and German were included in this review.\nExclusion criteria were (1) lumbar surgery; (2) spinal stenosis;  (3) disk herniation, as these were considered as reasons  for specific LBP.\nThis checklist contains 4  evaluation criteria: 1) adequate definition of participant groups; 2) absence of selection bias; 3) blindness  of intervention and outcome; 4) identification for possible confounders.\nThe results were compared and differences were  discussed in case of disagreement.\nThe risk of bias score  was not decisive for inclusion in this review, but was  taken into account when presenting the results.\nIn order to draw correct conclusions, the  level of conclusion will be determined based on the  levels of evidence of the different studies per topic.\nAdditionally 2 articles were found through hand searching.\nAfter this complete  screening, 15 articles remained.\nStudy Characteristics Since the intention was to compare structural  characteristics between non-specific LBP patients and  healthy controls, only case-control studies were admitted.\nClearly defined CLBP patients were found in 9  studies (1,4,8,17,22,27,29-31), whereas specifically defined RLBP patients were seen in 2 studies (29,32) and  one study investigated clearly defined ALBP (3).\nFour  studies however, reported only LBP with varying definitions and no clear defined duration (28,33-35).\nOne of  these subdivided LBP into previous LBP and current  LBP (34).\nAnother study split the patient group into  a group without hip-pain and a group with hip-pain  (33).\nThree articles included only patients with unilateral complaints (3,32,35), whereas 11 did not clearly  mention if patients suffered from unilateral or bilateral  LBP (1,8,17,22,27-31,33,34).\nOnly one article subdivided  the patient group into a bilateral and a unilateral LBP  group (4).\nFourteen studies evaluated CSA in lumbar muscles  (1,3,4,8,22,27-35), whereas 5 studies evaluated fat infiltration (1,8,29,32,33), and one study examined the  lumbar muscle fibers types (17).\nFrom all studies, 6  applied ultrasound imaging (USI) (3,4,8,27,30,31,35), 4  applied magnetic resonance imaging (MRI) (28,32-34),  and 3 applied computed tomography (CT) (1,22,29) to.\nevaluate CSA and/or fat content of the lumbar muscles.\nThe study investigating fiber type used percutaneous  spinal muscle biopsies which were obtained using the  conchotome technique (17).\nThe examined muscles  varied among all articles: 12 studies investigated the  isolated multifidus muscle (1,3,4,8,22,27,30-35), 5 studies investigated the isolated erector spinae muscle  (1,29,3234), and 4 studies examined the complete  paraspinal muscles (1,17,22,28).\ntigated both left and right side of the lumbar muscles  (1,3,4,8,22,26-35) but in ony 8 studies, was it examined  whether there were differences between both sides  (3,4,27,30-33,35).\nOnly one study did not clearly mention if the measurements were taken on one or both  sides of the lumbar musculature (17).\nStructural Changes of Lumbar Muscles in Non-specific Low Back Pain.\nDefinition  patient  group.\nEvaluation  technique Outcome  measure  Test site & position subjects Results.\nCLBP (12m;  22-52y; mean age  36.\n9)  HC (12m;2134y; mean age  25.\nCLBP: ODI  20% US CSA Fat area MF  At L4, bilateral In prone position;  25: forward  stooping; 45  forward stooping;  upright standing.\nCSA CLBP < HC in all positions (P <0.\nCrossman  et al  (2004).\nCLBP:  continuous or  recurrent LBP  >6 months.\nPS No histomorphometric group differences:  Fiber types by percent number: CLBP = HC Mean fiber narrow diameter: CLBP = HC Relative area occupied by type I: CLBP =  HC Fiber size type I or type II: CLBP = HC Admixture of type I & type II fibers in CLBP  & HC Size type I fibers  > type II in CLBP & HC;  in CLBP (P <0.\nCLBP (17m; 15f;  25-55y; mean age  36.\n26) HC (13m; 10f;  25-55y; mean age  37.\nCLBP: 1 year CT CSA Fat  deposits.\nPS (MF, longissimus  & iliocostalis) Isolated MF Isolated ES  (longissimus &  iliocostalis) At upper endplate  L3; upper & lower  endplate L4,  bilateral In prone position.\nCSA PS CLBP = HC at upper L3 & L4, with and  without fat (P > 0.\n05) CLBP < HC at lower L4 (with fat P  =0.\n048; without fat P =0.\n036) CSA MF CLBP = HC at upper L3 & L4, with and  without fat: (P > 0.\n05) CLBP < HC at lower L4 (with fat P  =0.\n009; without fat P =0.\n012) CSA ES CLBP = HC at upper L3 P =0.\n79; upper L4  P =0.\n707; Lower L4 P =0.\nRLBP: history  of 2 previous  episodes  (24h pain)  of LBP  followed by 1  month pain  free; onset  >6 months;  interference in  ADL.\nTotal CSA MF & ES RLBP = HC at any level (MF P =0.\n752) Fat CSA MF & ES RLBP = HC (P = 0.\n014; at lower endplate L4 P =0.\n017) LBP = HC at upper endplate L3 (P = 0.\nLBP (13) LBP + hip (10) HC (8) TOTAL (31;  14m; 17f; mean  age 23.\nLBP(+ hip):  pain in  lower back  (+buttock or  hip).\nCSA MF Group differences (P = 0.\n027) No differences at L2 (P > 0.\n10) Fat MF <10% fat content in all groups Fat ES Not evident.\nEvaluation  technique Outcome  measure  Test site & position subjects Results.\nALBP:  suffering first  episode of  LBP, unilateral.\nUS CSA MF At L2-L5/L2-S1  (ALBP); at L4 (HC),  bilateral In prone position.\nHC between side differences (at L4) <  ALBP (at all levels) (P <0.\n001) ALBP: difference in atrophy between  symptomatic & other levels (P <0.\n05)  ALBP: No atrophy below symptomatic  level HC: No difference in levels (P > 0.\nCLBP (23m;  27f; mean age  46.\nUS CSA MF At L2-L5, bilateral In prone position.\nLBP:  current or  previous LBP  interfering  with sports  performance.\nLBP < HC at both sides, at all levels.\nILBP: 1  episodes; 2  months pain  free episode CLBP: 3  years; sick  leave  3  months in  previous year.\nCT CSA RD ES At L3,  bilateral In supine position.\nCSA Mean values CLBP < HC < ILBP CLBP < ILBP (P = 0.\n037) CLBP = HC (P > 0.\n05) ILBP = HC (P > 0.\n05) ILBP = HC (P > 0.\nCLBP: 1 year CT CSA PS (MF, iliocostalis,  longissimus) Isolated MF  At upper & lower  endplate L4  In prone position.\n010) CSA MF CLBP < HC at upper endplate L4 (P =  0.\n002) CLBP < HC at lower endplate L4 (P = 0.\nLBP < HC at L4 & L5 (generally) LBP < HC at L4 upright (P <0.\n05) Asymmetry in CLBP at L4, not in HC No difference at L5 in standing No difference at L4 or L5 in prone, 25  or 45.\n2)  TOTAL  (22; mean  age22.\nIn 75% of the cases, both researchers agreed.\nThe remaining items were discussed  until agreement was reached.\nSince all  studies were case-controls, all articles received a B level  of evidence.\nChronic Low Back Pain Seven studies investigated lumbar muscle atrophy  in the multifidus in CLBP (1,4,8,22,27,30,31).\nSix of these  studies found a lowered CSA in the multifidus compared to healthy persons, for at least one lumbar level  (1,4,8,22,30,31).\nAt level L4, 3 studies found a lower CSA  in CLBP (4,8,30).\nbetween the upper and lower endplate of L4 (1,22).\nOne of these found a lowered CSA both at the upper  and lower endplate of L4 (22), whereas Danneels et al  (1) demonstrated that the multifidus, both with and  without fat, was smaller only at the lower endplate, but  not at the upper endplate.\nOne study even found a larger  mutifidus at higher lumbar levels in CLBP compared to  healthy persons (31).\nAccording to Hides et al (4),  asymmetry was larger in unilateral CLBP compared to  healthy participants and to bilateral CLBP, indicating  possible unilateral atrophy in unilateral CLBP (4).\nOn  the contrary, one study found no differences in asymmetry between healthy participants and CLBP (31).\nTwo studies separately reported on differences in  CSA for the isolated erector spinae muscle but could  not establish any differences between CLBP and healthy  controls (1,29).\nOnly 2 studies investigated CSA in the complete  paraspinal muscle and could establish a lowered CSA  in CLBP compared to healthy participants at the lower.\nCLBP (20; 14m;  6f; mean age  31.\nCLBP: 3  months RUSI CSA  MF At L5 In prone position;  sitting on stable  surface; sitting on  labile surface.\nCLBP = HC  at all positions Asymmetry CLBP = HC.\n7) HC (17; 8m; 9 f;  18-45y; mean age  33.\nYarjanian  et al  (2013).\nLBP: nonradiating  LBP  without  stenosis.\nPS  At L5-S1 disc level,  bilateral.\nDanneels et al (2000) 1 1 1 / / / 1 4/4 B 1 1 1 / / / 1.\nHides et al (2008a) 1 0 0 / / / 1 2/4 B 1 0 0 / / / 1.\nKamaz et al (2007) 1 1 1 / / / 1 4/4 B 1 1 1 / / / 1.\nLee et al (2006) 1 1 ? / / / 1 3/4 B 1 1 ? / / / 1.\nGildea et al (2013) 1 1 1 / / / 1 4/4 B.\nHides et al (2008b) 1 1 1 / / / 1 4/4 B 1 1 1 / / / 1.\nDanneels et al (2000) 1 1 1 / / / 1 4/4 B 1 1 1 / / / 1.\nDhooge et al (2012) 1 0 1 / / / 1 3/4 B.\nHultman et al (1993) 1 1 ? / / / 1 3/4 B 1 1 ? / / / 1.\nUndefined LBP Gildea et al (2013) 1 1 1 / / / 1 4/4 B 3 1 1 1 / / / 1.\nFIBER  TYPE CLBP Crossman et al (2004) 1 1 ? / / / 1 3/4 B 3 1 1 ? / / / 1.\nStructural Changes of Lumbar Muscles in Non-specific Low Back Pain.\nendplate, but not at the upper endplate of L4 (1,22).\nAt more cranial levels, also no differences in CSA could  been established (1).\nRecurrent Low Back Pain Two studies investigated CSA in erector spinae  muscles at levels L3-L4, but none of them could establish differences in CSA between RLBP and healthy  controls (29,32).\nOne study established a decreased CSA  in the erector spinae muscle of CLBP compared to RLBP  at level L3 (29).\nOnly one study searched for differences in CSA in  multifidus in RLBP, but could not establish any difference in total muscle CSA or lean muscle CSA compared  to healthy controls at any level.\nAcute Low Back Pain Only one article studied atrophy in the multifidus  in ALBP compared to healthy controls.\nThe between  side differences in healthy participants (at L4) appeared  smaller in comparison with ALBP (at all levels).\nA significantly larger asymmetry between symptomatic (L5)  and asymptomatic (L2-L4) levels were reported in ALBP,  whereas no differences between levels occurred in  healthy controls.\nBelow symptomatic levels, no atrophy  was noted both in ALBP and healthy persons (3).\nUndefined Low Back Pain Three articles discussed CSA in the multifidus  muscle (33-35) of which 2 established a smaller CSA in  LBP compared to healthy persons (33,35).\nOne of these  2 latter studies detected a smaller CSA at both sides, at  all lumbar levels (L2-L5) (35), whereas the other could  only find differences at L3-L4 and L5 level, but not at L2  (33).\nMoreover, CSA in previous LBP was  larger compared to current LBP (34).\nTwo articles considered differences in CSA in the  lumbar erector spinae and found conflicting results  (33,34).\nOne of these studies could not find any differences between healthy controls and LBP at all lumbar  levels (L2-L5) (33), whereas in the study of McGregor et  al (34) a significant larger CSA was found in the healthy  participants versus previous LBP at L5-S1.\nContradictory,  in this latter study, the erector spinae appeared larger  in both previous and current LBP, compared to healthy  controls at L4-L5.\nNo differences were found between  previous LBP and current LBP at L4-L5 (34).\nOnly one study investigated muscle functional CSA  in the complete paraspinal muscle at level L5-S1 but no  differences were found when comparing non-radiating  LBP to healthy controls (28).\nIn summary, moderate evidence of atrophy can be  found in CLBP (conclusion strength 2) since 6/7 studies  indicated the multifidus muscle is smaller when compared to healthy controls (1,4,8,22,30,31).\nA lowered  CSA in the paraspinal muscles in CLBP was only seen  at the lower endplate of L4 (1,22) but no atrophy was  found in the erector spinae muscle in CLBP (1).\nMoreover moderate evidence occurred in RLBP and ALBP  (conclusion strength 2) in which no atrophy was shown  in any lumbar muscle (3,29,32).\nOne study found multifidus to be larger in LBP (34)  whereas 2 others found multifidus to be smaller in LBP  compared to healthy controls (33,35).\nIn the erector  spinae, one study could not find any difference for CSA  (33) whereas another found the erector spinae to be  smaller in the LBP group at level L5-S1, but conversely  larger at L4-L5 (34).\nThe sole study investigating paraspinal muscles could not establish atrophy in undefined  LBP (28).\nChronic Low Back Pain Two studies in this review investigated fat infiltration in CLBP in the isolated multifidus muscle, providing conflicting results (1,8).\nOne study established differences in fat content between healthy controls and  CLBP at L4 (8), whereas the other researchers could not  detect any difference between groups (1).\nInconsistent results for the isolated erector spinae  were also found in 2 studies (1,29).\nOn the one hand,  Hultman et al (29) found a significant difference between CLBP and healthy controls at L3, whereas Danneels et al (1) could not establish differences in fat  content.\nOnly one study investigated the total paraspinal  muscle, but could not demonstrate differences between  healthy persons and CLBP (1).\nRecurrent Low Back Pain  Two studies investigated fat infiltration in the erector spinae in RLBP and could not find any differences  compared to healthy controls (29,32).\nOne study investigated the multifidus and the total  paraspinal muscle in unilateral RLBP patients during remission but could not find differences compared to healthy  controls.\nConversely, the authors of this study indicated  that the muscle fat index (reflecting the amount of fat  content in lean muscle CSA) was larger in RLBP compared  to healthy participants for all muscles at the upper and  lower endplate of L4, but not at upper endplate of L3.\nAcute Low Back Pain  No studies investigating fat content in lumbar  muscles of non-specific ALBP were found through our  search strategy.\nUndefined Low Back Pain One study, which did not define the LBP group,  was not able to establish differences in fat content nor  in multifidus or erector spinae between the patient  group and healthy controls (33).\nResults concerning fat infiltration in CLBP are conflicting (conclusion strength 3).\nStudies provided contradictory results for the isolated multifidus (1,8) and  for erector spinae (1,29).\nOn the other hand, there is moderate evidence fat  infiltration does not occur in RLBP (conclusion strength  2) since no fat infiltration in the erector spinae, multifidus, or paraspinal muscles was found in RLBP (29,32).\nConversely a larger muscle fat index for erector spinae,  multifidus, and paraspinal muscles was found in RLBP,  reflecting an increased relative amount of intramuscular lipids (32).\nIn undefined LBP, no differences in  multifidus and erector spinae were demonstrated (33)  (conclusion strength 3).\nNo studies were found investigating fat content in ALBP, so no conclusions can be  made for this population.\nNo histomorphometric differences  were found between healthy controls and CLBP, suggesting no significant atrophy of either fiber type in  CLBP.\nType I fibers size was slightly larger than type II  fiber size, both in CLBP and healthy controls, but only  significant in the CLBP group (17).\nIn summary, restricted evidence to date indicates  that patients with CLBP show no abnormalities in paraspinal muscle fiber types (conclusion strength 3).\nAs no  studies have examined whether alterations in fiber type  occurs in ALBP and RLBP, no conclusions can be made  for these populations.\nThe present study revealed different outcomes  for CSA in different LBP groups.\nIn CLBP, moderate  evidence is provided that the multifidus is smaller in  CLBP compared to healthy controls at different levels  (1,4,8,22,30,31), while results about CSA in paraspinal  muscles and the erector spinae muscle were less conclusive (1,22,29).\nThese results are similar to the review  of Fortin and Macedo (5) which investigated muscle  morphology in patients with specific and non-specific  LBP and found that both multifidus and paraspinal  muscles were smaller in CLBP compared to healthy  controls.\nAccording to Bierry et al (36), the multifidus  is predominantly affected by atrophy in LBP, given that  the multifidus is exclusively innervated by the medial  ramus of the dorsal root of the spinal nerve, without  segmental nerve supply, which is present in other spinal  muscles.\nAfter pain onset, a combination of reflex inhibition and disturbance in coordination of trunk muscles  occurs changes in the multifidus structure (1,19).\nTherefore, muscle training focused on multifidus activation  is often considered as a key feature in the clinical approach of LBP (19,37).\nAccording to levels of lowered CSA in CLBP, results were similar amongst studies: lowered CSA was  mainly found in more caudal lumbar levels (1,4,8,30,31)  whereas at more cranial lumbar levels no conclusive  results could been established (1,4,31).\nThe review of  Fortin and Macedo (5) established multifidus atrophy in  CLBP was even larger in L5 compared to L4.\ntion for this can be found in the fact that the multifidus  muscle becomes larger at lower levels (4).\nAt the level  L3, the multifidus is about one-sixth of the total paraspinal muscle; whereas, the multifidus muscle is onethird of the paraspinal muscle at the lower endplate of  L4 (1).\nDue to a larger muscular mass in lower areas of  lumbar muscles, clear atrophy can be rather expected in  the lower lumbar areas.\nIn the current review, however,  2 studies could not find any atrophy in the multifidus  muscles in CLBP at L5 (27,30), but one of these studies included professional athletes who were attending  physiotherapy.\nBeing at different stages in rehabilitation might imply that some patients normalized their  multifidus structures.\nIn rehabilitation, muscle training  on the multifidus should preferably be focused on the  lower levels, instead of general lumbar region.\nIn RLBP and ALBP no differences could been shown  in lumbar muscle size between patients and healthy  controls (3,29,32).\nPossibly earlier reductions in muscle  size during an episode of LBP resolve in remission.\nThis  assumption is found in a correlation between CSA and  time that elapsed since the last LBP episode in the  dissertation of DHooge et al (32).\nTo make this assumption more clear, a study should investigate muscle structure, as well during a pain flare as in pain remissions  during different points in time.\nThis is the only way to  examine the direct influence of clinical LBP on muscle  structure and the effect of pain remission.\nNotable is  the difference in CSA in the erector spinae between  RLBP and CLBP, indicating CSA is lowered in CLBP compared to RLBP (29).\nThis result supports our hypothesis  of differences in characteristics and etiology between  LBP groups.\nStudies investigating ambiguous LBP groups could  not find conclusive results towards CSA in lower back  muscles (28,33-35).\nLike Crossman et al (17) proposes,  2 groups of LBP might appear: LBP patients who stay  active despite their discomfort and LBP patients reducing their physical activity as a protection mechanism  resulting in deconditioning.\nThe amount of physical  activity despite LBP complaints might influence the  muscle structure characteristics.\nStudies should take this  into account when comparing groups and either match  participant groups for daily activity levels or report  when group differences exist regarding this confounding factor.\nGiven the importance of well-functioning  lower back muscles with regard to spinal functioning,  rehabilitation of LBP complaints should contain general  physical activity to ensure patients dont get inactive  and deconditioned.\nto multifidus activation exercises, since the multifidus is  the most sensitive to atrophy.\nBesides activity levels as a confounding factor  of fat content in the lumbar musculature, also body  mass index (BMI) and subcutaneous fat levels might  influence fat infiltration.\nMore specifically, paraspinal  muscle density has been shown to decrease when BMI  increases (24).\nSome articles in this review reported  that an increased fat infiltration in LBP is not related  to BMI or other body composition parameters (8,22,29),  whereas others just did not take this parameter into  account.\nThe amount of fat content in lumbar muscles is  considered as a sign of atrophy (2).\nIn CLBP a significant  increase in fat infiltration compared to healthy controls  was found in 2 studies (8,29), whereas another was  unsuccessful in confirming these findings (1).\nChan et  al (8) found an increased fatty infiltration in CLBP, but  the control group was much younger (25 years) compared to the patient group (37 years).\nThe significant  increase in muscle fat content in this patient group can  possibly be explained rather by age difference than by  LBP.\nAnother included article investigated very young  persons (< 32 years) and could not find differences in  fat infiltration between an undefined LBP group and  healthy controls (33).\nThese results also suggest the  duration of LBP in young persons might be too short to  cause structural changes.\nThe role between fat content  and age has been confirmed by McLoughlin et al (25),  who found that fat infiltration is related to age and is  not a sign of atrophy in the lumbar muscles.\nOther research supports the idea that an increase in fat content  is caused by age (1,22,33,38) or by disuse (1,22) of the  lumbar muscles rather than by the lumbar pain itself.\nSo age differences could lead to misinterpretation of  results concerning fat infiltration in lumbar muscles,  therefore age should be taken into account as a confounding factor when investigating fat content.\nBoth studies investigating fat content in RLBP in  remission reported no macroscopic fat depositions in  RLBP compared to healthy controls, speculating fat  content was not reduced or was restored during the remission period (29,32).\nDHooge et al (32) on the other  hand also reported an increased muscle fat index (which  reflects increased relative amounts of intramuscular lipids) in lean muscle tissue in the absence of alterations  in muscle size or macroscopic fat infiltration.\nThese  results mainly presume that the quality of the muscle  structure might be decreased during remission periods,  contributing to recurrence of LBP, rather than muscle.\nA decrease in CSA associated with  an increase in fat infiltration in the multifidus in CLBP  patients compared to healthy participants, implies an  increased infiltration of non-contractile material in  lumbar muscles (8).\nAs a consequence, lumbar muscle  quality drops in LBP without visual changes in absolute  muscle size.\nStudies incapable of finding differences in  CSA might be masking a reduction in relative muscle  size.\nResults in studies only measuring CSA without paying attention to fat infiltration, need careful interpretation, especially when confounders like age and BMI  are not taken into account.\nIf the fat content is supposed  to be a result of aging, long-lasting inactivity, or long  lasting LBP, it is not expected in persons experiencing  ALBP, although a relationship with fat infiltration was  discovered by Mcloughlin et al (25).\nLongitudinal research could further unravel the relationship (cause or  consequence) between fat infiltration and the etiology  of LBP.\nAccording to fiber type characteristics, this review  could not establish changes in non-specific CLBP.\nCrossman et al (17) found similar results regarding ranges  of type I and II fiber dimension and distributions in  healthy persons compared to CLBP, suggesting no abnormalities in paraspinal muscle fibers in CLBP symptom generation.\nHowever the review of Mannion (16)  suggests the degree of abnormalities in musculature  most likely depends on age, duration of symptoms,  and physical (in)activity prior to and after the onset of  LBP.\nDHooge et al (39) on the other hand, found lower T2rest values for multifidus, but not for erector spinae, in  non-specific RLBP in remission.\nThese authors suggest a  higher proportion of glycolytic fibers (type II) in multifidus muscles, which might lead to a reduced capability  of the multifidus in stabilizing the spine because of fatigue.\nFew studies concerning fiber type characteristics  in lumbar muscles of LBP patients are available.\nBased  on the solitary study of Crossman et al (17), a sound  conclusion on fiber characteristics in non-specific CLBP  cannot be made.\nHence, future studies examining fiber  size, and type and composition of the lumbar muscles in  all non-specific LBP populations are warranted.\nFirst  of all, some studies did not clearly define the included  patient population (CLBP, RLBP, or ALBP) or included a  mixture of LBP patients.\nThis made it difficult to incorporate the results of these studies when drawing conclusions for specific types of non-specific LBP (28,33-35).\nBesides this, a lot of different definitions were applied  to identify RLBP and CLBP, which might influence results and hamper conclusions.\nFuture studies should define their study population sufficiently, and moreover,  a global consensus regarding the definition for specific  groups of non-specific LBP is wanted.\nLack of clarity about LBP to be unilateral or bilateral  was also common in the included studies, however the  side of complaints might play an important role regarding structural changes.\nIn addition, some studies pooled  outcomes of muscles from the left and right body side  when no significant differences were found between  both.\nIn other studies, left and right were examined  separately, even when nothing was mentioned about  side differences or the affected side, which might lead  to improper conclusions.\nAccording to Bierry et al (36)  atrophy ought to be concentrated ipsilateral to the side  of pain and at the level of pain.\nThese results were also  found by Hides et al (3), in ALBP  and in cricketers with  general LBP (35).\nAlso in CLBP, studies have shown rather  local muscle changes (1,4,31).\nOther studies conversely  provide evidence of more generalized changes in LBP  populations (26,32,33,35).\nThe review of Fortin and  Macedo (5) revealed significant differences in symptomatic and asymptomatic sides in CLBP patients.\nGenerally  one would expect complaints in persons with CLBP to be  more widespread and generalized in the lumbar muscles,  whereas in ALBP, symptoms are more focal.\nHence, it is  recommended that when patients experience unilateral  complaints each side should be examined separately.\nIn  case of bilateral complaints, mean values of the right and  left side should be averaged only in case of no significant  side differences, which should also be reported.\nFurthermore the position in which patients were  examined differed among studies.\nSome evaluations  took place in upright position, others with the patients  in a prone or supine position.\nWhen in a supine position,  which is often the case when MRI is applied, muscles  might experience small amounts of flattening because  of the body weight.\nIn an upright position, the human  body needs a minimum of muscular activity to stabilize  the spine, which might affect the lumbar muscle size.\nence in position could lead to bias.\nThe different applied techniques (USI, CT, and MRI)  to investigate CSA and fat infiltration in this review  might also have an influence upon the conclusions  which were made.\nLike Mengiardi et al (10) put forward, magnetic resonance spectroscopy could reveal  increased metabolic fat content, whereas conventional  MRI using a semi quantitative visual grading system  could not reveal these differences.\nBesides these issues,  most applied techniques for calculating fat content  rely on qualitative visual analysis which is liable to interpretation and image windowing.\nOther more recent  techniques such as opposed-phase magnetic resonance  (26), Dixon (41,42), and proto magnetic resonance spectroscopy (10) are able to quantify fat fraction in tissues  and are less sensitive for detection bias.\nAlso blinding  of the assessor for participant status is key to avoid the  assessor of being prejudiced and influencial for the results.\nHowever, not all studies took this methodological  issue into account.\nA last limitation can be found in the designs of the  included studies.\nA cross-sectional design, restrains us  from drawing definite conclusions regarding temporal  patterns and causality between structural characteristics  and LBP.\nWe are not aware of prospective studies investigating structural muscle changes in non-symptomatic  LBP patients, although these studies are warranted to  gain more insight into the etiology of LBP and the related muscle structure alterations.\nThis systematic review provided evidence for the.\npresence of macroscopic changes in lumbar muscle  structures of CLBP.\nThere is moderate evidence for atrophy of the multifidus muscle in CLBP patients, whereas  atrophy of the paraspinal and erector spinae muscles  in CLBP is less clear.\nEspecially a loss of muscle size is  seen in the lower lumbar levels, but not in the more  cranially lumbar levels.\nAn increase in fat infiltration in  CLBP, on the other hand, seems more likely to be due to  age or by disuse of lumbar muscles, rather than to LBP  itself.\nThus far, microscopic changes do not seem to affect the lumbar muscles of CLBP, as patients have similar  fiber characteristics as healthy people.\nNo clear signs of  macroor microstructural changes of the lumbar musculature were established in RLBP and ALBP, but more  research is warranted to confirm these conclusions.\nAuthor contributions This research question was constructed by all  authors.\nDorien Goubert conducted the search  strategy for the literature search, ensured the selection  for relevant articles, and wrote the first draft of the  manuscript.\nThe assessment for methodological quality  was done both by Mrs.\nDorien Goubert and Mrs.\nJessica van Oosterwijck, Mrs.\nMira Meeus, and Mr.\nLieven Danneels provided revision  and final approval of the manuscript.\nFunding Support Both Dorien Goubert, a PhD student at University  Ghent, and Jessica van Oosterwijck, a postdoctoral research  fellow, are funded by the Special Research Fund of Ghent  University (BOF-Ghent).\nThe funding source had no involvement in the aim, process, or publication of this manuscript.\nEvidence of lumbar multifidus muscle wasting ipsilateral to symptoms in patients with acute/subacute low  back pain.\nMultifidus size and symmetry  among chronic LBP and healthy asymptomatic subjects.\nIpsilateral atrophy of paraspinal and psoas  muscle in unilateral back pain patients  with monosegmental degenerative disc  disease.\nBritish Journal of Radiology 2011;  84:709-713.\nSpine 2004;  29:E515-E519.\nClinical spinal instability  and low back pain.\nCan acute low back  pain result from segmental spinal buckling during sub-maximal activities? A  review of the current literature.\nMechanical  stability of the in vivo lumbar spine:  Implications for injury and chronic low  back pain.\nClinical Biomechanics 1996;  11:1-15.\nMannion AF, Connolly B, Wood K,  Dolan P.\nFibre type characteristics  and function of the human paraspinal  muscles: Normal values and changes in  association with low back pain.\nChronic low back  pain-associated paraspinal muscle dysfunction is not the result of a constitutionally determined adverse fiber-type.\nNeuromuscular adaptation in experimental and clinical neck  pain.\nThe role of the lumbar multifidus in  chronic low back pain: A review.\nThe lumbar multifidus muscle five  years after surgery for a lumbar intervertebral disc herniation.\nAre MRI-defined fat infiltrations in the multifidus  muscles associated with low back pain?  BMC Medicine 2007; 5:2.\nCT measurement of  trunk muscle areas in patients with  chronic low back pain.\nCorrelation between the MRI changes in  the lumbar multifidus muscles and leg  pain.\nChanges in paraspinal  muscles and their association with low  back pain and spinal degeneration:  CT study.\nThe significance  of fat and muscle areas in the lumbar  paraspinal space, a CT study.\nAssessment of  association between low back pain and  paraspinal muscle atrophy using opposed-phase magnetic resonance imaging: A population-based study among  young adults.\nSwiss ball  enhances lumbar multifidus activity in  chronic low back pain.\nCorrelation  of paraspinal atrophy and denervation  in back pain and spinal stenosis relative  to asymptomatic controls.\nPM&R Journal  2013; 5:39-44.\nBody composition, endurance,  strength, cross-sectional area, and density of MM erector spinae in men with  and without low back pain.\nThe effect of chronic low back  pain on size and contraction of the lumbar multifidus muscle.\nIncreased intramuscular fatty  infiltration without differences in lumbar muscle cross-sectional area during remission of unilateral recurrent  low back pain.\nSize and  symmetry of trunk muscles in ballet  dancers with and without low back pain.\nThe trunk muscles of elite oarsmen.\nEffect of stabilization training on multifidus muscle  cross-sectional area among young elite  cricketers with low back pain.\nDisorders  of paravertebral lumbar muscles: From  pathology to cross-sectional imaging.\nEffects of three different  training modalities on the cross sectional area of the lumbar multifidus muscle  in patients with chronic low back pain.\nStructural Changes of Lumbar Muscles in Non-specific Low Back Pain.\nLumbar muscle dysfunction during  remission of unilateral recurrent nonspecific low-back pain.\nIsokinetic and lifting strenght, static back  muscle endurance and mri of the paraspinal muscles as predictors.\nComparison of  dixon and T1-weighted MR methods to  assess the degree of fat infiltration in  duchenne muscular dystrophy patients.\nPLoS One 2013; 8:e70993."}