{"title": "8.pdf", "contents": "Low back pain covers a spectrum of different types of pain (eg, nociceptive, neuropathic and nociplastic, or nonspecific) that frequently overlap.\nThe elements comprising the lumbar spine (eg, soft tissue, vertebrae, zygapophyseal  and sacroiliac joints, intervertebral discs, and neurovascular structures) are prone to different stressors, and each of  these, alone or in combination, can contribute to low back pain.\nDue to numerous factors related to low back pain,  and the low specificity of imaging and diagnostic injections, diagnostic methods for this condition continue to be a  subject of controversy.\nThe biopsychosocial model posits low back pain to be a dynamic interaction between social,  psychological, and biological factors that can both predispose to and result from injury, and should be considered  when devising interdisciplinary treatment plans.\nPrevention of low back pain is recognised as a pivotal challenge in  high-risk populations to help tackle high health-care costs related to therapy and rehabilitation.\nTo a large extent,  therapy depends on pain classification, and usually starts with self-care and pharmacotherapy in combination with  non-pharmacological methods, such as physical therapies and psychological treatments in appropriate patients.\nFor  refractory low back pain, a wide range of non-surgical (eg, epidural steroid injections and spinal cord stimulation for  neuropathic pain, and radiofrequency ablation and intra-articular steroid injections for mechanical pain) and surgical  (eg, decompression for neuropathic pain, disc replacement, and fusion for mechanical causes) treatment options are  available in carefully selected patients.\nMost treatment options address only single, solitary causes and given the  complex nature of low back pain, a multimodal interdisciplinary approach is necessary.\nAlthough globally recognised  as an important health and socioeconomic challenge with an expected increase in prevalence, low back pain continues  to have tremendous potential for improvement in both diagnostic and therapeutic aspects.\nFuture research on low  back pain should focus on improving the accuracy and objectivity of diagnostic assessments, and devising treatment  algorithms that consider unique biological, psychological, and social factors.\nHigh-quality comparative-effectiveness  and randomised controlled trials with longer follow-up periods that aim to establish the efficacy and cost-effectiveness  of low back pain management are warranted.\nIntroduction Low back pain covers a spectrum of different types of  pain, including nociceptive pain, neuropathic (radicular)  pain that travels down the legs, and in some cases,  nociplastic pain, which is caused by amplification of pain  in the CNS, often falling under the umbrella of nonspecific low back pain.\nFrequently, these pain subtypes  overlap (eg, a patient with a herniated disc who has back  pain can have radicular pain and diffuse symptoms  outside pathoanatomical referral patterns).\nback pain often coexists and is conflated with buttock  pain, the buttock region is anatomically distinct and  comprises a region from the iliac crest to the gluteal  folds.\nMost people have at least one episode of acute low  back pain in their lifetime.\nThis condition is usually  self-limiting, but often becomes chronic.\n1 Studies  have found that more than 60% of individuals with  mechanical low back pain will continue to have pain or  frequent recurrences 1 year after onset.\n2 For new-onset  lumbar radiculopathy, between 15% and 40% of people  will have chronic pain or frequent relapse.\n3 Chronic low  back pain is a consequence of complex interactions  encompassing biological, psychological, and social  factors.\nIt is important to understand that pain is distinct  from nociception, and includes not just A delta fiber and  C fiber activation, but also context-dependent emotional,  cognitive, and behavioural elements.\n5 This distinction  partly explains the poor correlation with pathology and  symptoms,6 and why interventions that have no effect on  degenerative processes (eg, psycho logical therapies or  acupuncture) can have profound effects on pain and  quality of life, whereas interventions that address  pathology (eg, surgery) often do not provide benefit.\nThis  notion was eloquently described by Melzack and Casey7  in their landmark classification of pain into sensory discriminative, affectivemotivational, and cognitive evaluative components.\nIt forms the basis for a  multi modal, precision medicine approach to low back  pain, and is a foundation for the biopsychosocial model.\nWe prioritised systematic reviews and  meta-analyses, and clinical trials that multiple authors judged  relevant, but did not exclude any data sources including  non-peer-reviewed literature in the public domain.\nWe also  included review articles to provide readers with more details  and more references than this Seminar permits.\nepidemiology, and the causes and risk factors that contribute to the pathogenesis of low back pain.\nWe also  describe the clinical presentation and diagnostic evaluation  of low back pain and different therapeutic options.\nEpidemiology A study done in 195 countries assessing the incidence,  prevalence, and years lived with disability for 354 medical  conditions found low back pain to be the leading cause  of worldwide productivity loss as measured in years,  and the top cause of years lived with disability in  126 countries.\n9 One systematic review of 165 studies  from 54 countries estimated the point prevalence of low  back pain to be 119% (SD 2) and 1 month prevalence to  be 233% (SD 29), and to be most common in middleaged to older women (ie, 4080 years).\n10 In 2019, a systematic review of  13 studies from North America, northern Europe, and  Israel reported the prevalence to range between 14%  and 200%, and the annual incidence ranging between  0024% and 7%, being highest in the USA.\n11 A systematic  review and meta-analysis of the prevalence of low back  pain in low-income, lower-middle, and upper-middleincome countries in Africa showed a pooled lifetime  prevalence of 47%.\n12 The prevalence of low back pain  increases with age, with rates of 1%6% in children aged  710 years, 18% in adolescents,13 and a peak prevalence  ranging from 28% to 42% in people between 40 years  and 69 years.\nLow back pain can be classified as mechanical, radicular  (neuropathic), or primarily nociplastic in nature, with the  distinctions affecting treatment decisions.\nIn studies that  sought to determine the breakdown of lumbar pain, the  prevalence of neuropathic pain has ranged between  16% and 55% in patients with chronic low back pain, with  one review reporting an aggregate prevalence of 366%.\n14  Radicular pain is most commonly associated with  herniated nucleus pulposus and spinal stenosis, further  stratified by location as central, foraminal, or involving  the lateral recesses.\nInfrequently, other conditions (eg,  herpes zoster and metastatic cancer) can cause radicular  pain.\nThe prevalence of radicular pain due to a herniated  disc varies between 2% and 4%, being more common in  men and in individuals aged between 30 years and  50 years.\n15 The presence of a herniated nucleus pulposus  does not always result in pain, with one systematic review  reporting prevalence rates in asymptomatic individuals  ranging from 29% in 20 year olds to 43% in 80 year olds.\n16  Most herniated discs will regress within 2 years.\nIn one  review, the authors found that spontaneous regression  occurred in more than 90% of sequestered discs, 70% of  herniated discs, and more than 40% of protruded discs.\n17  In another study, 87% of patients reported a decrease in  acute pain due to disc herniation at 3 months.\nHowever, not everyone with  narrowing of the spinal canal will have radicular pain.\nIn  one review, the range of spinal stenosis in asymptomatic  individuals ranged from 0% to 56%, with a median  of 11%.\n19 The authors of the Framingham Study20 found  prevalence rates of 225% for relative (lumbar spinal canal  diameter 12 mm) and 73% for absolute acquired lumbar  spinal stenosis (diameter 10 mm).\nSocioeconomic burden The economic burden of low back pain is estimated to  be around 28 billion in the UK22 and more than  AU$48 billion in Australia23 per year.\nIn the USA,  the annual expenditures for the management of  patients with low back pain are estimated to exceed  US$100 billion.\n24 A retrospective analysis of nearly  25 million US patients with newly diagnosed low back  or lower extremity pain between 2008 and 2015,25  revealed that 988% of cohorts did not undergo  surgery in the year following diag nosis.\n25 Approximately two-thirds of the  economic costs from low back pain stem from indirect  costs (eg, loss of productivity).\n27 Another study  showed that expenditures from presenteeism (ie, being  present at work with suboptimal performance) were  higher than direct medical costs.\n28 The nature of low  back pain could also result in less quantifiable costs  such as difficulties doing domestic chores, caregiving,  engaging in recreational activities, struggles with  relationships, depression, and anxiety.\nDisc degeneration In a systematic review, Batti and colleagues30 found  inconsistencies when defining the term degenerative  disc disease and identifying painful discs, which creates  confusion in the literature and divergent treatment.\nThe structures constituting the lumbar  spine include muscles, fascia, ligaments, tendons,  facet joints, neurovascular elements, vertebrae, and  intervertebral discs, all of which are susceptible to  biochemical, degenerative, and traumatic stressors  (figure 1).\nIntervertebral discs absorb shock,  preserve spinal movements, and distribute axial and  torsional forces.\nDuring healing, neovas cularisation  occurs and minute sensory nerves can penetrate the  disrupted annulus and nucleus pulposus, leading to  mechanical and chemical sensitisation.\n34  Similar to other sources of mechanical pain, discogenic  pain can extend into the upper and occasionally lower  legs in a non-dermatomal pattern.\nHerniated nucleus pulposus is the most  common cause of radicular pain, although after 60 years  of age, spinal stenosis is the leading cause.\nSpinal stenosis  is most common at the L4L5 level and can result  from facet joint and ligamentum flavum hypertrophy,  congenitally short pedicles, and spondylolisthesis.\n35 Spinal  stenosis can cause chronic mechanical compression  resulting in axonal injury or nerve root ischaemia.\n36 A herniated disc is diagnosed when the  nucleus pulposus extends beyond the normal confines of  the annulus fibrosis, but involves less than 25% of  the circumference.\nSpinal stenosis often coexists with  other conditions (eg, hypertrophied facet joints causing  foraminal narrowing) including herniated disc, with  one study reporting a 23% co-prevalence rate.\n37 Because  most herniated discs are substantially degenerated and  the causes of spinal stenosis can also cause axial pain,  most, but not all, cases of lumbar radicular pain co-occur  with back pain.\nIn contrast to facet joint pain and sacroiliac joint pain, discogenic  pain is more likely to be bilateral or symmetrical in nature.\nForaminal stenosis relates  to a neuroforaminal  diameter of <3 mm.\nThe most common causes of radicular pain are  herniated nucleus pulposus (mechanical and  chemical irritation) and spinal stenosis  (chronic nerve root compression or ischaemia).\nPathoanatomic relationship between patients  perceived cause of back pain and actual cause  is often unclear.\nZygapophyseal (facet) joints are susceptible to osteoarthritic  changes   Disc degeneration (without pain) typically precedes and can  accelerate facet joint arthropathy  The pain referral patterns for zygapophyseal joint and discogenic  pain are variable, depending on the level or levels affected and  the magnitude of the stimulus.\nMuscles, fascia, and ligaments could be  a source of low back pain  Myofascial pain is often categorised as  non-specific.\nVertebrogenic pain can arise from  compression fractures, microfractures,  and endplate degeneration  Treatments targeting the vertebral body  nerve supply have shown effectiveness  in preliminary studies   Presentation and affected levels are  similar to discogenic low back pain.\nFacet arthropathy Facet joints (ie, zygapophyseal joints) that connect  adjacent vertebrae always play a role in limiting spine  move ments, but their role in loadbearing becomes  prominent as discs age and degenerate.\n39 Referred lumbar facet joint pain has a  variable presentation; upper lumbar levels are associated  with non-dermatomal pain projecting into the hip, flank,  and lateral aspects of the upper thigh, which is in contrast  to pain felt in the lateral or posterior aspects of the  thigh observed with the lower levels.\nThe most commonly  affected L4L5 and L5S1 zygapophyseal joints can  sometimes produce pseudoradicular symptoms extending  into the lower leg.\nMyofascial pain Muscles, fascia, and ligaments can also be pain generators  (figure 1).\n41,42 Muscles that can potentially contribute to  low back pain include deep intrinsic (eg, multifidus or  rotatores) and the more superficial longissimus, spinalis,  and iliocostalis muscles, collectively referred to as erector  spinae muscles.\n43 Back muscles are integral to normal  spine stiffness and function, and chronic low back pain  could be paradoxically associated with both atrophy and  increased myoelectric activity, which is consistent with  studies showing both increased and decreased activation  depending on context.\n43,44 Muscle pathology represents an  underappreciated source of low back pain, often misdiagnosed as non-specific, and frequently arises consequent to other primary pathology.\nMyofascial pain might  result from overuse, acute stretch injuries or tears, and  diffuse or localised (eg, trigger points) muscle spasm.\nSacroiliac joint pain The sacroiliac joint consists of an extensive network of  ligaments both dorsally and ventrally, and a joint capsule in  the anterior, lower-third of the sacroiliac junction.\nAlthough  sacroiliac joint pain most frequently presents in the  buttocks, over two-thirds of individuals will have lumbar  pain; in approximately 50% of cases, the pain radiates to  the leg, sometimes below the knee.\nIntra-articular pathology is  more common in older people, whereas younger individuals with prominent tenderness and a traumatic cause are  more likely to have extra-articular pathology.\nSpondyloarthropathies Spondyloarthropathy refers to a family of inflammatory  rheumatic diseases that includes ankylosing spondylitis  and psoriatic arthritis.\nThese systemic conditions typically  include multiple joints, with ankylosing spondylitis and  axial spondyloarthritis preferentially affecting the low  back.\nIn addition to facet and sacroiliac joint arthritis,  other spinal manifestations include enthesitis and  autofusion.\nvaries from 02%05% for ankylosing spondylitis to  005%025% for enteropathic axial arthritis.\nNociplastic pain The term non-specific low back pain is ambiguous and  evolving.\nSemantically, the term refers to low back pain  in which a specific pain generator, or generators, has not  been identifiednot that one does not exist.\nHistorically,  it has been written that approximately 90% of cases of  low back pain were not associated with a clear-cut cause,  although almost all studies used for this prevalence  rate did not involve the use of advanced diagnostic tools  (eg, diagnostic blocks or electrodiagnostic testing).\n44 In the  past 5 years, the term nociplastic pain has been  introduced, in which objective abnormalities might or  might not be present, but in which the principal  mechanism is sensitisation of the nervous system.\nJust  as neuropathic pain and nociceptive pain can co-exist,  nociplastic pain can be present in cases of nociceptive or  neuropathic low back pain.\nChanges in the brain Structural and functional changes in the brain have been  generating interest as they might serve as biomarkers  linking anatomical changes with pain.\nStudies have  identified common and disease-specific changes in white  and grey matter brain regions in patients with chronic  low back pain, such as the dorsolateral prefrontal cortex  thalamus, temporal lobes, and insula and primary  somatosensory cortex, indicating that chronic pain is  associated with structural reorganisation.\nA study on patients with low  back pain has shown that deleterious anatomical and  functional changes can be reversed with treatment.\nBehavioural factors In line with the revised International Association for the  Study of Pain51 definition of pain, low back pain represents  not just the sensory awareness of bodily harm, but also an  emotional experience that can be influenced by other  emotions (eg, fear, sadness, and anxiety).\nPsychologically  traumatic events could precipitate or reinforce low back  pain.\nIn one study evaluating clinician-reported views on  low back pain triggers (which could underestimate the  inci dence), 31% cited psychological factors as a primary  determinant.\nIn clinical studies, negative expectations have been  shown to predict poor pain outcomes.\n53 Patients expectations are based on previous experience, cultural attitudes,  health-care beliefs, context, and an understanding of their  illness.\nfurther fuel disability, depression, and anxiety.\nLow back  pain frequently leads fearful patients to avoid painful  movements or activities, putting them in a vicious cycle  of anxiety, avoidance, disability, and worsening pain.\nTraditionally, low back pain was considered a result of  injury.\nThis model is not only overly simplistic but does  not reflect the power of pain to instigate learning and  adaptation.\nIndividuals with low back pain learn to  predict, control, and prevent painful events.\nLearning to predict pain occurs by detecting nonnociceptive cues or events that precede or coincide  with the occurrence of pain.\nThe mechanism of such  Pavlovian learning is that after such co-occurrences,  the non-nociceptive event elicits an anticipatory fear  response.\n57 Erroneous  beliefs about the relationship between particular  movements and pain are prevalent in patients with  low back pain,58 but are also found among health  professionals.\n59 For example, the use of expressions  implying harm (eg, Your spine looks like that of a  70-year-old) could inadvertently evoke pain-related  fear.\nSimilar to Pavlovian learning is the acquisition of  harm expecta tions, which have shown to be potent  predictors of recovery from back pain.\nA particular form of learning to control pain is  avoidance learning; individuals with low back pain learn  that when they avoid the predictive cues, the anticipated  pain increase or injury is circumvented.\nmotivational, and behavioural aspects of pain-related  behaviour into an integrated theoretical framework.\n60  Whereas avoidance might be adaptive in the short term,  its excessive or unnecessary deployment can have  detrimental conse quences in the long term.\nGenetic factors The genetic determinants of low back pain have received  increased attention in the past decade and could  someday be part of precision medicine algorithms.\nCarvalho-E-Silva and colleagues62 found that heritability  contributed 26% to lifetime prevalence of low back pain,  36% for functional limitations, and 25% to pain  intensity in 1598 twins.\nA systematic review of 27 studies  involving twins showed that the effects of heritability  accounted between 21% and 67% of back pain burden.\n63  One question raised by genetic studies is how  individually identified genes contribute to low back pain  (eg, through pain perception, accelerated spondylosis,  predisposing psychopathology, lifestyle, and response  to treatments), and the role that epige netics plays.\nClinical presentation Intervertebral disc herniation typically manifests as low  back pain (ie, from annular tears and disc disruption)  and leg pain (from nerve root irritation or referred pain  from degenerated discs).\nThis pain usually resolves over  several weeks in patients without neurological deficits  but might persist in many people.\nA prospective cohort  study followed 605 patients with low back pain with or  without sciatica for 2 years, and noted that 54% of  patients had recurrent pain at 6 months and 47% had  recurrent pain at 24 months.\n64 The extent of disc  herniation does not correlate well with severity of pain.\n65  Patients with lumbar spinal stenosis can report low back  and leg pain, aggravated by walking and alleviated by  bending forward.\nThey often present with a wide-based  gait and neurological weakness.\n35 These symptoms are  referred to as intermittent neurogenic claudication,66  which can be distinguished from vascular claudication  in that patients with the latter could have decreased  temperature in their feet, diminished distal pulses, and a  lower anklebrachial index.\nPatients with lumbar spinal  stenosis can often be distinguished from patients with a  herniated lumbar disc in that they tend to assume a  characteristic kyphotic standing posture (flexion of the  lumbar spine) to alleviate their symptoms, and physical  examination signs, such as the straight leg raising test,  are less reliable.\nDiagnosis of low back pain An overview of 15 clinical practice guidelines explored  diagnostic recommendations for non-specific low back  pain.\nPsychosocial factors (poor social support, anxiety,  depression, and catastrophising).\nPoor coping mechanisms (eg, fear-avoidance behaviour).\nare non-specific or resolve without a formal diagnosis,  most guidelines recommend history taking and physical examination to identify specific entities.\nPatients  with lumbar spinal stenosis might also require vascularfocused studies to differentiate between vascular  and neurogenic claudication.\nA large retrospective review showed that presence of  red flags such as fracture, metastases, and infection  increased the probability of identifying serious spinal  pathology, although a negative response to red flag  surveillance did not lower the probability of a red flag  diagnosis.\nIntervertebral  disc34,67,68 Advanced age, but patients  typically younger than those  with facetogenic or sacroiliac  joint pain; repetitive or acute  trauma.\nInsidious Low back pain and leg pain;  pain worse with sitting Midline tenderness; reduced range of  motion, especially bending forward;  no focal neurological findings.\nPlain films to evaluate disc height;  MRI to detect annular tears, fissures,  or high intensity zones; imaging not  routinely needed.\nFacet joint69 Osteoarthritis;  spondylolisthesis Insidious Axial low back pain; referred  pain to hip, flank, or upper  thigh.\nParaspinal greater than midline  tenderness; reduced back range of  motion; no focal neurological findings.\nCT is gold standard for bone  pathology, with SPECT scans showing  correlation with facet block results;  imaging not routinely needed.\nAcute or insidious Axial low back pain; occasional  referred pain to the posterior  thigh.\nMuscle guarding, spasm, oedema, or  atrophy; reduced back range of  motion; no focal neurological findings.\nButtock pain; low back pain  frequently radiating into the  leg or groin; sitting or rising  from sitting can worsen it.\nVertebral body Advanced age, history of  trauma Insidious Low back pain, with or without  upper leg pain Midline tenderness, pain worsened by  activities, no focal neurological  findings.\nAcute or insidious Low back pain or leg pain, or  both Straight leg raising test; crossed  straight leg raising test; dermatomal  pain location; diminished reflexes  depending on nerve root involvement;  lower extremity muscle weakness  depending on nerve root involvement;  weakness can be pain-induced or  neurological.\nInsidious Low back pain and leg pain;  wide-based gait; neurological  weakness.\nAt least three to five findings from  patient history and examination  (age >48 years, leg pain greater than  back pain, bilateral symptoms, pain with  walking or standing, pain alleviation  with sitting); improved walking ability  with the spine flexed forward; pain relief  with bending; muscle weakness and  diminished reflexes depending on nerve  root involvement.\nMRI for soft tissues and measuring  spinal canal diameter; CT can assess  osseous diameter of spinal canal in  axial views, but is less sensitive than  MRI; plain x-rays used to evaluate  spinal instability (flexion or extension).\nTable 1: Clinical presentation and diagnostic evaluation of low back pain.\nImaging Numerous guidelines have been published on the use of  imaging for low back pain, high rates of use, the high  prevalence rates of abnormalities in asymptomatic  volunteers (most people have disc degeneration by age  40 years), and the poor correlation between symptoms  and pathology.\nFor chronic low back pain, routine  imaging is not recommended, although it could be  considered on a case-by-case basis, particularly when  findings are likely to affect care (eg, referral for surgery).\n82 In patients who are candidates for MRI but  have contraindications, CT scans have greater than  90% sen sitivity for detecting most lumbar pathology.\nScreening Screening tools have been developed to identify patients  with acute low back pain who are prone to develop  chronic pain.\nA large prospective study found the  StarT Back tool to be acceptable for a 1 year disability.\nSeveral instruments have been developed to distinguish  neuropathic pain from non-neuropathic pain, including  painDETECT, s-DN4, and s-LANSS.\nQuestionnaires used to identify  nociplastic contributions to low back pain can include  the central sensitisation inventory and pain sensitivity  questionnaire.\nOne reason behind the  lack of progress could be the underestimation of nonanatomical aspects contributing to low back pain, such  as psychosocial risk factors,89 and under-utilisation of  multidimensional interventions.\n90 Previous studies on  interventions such as exercise, education, and ergonomic  modifications have yielded modest results.\n91 In adults, a  systematic review found moderate-quality evidence that  exercise alone or with education was effective for both  primary and secondary prevention of low back pain, and  low-quality evidence that education alone, back braces,  shoe inserts, and ergonomic corrections were ineffective  for the primary prevention of low back pain.\n92 A systematic  review confirmed that exercise alone and in combination  with education was effective as a primary prevention  strategy for low back pain.\nTreatment Behavioural management of low back pain Due to ongoing concerns about the risk to benefit ratio of  opioids and suboptimal results in clinical trials evaluating  other pharmacological agents, published guidelines have  proposed non-pharmacological approaches such as  exercise and physical therapy as first-line treatments  for low back pain.\nThe initial encounter with patients  with low back pain should take place in a primary care  setting,31 and begin with familiarising an individual with  their pain condition and self-management techniques.\nShould reassurance and self-care not work, additional  risk-stratified methods such as exercises and cognitive  behavioural therapy can be considered.\nIf low back pain  persists, pharmacological and procedural options can  be trialed.\nThe management of chronic low back pain is  notoriously challenging, and the prominent role of  negative expectations, pain-related fear, and various  avoidance behaviours in sustaining chronic low back  pain,94 warrant a behavioural management approach.\n95  Yet, there is also no consensus as to what constitutes  an optimal design or duration of treatment.\nsharing the goal of restoring the pursuit of individualvalued life goals can be roughly classified into  clarification-oriented and exposure-based cognitive  behavioural interventions.\nClarification-oriented interventions help patients disengage from disabling  avoidance behaviours by unambiguously providing new  information that pain can be self-managed and does  not require aggressive protection.\nExposure-based treatments include graded activity,  which uses operant learning principles to encourage  healthy behaviours,98 and exposure treatment, which  focuses on the reduction of pain-related fears and  maladaptive avoidance behaviours.\n99 In a systematic  review evaluating cognitive behavioural therapy for  subacute back pain, most included studies reported  statistically significant benefit at variable follow-up  periods.\n100 Cognitive behavioural therapy has also been  shown to decrease recovery time and prevent the  development of chronic spinal pain.\nA systematic review on  mindful-based stress reduction found only small, shortterm differences for improvement in pain and function.\n102  A systematic review of acceptance and commitment  therapy on chronic low back pain revealed small to  medium effect sizes for measures of function, anxiety,  and depres sion, but not for pain or quality of life.\n11 of 12 guidelines  recommended against bed rest for acute low back pain,  and four were against bed rest for any duration of pain.\nMore than half endorsed maintaining normal activities  as part of acute low back pain management.\nThe  American College of Physicians published guidelines  with recommendations for non-invasive management  of radicular or non-radicular low back pain.\nAccording to the American  College of Physicians guidelines,104 pharmacological  recommen dations for acute or subacute low back pain  should begin with non-steroidal anti-inflammatory  drugs (NSAIDs) or muscle relaxants (moderate-quality  evidence).\nA Cochrane review found no significant  diff erence on effectiveness between selective and nonselective NSAIDs for low back pain.\n111 Guidelines by the  American College of Physicians104 recommend tramadol  or duloxetine as second-line treatment, and opioids as  the last-line treatment for chronic low back pain.\n113 Although opioids are  as or more efficacious than other analgesics for both  neuropathic and non-neuropathic pain,114 a metaanalysis showed only modest, short-term pain relief in  patients with chronic low back pain.\n115 The addictive  potential of opioids coupled with a plethora of sideeffects have led multiple organisations to recommend  them only for low back pain refractory to other  treatments.\ntions for the treatment of neuropathic pain;114 however, a  systematic review found no strong evidence to support  their use for chronic low back pain with or without  radicular pain.\n116 Tricyclic anti depressants are also used  in the management of neuropathic pain, and the  serotoninnorepinephrine reuptake inhibitor duloxetine  is approved by the US Food and Drug Administration  for musculoskeletal pain, including low back pain.\nA systematic review by Chou and colleagues117 found  evidence supporting duloxetine, but not tricyclic  antidepressants and gabapentinoids for chronic low  back pain.\nHowever, the evidence for duloxetine in  lumbosacral radiculopathy was indeterminate.\nNon-surgical procedures There is wide geographical and practitioner variability in  the use of procedures to treat low back pain, and studies  have shown positive correlations between imaging,  injec tions, and surgery rates.\n118 Given the risks and finite  duration of benefit for interventions, procedures should  generally be done on patients who have not responded to  conservative measures, although exceptions could be  reasonable in some cases.\nLumbar epidural steroid injections and adhesiolysis Despite over 9 000 000 epidural steroid injections  performed each year in the USA, the utility of lumbar  epidural steroid injections is controversial, with studies  and reviews done by interventionalists more likely  to yield positive findings than those done by noninterventionalists.\n119 For example, although the Spinal  Intervention Society guidelines120 give strong evidence to  support lumbar epidural steroid injections for radicular  pain, a Cochrane review found only small, short-term  benefits compared with placebo for pain relief and  function.\n121 For axial low back pain, there is a shortage of  strong evidence supporting benefit, and most guidelines  recommend them only for radicular pain.\nThere are several approaches for the administration of  epidural steroids including transforaminal, interlaminar,  and caudal routes.\nA comprehensive review of published  data found strong evidence for transforaminal epidural  steroid injection in herniated nucleus pulposus for up to  6 months, but only low-quality evidence for a small effect  for spinal stenosis.\nFor the type of steroid, all placebo-controlled trials have  been done using long-acting particulate steroids, but  reviews are mixed regarding whether they provide  better or longer relief than non-particulate steroids  (eg, dexamethasone).\n122,123 However, the transforaminal  delivery of long-acting particulate steroids has been  associated with rare, catastrophic events such as death  and paralysis, which has prompted some,123 but not all,124  task forces to recommend that the initial transforaminal lumbar epidural steroid injection be done with  non-particulate steroids.\nStratified by pathology, the  effectiveness of epidural steroid injection tends to be  better in patients with herniated nucleus pulposus than  spinal stenosis, and weakest in individuals with axial  pain and radicular pain from degenerative disc disease  without nerve compression.\n119 Most of the early (<2 weeks).\n125,126  Although multiple studies have found evidence for  long-term benefit with serial lumbar epidural steroid  injections,127,128 the disadvantage is that a single injection  typically provides only short-term relief (<3 months).\nFor  the prevention of surgery, a meta-analysis found mixed  evidence for a small effect in the short term for a single  lumbar epidural steroid injection, but not in the longterm (>1 year).\nSacroiliac joint injections Small controlled studies with short-term (2 months)  follow-up found evidence for intra-articular and extraarticular steroids in patients with and without spondyloarthropathy.\n130 There is some evidence that the  combination of intra-articular and extra-articular sacroiliac  joint steroid injections might have a better therapeutic  effect.\n131 Fluoroscopic guidance has been recommended  when doing sacroiliac injections; however, there is no  agreement on the type and dose of steroids used.\nMassage105 Manual therapy to reduce muscle spasm and increase joint mobility Immediate benefit for non-specific low back pain vs no treatment, inactive controls, or sham  treatments, although differences in improvements are small; most beneficial as an addition to  exercise or education.\nAcupuncture105 Manual needle insertion into particular points of different  anatomical planes to reduce pain Global improvement compared with NSAIDs but the effect is very small; inconsistent benefit for  pain relief compared with NSAIDs; acupuncture in addition to medication is more effective for pain  relief and function versus medication alonedifferences are small; immediate pain relief and  functional improvement greater than with sham acupuncture, no treatment, NSAIDs, or muscle  relaxantsdifferences are small; systematic reviews have also found that some forms of sham  acupuncture are superior to no treatment.\nSuperficial heat and  cold106 Increases cutaneous blood flow and causes a cooling reaction; can be  done with moist hot packs, fluid therapy, whirlpool, or paraffin;  used to relieve muscle spasms, joint contractures, and decreased  range of motion.\nShort-term (4 days) pain and disability reduction for continuous heat wrap vs oral placebo in acute  and subacute low back pain (3 months); additional benefit as an add-on therapy to exercise;  insufficient evidence for chronic low back pain; insufficient evidence on the effects of cold therapy.\nCBT involves managing pain by modifying maladaptive beliefs and  behaviours through education and methods to manage symptoms;  operant therapy involves learning through positive reinforcement of  health-promoting behaviours.\nCompared with waiting list control group or no psychological therapy, operant therapy and CBT  show superior short-term post-treatment pain improvement; no therapeutic difference at  6 months.\nYoga105 Ancient Indian practice whereby physical, mental, and spiritual  exercises are used to improve bodily posture, and emotional and  physical well-being.\nYoga is superior to non-yoga exercise for pain and function in chronic low back pain (>12 weeks)  patients; better function in the short term (3 months) and long term (1 year).\nMovement control  exercise107 Physical exercises designed to straighten muscles, alleviate pain, and  improve spinal posture Positive effect of movement control exercise on disability immediately after treatment and after  12 months.\nSMT105 Chiropractic application of controlled manipulation or thrust applied  to joints of the spine SMT is better than sham SMT and inert interventions and as an adjunct to other interventions for  pain and quality of life improvement; non-significant short-term (13 months) effect on pain or  function versus sham manipulation.\nTSET108 Simultaneous application of electronic technological systems with  exercise therapy Technological support of physical exercises provides limited benefit for pain, disability, and quality  of life; TSET is not more effective than other treatments.\nMiniinterventions109,110 Interventions based on features from light mobilisation and graded  activity programmes Mini-interventions reduce daily subacute low back pain symptoms, improve adaptation to pain,  and do not increase health-care costs.\nFacet joint blocks and radiofrequency ablation Facet joints receive innervation from medial branches of  the dorsal ramus at two levels, which are the target for  diagnostic or prognostic nerve blocks.\nInternational  guidelines on lumbar facet interventions found no  evidence for long-term therapeutic benefit from medial  branch blocks or intra-articular injections with steroids,  and concluded that medial branch blocks should be  the preferred prognostic test before radiofrequency  ablation.\nA large randomised controlled trial (RCT)134 raised  questions about the efficacy of radiofrequency treatment  of the medial branches of the dorsal ramus; however,  the study was widely criticised for its non-rigorous  selection criteria and performance.\n135,136 According to  NICE guidelines,112 radiofrequency lumbar medial  branch (facet) denervation might be considered after  conventional management has not worked in individuals with injection-confirmed facetogenic pain.\nAt each level, 14 lateral branches supply nociceptive  feedback, primarily from the ligaments; hence, sacroiliac  joint denervation is ideally suited for individuals  with suspected extra-articular pain.\nSpinal cord stimulation A systematic review that compared spinal cord stimulation  with conventional therapies in more than 300 000 patients  with chronic low back pain and leg pain found that eight of  11 studies reported spinal cord stimulation to be associated  with better outcomes and cost-effectiveness.\n138 A review  found low-to-moderate quality evidence that spinal cord  stimulation is better than reoperation or conventional  medical management for failed back surgery syndrome,  but conflicting evidence that conventional spinal cord  stimulation is superior to sham stimulation.\n139 Major  limitations of randomised spinal cord stimulator trials  include the effect of industry sponsorship, including programming by company representatives, and the complete  absence of adequate blinding.\nSpinal cord stimulation has traditionally been used  for neuropathic pain, particularly in individuals with  previous spine surgery and more pain in their legs than  their backs.\nHowever, a study showed that high-frequency  spinal cord stimulation provided better analgesia and  functional improvement than conventional spinal cord.\nstimulation in patients with low back and leg pain, with  or without previous surgery.\n140 A meta-analysis showed  that neuromodulation was associated with opioid  reduction.\n141 Other major advances in neuromodulation  include burst stimulation, MRI-compatible systems,  dorsal root ganglion stimulation, and a diverse combination of electrode arrays.\nSurgery There has been enormous interest in the past two  decades about the indications and utility of surgery for  chronic low back pain.\nStudies have shown that surgical  rates and the proportion of complex surgeries (eg,  instrumentation) are higher in the USA than nearly all  other countries, but do not affect low back pain disability  rates.\nFor herniated nucleus pulposus, a systematic review  found that surgery results in faster pain relief and  functional improvement than conservative management,  but no differences were observed after 12 years.\n143 In  2020, an RCT found greater improvement in the surgical  group compared with conservative care in patients with  sciatica secondary to herniated nucleus puplosus that  persisted at 12 months.\n144 In patients with lumbar spinal  stenosis, a systematic review found that decompression  surgery resulted in substantial improvement compared  with conservative management at 36 months; at  the 24 year follow-up, pain and disability outcomes  continued to be more favourable in the surgical group,  but had declined.\n145 A later systematic review found no  benefit for decom pression and fusion compared with  decompression alone for stenosis.\n146 The 2016 NICE  guidelines112 recommend spinal decompression for  people with radicular pain when non-surgical treatment  has not improved pain or function, and radiological  findings are consistent with radicular symptoms.\nLumbar fusion is often done for refractory spondylosis.\nHowever, a meta-analysis that included studies with longterm follow-up found little benefit for fusion compared  with non-operative management.\n147 A cohort study  evaluating prognostic factors following fusion found  that older patients (62 years old vs 57 years old) undergoing single-level lumbar disc fusion with low baseline  disability had the best outcomes.\n148 According to the NICE  guidelines,112 spinal fusion should not be offered as a  treatment for low back pain outside of a clinical trial.\nPatients with low back pain who undergo spinal surgery  could have recurrent low back pain with or without a  radicular component, termed as failed back surgery  syndrome.\nThe incidence ranges from 10% to upwards  of 40% after lumbar laminectomy, with or without  fusion.\n149 Causes might include adhesions, arachnoiditis,  spinal instability, complications of the surgery (battered  nerve roots), inappropriate patient selection, technical  failure, and adjacent segment disease.\nDisc replacement is generally limited to individuals with  predominantly discogenic pain at one or two segments,.\nand might be associated with better preserved range  of motion than arthrodesis.\nA systematic review that  compared lumbar fusion with disc replacement reported  short-term benefits favouring disc replacement that  might not have been clinically meaningful.\n150 An earlier  Cochrane review reported disc replacement to have small,  clinically questionable benefits compared with fusion  surgery and comprehensive rehabilitation in patients with  degenerative disc disease.\n151 An inherent flaw in surgical  studies that use intention-to-treat analysis is that more  patients crossover to the surgery group than vice versa,  which can minimise differences.\nUnlike  conditions such as diabetic neuropathy, low back pain is a  symptom; therefore, studies evaluating interventional  treatments tailored towards a specific cause (eg, injections  or surgeries) depend on accurate diagnosis, which is  subject to false-positive and false-negative results.\nNonpharmacological treatments (integrative and procedural)  are challenging to study using placebos (eg, ethical and  practical [enrollment] concerns about invasive sham  treatments, ambiguity about what constitutes a placebo),  and uncontrolled studies generally overestimate treatment  effects.\nfactorial nature of most cases of chronic low back pain  (eg, superimposed facetogenic pain, discogenic pain,  and muscle tension), and the inherent difficulties in  identifying pain generators (eg, low MRI specificity, and  the high false-positive and false-negative rate of  diagnostic blocks with no reliable reference standards);  the high placebo response rate for surgery, non-surgical  interventions, and integrative therapies that require  multiple visits and hands-on care; deciding what  constitutes a true control (eg, placebo) treatment, and  the cost and ethics involved in doing controlled studies;  and poor translation from clinical trials to clinical  practice.\nFuture directions for low back pain research include  the shift from focusing on outcome measures based on  self-report only (eg, pain scores at a cross-section in  time) to behavioural and neurocognitive measures (eg,  step count and functional imaging); increasing the  duration of follow-up in clinical studies; avoiding  unnecessary provider contact; taking steps to maximise  study blinding effectiveness; adapting study designs that  consider personalised care models; including patients  with psychopathology, on opioid therapy, and with a  nociplastic component to enhance generalisability; and.\ndetermining the relationship between infection and disc  degeneration, and the effectiveness of antibiotics to treat  disc disease.\nConclusions The prevalence of chronic low back pain is expected  to increase with the ageing of populations and as  technological advances lead to more sedentary lifestyles.\nAlthough this Seminar focuses on specific conditions  and their treatments, there is considerable overlap  between contributors to low back pain in terms of  presentation.\nThere is widespread acceptance of the  biopsychosocial model that emphasises multidimensional components and the diverse consequences of  chronic pain that can adversely affect all aspects of  life.\nThis model emphasises behav ioural and lifestyle  modification and the burgeoning fields of genetics  and phenotyping (ie, precision medicine), a detailed  discussion of which is beyond the scope of this Seminar.\nAlthough most currently available pain management  options typically address only single causes, given the  complex nature of low back pain, a multimodal, interdisciplinary approach is warranted.\nEvaluation and treatment of low back pain:  a clinically focused review for primary care specialists.\nThe biopsychosocial model of low back pain  and patient-centered outcomes following lumbar fusion.\nBehavioral conceptualization and  treatment of chronic pain.\nSensory, motivational, and central control  determinants of pain.\nDevelopment and validation of  a prediction model for pain and functional outcomes after lumbar  spine surgery.\nA systematic review of the global  prevalence of low back pain.\n11  Fatoye F, Gebrye T, Odeyemi I.\nAn update on the  prevalence of low back pain in Africa: a systematic review and  meta-analyses.\nThe prevalence of low  back pain among children and adolescents.\nWhat is the evidence that  neuropathic pain is present in chronic low back pain and soft tissue  syndromes? An evidence-based structured review.\nSystematic literature  review of imaging features of spinal degeneration in asymptomatic  populations.\nThe probability of spontaneous regression of lumbar herniated disc:  a systematic review.\nLack of effectiveness of bed rest for sciatica.\nPrevalence of lumbar  spinal stenosis in general and clinical populations: a systematic  review and meta-analysis.\nLow back pain: guidelines  for the clinical classification of predominant neuropathic,  nociceptive, or central sensitization pain.\ntreatment of chronic low back pain: an analysis of the UK General  Practice Research Database.\nThe personal and national costs of early retirement  because of spinal disorders: impacts on income, taxes, and  government support payments.\nLumbar disc disorders and low-back pain: socioeconomic  factors and consequences.\nJ Bone Joint Surg Am 2006; 88: 2124.\nExpenditures and health care.\nFactors associated with costs and health outcomes in patients with  back and leg pain in primary care: a prospective cohort analysis.\nPredictive factors of  high societal costs among chronic low back pain patients.\nHealth, absence, disability, and presenteeism cost  estimates of certain physical and mental health conditions affecting  U.\nmeta-synthesis of the impact of low back pain on peoples lives.\nDegenerative disc disease: what is in a name?  Spine 2019; 44: 152329.\nIntervertebral disc as a source of pain.\nassociations with low back pain and activity limitation: a systematic  literature review and meta-analysis.\nA review of lumbar spinal stenosis with intermittent neurogenic  claudication: disease and diagnosis.\ncriteria for the diagnosis of lumbar spinal stenosis: a systematic  literature review.\nLumbosacral radiculopathy:  inciting events and their association with epidural steroid injection  outcomes.\nfrom diagnosis to interventional management.\nPathogenesis, diagnosis, and treatment of lumbar  zygapophysial (facet) joint pain.\nThe stabilizing system of the spine.\nFunction,  dysfunction, adaptation, and enhancement.\nElectrical  high-frequency stimulation of the human thoracolumbar fascia  evokes long-term potentiation-like pain amplification.\nChanges in structure and function of the  back muscles in low back pain: different time points, observations,  and mechanisms.\nA meta-analytic review of  surface electromyography among persons with low back pain and  normal, healthy controls.\nJ Pain 2005; 6: 71126.\nSacroiliac joint pain:  a comprehensive review of epidemiology, diagnosis and treatment.\nNon-specific low back  pain.\nThe relationship between structural and functional  brain changes and altered emotion and cognition in chronic low  back pain brain changes: a systematic review of MRI and fMRI  studies.\nchronic low back pain in humans reverses abnormal brain anatomy  and function.\nThe revised International  Association for the Study of Pain definition of pain: concepts,  challenges, and compromises.\nPain 2020; 161: 197682.\nClinicians views on factors that trigger a sudden onset of  low back pain.\nIndividual recovery expectations and prognosis of outcomes in  non-specific low back pain: prognostic factor review.\nForming beliefs: why valence matters.\nFear-avoidance model of chronic.\nmusculoskeletal pain: 12 years on.\nPain-related fear, pain intensity and function in  individuals with chronic musculoskeletal pain: a systematic review  and meta-analysis.\nCan pain or hyperalgesia be  a classically conditioned response in humans? A systematic review  and meta-analysis.\nThe causes of low back pain: a network.\nHealth care practitioners attitudes.\nand beliefs about low back pain: a systematic search and critical  review of available measurement tools.\nchronic musculoskeletal pain: a state of the art.\nHow important are back pain  beliefs and expectations for satisfactory recovery from back pain?  Best Pract Res Clin Rheumatol 2010; 24: 20517.\nNature or nurture in low back pain? Results of a systematic review  of studies based on twin samples.\nThe prognosis of acute  low back pain in primary care in the United States: a 2-year  prospective cohort study.\nSpine 2012; 37: 67884.\nRelationship between severity of lumbar disc disease and  disability scores in sciatica patients.\nA comprehensive study of patients with surgically treated lumbar  spinal stenosis with neurogenic claudication.\nWhat is the source of chronic  low back pain and does age play a role? Pain Med 2011; 12: 22433.\nlumbar disc herniation: a systematic review and meta-analysis.\nRadiological and radionuclide imaging of degenerative disease of  the facet joints.\nAccuracy of magnetic resonance imaging  in detecting lumbo-sacral nerve root compromise: a systematic  literature review.\nClinical classification in low back  pain: best-evidence diagnostic rules based on systematic reviews.\nQualitative grading of  severity of lumbar spinal stenosis based on the morphology of the  dural sac on magnetic resonance images.\nRed flags  presented in current low back pain guidelines: a review.\nClinical practice guidelines  for the management of non-specific low back pain in primary care:  an updated overview.\nRed flags for  low back pain are not always really red: a prospective evaluation of  the clinical utility of commonly used screening questions for low  back pain.\nEarly identification and  management of psychological risk factors (yellow flags) in patients  with low back pain: a reappraisal.\nDevelopment of a  risk stratification and prevention index for stratified care in chronic  low back pain.\nPain Rep 2017;  2: e623.\nMRI findings of disc  degeneration are more prevalent in adults with low back pain than  in asymptomatic controls: a systematic review and meta-analysis.\nDiagnostic imaging for  low back pain: advice for high-value health care from the American  College of Physicians.\nEffect of MRI on treatment  results or decision making in patients with lumbosacral  radiculopathy referred for epidural steroid injections: a multicenter,  randomized controlled trial.\naccuracy of low-dose versus ultra-low-dose CT for lumbar disc  disease and facet joint osteoarthritis in patients with low back pain  with MRI correlation.\nCan we screen for problematic back pain?  A screening questionnaire for predicting outcome in acute and  subacute back pain.\nA primary care back pain.\nThe predictive ability of the STarT back tool was limited in people  with chronic low back pain: a prospective cohort study.\nUsefulness of four commonly used  neuropathic pain screening questionnaires in patients with  chronic low back pain: a cross-sectional study.\npain sensitivity questionnaire: an exploration of construct validity  and associations with widespread pain sensitivity among individuals  with shoulder pain.\nDiagnosis of psychosocial risk factors in prevention of low  back pain in athletes (MiSpEx).\nInterventions to prevent back pain and back injury in  nurses: a systematic review.\nLancet 2018; 391: 236883.\ncombined with education both prevent episodes of low back pain  and related absenteeism: systematic review and network  meta-analysis of randomised controlled trials (RCTs) aimed at  preventing back pain.\nCatastrophizinga prognostic factor for outcome in patients with  low back pain: a systematic review.\nhold: a qualitative synthesis exploring the experience of chronic  low-back pain.\nClin J Pain 2013; 29: 90716.\nDose or content? Effectiveness of  pain rehabilitation programs for patients with chronic low back  pain: a systematic review.\nBack to basics:  10 facts every person should know about back pain.\nadults with chronic low back pain: program development and  mixed methods feasibility cohort study.\nThe treatment of fear of movement/(re)injury in chronic low back  pain: further evidence on the effectiveness of exposure in vivo.\nCognitive behavioral therapy (CBT) for subacute low back pain:  a systematic review.\nprevention for persistent neck and back pain in a non-patient  population: a randomized controlled trial.\n102 Anheyer D, Haller H, Barth J, Lauche R, Dobos G, Cramer H.\nMindfulness-based stress reduction for treating low back pain:  a systematic review and meta-analysis.\ntreatments for acute, subacute, and chronic low back pain: a clinical  practice guideline from the American College of Physicians.\nback pain: a systematic review for an American College of Physicians  clinical practice guideline.\nEffectiveness of movement control exercise on patients with  non-specific low back pain and movement control impairment:  a systematic review and meta-analysis.\ntechnology-supported exercise therapy for low back pain:  a systematic review.\ndiagnosis, imaging, and self-care for people with low back pain:  a modified Delphi study of consumer and expert opinions.\nfor subacute low back pain: a randomized controlled trial.\nNon-steroidal anti-inflammatory drugs for chronic low back pain.\nLow back pain and sciatica in over.\nsecondary) in over 16s: assessment of all chronic pain and  management of chronic primary pain.\nLondon: National Institute  for Health and Care Excellence, 2021.\nneuropathic pain in adults: a systematic review and meta-analysis.\nEfficacy, tolerability, and dose-dependent effects of opioid analgesics  for low back pain: a systematic review and meta-analysis.\nAnticonvulsants in the treatment.\nof low back pain and lumbar radicular pain: a systematic review and  meta-analysis.\nfor low back pain: a systematic review for an American College of  Physicians clinical practice guideline.\nEpidural steroids: a comprehensive, evidence-based review.\nReg Anesth Pain Med 2013; 38: 175200.\nPhys Med Rehabil Clin N Am 2018; 29: 7392.\nThe effectiveness of lumbar transforaminal injection  of steroid for the treatment of radicular pain: a comprehensive  review of the published data.\nneurologic complications after epidural steroid injections:  consensus opinions from a multidisciplinary working group and  national organizations.\nSafe use of epidural.\ncorticosteroid injections: recommendations of the wip benelux work  group.\nLack of superiority of.\nepidural injections with lidocaine with steroids compared to  without steroids in spinal pain: a systematic review and  meta-analysis.\nDoes epidural bupivacaine with or without steroids  provide long-term relief? A systematic review and meta-analysis.\nEffectiveness of therapeutic lumbar transforaminal epidural steroid  injections in managing lumbar spinal pain.\nA randomized, double-blind controlled trial of lumbar  interlaminar epidural injections in central spinal stenosis: 2-year  follow-up.\ninjections in prevention of surgery for spinal pain: systematic  review and meta-analysis of randomized controlled trials.\nthe diagnostic accuracy and therapeutic effectiveness of sacroiliac  joint interventions.\nsacroiliac joint injections: an evidence-based review of best practices  and clinical outcomes.\nguidelines on interventions for lumbar facet joint pain from a  multispecialty, international working group.\nbased guidelines for facet joint interventions in the management of  chronic spinal pain: American Society of Interventional Pain  Physicians (ASIPP) guidelines facet joint interventions 2020  guidelines.\ndenervation on pain intensity among patients with chronic low  back pain: the mint randomized clinical trials.\nInterpreting the MINT randomized trials evaluating  radiofrequency ablation for lumbar facet and sacroiliac joint pain:  a call from ASRA for better education, study design, and  performance.\nand incorrect presentation of data negatively impact potentially  useful interventional treatments for patients with low back pain:  a critical review of JAMAs MinT study.\nablation for posterior sacroiliac joint complex pain: a narrative  review.\ncord stimulation vs conventional therapies for the treatment of  chronic low back and leg pain: a systematic review of health care  resource utilization and outcomes in the last decade.\nPain Med  2019; 20: 247994.\n140 Amirdelfan K, Yu C, Doust MW, et al.\nimprovement for chronic intractable back and leg pain patients  using spinal cord stimulation: 12-month results from the  SENZA-RCT.\nThe case for restraint in spinal surgery:.\nmanagement of sciatica due to a lumbar herniated disc:  a systematic review.\nconservative care for persistent sciatica lasting 4 to 12 months.\ntreatment for symptomatic lumbar spinal stenosis: a systematic  review of randomized controlled trials.\nfor lumbar spinal stenosis: a systematic review and meta-analysis.\nLumbar fusion versus nonoperative management for  treatment of discogenic low back pain: a systematic review and  meta-analysis of randomized controlled trials.\nPrognostic factors associated with best  outcomes (minimal symptom state) following fusion for lumbar  degenerative conditions.\nFailed back surgery syndrome.\nterm outcome of lumbar fusion in the Swedish lumbar spine study.\nfor chronic back pain in the presence of disc degeneration."}