{"title": "14.pdf", "contents": "Abstract: A challenge in understanding chronic musculoskeletal pain is that research is often siloed between neuroscience, physical therapy/rehabilitation, orthopedics, and rheumatology which focus respectively on 1) neurally mediated effects on pain processes, 2) behavior and muscle activity, 3) tissue structure, and 4) inflammatory processes.\nAlthough these disciplines individually study important aspects of pain, there is a need for more cross-disciplinary research that can bridge between them.\nIdentifying the gaps in knowledge is important to understand the whole body, especially at the interfaces between the silosbetween brain function and behavior, between behavior and tissue structure, between musculoskeletal and immune systems, and between peripheral tissues and the nervous system.\nResearch on mind and body practices can bridge across these silos and encourage a whole person approach to better understand musculoskeletal pain by bringing together the brain and the rest of the body.\nPerspective: Research on chronic musculoskeletal pain is limited by significant knowledge gaps.\nTo be fully integrated, musculoskeletal pain research will need to bridge across tissues, anatomical areas, and body systems.\nResearch on mind and body approaches encourages a whole person approach to better understand musculoskeletal pain.\nPain and the Brain.\nThroughout most of the 20th century, musculoskeletal pain was mainly approached through the lens of orthopedics, focusing on specific structures such as joints or intervertebral discs.\nHowever, in the last 2 decades or so, there has been a shift in emphasis to the neuro-affective components of chronic musculoskeletal pain, including peripheral and central sensitization, reduced descending inhibition, and functional/structural alterations of cortical networks referred to as the pain matrix.\nIn parallel to this evolution in basic pain mechanisms, there has been a shift in our clinical approach to the management of patients with chronic musculoskeletal pain, from a biomedical to a biopsychosocial model.\n23,34,45 There is indeed ample evidence that successfully treating musculoskeletal pain involves more than simply fixing the broken part.\nFunding: No funding sources were provided.\nConflicts of Interest: There are no conflicts to report.\non behalf of United States Association for the Study of Pain, Inc.\nThis has caused the research pendulum to swing away from diagnosing structural causes of musculoskeletal pain and toward psychological factors, such as fear avoidance and depression in predicting how patients with chronic pain respond to treatment.\n26 However, this shift toward the psychological elements of musculoskeletal pain may be neglecting some important sources of peripheral tissue nociception that we have yet to fully understand.\n, muscle, fasciae),1,32 and integrative models are emerging that incorporate plasticity in these tissues as well as the nervous system into an integrated biopsychosocial whole.\n27,31,39 A similar phenomenon is beginning to happen in the field of osteoarthritis.\nWhile earlier studies were focused first on cartilage, then turned to psychological factors, newer integrative models are increasingly incorporating extra-articular connective tissues and muscles as well.\nA more general question then might be: when a patient experiences musculoskeletal pain that lasts more than 3 months, is the pain all in the brain or could there be musculoskeletal tissue pathology that we do not yet fully understand phenotypically, but could contribute to pain chronicity? And if so, how would the musculoskeletal and neuro-affective components interact, and could understanding their interaction help develop better integrative treatment and prevention strategies?.\nMyofascial Tissues: Important Pieces of the Chronic Pain Puzzle.\nThere is much interest in understanding mechanisms of acute to chronic pain transition, most of them involving the nervous system and brain.\n12 However, there is evidence that chronic inflammatory processes within soft tissues could play a role as well, especially with repeated trauma.\n5 Small soft tissue injuries, such as sprains involving connective tissue and/or muscle are common and cause acute pain, inflammation, and muscle spasms that usually resolve within 48 to 72 hours but can progress to chronic pain.\n59 In an animal model, rats who had to pull a lever repetitively for 3 to 6 weeks to get a reward developed chronic macrophage infiltration and fibrosis in tendons, muscles, and loose connective tissue.\n5 Inflammation is important because it can sensitize deep fascia nociceptive neurons,32 and cause tissue acidosis, which has been associated with musculoskeletal pain in several animal models.\nEven when pain and inflammation resolve, scarring and adhesions can cause movement restrictions that accumulate over time.\n29 After an injury or in the presence of muscle disuse, perimuscular and intramuscular fibrosis is a main driver of muscle shortening, atrophy, and fatty infiltration, especially in the presence of inflammation.\n49,57 In humans, cross-sectional studies have shown abnormalities of paraspinal muscles.\nincluding atrophy, fibrosis, and fatty infiltration in patients with chronic low-back pain, compared with controls without back pain.\n53,69,73 However, these measurements tend to be highly variable across subjects and have poor predictive value for future pain or disability.\nFor example, a patient with tight hamstrings, weak multifidi and chronic neck pain may have posture and alignment abnormalities that could underlie all three problems.\nThe recent discovery that a substantial proportion of muscle forces are transmitted to neighboring structures via epimysium and fasciae, in addition to tendons, underscores the importance of understanding if and how muscle function becomes altered when adhesions form between adjacent fascia layers as a result of injury or chronic inflammation.\nAlthough a full personalized phenotypic understanding of musculoskeletal pain for individual patients may not be realistic for some time, a better understanding of myofascial tissue will help to build biomechanical models across multiple body regions.\nThe clinical literature has for decades included descriptions of focal indurated and tender bands or knots commonly found within shortened or weak muscles.\n20,66,71 Following unhabitual exercise or repetitive movement, these focal areas can become spontaneously painful and cause local and/or referred pain that typically resolves within a few days, but commonly recurs in a chronic pattern.\nRemarkably, there has been a near complete lack of imaging methods or animal models to investigate the pathophysiological underpinnings of these clinical observations.\nThis is beginning to change, however, as we are seeing the emergence of new magnetic resonance elastography methods, as well as a rodent model of myofascial trigger points combining a soft tissue injury with repeated bouts of exercise.\n13,40 What role myofascial tissues play in chronic musculoskeletal back pain is clearly a substantial gap area in need of more research.\nA biopsychosocial approach to chronic musculoskeletal pain needs to include not only its biological and psychosocial components, but also how these components influence one another.\nMotor behavior plays a pivotal role in musculoskeletal pain because body movements are both altered by pain and can feed forward to cause further deterioration of musculoskeletal tissues.\nThere is considerable evidence from physical therapy research that patients with low-back pain have altered movement strategies that evolve over time.\nelectromyography activity, reduced trunk counter-rotation, and impaired sensorimotor control.\n35,47 Fear avoidance contributes to the movement impairment, as people become afraid to move and adopt movement strategies that attempt to protect from further injury.\nFear avoidance can ultimately lead to withdrawal and social isolation, with increasing sedentary behavior and deconditioning.\nThere is evidence that body movements influence muscle growth and regeneration4 as well as connective tissue remodeling.\n2,52,72 Importantly, the shape of our musculoskeletal tissues reflects the movements that we do, as well as those that we do not do, such that tissues becomes less mobile in the directions that are not moved habitually due to poor posture and/or sedentary lifestyle.\n18,28,63,65 Sedentary behavior, poor posture, and joint misalignment also can contribute to muscle shortening, fibrosis, and dysfunction.\n74 In a cross-sectional study, participants with chronic low-back pain of more than 12 months duration had on average less shear plane motion between adjacent thoracolumbar fascia layers compared with subjects without low-back pain.\nSimilar findings were seen in another study in pigs, in which a minor fascia injury and movement restriction had additive effects.\n7 These findings suggest that a combination of reduced movement and inflammation can lead to adhesions between adjacent connective tissue layers, thus converting a functional restriction into a structural one.\nAn important current gap in knowledge is whether the presence of fascia adhesions creates abnormal load distributions through tissues that put vulnerable structure such as joints and intervertebral discs at risk of premature degeneration.\nThere is, in general, need for more research on the cumulative effects of motor behavior in everyday activities on the structure and function of musculoskeletal tissues over the lifespan.\nGiven the enormous burden posed by disability due to chronic musculoskeletal pain, as well as the increasing sedentary behavior in contemporary society, it is imperative that we better understand mechanisms that may lead to the progression from soft tissue injury to inflammation, movement restriction, and further deterioration of tissue structure, posture, and movement.\nWe also need more research to identify preventive strategies, such as changing or improving movements, to stop and potentially reverse such a vicious cycle.\nChanging a movement pattern first and foremost requires awareness of the habitual movement or faulty posture.\n51 Mind and body exercises and hands-on movement reeducation aim to bring awareness and correct faulty movement habits and offer a window of opportunity to prevent or reverse tissue abnormalities and reduce pain.\n25,41 On the other hand, less well-studied techniques and exercises that address whole body posture and movement could be useful in helping patients become aware of, and correct, posture and movement habits that may underlie seemingly unrelated musculoskeletal pain in different parts of the body.\nMind and body practices include a large and diverse group of procedures or techniques administered or taught by a trained practitioner or teacher.\nIn general, these practices fall into 3 broad categories: 1) practices whose primary therapeutic input is mental, such as mindfulness-based meditation, cognitive-behavior therapy, hypnosis, and relaxation techniques; 2) body-based treatments such as massage, chiropractic, and acupuncture whose primary input is physical; and 3) practices such as yoga and tai chi whose input is both mindand body-based.\nAlthough these practices fall into the area of complementary therapies, they are increasingly being integrated into conventional treatments such as clinical psychology and physical and exercise therapy.\nA number of studies have shown that techniques with a mind-based component such as meditation, cognitivebehavior therapy, and yoga can enhance pain inhibition.\n24,68 Mind-based therapies also reduce fear of movement and catastrophizing and improve functional behavior in patients with chronic pain.\nImportant further questions are whether reducing fear of movement and changing movement patterns can measurably alter pathological processes with musculoskeletal tissues such as inflammation and fibrosis.\nSeveral studies in animal models have shown that massage and stretching can reduce connective tissue macrophage infiltration, collagen deposition, inflammation, and fibrosis.\n8,9,16 There is also evidence that acupuncture needling mechanically engages connective tissue and may have local effects similar to manual therapies, as well as deactivate myofascial trigger points by eliciting a characteristic twitch response.\n37,40,71 Additionally, the sensory input produced during acupuncture needling seems to have many neuro-affective effects in common with those of mind-based treatments, including descending pain inhibition and activation of pain matrix brain areas.\n33 Mind and body therapies such as yoga and tai chi potentially combine all 3 types of beneficial effects: enhanced descending pain inhibition, behaviorally mediated improvement in movement patterns, and direct stretching of tissues.\nAn overarching challenge of investigating physicalbased therapies, such as massage and spinal manipulation, as well as complex interventions, such as yoga and acupuncture, is that they are difficult to standardize.\nAlthough this can be perceived as an obstacle to rigorous research, it also constitutes a healthy challenge that can motivate better study designs that will benefit research as a whole.\n21 Pragmatic clinical trial designs can test the effectiveness of individualized interventions, while preserving the ecological validity of the treatment.\n64 This includes multimodal treatments delivered as a flexible package where the goal of the study is to compare the overall effect with a control intervention such a drug or other established usual care approach.\nWhile such studies cannot determine whether any given treatment component is responsible for an overall therapeutic effect, this can be tackled by other types of translational studies combining clinical and mechanistic endpoints.\nsubgroups post hoc according to their clinical response to the overall treatment.\n43 These types of analyses can then generate mechanistic hypotheses that can be reverse-translated into animal/and or human studies.\nIntegrative approach to musculoskeletal pain, bridging across neuroscience, physical therapy and rehabilitation, orthopedics, and rheumatology silos.\nbetween 1) neuroscience, which focuses on neutrally mediated effects on pain processes; 2) physical therapy and rehabilitation, which focus on behaviorally mediated effects on muscle activity; 3) orthopedics, which focuses on musculoskeletal tissue structure; and 4) rheumatology, which focuses on inflammatory processes within connective tissues (Fig 1).\nThese are all important aspects of musculoskeletal pain, but there is a need for more cross-disciplinary research that can integrate these disciplines.\nExpanding this concept to other conditions that are often co-morbid with musculoskeletal pain, there is still much to learn about the connections between organ systemssuch as between respiratory and gastrointestinal, between musculoskeletal and gastrointestinal or genitourinary systemswhich can help us think about the whole body and advance our understanding of chronic pain related to conditions such as irritable bowel syndrome and interstitial cystitis.\nBut identifying the gaps in knowledge is important to understand the whole body, especially at the interfaces between the silosbetween brain function and behavior, between behavior and tissue structure, between musculoskeletal and immune systems, and between musculoskeletal tissues and the nervous system.\nSome interdisciplinary groups have been working at these interfaces with promising results.\nPhysical therapy, which traditionally had focused on musculoskeletal function, is increasingly bridging to psychological behavior and neuroscience.\n31 Several neuroscience groups have explored the sensory innervation of deep tissues, as well as the interactions between inflammation and mechanosensation.\ntemporomandibular disorders is increasingly reaching across disciplines, as it is becoming clear that this problem involves musculoskeletal components beyond the temporomandibular joint itself, as well as psychological factors.\n23 Fascia research is an emerging cross-cutting field bridging orthopedics, sports medicine, and rheumatology.\nAn important additional challenge is that, even with more integrated research, musculoskeletal pain is often compartmentalized by body region (e.\n, low back, knee, shoulder, temporomandibular area), such that common basic mechanisms relevant to musculoskeletal pain in general are difficult to synthesize.\nAnother challenging aspect of musculoskeletal research is that specialized tissues and structures such as cartilage and intervertebral discs are often studied in isolation to the tissues anatomically connected to them.\nFor example, studies of periarticular connective tissues often include synovium, ligaments, and joint capsules, but rarely the fasciae and aponeuroses that connect these structures to the rest of the limb or body region.\nImaging of musculoskeletal structures reflects this emphasis, as much as musculoskeletal radiology focuses on bones and joints, and standard clinical MRI methods are not optimized to differentiate soft connective tissue from muscle or fat.\nImproved imaging methods, including dynamic soft tissue imaging, especially if combined with measures of muscle metabolism, can aid in this effort.\nTo be fully integrated, musculoskeletal pain research will need to bridge across tissues, anatomical areas, and body systems.\nResearch on mind and body approaches is well situated by its very nature to encourage a whole person approach to better understand musculoskeletal pain, and this needs to begin by reconnecting the brain with the rest of the body.\nPain 152(3 Suppl):S49-S64, 2011.\nBamman MM, Roberts BM, Adams GR: Molecular regulation of exercise-induced muscle fiber hypertrophy.\nCold Spring Harb Perspect Med 8:a029751, 2018.\nBarbe MF, Barr AE, Gorzelany I, Amin M, Gaughan GP, Safadi FF: Chronic repetitive reaching and grasping results in decreased motor performance and widespread tissue responses in a rat model of MSD.\nBishop JH, Fox JR, Maple R, Loretan C, Badger GJ, Henry SM, Vizzard MA, Langevin HM: Ultrasound evaluation of the combined effects of thoracolumbar fascia injury and movement restriction in a porcine model.\nBove GM, Delany SP, Hobson L, Cruz GE, Harris MY, Amin M, Chapelle SL, Barbe MF: Manual therapy prevents onset of nociceptor activity, sensorimotor dysfunction, and neural fibrosis induced by a volitional repetitive task.\nBove GM, Harris MY, Zhao H, Barbe MF: Manual therapy as an effective treatment for fibrosis in a rat model of upper extremity overuse injury.\nBushnell MC, Ceko M, Low LA: Cognitive and emotional control of pain and its disruption in chronic pain.\nCai L, Gao H, Xu H, Wang Y, Lyu P, Liu Y: Does a program based on cognitive behavioral therapy affect kinesiophobia in patients following total knee arthroplasty? A randomized, controlled trial with a 6-month follow-up.\nChapman CR, Vierck CJ: The transition of acute postoperative pain to chronic pain: an integrative overview of research on mechanisms.\nChen Q, Wang HJ, Gay RE, Thompson JM, Manduca A, An KN, Ehman RE, Basford JR: Quantification of myofascial taut bands.\nAnn Intern Med 154:181-189, 2011.\nCorey SM, Vizzard MA, Bouffard NA, Badger GJ, Langevin HM: Stretching the back improves gait, mechanical sensitivity and connective tissue inflammation in a rodent model.\nDeyo RA, Weinstein JN: Low back pain.\nEdwards E: The role of complementary, alternative, and integrative medicine in personalized health care.\nFritz JM, Cleland JA, Childs JD: Subgrouping patients with low back pain: Evolution of a classification approach to physical therapy.\nGeorge SZ, Beneciuk JM: Psychological predictors of recovery from low back pain: A prospective study.\nBMC Musculoskelet Disord 16:49, 2015.\nHeiderscheit BC, Sherry MA, Silder A, Chumanov ES, Thelen DG: Hamstring strain injuries: Recommendations for diagnosis, rehabilitation, and injury prevention.\nHillier S, Worley A: The effectiveness of the feldenkrais method: A systematic review of the evidence.\nHodges PW, Danneels L: Changes in structure and function of the back muscles in low back pain: Different time points, observations, and mechanisms.\nHoheisel U, Mense S: Inflammation of the thoracolumbar fascia excites and sensitizes rat dorsal horn neurons.\nHuang W, Pach D, Napadow V, Park K, Long X, Neumann J, Maeda Y, Nierhaus T, Liang F, Witt CM: Characterizing acupuncture stimuli using brain imaging with fMRI A systematic review and meta-analysis of the literature.\nKeefe FJ, Main CJ, George SZ: Advancing psychologically informed practice for patients with persistent musculoskeletal pain: Promise, pitfalls, and solutions.\nKoch C, Hansel F: Chronic non-specific low back pain and motor control during gait.\nKrause F, Wilke J, Vogt L, Banzer W: Intermuscular force transmission along myofascial chains: A systematic review.\nLangevin HM, Churchill DL, Wu J, Badger GJ, Yandow JA, Fox JR, Krag MH: Evidence of connective tissue involvement in acupuncture.\nLangevin HM, Fox JR, Koptiuch C, Badger GJ, Greenan Naumann AC, Bouffard NA, Konofagou EE, Lee W-N, Triano JJ, Henry SM: Reduced thoracolumbar fascia shear strain in human chronic low back pain.\nLangevin HM, Sherman KJ: Pathophysiological model for chronic low back pain integrating connective tissue and nervous system mechanisms.\nLomond KV, Jacobs JV, Hitt JR, DeSarno MJ, Bunn JY, Henry SM: Effects of low back pain stabilization or movement system impairment treatments on voluntary postural.\nadjustments: A randomized controlled trial.\nMackichan F, Adamson J, Gooberman-Hill R: Living within your limits: Activity restriction in older people experiencing chronic pain.\nMalay MR, Lentz TA, ODonnell J, Coles T, Mather RC, Jiranek WA: Development of a comprehensive, nonsurgical joint health program for people with osteoarthritis: A pilot case report.\nMarin TJ, Van Eerd D, Irvin E, Couban R, Koes BW, Malmivaara A, van Tulder MW, Kamper SJ: Multidisciplinary biopsychosocial rehabilitation for subacute low back pain.\nMasse-Alarie H, Beaulieu LD, Preuss R, Schneider C: Influence of chronic low back and fear of movement on the activation of the transversely oriented abdominal muscles during forward bending.\nONeill MM, Anderson DI, Allen DD, Ross C, Hamel KA: Effects of Alexander technique training experience on gait behavior in older adults.\nProvenzano PP, Martinez DA, Grindeland RE, Dwyer KW, Turner J, Vailas AC, Vanderby R Jr: Hindlimb unloading alters ligament healing.\nRanger TA, Cicuttini FM, Jensen TS, Peiris WL, Hussain SM, Fairley J, Urquhart DM: Are the size and composition of the paraspinal muscles associated with low back pain? A systematic review.\nRosenberger ME, Buman MP, Haskell WL, McConnell MV, Carstensen LL: Twenty-four hours of sleep, sedentary behavior, and physical activity with nine wearable devices.\nSchweinhardt P: Where has the bio in bio-psychosocial gone? Curr Opin Support Palliat Care 13:94-98, 2019.\nSeminowicz DA, Moayedi M: The dorsolateral prefrontal cortex in acute and chronic pain.\nJ Pain 18:1027-1035, 2017.\nSolomonow M, Zhou BH, Lu Y, King KB: Acute repetitive lumbar syndrome: A multi-component insight into the disorder.\nSuri P, Fry AL, Gellhorn AC: Do muscle characteristics on lumbar spine magnetic resonance imaging or computed tomography predict future low back pain, physical function, or performance? A systematic review.\nThorpe KE, Zwarenstein M, Oxman AD, Treweek S, Furberg CD, Altman DG, Tunis S, Bergel E, Harvey I, Magid DJ, Chalkidou K: A pragmatic-explanatory continuum indicator summary (PRECIS): A tool to help trial designers.\nTurner JA, Anderson ML, Balderson BH, Cook AJ, Sherman KJ, Cherkin DC: Mindfulness-based stress reduction and cognitive behavioral therapy for chronic low back pain: Similar effects on mindfulness, catastrophizing, selfefficacy, and acceptance in a randomized controlled trial.\nVillemure C, Ceko M, Cotton VA, Bushnell MC: Insular cortex mediates increased pain tolerance in yoga practitioners.\nWallwork TL, Stanton WR, Freke M, Hides JA: The effect of chronic low back pain on size and contraction of the lumbar multifidus muscle.\nWeller JL, Comeau D, Otis JAD: Myofascial pain.\nWinslow J, Getzin A, Greenberger H, Silbert W: Fatty infiltrate of the lumbar multifidus muscles predicts return to play in the young athletes with extension-based low back pain.\nYamamoto A, Takagishi K, Kobayashi T, Shitara H, Ichinose T, Takasawa E, Shimoyama D, Osawa T: The impact of faulty posture on rotator cuff tears with and without symptoms.\nYucesoy CA: Epimuscular myofascial force transmission implies novel principles for muscular mechanics.\nZacharias A, Green RA, Semciw A, English DJ, Kapakoulakis T, Pizzari T: Atrophy of hip abductor muscles is related to clinical severity in a hip osteoarthritis population.\nZeidan F, Emerson NM, Farris SR, Ray JN, Jung Y, McHaffie JG, Coghill RC: Mindfulness meditation-based pain relief employs different neural mechanisms than placebo and sham mindfulness meditation-induced analgesia.\nJ Neurosci 35:15307-15325, 2015."}