{"title": "16.pdf", "contents": "Low-Back pain patients learn to adapt motor behavior with adverse secondary consequences.\nWe hypothesize that changes in motor behavior in individuals with low-back pain are adaptations aimed at minimizing the real or perceived risk of further pain.\nThrough reinforcement learning, pain and subsequent adaptations result in less dynamic motor behavior, leading to increased loading and impoverished sensory feedback, which contribute to cortical reorganization and proprioceptive impairments that reduce the ability to control lumbar movement in a robust manner.\nLow-back pain tends to change motor behavior toward increased coactivation, reduced deep muscle activity, and less within-subject variance.\nIn addition to actual benefits with respect to risk and nociception, changes may be driven by maximization of perceived benefits.\nOriginally adaptive changes have negative consequences that may outweigh benefits in the long term.\nINTRODUCTION Low-back pain (LBP) is widely prevalent and, globally, is the leading cause of years lived with disability due to the functional limitations, limited benefits of treatment, and frequent recurrence (15).\nMotor control exercise is a commonly used treatment for LBP.\nAlthough systematic reviews support its effectiveness, like other treatments for LBP, the effect size is not large (33).\nbehind motor control changes in LBP should lead to more effective treatments.\nMotor control in LBP is changed at many levels of the nervous system.\nStudies of individuals with and without LBP have reported differences in voluntary trunk muscle activation (45), trunk muscle reflexes (32), and trunk kinematics (20) and in cortical mapping of sensory inputs from (5), and motor outputs to (36), the trunk.\nHowever, the literature is far from consistent regarding the nature of these differences.\nFor example, according to a systematic review, there is support of both an increase and a decrease of trunk muscle activation in individuals with LBP (45).\nHere, we propose a hypothesis on how LBP affects motor control, which may account for these inconsistencies.\nIn reinforcement learning, a reward (positive reinforcement) or the absence or reduction of a cost (negative reinforcement) increases the likelihood that a performed behavior will be repeated and thus learned.\nIn this context, movement-related pain may function as a negative reinforcement and the sense of being able to prevent pain provocation as a positive reinforcement.\nMotor control can be considered as the outcome of a learning process aimed at optimizing a combination of costs and rewards.\nFor clarity, either costs or rewards usually are inverted, such that a sum of weighted costs can be minimized or a sum of weighted rewards can be maximized.\nIn pain-free conditions, costs associated with control efforts or muscle activation are considered most important.\nWe assume that with LBP, weighting of costs associated with potential loss of control over posture and movement and costs associated with potential pain provocation increase, and one learns to minimize this new weighted sum of costs.\nactivation and movement patterns may differ between individuals, patients with LBP will tend to control posture and movement more rigidly, causing more stereotypical muscle activation and kinematics.\nSuch adaptations entail greater muscle activity, greater compressive loads on the spine, and impoverished sensory feedback in the form of less variability of the afferent signals from the lumbar area.\nThe latter would have the potential to contribute to neuroplastic changes in sensory and motor regions of the cortex and proprioceptive impairments reducing the ability to control lumbar movement in a robust manner.\nThese secondary, long-term effects may contribute to recurrence and chronicity of back pain.\nWe hypothesize that changes in motor control with LBP reflect functional adaptations acquired through reinforcement learning (Fig.\ncauses adaptive motor control changes through reinforcement learning and 2) these adaptations potentially result in negative long-term consequences.\nThe notion that adaptations arise through reinforcement learning is important from a clinical perspective.\nFor the second part of the hypothesis, previous publications have alluded to adverse effects of adaptations (14,45), but that this may contribute to reorganization of the sensory and motor cortex has not been discussed previously.\nThe ideas proposed in this article likely are applicable to other movement-related pain syndromes, but we will limit ourselves here to LBP because this allows more specific testing of the hypotheses.\nThe aims of the present article were to describe this hypothesis.\nIn the first part of the article, we describe how LBP might induce learning that adapts motor behavior.\nWe provide a formalization of this part of the hypothesis in a simple optimization model of trunk motor control, which yields predictions on motor behavior in patients with LBP that we compare with empirical findings.\nIn the second part of the article, we describe how these changes on motor control may lead to adverse physiological, neurological, and mechanical effects and how these secondary effects might contribute to the persistence of LBP.\napproximated by models in which the central nervous system (CNS) is assumed to use some form of optimal control, i.\nIn line with this assumption, pain-free subjects recruit trunk muscles in a manner that is consistent across individuals and compatible with minimization of dynamic costs (42).\nSchematic illustration of the hypothesis on motor control changes with low-back pain (LBP).\nIn normal conditions, motor behavior is somewhat variable.\nbecause many near optimal solutions can be used to achieve the task goal.\nThis is illustrated on the left, with the dotted lines representing near optimal movement trajectories of a marker on the trunk and the circles representing the area of end point positions of this marker over a series of repeated movements.\nWith incidence of LBP, variability will increase because nociception interferes with motor control.\nThe subject will then learn an adapted motor pattern with negative reinforcement by nociception, pain perception, and positive reinforcement because the sense of having control over movement.\nOnce the new optimal pattern (dashed line) is found, motor variability is reduced because costs of movement (pain, potential loss of control) may rapidly increase with changes in behavior.\nThe adapted motor behavior furthermore consists of increased levels of antagonistic contraction and preferential recruitment of muscles with large moment arms.\nThis adaptive behavior may lead to secondary consequences in joint structures and muscles due to increased and more sustained muscle activity and to reorganization of the sensory and motor cortex because of the more stereotypical sensory feedback and selective muscle recruitment.\nThese changes may increase uncertainty about motor control and hence, perceived movement-related threats, which may further reinforce the adaptations in motor behavior.\nExperimentally induced nociception from back muscles, or the resulting pain perception, changes control of trunk muscles in a manner resembling that observed in clinical LBP (9,45).\nNociception may modify motor control online by providing feedback regarding the consequence of the exerted control, possibly even in pain-free conditions.\nIn addition, pain experience is likely to cause anticipatory changes in motor control (38), i.\n, an individual would choose motor strategies to avoid pain provocation.\nWe propose that changes in control arising from nociception and pain can be understood in the context of optimal control.\nOptimal control generally is thought to be the outcome of reinforcement learning.\nEfference copies of the motor commands and feedback on the consequences of the motor actions provide the individual with information on performance and associated costs, allowing adaptation of motor commands to achieve the task goal with minimal costs in terms of neural drive (control effort) or metabolic or mechanical costs of muscle force production.\nIt has been suggested that movement planning occurs sequentially at two hierarchical levels: initially to plan the kinematic trajectory and subsequently to plan a muscle recruitment pattern that fits the planned kinematic trajectory (18).\nIn the present context, adaptation of motor control to changing conditions (the presence of nociception from the spine and the perception of LBP) is of particular interest.\nMany reinforcement learning studies have addressed adaptation in the control of goal-directed arm movements to mechanical perturbations.\nSuch studies show that subjects gradually but consistently adapt to the mechanical perturbations to converge on a near straightline hand trajectory that closely resembles the unperturbed trajectory (18).\n(1) recently applied a similar paradigm to study adaptation of a squat movement to mechanical perturbations that could potentially lead to balance loss.\nThe results differed in important ways from those in goal-directed arm movements.\nFirst, participants converged on an adapted center of mass trajectory after relatively few trials.\nSecond, although individual participants converged on a consistent trajectory, between-subject variance in the adapted trajectories was substantial.\nThese differences were interpreted as indicating that the CNS takes other costs into account in addition to costs of movement.\nSpecifically, the risk of losing balance is significant.\nIf preventing balance loss is an objective of the CNS, then rapid convergence on an adapted trajectory (consistent with experimental results) is of great importance.\nHowever, this may represent a local minimum because further exploration to adapt would involve a steep increase in costs that may actually increase the risk of balance loss.\nMore generally, we suggest that motor control is the outcome of a learning process in which a weighted sum of costs is minimized.\nThe weighted sum comprises costs related to control effort and muscle activity, metabolic costs, and fatigue development, as well as costs that reflect more indirect effects of the selected motor pattern such as the risk of losing control over posture or movement and the possibility of pain provocation.\nIn an individual who had pain, the latter two costs would be expected to receive higher weighting for an individual with LBP than one without pain.\nsimplified model of motor control changes with LBP.\nWe simulate a simple muscle-joint system, representing the trunk, with one degree of freedom, controlled by two extensor muscles and one antagonistic flexor muscle (Fig.\nWe assumed that three costs govern the selection of a muscle recruitment pattern.\nwith A a vector of n (here 3) levels of muscle activation.\nThe value of the exponent p was set to 3 to minimize the loss of muscle force due to sustained activity, which has been shown to accurately predict muscle activity of trunk muscles (42) (reasonable predictions were generated with any p > 1).\nThe second cost is trunk admittance, in which the objective is to maximize the resistance against perturbations.\nIn this simplified model, this effect can be achieved only through increasing muscle stiffness by means of coactivation.\nEffects of muscle contraction on joint stiffness can be modeled as a function of muscle force, muscle length and muscle moment arm (31), which yields the cost function.\nwith F the vector of muscle forces calculated as A * Fmax0, d the vector of muscle moment arms and l the vector of muscle lengths.\nThe third objective function is to minimize nociceptive afference.\nWe used the simple assumption that nociception increases with the total muscle force produced, yielding.\nC3  n i1Fi  p Eq: 3.\nWe arbitrarily set p to 1.\nHowever, results presented in the next sections held over a range of values for p from 0.\nThe costs as functions of the forces in the two extensor muscles are illustrated in the top panels of Figure 2.\nCosts 1 and 3 penalize high muscle forces, whereas cost 2 penalizes low muscle forces.\nwith w the vector of weight factors and by definition P3 j1wj  1.\nThis weighted cost function is minimized subject to the constraint Mnet  n i1Fidi Eq: 5.\nensuring that the three muscles together produce a net moment (Mnet) of 20 Nm.\nThe initial setting for the pain-free condition.\ntive to the load sharing between the two synergistic extensor muscles.\nThis is accomplished by exploring the surface of the weighted cost function and converging on an optimal recruitment pattern that combines the muscle forces with the lowest cost (indicated by an asterisk).\nfunction from w(0) to w(1) shifts the optimal muscle recruitment pattern toward higher activation of the larger of the two extensor muscles, because of the higher weighting of admittance, which favors the muscle with the larger moment arm.\nIn addition, the level of antagonistic coactivation increases.\nFurthermore, the curvature of the surface of the weighted cost function around the optimum solution is steeper for w(1) than for w(0).\nThe model results predict higher coactivation, preferential recruitment of large superficial muscles, and less exploration with pain than in the pain-free condition.\nOf note is that the same model would predict less obvious qualitative changes in muscle activity when higher net moments are produced.\nis because the second cost function, limiting admittance, affects muscle recruitment mainly at low levels of muscle activity, whereas the third cost function, to limit nociception, penalizes high muscle activity.\nIt should be noted that the present cost function for pain is quite simplistic.\nIn reality, it could be that activity of one muscle provokes pain and that of another muscle does not.\nThis would require another formalization of the cost function to minimize nociception.\nHowever, such a cost function is unlikely to be universal as the painful muscle may be different in different individuals.\nTherefore, we choose this simple cost function.\nminimization is based on reinforcement learning.\nThis implies that costs taken into account can reflect perceptions rather than direct information from sensory feedback or efference copies.\nAlthough nociceptive afference may lead to the perception of pain, the presence, intensity, and nature of this perception is shaped by cognitive factors, which include the expectation of pain (4).\nThe objective may be to minimize the perception of pain instead of the nociceptive input or to maximize perceived safety rather than actual robustness of the motor strategy.\nThis introduces the possibility for a feedback mechanism, where one change to the motor strategy leads to a perception of increased safety or decreased pain.\nThis may reinforce the strategy choice despite the possibility that the perception could be unrelated to effects of the movement strategy on actual safety or nociception.\nThis may explain why increasing muscle activity can reduce perceived pain under a constant nociceptive input (19).\nWe recently have provided more specific data to this effect.\nThe upper body center of mass (CoM) is indicated by the red circle, the joint center of rotation (CoR) by the blue circle, with the inclination of the upper body leading to an external moment around the CoR of 20 Nm.\nThe right graphs show in the upper panels the three objectives outlined in the text as a function of forces produced by muscles 1 and 2.\n, any position on the x-y plane, the force in muscle 3 is determined given the constraint function, which requires the three muscles combined to produce an internal moment of 20 Nm.\nThe lower panels illustrate the weighted sum of the three objectives for weight vectors specified in the text, with the pain-free condition (w(0)) on the left and the pain condition (w(1)) on the right.\nThe * indicates the optimum combination of muscle forces for each objective function.\nIt is important to note that the proposed model does not predict local minima of the weighted sum of costs.\nNevertheless, the curvature of the objective function for the condition with pain suggests that individuals might end up using suboptimal solutions because exploration starting from any near optimal point is heavily penalized with changes of the recruitment pattern in most directions.\nThis may occur for pain-related objective functions in kinematic planning because pain often changes nonmonotonically with trunk angle, a socalled painful arc (2).\nCHANGES IN MOTOR BEHAVIOR WITH LBP The proposed reinforcement learning model predicts that individuals with LBP will display 1) greater coactivation, 2) more activity of large superficial muscles, and 3) lower variability in muscle recruitment than individuals without pain.\nThe following sections review the evidence that clinical LBP and experimental noxious stimuli to the low back are associated with changes in motor behavior in line with these predictions.\nCoactivation The model predicts that coactivation increases during pain to reduce admittance.\nNo feedback control was implemented in the model, but a high weighting of an objective to minimize admittance with pain also would predict an increase in feedback gains (47).\nThese changes in muscle recruitment would be associated with small displacements after mechanical perturbations.\nIn line with the model predictions, experiments using experimental noxious stimuli to the low back have shown increased activity of trunk muscles and decreased displacements after trunk perturbations (8).\nIn addition, studies comparing participants with and without LBP have commonly reported increased activity of trunk muscles, particularly in low-intensity activities (45), as proposed by the model.\nMoreover, smaller displacements after perturbations have been found in participants with LBP (7,17).\nThis prediction is supported by studies on anticipatory activation of trunk muscles.\nThese studies have reported reduced and delayed activation of deep muscles relative to superficial muscles after administration of a noxious stimulus to the low back (10).\nIn addition, studies comparing participants with and without LBP have consistently reported delayed recruitment of deep muscles relative to superficial muscles (9,1113,25,28) and earlier activation of the superficial abdominal muscles in participants with LBP (30).\nWithin-Subject Variability The higher weighting of objectives related to admittance and nociception caused the surface of the weighted cost function to be more curved, which would suggest that exploration is limited by pain.\nThis prediction was supported in a recent study, where we applied a force field to the ankle during gait and provided noxious input to the tibialis anterior muscle.\nParticipants with and without pain adapted quickly to the force field to continue walking without loss of balance, but only the participants without pain were able to continue to refine their adaptation; participants with pain continued to use their initially adopted solution (Bouffard J, Salomoni SE, Mercier C, Tucker K, Roy JS, van den Hoorn W, Hodges PW, Bouyer LJ.\nThe limited exploration would lead to a reduced within-subject variance of trunk muscle recruitment and trunk kinematics.\nBoth reduced variance of muscle recruitment patterns after administration of a noxious stimulus to the low back (e.\nNote that our hypothesis would predict an initial increase in variability in response to incident pain because this acutely changes movement-related costs followed by a reduced variability as a result of the steeper increase in the weighted sum of costs with pain.\nThis is in line with differences observed between effects of experimentally induced acute pain and chronic pain in the neck and shoulder region on movement variability (26).\nIndividuals with chronic LBP have been reported to display lower variability of muscle recruitment (6,16) and lower variability of trunk kinematics (22,29) than individuals without pain.\nEffect of Pain-Related Cognitions In line with our hypothesis, the effects of LBP on trunk muscle activity (41) and trunk displacement after perturbations (17) are more pronounced in participants with high scores on pain catastrophizing or fear of movement.\nSimilarly, delayed deep muscle activation was more pronounced in participants with a high fear of pain (39), and variability was decreased in participants with negative pain-related perceptions (6), which persisted after pain had resolved in these participants (30).\nBetween-Subject Variability Although not a prediction of our model, the general hypothesis suggests that different individuals may end up using different motor strategies after the development of LBP because individuals do not explore to find the optimum.\nFormal comparisons of between-subject variability in groups of individuals with and without LBP are lacking, but one systematic review concluded that between-subject variability of trunk kinematics is indeed larger among study populations with LBP than among those without LBP (20).\nConclusions Regarding Motor Behavior in LBP The model used to illustrate the hypothesis that changes in motor behavior with LBP are determined by reinforcement learning, which minimizes uncertainty and pain, is simplified.\nMost importantly, nociceptive inputs or pain experiences may shape the objective function for avoiding pain in a much more complicated way than represented here.\nInconsistency of findings with respect to within-subject variability may be related to the fact that LBP also interferes with motor control through factors such as impaired proprioception (50), or pain-related inhibition (e.\nMoreover, pain-related perceptions moderate the effects of LBP on motor behavior (as proposed by the model), which leads to variance in effects between individuals and between conditions.\nFor instance, adaptive motor behavior may be more obvious in tasks that impose a substantial threat of pain.\nCONSEQUENCES OF CHANGES IN MOTOR BEHAVIOR WITH LBP Although adaptive and with short-term or immediate benefits, changes in trunk motor control due to LBP may have adverse mechanical, physiological, and neurological consequences that, in the long term, may outweigh the benefits.\nIncreased and more sustained trunk muscle activity would come at a cost in terms of muscle and spine loading.\nTrunk extensor contractions at intensities below 5% of maximum activation cause a decline in muscle force capacity within 30 min if variability of activation is low (46).\nPatients maintaining sustained trunk muscle activity, even at a low level, may incur decreased muscle capabilities and related discomfort, or even pain of muscular origin (48), especially in the presence of sensitization.\nIncreased trunk muscle activation to reduce admittance also comes at the cost of increased spinal loading.\nIndividuals with LBP have been shown to expose their spine to higher forces during lifting than individuals without LBP due to coactivation (e.\nFurthermore, low-level coactivation of trunk muscles may occur in LBP patients even at rest (45), implying sustained compression of the spine, which animal models implicate as a cause of intervertebral disc degeneration (23).\nThere also may be adverse mechanical consequences of the decreased variation that would be expected to accompany LBP.\nIt is increasingly recognized that some degree of variation in tissue mechanical loading is essential for tissue health (34).\nIn addition to mechanical consequences, adaptations in trunk control due to LBP can be expected to have neurological consequences.\nReduced variability in posture and movement likely yields impoverished afferent feedback.\nWe hypothesize that this may contribute to the changes in representations of the trunk in the somatosensory (37) cortex observed with LBP.\nIn turn, these changes in the sensory cortex could contribute to the impaired proprioception (35) and the related imprecision in control of trunk movement in individuals with chronic LBP (50).\nFurthermore, conventional muscle recruitment patterns, with relative inhibition of deep muscle activity, are associated with changes in representations of trunk muscles on the motor cortex in individuals with LBP (5).\nthe reduced motor variability (30), may limit the ability to relearn normal motor control even after LBP has receded.\nCONCLUSIONS To further test the hypothesis that motor behavior changes in individuals with LBP are the result of a reinforcement learning process  in which potential loss of control over posture and movement and provocation of pain would be minimized  several avenues of research could be explored.\nManipulation of nociception and pain as a function of motor behavior could be used to shape objective functions and, when used as such, test the hypothesis that strategies to avoid the painful stimulus develop through exploration and reinforcement.\nFurthermore, the predictions of our model that within-subject variance of trunk motor behavior is smaller in individuals with LBP than in individuals without pain needs further study, as does the prediction that between-subject variance is higher among individuals with LBP.\nThe proposed hypothesis, specifically the potential for changes in motor behavior to underpin adverse secondary effects, indicates that interventions targeting these changes may be needed despite their initially adaptive nature.\nFurthermore, the hypothesis suggests that motor control exercises should be aimed at increasing admittance, inhibition of superficial muscles and stimulation of deep muscles, training of proprioception, or instilling confidence in the ability to control lumbar motion.\nFinally, when designing interventions, the potential for a reduced ability to relearn normal motor control because of the presence of pain and the secondary effects thereof needs to be considered.\nThe preparation of this article was facilitated by a Koselleck award by the Deutsche Forschungsgemeinschaft to Herta Flor.\nPaul Hodges is supported by a research fellowship (APP1102905) and program grant (APP1091302) from the National Health and Medical Research Council of Australia.\nClinical observation of standing trunk movements: what do the aberrant movement patterns tell us? J.\nMechanical stability of the in vivo lumbar spine: implications for injury and chronic low back pain.\nPsychological pain interventions and neurophysiology: implications for a mechanism-based approach.\nExtensive reorganization of primary somatosensory cortex in chronic back pain patients.\nThe study of the variability of anticipatory postural adjustments in patients with recurrent non-specific low back pain.\nChanges in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nHodges PW, Coppieters MW, MacDonald D, Cholewicki J.\nPain and motor control of the lumbopelvic region: effect and possible mechanisms.\nExperimental muscle pain changes feedforward postural responses of the trunk muscles.\nHodges PW, Richardson CA.\nInefficient muscular stabilization of the lumbar spine associated with low-back-pain a motor control evaluation of transversus abdominis.\nDelayed postural contraction of transversus abdominis in low back pain associated with movement of the lower limb.\nAltered trunk muscle recruitment in people with low back pain with upper limb movement at different speeds.\nMoving differently in pain: a new theory to explain the adaptation to pain.\nPeople with chronic low back pain exhibit decreased variability in the timing of their anticipatory postural adjustments.\nFear of movement is related to trunk stiffness in low back pain.\nThe cost of moving optimally: kinematic path selection.\nLearned maintenance of pain: muscle tension reduces central nervous system processing of painful stimulation in chronic and subchronic pain patients.\nComparing lumbo-pelvic kinematics in people with and without back pain: a systematic review and metaanalysis.\nEffects of experimentally induced pain and fear of pain on trunk coordination and back muscle activity during walking.\nEffects of chronic low back pain on trunk coordination and back muscle activity during walking: changes in motor control.\nThe pain-adaptation model: a discussion of the relationship between chronic musculoskeletal pain and motor activity.\nWhy do some patients keep hurting their back? Evidence of ongoing back muscle dysfunction during remission from recurrent back pain.\nChanges in the degree of motor variability associated with experimental and chronic neck-shoulder pain during a standardised repetitive arm movement.\nSpine loading in patients with low back pain during asymmetric lifting exertions.\nCorticomotor control of deep abdominal muscles in chronic low back pain and anticipatory postural adjustments.\nTrunk coordination in healthy and chronic nonspecific low back pain subjects during repetitive flexion-extension tasks: effects of movement asymmetry, velocity and load.\nReduced variability of postural strategy prevents normalization of motor changes induced by back pain: a risk factor for chronic trouble? Behav.\nAn equation to calculate individual muscle contributions to joint stability.\nMuscle response pattern to sudden trunk loading in healthy individuals and in patients with chronic low back pain.\nMotor control exercise for chronic non-specific low-back pain.\nMotor variability in occupational health and performance.\nIs there a relationship between lumbar proprioception and low back pain? A systematic review with meta-analysis.\nISSLS prize winner: smudging the motor brain in young adults with recurrent low back pain.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nSimilar alteration of motor unit recruitment strategies during the anticipation and experience of pain.\nAre fear avoidance beliefs associated with abdominal muscle activation outcome for patients with low back pain? Physiother.\nvan den Hoorn W, Hodges PW, van Dien JH, Hug F.\nRelationships between coping strategies and lumbar muscle activity in subjects with chronic low back pain.\nTrunk muscle recruitment patterns in patients with low back pain enhance the stability of the lumbar spine.\nEvidence for a role of antagonistic cocontraction in controlling trunk stiffness during lifting.\nTrunk muscle activation in lowback pain patients, an analysis of the literature.\nIdentifying intrinsic and reflexive contributions to low-back stabilization.\nPathophysiology of upper extremity muscle disorders.\nInfluences of nonspecific low back pain on three-dimensional lumbar spine kinematics in locomotion.\nPrecision control of trunk movement in low back pain patients.\nUnauthorized reproduction of this article is prohibited."}