{"title": "17.pdf", "contents": "Abstract: Movement is changed in pain.\nThis presents across a spectrum from subtle changes in the manner in which a task is completed to complete avoidance of a function and could be both a cause and effect of pain/nociceptive input and/or injury.\nMovement, in a variety of forms, is also recommended as a component of treatment to aid the recovery in many pain syndromes.\nSome argue it may not be sufficient to simply increase activity, whereas others defend a necessity to consider how a person moves.\nThere is unlikely to be a simple relationship between pain and movement, as both too little and too much movement could be suboptimal for the health of the tissues.\nThe interaction between pain, (re)injury, and movement is surprisingly unclear.\nTraditional theories to explain adaptation in the motor system in pain are unable to account for the variability observed in laboratory and clinical practice.\nNew theories are required.\nTreatments that focus on physical activity and exercise are the cornerstone of management of many pain conditions, but the effect sizes are modest.\nThere is limited consensus when, if, and how interventions may be individualized and combined.\nThe aim of this narrative review was to present current understanding of the interaction between movement and pain; as a cause or effect of pain, and in terms of the role of movement (physical activity and exercise) in recovery of pain and restoration of function.\nMovement in a variety of forms is recommended as a treatment to aid recovery in all kinds of pain syndromes, and this can range from encouraging regular physical activity1,2 to specific exercise approaches that modify how people complete a task.\n3 Although these issues seem straight forward, the reality is far from clear.\ncomplexity are only beginning to be understood.\n4,5 Important questions continue to be debated.\nIs movement inhibited as a simple mechanism to avoid further pain and injury? Is avoidance of movement driven by cognitive learning processes that can be changed? Are movement changes beneficial in the shortand long-term or are they part of the problem? Current theories cannot answer these questions or explain the diversity of changes observed in clinical and experimental contexts.\nAs a component of management of the person in pain it is generally accepted that maintenance or resumption of activity is important, at least to reduce disability and increase quality of life.\n6 Clinical trials,7 systematic reviews,8,9 and clinical practice guidelines10 all recommend that advice to remain or become active is better than advice to rest for management of acute and chronic back pain.\nExercise is considered to have an analgesic effect11,12 and prevent development of chronic pain.\n13 When pain persists and becomes chronic, cognitive-behavioral approaches are advocated that use graded exposure to physical activity while challenging cognitions that cause avoidance of movement and activities; or operant conditioning techniques to encourage and reward gradual increase of physical activity and discourage attention to pain.\nBut is it that simple? Recent evidence indicates exercise-induced analgesia may be absent in musculoskeletal pain as a result of central sensitization, and exercise can increase pain.\n14 Some argue it may not be sufficient to simply increase activity, but is it necessary to also consider how a person moves?15 There is unlikely to be a simple relationship between pain and activity as both too little and too much movement could be suboptimal for tissue health.\n16,17 The effectiveness of active treatments is likely to depend on the individual and are unlikely to be optimal if implemented in a generic manner without consideration of the individual.\nThe scope of issues that have an impact on the application of exercise approaches to pain management must be explicitly explored.\nThe aim of this narrative review was to consider the contemporary view of how movement changes in pain; the potential benefits and consequences of these changes in the short-term and long-term; and the role of movement and physical activity in recovery from pain and restoration of function.\nSpinal pain is drawn on as an example as it is associated with a wealth of research investigation, but has far from ideal clinical outcomes.\nHOW IS MOVEMENT CHANGED IN PAIN? When pain is acute the nervous system takes action to remove real or anticipated threat to the tissues and this can be achieved by motor output.\nThe authors declare no conflict of interest.\nsimple nociceptive reflex mechanisms from the source of threat to the tissues; muscle activation may be modified to splint the painful part18; muscle activation may be inhibited to reduce the amplitude or velocity of a painful movement19; or an activity involving the painful area (in)directly may be avoided20 (Fig.\nWhen pain is chronic the motor system changes and its relevance for protection of tissues is less clear.\nAlthough the presence of changes in motor control is undeniable, the explanation for how and why it occurs and its relevance for ongoing pain remain debated.\n4 Although older theories of motor adaptation in pain provide some understanding21,22 they do not explain the complexity of response identified in clinical and experimental contexts.\nFeatures of the Motor Adaptation to Pain and Limitations of the Existing Theories Early physiological theories argued for simple stereotypical changes in motor output in response to nociceptive input.\n21,22 The vicious-cycle theory advocated increased muscle activity (spasm) and subsequent stimulation of nociceptive afferents by accumulation of metabolites secondary to ischemia induced by muscle contraction.\n22,23 The failure to observe these changes universally led to the proposal of more versatile, but still predictable, pain adaptation theory that predicted reduced activation (inhibition) of agonist muscles and increased activation (facilitation) of antagonist muscles.\n21 Such changes were observed during simple voluntary movements and forcecontrolled tasks of one or few joints,24 and were related to an objective to reduced amplitude, velocity, or force of a painful movement.\nThese theories explained some subtle deviations in muscle coordination (Fig.\n1) using simple brain stem and spinal cord mechanisms.\n21 Animal studies revealed changes in excitability of spinal motoneurons that could underpin some of these effects.\n25 In parallel, other theories aimed to explain changes at the other end of the spectrum (Fig.\n1) and proposed cognitive-emotional mechanisms for complete or relative avoidance of motor functions.\nIt was argued that movement and function are avoided (kinesiophobia) as a result of fear of pain or (re)injury, mediated by catastrophizing thoughts about the pain experience and hypervigilance.\ntoward painful sensations, with the net outcome of disuse and disability.\n20 Although this is supported by evidence26 and is relevant for subgroups in the pain population,27 it cannot and does not attempt to explain more subtle deviations in motor behavior and changes in individuals who do not express avoidant behaviors.\n28 There is a void between existing theories and the spectrum of presentations.\nSeveral issues require consideration.\nFirst, clinical conditions are rarely typified by stereotypical and systematic changes in muscle activation.\nSecond, although early theories proposed spinal and brain stem mechanisms, motor control also changes when pain/nociception is anticipated in the absence of peripheral nociceptive input.\nThird, although cognitive-emotional mechanisms account for top-down effects in some individuals, they do not attempt to explain subtle changes in motor control or changes in individuals without negative cognitions.\nA comprehensive understanding of motor adaptation to pain must account for changes across the spectrum.\nFourth, theories should account for the possibility that changes in movement may precede and contribute, at least in part, to the development and maintenance of pain and/or injury.\nFifth, models must recognize the different types of pain (eg, nociceptive, neuropathic, and centrally maintained pain36) and pain presentations from highly disabled individuals to those who maintain high level function with occasional recurring episodes of pain.\nFinally, theories must dismiss the notion of a simple relationship to nociceptive stimulation and consider the subjective experience of pain.\nAlthough early theories may not be wrong, they fail to explain the diversity of adaptation identified in the presence of pain.\nNew models can be inclusive of the existing theories, but must account for the issues presented above.\nSubtle modification of force direction or stress distribution.\nModification of loading at adjacent regions.\nEnhanced or reduced movement variation.\nReduced force  output.\nActivity and/or participation limitation.\nSpectrum of changes in motor behavior expressed by people in pain.\nMotor adaptation can present in many phenotypes, from subtle changes in the manner that a task is completed, to complete avoidance of movement/function, with varying impacts on activity and participation and potentially important implications for selection of treatments that involve movement (physical activity/ exercise).\nMovement Adaptation May Follow or Precede Pain/Injury Adaptation in motor behavior in pain may be: (1) a reaction to nociceptor input/pain or injury; (2) a reaction to the threat of these; or (3) secondary to some tertiary factor and contribute to the development of pain.\nIn an acute pain episode motor function may adapt in response to an acute noxious input from a chemical, thermal, or mechanical stimulus.\nAbnormal mechanical tissue loading or injury that ultimately leads to nociceptor stimulation can result from a sudden large amplitude load such as in whiplash injury,39 a repetitive or sustained low-level load,40 or a combination.\nThere is a complex relationship between loading, dosage of exposure, and injury, and why some people become injured, whereas others do not.\n41 The motor system adapts quickly and may do so as a process of trial and error as an optimal solution is searched for.\n42 Alternatively, a motor behavior may be suboptimal, leading to abnormal tissue loading and injury that ultimately stimulates nociceptors.\nNociceptive input/Pain/injury or threat of pain/injury.\nChanged motor output/mechanical behaviour Changes in stiffness, external force  direction, load distribution (within  muscle, between muscles), variability,  Force & movement amplitude).\nload demand exceeds ability/ tolerance (individual).\nBeneficial: Protection of the  injured/painful part Change load on tissue source of nociceptive input (May be sensitised) (eg, splint, reduce load, etc.\nMAJOR Avoidance of movement.\nMotor cortex (excitability/ organisation) Sensory cortex Cognitive-emotional Sensory integration Sensorimotor mismatch Brain stem Spinal cord (eg, inhibition/ excitation) Receptor injury Muscle.\nChanges in the motor system across the spectrum from subtle modification to avoidance of function can be both a cause and effect of injury, nociceptive input, and/or pain.\nUsing a range of mechanisms at multiple regions in the distributed sensory and motor systems, motor control is modified and may present both positive and negative outcomes for the individual.\nWhen, if, and how movement should be addressed to influence this cycle is a topic of ongoing debate, but will require consideration of the multiple underlying mechanisms.\nmovement of the spine during hip rotation,43 or competing functions of the muscle system such as competition between roles of the trunk muscles for spine control and breathing in respiratory disorders.\n44 Regardless of whether the modified movement behavior was the cause or effect of an initial tissue injury/ pain or threat of these, suboptimal tissue loading could be relevant for the ongoing health of the tissues.\nThis may drive a peripheral contribution to the pain cycle, particularly in the presence of peripheral and central sensitization (see below).\nMovement Adaptation Involves a Spectrum of Presentations Although motor system adaptations in pain is diverse and ranges from complete avoidance of a task to redistribution of activity within and/or between muscles, the overarching purpose may be a universal objective to protect the painful part from further pain or injury, at least in the acute phase.\nThere are numerous examples of complete or relative avoidance of movement, activity, and participation, such as avoidance of flexion to end range,45 avoidance of sitting, and avoidance of work or sport, respectively.\nMore subtle motor adaptations include redistribution of activity between and within muscles,18 which may occur in a manner that either sustains the motor output such that the goal of the task is maintained, but with modified distribution of load in the tissues, or fails to maintain motor output.\nIn the case of the former, force may be maintained, but with a different mechanics.\nFor instance the distribution of force may be modified by redistribution of activation of motor units within a muscle,46 altered activation of synergist muscles,18 or redistribution of load between limbs.\nAlternatively, the output might not be sustained.\nReduced gait speed47 and decreased capacity to maintain maximal force48 are both examples.\nThese subtle adaptations may not prevent activity and participation, but instead change mechanics in a manner that has short-term benefit.\nThere is a potential conflict between protecting the painful part from further pain or injury at the one hand, and realizing current activities in daily life despite pain in order to protect important life goals.\nThese conflicts are conceptualized within the avoidance-endurance49 and goal pursuit50 model of pain.\nMovement Adaptation is Individual Specific Older theories of adaptation to pain and injury predicted stereotypical changes in motor output.\nAlthough some stereotypical changes have been observed, such as reduced masseter muscle activity during acute experimental pain,19 this is not universal.\nFor instance, when pain is induced experimentally in the low back, although most participants achieve a net outcome of increased spine protection, they all engaged different patterns of modified muscle activity.\n18 Individual variation may be caused by differences in fear-avoidance beliefs, habitual postures and movements, experience, and differences in anatomy and structure.\nSome clinical approaches aim to reduce the complexity of the individual variation by allocation of patients into subgroups, based on clustering of features, including motor.\nbehaviors such as movement characteristics that provoke or relieve symptoms.\n51,52 Lending support to this approach, features of these subgroups seem to be grossly consistent with variants of motor adaptation induced by an acute noxious stimulus.\nAdaptation in the Motor System Aims to Protect the Painful, Injured, or Threatened Body Region Whether the adaptation involves subtle change or complete avoidance of participation, the overarching purpose seems to be reduced risk for further injury, nociceptive input and pain; that is, to protect the body part.\nSubtle changes in the manner in which a task is performed may unload a painful, injured, or threatened tissue.\nAvoidance of participation aims to overtly prevent exposure to a situation that may load or threaten the injured part.\n53 In the context of acute tissue damage, and in the context of sensitization, this adaptation seems logical and relates to the fundamental principal that pain is a motivator to remove threat.\nOne issue highlighted recently is that adaptation to pain is not always the most obvious solution.\nWhen presented with an obvious alternative movement strategy to relieve pain, such as a particular direction of movement that is pain free, this is not always selected by the nervous system (Bergin M, Tucker K, Vicenzino B, Hodges P, unpublished data, 2013).\nThis implies that multiple factors have to be considered in addition to the benefit of reduced nociceptive discharge and tissue protection.\nIn some cases movement behaviors are provocative.\nFor instance, people who experience pain when sitting in lumbar flexion often continue to adopt this position.\n54 This apparently maladaptive behavior might be most prevalent in cases where it preceded the onset of pain.\nMovement Adaptation has Long-term Consequences That Will Depend on the Type of Pain Although potentially beneficial in the short-term to protect the part, adapted motor behaviors may have long-term consequences if they persist beyond when they are necessary (eg, beyond the time of tissue healing), exceed what is necessary (eg, modify load in a manner that is greater than that which could be beneficial), or are inappropriate for what is necessary (eg, change in motor control when there is no real threat to the tissues, such as when pain is threatened but without any tissue damage or nociceptive input33; or complete avoidance of movement with resultant physical deconditioning55).\nAlthough ongoing peripheral nociception is not necessary for development of chronic pain, motor adaptation will continue to be relevant in the subgroup of patients with ongoing excitation of nociceptive sensory neurons.\n56 This may be particularly important when sensitization is present, or if a new source of peripheral nociception is initiated as a result of changed loading on structures secondary to modified movement patterns.\nAlthough the initial motor adaptation may have been beneficial to protect the painful/injured body region, if maintained there are a number of mechanisms for the adapted strategy to contribute to ongoing pain.\nComplete or relative avoidance of movement as explained by the fearavoidance model will lead to deconditioning and disuse20 and a compromised capacity to meet physical demands.\nWhy does motor adaptation persist beyond when it is necessary? There are several possibilities.\n(1) The nervous system may fail to return to its preinjury/pain motor strategy.\nAlthough pain motivates a change to movement, removal of pain may not provide impetus for movement recovery.\nIf feedback is immediate the nervous system is motivated to change behavior, but as the consequences of tissue loading takes time to develop, the outcome is unlikely to be anticipated and no such motivation to modify behavior exists.\n(2) Ongoing anticipation, threat, or fear of potential pain and/or injury may motivate the maintenance of the adapted strategy.\nFor example, fear of pain maintains absence of trunk extensor muscle relaxation during flexion.\n45 (3) Central or peripheral sensitization render the link between motor adaptation and the pain experience less clear, with neither maintenance of the adaptation nor its recovery directly related to pain.\n(4) The modified motor behavior could lead to secondary biomechanical or neurophysiological changes that prevent return to the prepain state.\nAlthough not observed universally,59 atrophy and fatty infiltration of the multifidus muscle in back pain,6062 and the supraspinatus muscle in tendinopathy,63 adaptive muscle length/stiffness changes,64 and increased or decreased muscle strength65 would limit the potential for the motor system to recover motor function.\nIf a patients symptoms are neuropathic with pain attributable to a lesion or dysfunction in the nervous system66 the motor adaptation may still be relevant regardless of whether there is a mechanical aspect to the neuropathic symptoms.\nThis could present as augmented muscle activation to reduce load on neural tissues such as hamstrings muscle activation in the presence of sciatica67 or simple avoidance of movement of the painful segment.\nAlthough the adaptation may have little direct relevance to the development or maintenance of pain, the adapted behavior is likely to lead to secondary changes in other tissues.\nIn this case modification of motor system would not modify the neuropathic source of pain, but prevent or reduce nociceptive input from secondary issues.\nCentral sensitization involves amplification of neural signaling at multiple regions of the CNS.\n68,69 After the initial insult, central reorganization occurs, and in some this underpins the maintenance of pain without ongoing peripheral nociception as a result of hyperalgesia, allodynia, compromised central pain modulatory mechanisms (descending and/or ascending), cognitive-emotional issues, and potential conflict between sensory and motor events.\nMovement adaptation requires consideration for a number of reasons.\nFirst, persistent nociceptive input can contribute to the maintenance of central sensitization.\n70 Suboptimal control of movement may contribute to the ongoing input and, in the presence of a sensitized system, lesser stimuli will be required to sustain nociceptive input.\nSecond, pain may involve mechanisms that relate to central processing of motor and sensory activity71 such as a mismatch between motor output and sensory input, and disturbed body image.\nMovement may be relevant; not from the perspective of abnormal tissue loading, but the disturbed body image may make it difficult to learn movement patterns.\nThird, stressinduced analgesia from physical activity that is normally mediated by descending opioid and nonopioid brain circuits is absent and the link to motor adaptation will be less clear.\nWhether rehabilitation of the adapted motor behavior is relevant for recovery of symptoms, depends on the underlying mechanism.\nIt is important to consider that the mechanism for persistence of pain may differ from the mechanism that initiated pain.\nAlthough biomechanics may underpin the onset of nociceptive input and pain, and ongoing biomechanical issues could mediate maintenance of nociceptive pain, other cognitive and biological processes may also be responsible; and each requires a different treatment approach.\nMovement Adaptation Involves Multiple Mechanisms That are not Mutually Exclusive There is ongoing debate regarding the neural mechanisms that underlie motor adaptation in pain.\nPain, injury, or their threat can change motor control at multiple levels of the nervous system, from cognitive-emotional aspects of the pain experience to the spinal cord.\nThese mechanisms are not mutually exclusive and can interact.\nEarly animal studies showed spinal mechanisms for motoneuron excitation and inhibition from noxious input.\n25 Other work showed inhibition of extensor muscles by afferent input from injured tissue.\n78 These mechanisms imply stereotypical adaptation to nociceptive input, and although they may contribute to motor adaptation, they cannot explain the diversity of presentations,18 the nonlinear relationship between nociceptive input and motor adaptation,30 or motor adaptation induced by the threat of pain without nociceptive input.\n32,33 Reflex adjustments constitute the simplest mechanisms for adaptation of movement to remove threat.\nFlexor withdrawal reflexes are the most widely studied.\n79 Although reflexes may maintain involvement in chronic pain, such as protective muscle spasm when sensitized nerve is stretched,80 they cannot explain the diversity of adaptation.\nHigher nervous system mechanisms have been identified.\nReorganization of the motor and sensory cortical representations in pain imply modified sensorimotor interaction71 as evidenced by shift in motor area for specific muscles,81 smudging between adjacent motor82 and sensory regions,83 and changes in cortical map threshold or volume.\n84 Cognitive-emotional mechanisms are a major factor in motor adaptation.\n49,85 Although fear of pain and injury underpins avoidant behaviors, considerable research has highlighted the specific psychosocial features that mediate and moderate the effect on movement.\nAccording to the Fear-Avoidance Model, when confronted with a new episode of pain, individuals86,87 with a tendency to negative affectivity, will start to develop catastrophizing thoughts (erroneous beliefs) leading to fear of pain, injury, and movement.\n86,87 This process can be further fueled by hypervigilance to signals that might indicate harm or pain.\nThis leads to avoidance or escape from movement and development of safety behaviors.\nAlthough this behavior seems adaptive in the short term, in the long term this leads to functional disability, disuse, and depression, which enhance the vulnerability to pain.\nThe Avoidance-Endurance Model49 implies a patients cognitions and beliefs can underpin a strategy to complete a task despite pain, with the outcome of overuse of the motor system leading to additional pain and injury and subsequent rest until the pain subsides.\nWHAT IS THE ROLE OF MOVEMENT IN RECOVERY FROM PAIN? Movement and physical activity (including general physical activity, exercise, specific motor learning) are advocated in the management of many musculoskeletal conditions to reduce pain and disability in acute and chronic conditions, and to prevent the transition from an acute to chronic state.\nIt is also advocated to reduce disability despite persistence of pain.\nImportant and largely unresolved issues require consideration.\nFirst, the mechanisms by which movement and physical activity affect pain are debated.\nTreatment is likely to be optimized if the mechanism is known.\nThis may differ between conditions, types of pain, individuals, and different movement interventions.\nSecond, there is a paradox; physical activity is encouraged in pain, but physical activity may provoke pain.\nRegardless of the mechanism for maintenance of modified movement behaviors in persistent pain states, it is essential to consider whether restoration or rectification of these issues is a relevant target for treatment, that is, if and how the adaptation contributes to the ongoing pain.\nVarious biological, psychological, and social factors are potential mediators of the transition to persistent pain.\nKey factors that include peripheral and central sensitization,68 cognitive-emotional features of the pain response,27 social issues such as those related to high job demands, low work support, or satisfaction96 contribute to, this transition.\nAlthough restoration of motor adaptations may be neither sufficient nor necessary for recovery in a number of these cases, movement issues cannot be dismissed.\nThe motor system is a biological factor within the bio-psycho-social model and interacts with other domains.\nFor instance, attitudes to pain influence movement behavior.\n42,45 The relative importance of biological, psychological, and social factors will vary between individuals; movement may be critical for the primary pain condition for some, and for others movement changes may be relevant for secondary conditions, such as development of knee pain secondary to modified movement patterns in back pain.\nMechanisms for Movement and Physical Activity to Change Pain and Disability and the Implications for Treatment Movement and physical activity may influence pain and disability by several mechanisms.\nanalgesic effects to a contribution to cognitive-behavioral processes and require further consideration.\nImmediate Analgesic Effects of Exercise and Impact on Central Pain Processing In pain-free individuals, aerobic exercise and resistance training trigger centrally mediated pain inhibition presumably by the release of endogenous opioids [bendorphines from the pituitary (peripherally) and hypothalamus (centrally) activating the m-opioid receptors] and growth factors, through the periaqueductal gray, activating the descending nociceptive inhibitory systems.\n98,99 Catecholamines suppress the release of excitatory transmitters of primary afferent nociceptors and postsynaptic responses of pain relay neurons in the spinal cord.\nExercise can also: enhance experience of other bodily sensations such as heart beat, sweating that diverts attention from pain; activate gate control through afferent input from skin and muscles; and activate conditioned pain modulation by nociceptive afferent input from other regions secondary to ischemia and lactate accumulation.\n14 As evidence, movement reduces pressure pain thresholds.\n100 Although effective in pain-free individuals, the effectiveness in chronic pain is unclear.\n101 Exercise-induced endogenous analgesia may be dysfunctional in patients, and exercise might therefore increase pain, particularly in individuals with central sensitization, which is characterized by nonsegmental spreading of pain, difficulties with concentration and fatigue, stress-intolerance, and hypersensitivity to stimuli such as bright light and touch (for review see Nijs and colleagues14,29).\nHowever, this may only apply to a subgroup as central sensitization is the dominant pain mechanism in only 23% of chronic low back pain patients.\nThis concurs with the finding that exercise-induced analgesia is experienced in chronic back pain, but not in chronic fatigue syndrome and whiplashassociated disorder.\nExercise That Aims to Correct Motor Control Several approaches to optimization of motor control have been proposed52,104 with the objective to correct features of muscle activation, postural alignment, and movement patterns that abnormally load tissues.\n105 The science underpinning this approach is sound, and mechanics may explain the onset of injury or nociceptor discharge, but tissue loading may or may not be involved in transition to chronicity.\nThus, restoration of motor control might not be relevant for recovery for some individuals and some argue that attention to motor control is unnecessary.\n106,107 Although clinical trials and subsequent systematic reviews point to the efficacy of interventions that address these issues,108115 evidence is not yet conclusive as other trials have not shown higher effectiveness than more general exercise.\n116,117 Issues such as optimal selection of patient subgroups and individualization of treatment have been questioned and need to be addressed.\nTheoretically, individuals with a persistent nociceptive component should benefit from improved motor control.\nSeveral issues require consideration.\nFirst, optimal outcomes are expected if exercise is targeted to the individual presentation based on careful assessment.\nSecond, optimization of motor control may be particularly relevant for a sensitized system.\ninteraction between motor adaptation and psycho-social features requires consideration.\nFourth, motor control training requires consideration of multiple mechanisms from muscle, to the spinal cord and the supraspinal centers.\nFifth, as pain is a potent stimulus for adaptation, pain relief in conjunction with exercise would be relevant whether pain is nociceptive, neuropathic, or centrally maintained.\nIn fact, positive effects of aerobic exercise and back extensor muscle strengthening have been shown to be mediated by reduced catastrophizing thoughts, rather than increased aerobic capacity or strength.\n118 Likewise, cognitive-behavioral treatments such as graded physical activity increase self-efficacy and decrease catastrophization leading to secondary gain of functional ability.\nIt is characterized by a systematic and repeated exposure to sensations, movements, or activities the patient fears.\nThis is achieved by: identification of fears; explanation why the feared stimuli, movement, or activities can be performed without further harm; challenge of catastrophic thoughts by experience with the movement/activity associated with fear.\nThis process aims to lower threat-value of stimuli, and reduce perception of harmfulness of the movements and activities.\nStrategies to Reverse/Prevent Disuse and Deconditioning Moderate to strong evidence indicates that a more active lifestyle is better for the general health and prevention of morbidities.\n124 Although, it remains debated whether deconditioning is common in patients with chronic pain,125,126 the association between a less active lifestyle and greater pain and disability is strong.\n127 The possibility to resume activities has broad benefits for those with chronic pain including enhancement of opportunities to re-engage in social roles.\nMultimodal Integration of Movement and Activity Interventions That Target Different Mechanisms Integration of approaches that target the different mechanisms outlined above has potential benefits, but has not been well investigated.\nNotably, whether attention to how a person moves adds additional benefit to increasing how much they move should be a major priority in pain research.\nRecent work showed greater clinical effect of treatment based on comprehensive classification of patients on the basis of movement characteristics and psychosocial presentation to select treatment, than manual therapy and exercise in chronic low back pain.\n108 Despite methodological issues, this is the first trial to tease out the factors,.\nacross multiple dimensions, which may contribute to maintenance of pain and disability.\nOther studies show that graded exposure without consideration of movement quality does not have adverse effects in back pain and CRPS patients,130 follow-up has been limited to 6 or 12 months, so no definite conclusions can be drawn.\nPhysical Activity as a Cause or Consequence of Pain Advice to stay active is the cornerstone of management of the patient with acute back pain and advocated in clinical practice guidelines internationally.\nIn chronic pain, graded return to activity is advocated as the optimal approach.\nAlthough there is no convincing evidence that a specific type of exercise or cognitive-behavioral treatment is most effective,131 some argue that the latter is more cost effective,7 yet, the overall clinical effect size is low to moderate.\n131 Regardless, it is generally accepted that back pain outcome is better in those who remain active, with some provisos such as early identification of more serious pathologies.\n132 Engagement in sport was associated with less back pain, and, in women, there was a moderate risk for greater back pain for participants both with a sedentary lifestyle and involvement in strenuous physical activities.\nFurther work is needed to resolve this quandary.\nFrom another perspective, symptom flare-ups after exercise often lead to early dropout in treatment.\nCognitive-emotional sensitization should be addressed concurrently with cognitive-behavioral techniques such as education, graded activity, etc.\n, as well as other techniques to modulate pain such as pain relieving modalities.\nHowever, the evidence for transcutaneous electrical nerve stimulation135 and virtual reality136,137 is scarce, and effects of medication are small with risk of side effects.\n138 What could go wrong if pain is not taken into account? Can increased walking, bending, and lifting cause additional damage in a patient with a movement pattern that potentially loads the tissues suboptimally? Motor adaptation to nociception and pain often persist despite the relief.\nClin J Pain  Volume 31, Number 2, February 2015 Relationship Between Pain and Activity.\n139141 For instance, multifidus muscle atrophy is not reversed when back pain resolves.\n139 Why the adaptation does not resolve is not clear.\nOne explanation is that although the nervous system has a refined capacity to respond and adapt to immediate feedback such as pain provocation, there is limited potential to predict and adjust to long-term outcomes such as the potential consequences of maintenance of a suboptimal strategy.\nThis may justify implementation of motor control (re)training strategies for patients with chronic pain.\nGiven the disrupted body image this also seems reasonable.\nFurther, if chronic nociception inhibits motor output, as predicted by some models of motor-nociception interaction, this could be interpreted to be contradictory and even fruitless.\n71 Evaluation of whether the failure of resolution of motor control dysfunction is relevant for recovery requires more valid and reliable assessments for motor control,142 and more methodologically sound and adequately powered studies.\nAlthough no evidence shows motor control exercise is harmful, how this approach interacts with other interventions requires consideration.\nFor example, graded exposure approaches emphasize not paying attention to pain and this may be hampered if a motor control intervention is added that advocates attention to aspects of movement that provoke pain.\nIf a structural lesion is present but not well diagnosed and treated, starting to move might increase the risk of compounding the problem.\nFor example, an ankle sprain with concomitant limitation of dorsiflexion that is not well treated will likely induce compensatory external rotation of hip, decreased knee flexion at heelstrike, and increased hip circumduction during swing phase.\nConsistent with contemporary models of pain adaptation, the short-term benefit of these adaptations to enable walking could underpin long-term consequences such as development of secondary problems at the knee, hip, and back through excessive loading.\nThis example highlights the potential relevance of addressing suboptimal features of movement in association with increased activity.\nCONCLUSIONS Contemporary models that aim to unify understanding of divergent changes in the sensorimotor system are enhancing understanding of why people move differently in pain, yet there is much still to learn, particularly with respect to the interaction between pain and movement over time and the ideal methods to apply and combine (or not) treatments.\nFrom a clinical point of view, 2 options could be justified.\nOne option would be to first trial training that increases activity with dosage controlled to limit flareups, followed by attention to optimization of motor control once the patient is more active.\nAnother option would be to first train motor control to optimize tissue load before augmenting activity.\nThere is insufficient evidence to justify one approach over the other, and limited evidence that exercise of either dimension contributes to a normalization of central nervous system processing of pain.\nThis issues should be a priority for ongoing research.\nEfficacy of different types of aerobic exercise in fibromyalgia syndrome: a systematic review and meta-analysis of randomised controlled trials.\nMoving differently in pain: a new theory to explain the adaptation to pain.\nDiagnosis and treatment of low back pain.\nMore is not always better: cost-effectiveness analysis of combined, single behavioral and single physical rehabilitation programs for chronic low back pain.\nAdvice to rest in bed versus advice to stay active for acute low-back pain and sciatica.\nExercise therapy for chronic nonspecific low-back pain.\nAiraksinen O, Brox JI, Cedraschi C, et al.\nEuropean guidelines for the management of chronic nonspecific low back pain.\nRegular physical activity prevents development of chronic pain and activation of central neurons.\nDysfunctional endogenous analgesia during exercise in patients with chronic pain: to exercise or not to exercise? Pain Physician.\nEffect of classification-specific treatment on lumbopelvic motion during hip rotation in people with low back pain.\nSpine loading characteristics of patients with low back pain compared with asymptomatic individuals.\nFunction, dysfunction, adaptation, and enhancement.\nNew insight into motor adaptation to pain revealed by a combination of modelling and empirical approaches.\nBilateral experimental muscle pain changes electromyographic activity of human jaw-closing muscles during mastication.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nThe pain-adaptation model: a discussion of the relationship between chronic musculoskeletal pain and motor activity.\nA critical review of the evidence for a painspasm-pain cycle in spinal disorders.\nThe peripheral apparatus of muscle pain: evidence from animal and human studies.\nThe effect of muscle pain on elbow flexion and coactivation tasks.\nFear reduction in patients with chronic pain: a learning theory perspective.\nThe relation between pain-related fear and disability: a meta-analysis.\nThe fear avoidance model disentangled: improving the clinical utility of the fear avoidance model.\nExperimental muscle pain changes feedforward postural responses of the trunk muscles.\nAn occupational pain study.\nDoes anticipation of back pain predispose to back trouble? Brain.\nWhat harmpain behavior? Psychological and physical factors in the development of chronicity.\nSurface electromyography in the identification of chronic low back pain patients: the development of the flexion relaxation ratio.\nThe discriminative validity of nociceptive, peripheral neuropathic, and central sensitization as mechanisms-based classifications of musculoskeletal pain.\nDisuse and physical deconditioning in the first year after the onset of back pain.\nPrognosis for patients with chronic low back pain: inception cohort study.\nDo individuals who develop transient low back pain exhibit different postural changes than non-pain developers during prolonged standing? Gait Posture.\nVan Dillen LR, Gombatto SP, Collins DR, et al.\nSymmetry of timing of hip and lumbopelvic rotation motion in 2 different subgroups of people with low back pain.\nReduced postural activity of the diaphragm in humans when respiratory demand is increased.\nEvidence for the role of psychological factors in abnormal paraspinal activity in patients with chronic low back pain.\nMotor unit recruitment strategies are altered during deep-tissue pain.\nSimmonds MJ, Lee CE, Etnyre BR, et al.\nInhibition of maximal voluntary contraction force by experimental muscle pain: a centrally mediated mechanism.\nDiagnosis and classification of chronic low back pain disorders: maladaptive movement and motor control impairments as underlying mechanism.\nMayer TG, Polatin PB, Gatchel RJ.\nFunctional restoration and other rehabilitation approaches to chronic musculoskeletal pain disability syndromes.\nMok NW, Brauer SG, Hodges PW.\nA dynamical systems approach to lower extremity running injuries.\nThe association of physical deconditioning and chronic low back pain: a hypothesis-oriented systematic review.\nRapid atrophy of the lumbar multifidus follows experimental disc or nerve root injury.\nEvidence of lumbar multifidus muscle wasting ipsilateral to symptoms in patients with acute/subacute low back pain.\nChanges in the crosssectional area of multifidus and psoas in patients with unilateral back pain: the relationship to pain and disability.\nAsymmetric atrophy of the supraspinatus muscle following tendon tear.\nDifferences in symmetry of lumbar region passive tissue characteristics between people with and people without low back pain.\nInfluence of age and duration of symptoms on fibre type distribution and size of the back muscles in chronic low back pain patients.\nClin J Pain  Volume 31, Number 2, February 2015 Relationship Between Pain and Activity.\nCentral sensitization: implications for the diagnosis and treatment of pain.\nCentral sensitization: a generator of pain hypersensitivity by central neural plasticity.\nPainful neuropathy: altered central processing maintained dynamically by peripheral input.\nNociception affects motor output: a review on sensory-motor interaction with focus on clinical implications.\nBrain correlates of stressinduced analgesia.\nPerception of pain after resistance exercise.\nConditioned stress-induced analgesia in humans.\nStress-induced analgesia in humans: endogenous opioids and naloxone-reversible depression of pain reflexes.\nBoecker H, Sprenger T, Spilker ME, et al.\nKnee joint effusion and quadriceps reflex inhibition in man.\nModular organization of human leg withdrawal reflexes elicited by electrical stimulation of the foot sole.\nTsao H, Galea MP, Hodges PW.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nTsao H, Danneels LA, Hodges PW.\nAbnormal somatosensory homunculus in dystonia of the hand.\nStrutton PH, Theodorou S, Catley M, et al.\nCorticospinal excitability in patients with chronic low back pain.\nHuijnen IP, Kindermans HP, Seelen HA, et al.\nEffects of selfdiscrepancies on activity-related behavior: explaining disability and quality of life in patients with chronic low back pain.\nWideman TH, Asmundson GG, Smeets RJ, et al.\nTactile acuity is disrupted in osteoarthritis but is unrelated to disruptions in motor imagery performance.\nNeglect-like tactile dysfunction in chronic back pain.\nTactile acuity and lumbopelvic motor control in patients with back pain and healthy controls.\nSpatially defined disruption of motor imagery performance in people with osteoarthritis.\nThe role of paraspinal muscle spindles in lumbosacral position sense in individuals with and without low back pain.\nCentral sensitization and altered central pain processing in chronic low back pain: fact or myth? Clin J Pain.\nChanges in head and neck position have a greater effect on elbow joint position sense in people with whiplash-associated disorders.\nCorticomotor excitability of back muscles is affected by intervertebral disc lesion in pigs.\nDeficits in neuromuscular control of the trunk predict knee injury risk: a prospective biomechanical-epidemiologic study.\nCentral modulation of exercise-induced muscle pain in humans.\nSpecific therapeutic exercise of the neck induces immediate local hypoalgesia.\nReduced pressure pain thresholds in response to exercise in chronic fatigue syndrome but not in chronic low back pain: an experimental study.\nLack of endogenous pain inhibition during exercise in people with chronic whiplash associated disorders: an experimental study.\nTherapeutic Exercise for Lumbopelvic Stabilisation: A Motor Control Approach for the Treatment and Prevention of Low Back Pain.\nTrunk muscle stabilization training plus general exercise versus general exercise only: randomized controlled trial of patients with recurrent low back pain.\nLeeuw M, Goossens ME, van Breukelen GJ, et al.\nExposure in vivo versus operant graded activity in chronic low back pain patients: results of a randomized controlled trial.\nEfficacy of classification-based cognitive functional therapy in patients with non-specific chronic low back pain: a randomized controlled trial.\nDoes it matter which exercise? A randomized control trial of exercise for low back pain.\nLong term effects of specific stabilizing exercises for first episode low back pain.\nEvaluation of specific stabilizing exercise in the treatment of chronic low.\nThe efficacy of a treatment program focusing on specific stabilizing exercises for pelvic girdle pain after pregnancy: a two-year follow-up of a randomized clinical trial.\nEffect of motor control exercises versus graded activity in patients with chronic nonspecific low back pain: a randomized controlled trial.\nMacedo LG, Maher CG, Latimer J, et al.\nSpecific stabilisation exercise for spinal and pelvic pain: a systematic review.\nA randomized controlled trial on the effectiveness of a classification-based system for subacute and chronic low back pain.\nThe effectiveness of the McKenzie method in addition to first-line care for acute low back pain: a randomized controlled trial.\nReduction of pain catastrophizing mediates the outcome of both physical and cognitive-behavioral treatment in chronic low back pain.\nIs adherence to pain self-management strategies associated with improved pain, depression and disability in those with disabling chronic pain? Eur J Pain.\nCan we identify how programmes aimed at promoting self-management in musculoskeletal pain work and who benefits? A systematic review of sub-group analysis within rcts.\nA randomized controlled trial of exposure in vivo for patients with spinal pain reporting fear of work-related activities.\nReduction of pain-related fear and disability in post-traumatic neck pain: a replicated single-case experimental study of exposure in vivo.\nReduction of painrelated fear in complex regional pain syndrome type 1: the application of graded exposure in vivo.\nDomains of physical activity and all-cause mortality: systematic review and dose-response meta-analysis of cohort studies.\nThe deconditioning paradigm for chronic low back pain unmasked? Pain.\nCause or effect? Deconditioning and chronic low back pain.\nRelationship between physical activity and disability in low back pain: a systematic review and meta-analysis.\nPhysical conditioning as part of a return to work strategy to reduce sickness absence for workers with back pain.\nBehavioral treatment for chronic low-back pain.\nSafety of pain exposure physical therapy in patients with complex regional pain syndrome type 1.\nGraded activity and graded exposure for persistent nonspecific low back pain: a systematic review.\nPhysical activity and low back pain: a u-shaped relation? Pain.\nA research synthesis of therapeutic interventions for whiplash-associated disorder (WAD): part 4noninvasive interventions for chronic wad.\nIsometric exercise has opposite effects on central pain mechanisms in fibromyalgia patients compared to normal controls.\nPain reducing effect of three types of transcutaneous electrical nerve stimulation in patients with chronic pain: a randomized crossover trial.\nThe neurobiology of virtual reality pain attenuation.\nScientific evidence for the effectiveness of virtual reality for pain reduction in adults with acute or chronic pain.\nSerotonin and noradrenaline reuptake inhibitors (snris) for fibromyalgia syndrome.\nMultifidus muscle recovery is not automatic after resolution of acute, firstepisode low back pain.\nInefficient muscular stabilisation of the lumbar spine associated with low back pain: a motor control evaluation of transversus abdominis.\nWhy do some patients keep hurting their back? Evidence of ongoing back muscle dysfunction during remission from recurrent back pain.\nAn investigation of the reproducibility of ultrasound measures of abdominal muscle activation in patients with chronic non-specific low back pain."}