{"title": "46.pdf", "contents": "Lumbar range of motion in chronic low back pain is predicted by  taskspecific, but not by general measures of painrelated fear.\nAbstract Background: Most studies fail to show an association between higher levels of pain related fear and protective movement behaviour in patients with chronic low back  pain (CLBP).\nThis may be explained by the fact that only general measures of pain related fear have been used to examine the association with movement patterns.\nThis  study explored whether taskspecific, instead of general measures of painrelated  fear can predict movement behaviour.\nMethods: Fiftyfive patients with CLBP and 54 healthy persons performed a lifting  task while kinematic measurements were obtained to assess lumbar range of motion  (ROM).\nScores on the Photograph Daily Activities SeriesShort Electronic Version  (PHODASeV), Tampa Scale for Kinesiophobia and its Activity Avoidance and  Somatic Focus subscales were used as general measures of painrelated fear.\nThe  score on a picture of the PHODASeV, showing a person lifting a heavy object with  a bent back, was used as taskspecific measure of painrelated fear.\nResults: Lumbar ROM was predicted by taskspecific, but not by general measures  of painrelated fear.\nOnly the scores on one other picture of the PHODASeV, similar  to the taskspecific picture regarding threat value and movement characteristics, predicted the lumbar ROM.\nCompared to healthy persons, patients with CLBP used  significantly less ROM, except the subgroup with a low score on the taskspecific  measure of painrelated fear, who used a similar ROM.\nConclusions: Our results suggest to use taskspecific measures of painrelated fear  when assessing the relationship with movement.\nIt would be of interest to investigate  whether reducing taskspecific fear changes protective movement behaviour.\nSignificance: This study shows that lumbar range of motion in CLBP is predicted by  taskspecific, but not by general measures of painrelated fear.\nThis suggests that  both in clinical practice and for research purposes, it might be recommended to use  taskspecific measures of painrelated fear when assessing the relationship with  movement behaviour.\nThis may help to disentangle the complex interactions between  painrelated fear, movement and disability in patients with CLBP.\nThe fearavoidance model postulates that catastrophic  thoughts about pain can lead to painrelated fear, which in  turn may result in avoidant behaviour (Crombez, Eccleston,  Damme, Vlaeyen, & Karoly, 2012; Vlaeyen, Crombez, &  Linton, 2016).\nWhile the temporary avoidance of certain activities might be beneficial in case of acute injury, this behaviour becomes maladaptive once the tissues have healed  (Hodges & Smeets, 2015).\nThis is relevant for patients with  chronic low back pain (CLBP) in particular, because in about  90% of this population no pathoanatomical cause can be detected to explain the pain (Maher, Underwood, & Buchbinder,  2017).\nDespite the absence of clear tissue damage, a subgroup  of patients with CLBP adopts a protective movement strategy  by stiffening the spine, resulting in a reduced lumbar range of  motion (ROM) during active movements (O'Sullivan, 2005).\nBased on the fearavoidance model, it has been hypothesized that especially patients with CLBP who are displaying  higher levels of painrelated fear would show this protective behaviour (Geisser, Haig, Wallbom, & Wiggert, 2004).\nAlthough painrelated fear has been associated with a reduced  active lumbar range of motion (Geisser et al.\n, 2004; Thomas &  France, 2008), most studies do not support such a relationship  (Demoulin et al.\n, 2013; Karayannis, Jull, Nicholas, & Hodges,  2018; Marich, Hwang, Salsich, Lang, & Dillen, 2017; Vaisy et  al.\n, 2015; Vincent et al.\nThe discrepancy between the  abovementioned hypothesis and the results from crosssectional studies could possibly be explained by the fact that only  general measures of painrelated fear, such as the Tampa scale  for kinesiophobia (TSK) and the Fearavoidance beliefs questionnaire (FABQ), have been used to examine the association  with movement patterns.\nAlthough some patients with CLBP  may present with a generalized fear of movement, others might  be fearful of particular activities only, without achieving a high  score on the TSK or the FABQ.\nAs such, taskspecific measures of painrelated fear could be more appropriate to assess  the relationship with movement patterns (Leeuw, Goossens,  Breukelen, Boersma, & Vlaeyen, 2007; Oliveira et al.\nIf patients do not resume their normal movement patterns  after an acute episode of low back pain (LBP), but maintain  a protective movement behaviour, the latter can become a  source of ongoing peripheral nociceptive input by loading  the spine in a suboptimal manner, which in turn can contribute to the persistence of CLBP (Hodges & Smeets, 2015;  O'Sullivan, 2005).\nTherefore, painrelated fear may not only  influence central pain processing but also peripheral pain  mechanisms.\nFrom a clinical perspective, it would be of interest to identify modifiable factors that are related to movement patterns which deviate from those of healthy persons.\nThis would allow to specifically target therapy towards these  sources of altered movement, potentially leading to improved  treatment outcomes for patients with CLBP.\nIn this study, a standardized lifting task was used to  examine the association between lumbar ROM and measures of painrelated fear in patients with CLBP.\nWe hypothesized that lumbar ROM during a lifting task would  be predicted by taskspecific, but not by general measures  of painrelated fear.\nSecond, based on the observation that  painrelated fear can generalize to movements that are  proprioceptively similar to the initial painful movement  (Meulders & Vlaeyen, 2013), we expected that patients  who are fearful of activities similar to lifting would perform the lifting task with less lumbar ROM.\nFinally, the  lumbar ROM of healthy persons and patients with CLBP  was compared with each other.\nWe hypothesized that patients with lower scores on the taskspecific measure of  painrelated fear would have a similar lifting pattern compared to healthy persons, whereas patients who selfreport  fear of lifting would use less lumbar ROM.\nThis crosssectional study is a preplanned analysis of baseline measurements of a randomized controlled trial (Matheve,  Brumagne, Brumagne, Demoulin, & Timmermans, 2018).\nAll the data presented in this paper were collected on the  same day.\nFiftyfour healthy persons and 55 patients with chronic non specific LBP participated in this study.\nParticipants were recruited via private GP and physiotherapy practices and via  social media.\nTo be included, participants needed to be between 18 and 65 years old, and patients had to be diagnosed  with chronic nonspecific LBP (>3 months, 3 days/week).\nExclusion criteria for both participant groups were signs and  symptoms of nerve root involvement, a serious underlying  disease, pregnancy, performance of lumbopelvic movement  control exercises in the past year and musculoskeletal complaints other than LBP interfering with daily functioning (e.\nHealthy participants were excluded when  they experienced at least 1 day of selfreported LBP in the  past year that interfered with daily life activities or sought  professional help for their LBP in the past year (Sorensen,  George, Callaghan, & Dillen, 2016).\nPersons willing to participate in the study were initially screened via a structured  telephone interview, and eligibility was confirmed when participants arrived in the laboratory, prior to the start of the tests.\nEthical approval was obtained from the Ethics Committees of  Hasselt University and Jessa Hospital, Belgium.\nAll participants gave written informed consent before being included  in the study.\nFirst, participants completed a series of questionnaires after  which a movement analysis was performed during a lifting  task.\nHealthy participants and patients with CLBP Sociodemographic variables: Age, sex, height and weight  were collected.\n, 2011):  Participants were asked to indicate the intensity of their present LBP and the average intensity of their LBP over the  past 7 days on a 0 to 10 numeric rating scale (0 = no pain,  10 = worst imaginable pain).\nRoland Morris Disability Questionnaire (RMDQ) (Roland  & Morris, 1983): The RMDQ contains 24 questions about  the effect of LBP on daily activities, which have to be answered with yes or no.\nPain Catastrophizing Scale (PCS) (Sullivan, Bishop, &  Pivik, 1995): The PCS contains 13 questions relating to the  patients negative thoughts and feelings during pain.\nEach  question has to be answered on a 5point scale (0 = not at all,  4 = always), resulting in a score between 0 and 52.\nTampa Scale for Kinesiophobia (TSK) (Vlaeyen, Kole Snijders, Boeren, & Eek, 1995): The TSK is a questionnaire  containing 17 items to assess subjective ratings of fear of  movement/reinjury due to physical activity.\nThe total score  (TSKtotal) ranges between 17 and 68, with a higher score  indicating a higher level of kinesiophobia.\nThe activity  avoidance subscale (TSKAA) specifically measures activity  avoidance and fear of reinjury, whereas the Somatic Focus  subscale (TSKSF) assesses to which extent patients believe  that their LBP can be attributed to a serious underlying medical  problem (Goubert et al.\nBecause it has previously been  hypothesized that the TSKAA might be a better predictor for  the lumbar ROM than the TSKtotal or TSKSF (Demoulin et  al.\nForty consecutive pictures  of daily life activities are shown on a computer screen.\nthe activities are harmful to their back on a 0 to 100 scale  (0 = not harmful at all, 100 = extremely harmful).\nThe score (range 0100) on  picture number 3 of the PHODASeV, which displays a  person lifting a flower pot with a bent back (see Supporting  Information Figure S1a), was defined a priori as a task specific measure of painrelated fear (PHODAlift), as this  picture best resembles the task that participants in the current study had to perform.\nLifting task The participants started from their habitual standing position.\nThey were then asked to lift a box with handles from  a platform, to remain in an upright standing position for one  second and to put it down again (Supporting Information  Figure S1b).\nTo standardize the lifting task for the participant's height, the top of the box was positioned 10 cm below  the apex of the subjects' patella.\nThe dimensions  of the box were 40  30  23.\n5 cm, and it weighed 4 kg.\nkinematic data acquisition The Valedomotion research tool (version 1.\n2; Hocoma,  Switzerland) was used to obtain lumbopelvic kinematics in the  sagittal plane.\nThis tool consists of wireless inertial measurement sensors that have an accuracy of 0.\nlumbopelvic kinematics have been previously shown (Bauer  et al.\n, 2015; Matheve, De Baets et al.\nFirst, the L1 and  S1 levels were palpated in a standardized way (Tixa, 2015).\nHereafter, the system was calibrated and the sensors were  placed at the level of the spinous process of L1 and S1 using  doublesided tape.\nBoth the palpation and sensor placement  were performed with the participant in a relaxed standing position.\nThe movement analysis started by recording the habitual  standing position of the participants.\nFor each repetition, the  maximal deviation from the starting position was calculated  and expressed in absolute values.\nLumbar spine angles were  calculated from the orientation of the L1sensor relative to that  of the S1sensor.\nTo obtain a more reliable measurement of  the movement patterns, an average of the five repetitions was  calculated.\nFurther details on the data acquisition can be found  elsewhere (Matheve, De Baets et al.\nA multiple linear regression was performed to examine the  predictive value of painrelated fear for the lumbar ROM  during the lifting task.\nFirst, a basic model was constructed  that only contained the controlling variables age, sex, current  pain, pain catastrophizing, duration of LBP and disability.\nThese variables were controlled for as they might influence  lumbar ROM (Arshad, Pan, Reitmaier, & Schmidt, 2018;.\n, 2009; Laird, Gilbert, Kent, & Keating, 2014;  Marich et al.\n, 2017; Vaisy et al.\nNext, for every measure of painrelated fear (i.\nTSKtotal, TSKAA, TSKSF,  PHODAtotal, PHODAlift), a separate regression analysis was made by adding the respective measure to the basic  model.\nThis resulted in five additional regression models,  each containing the same set of controlling variables, but a  different measure of painrelated fear.\nSingle correlation coefficients were used to analyse  whether the lumbar ROM was associated with any of the  scores on the individual pictures of the PHODASeV, other  than the PHODAlift.\nScores of pictures showing a  significant correlation with the lumbar ROM were entered  in a regression analysis together with the same controlling  variables as described above.\nFirst,  healthy persons were compared with the CLBP group as a  whole.\nSecond, to assess whether painrelated fear influenced  this comparison, patients with CLBP were categorized into  subgroups of low (n = 18), medium (n = 18) or high (n = 19).\nTSKAA (832)a  16 (1320).\nBMI: body mass index; LBP: low back pain; Pain 7 days: average pain in the past 7 days; PCS: Pain catastrophizing scale; PHODAlift: score on the taskspecific picture of the PHODASeV; PHODAtotal: total score  on the PHODASeV; RMDQ: Roland Morris Disability Questionnaire; TSKAA: score on the Activity  Avoidance subscale of the TSK; TSKSF: score on the Somatic Focus subscale of the TSK; TSKtotal: total  score on the Tampa Scale for Kinesiophobia.\nData are mean (SD), unless otherwise stated.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nBasic  model + TSKtotal Sex [F] 0.\nBasic  model + PHODA total.\nBasic  model + PHODA lift.\nBeta indicates that female sex is associated with a larger range of motion.\nTABLE 2  Regression models  predicting lumbar range of motion during  the lifting task.\nlevels of painrelated fear by using the lowermost, middle and  uppermost thirds of the actual scores on the measure of pain related fear (Karayannis et al.\nThis subgroup analysis  was performed for each of the painrelated fear measures.\nDunnett's post hoc test was used to compare each subgroup  of patients (low, middle or high level of painrelated fear)  with the group of healthy persons.\nBaseline characteristics of the participants can be found in  Table 1.\nA total of 178 patients with CLBP and 56 healthy  participants were screened for participation.\nReasons for exclusion can be found in Supporting Information Figure S2.\nThe results from the regression analyses are presented in  Table 2.\nIn all of the models, female sex was predictive for  an increased lumbar ROM and current pain had a negative  predictive value for lumbar ROM.\nPHODAlift was negatively associated  with lumbar ROM, indicating that patients who scored higher  on the PHODAlift used less lumbar ROM during the lifting  task.\nWhen the scores on picture 1 were  added to the basic regression model, they explained an additional 6% of the variance in lumbar ROM (p = 0.\nIn each of the regression analyses used to compare lumbar ROM between healthy persons and (subgroups of) patients with CLBP, the variable group was significant (see  Supporting Information Table S1).\nPost hoc tests indicated  that the whole group and all the subgroups of patients with  CLBP used significantly less ROM compared to the healthy  subjects (all pvalues  0.\nwas present between the ROM of the healthy persons and the  patients with a low score on the PHODAlift (p = 0.\nThe aim of this study was to investigate whether taskspecific or general measures of painrelated fear were predictive for the lumbar ROM during a lifting task.\nSecond, we expected that patients who were fearful of  activities similar to lifting would perform the lifting task with  less lumbar ROM.\nOnly the scores on picture 1, displaying  a person shovelling soil, were predictive for lumbar ROM  during the lifting manoeuver.\nlow, medium and high) based on the  painrelated fear scores used significantly less ROM than the  healthy control group, except the subgroup with low scores  on the taskspecific measure of painrelated fear, which used  a ROM similar to the healthy subjects.\nMoreover, the reduction in painrelated fear is  predictive for a better treatment outcome in this population,  which implies that this fear should be addressed when present (Wertli et al.\nTo achieve this, Vlaeyen, Morley,  Linton, Boersma, and Jong (2012) developed a graded exposure in vivo treatment for patients with CLBP who are displaying elevated levels of painrelated fear.\nBased on this information, patients will (gradually) be exposed to feared movements and  activities.\nThis could be considered as a  limitation of the construct validity of the PHODASeV, and  therefore, it has been recommended to relate PHODASeV  scores with the performance on behavioural tests (Leeuw et  al.\nBecause the scores on the  PHODAlift were indeed predictive for the lumbar ROM  during a lifting task, the results of this study suggest that the  PHODASeV is a valid instrument for establishing a fear hierarchy and further support the use of taskspecific behavioural.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nTABLE 3  Correlations between scores on individual pictures of the PHODASeV and lumbar range of motion during lifting.\nScore on item Correlation  with ROM pvalue Median (IQR) Mean (SD).\n1 Shovelling soil 84 (7092) 79.\nsquatting 16 (530) 21.\n7 Ironing while standing 30 (1550) 31.\n39 Mowing lawn 60 (3371) 53.\n31 Lifting toddler from cot 59 (4370) 56.\n19 Back twisting 33 (2050) 36.\n32 Carrying child on hip 50 (3765) 49.\n26 Getting out of bed 35 (1555) 37.\nsquatting 16 (526) 17.\n14 Clearing out dishwasher 54 (3470) 50.\n25 Making bed 50 (2470) 50.\n23 Rope skipping 31 (1356) 34.\n34 Running through forest 25 (1440) 28.\n4 Picking up shoes.\n35 Walking through forest 5 (115) 10.\n11 Carrying shopping bag.\n18 Leg stretching 27 (1941) 32.\n36 Cycling from kerb 20 (940) 26.\n38 Falling backwards 80 (5790) 70.\n15 Taking box from cupboard 27 (1555) 36.\n28 Walking down stairs 12 (523) 16.\n17 Mopping floor 50 (3061) 46.\n16 Vacuum cleaning 60 (4075) 58.\n22 Trampoline jumping 30 (1460) 34.\n21 Taking heavy box from shelf above head 60 (3085) 56.\n29 Cleaning windows above head 41 (2071) 44.\n24 Abdominal exercises 26 (1149) 33.\n13 Carrying rubbish bag.\n33 Doing dishes 44 (2759) 44.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nassessments to investigate protective movement behaviour  (Holzapfel, Riecke, Rief, Schneider, & Glombiewski, 2016).\nThe general measures of painrelated fear were not related to the lumbar ROM, which is in line with the results  from most (Demoulin et al.\n, 2013; Karayannis et al.\n, 2018;  Marich et al.\n, 2017; Vaisy et al.\n, 2004; Thomas & France, 2008)  of the studies on this topic.\nThe reasons for these differences are unclear and may be explained by various factors,  including differences in the task performed (e.\nchronic LBP) or the variables that have been controlled for in the analysis.\nIn this respect, it could be argued  that specifically including the PCS into the basic model  of our study might have attenuated the predictive value of  the painrelated fear measures because both variables are  closely linked in the fearavoidance model (Vlaeyen et al.\nHowever, there was no multicollinearity and removing the PCS from the basic regression model did not influence results.\nwalking  or doing exercises) as harmful (Pincus, Smeets, Simmonds, &  Sullivan, 2010).\nFearavoidance beliefs are shaped by many  factors, including pain characteristics (e.\nfamily) and information from  healthcare providers (Bunzli, Smith, Schutze, & O'Sullivan,  2015; Darlow et al.\nEspecially, the influence of the  latter has gained more attention in recent years.\nWhile most  healthcare practitioners regard exercises and staying active  as beneficial for CLBP, many of them consider lifting with a  bent back as harmful for the lumbar spine, although there is  no good evidence to support this belief (Nolan, O'Sullivan,  Stephenson, O'Sullivan, & Lucock, 2018).\nBecause patients  with CLBP are strongly influenced by the information provided by their healthcare provider (Darlow et al.\nis plausible that misinformed patients will become fearful to  perform this specific task, resulting in a protective movement  behaviour with a restricted lumbar ROM, without necessarily  regarding general physical activity as harmful.\nBesides the influence of the abovementioned factors,  learning processes are fundamental for acquiring painrelated fear and avoidant behaviour.\nWhen a lifting manoeuver  is followed by an episode of LBP, lifting itself may become  associated with pain.\nAs a consequence, patients may develop  a fear for lifting and avoid this activity (respondent conditioning).\nThis occurs when a stimulus that is similar  to the original feareliciting stimulus will also provoke a fear response.\nThe strength of this response follows a gradient  which depends on how closely these stimuli match with each  other (Vlaeyen, 2015).\nshowed  that in a predictable pain context, painrelated fear also  spreads to movements that are proprioceptively similar to the  original painful movement, and that this generalization does  indeed follow a gradient (Meulders, Vandebroek, Vervliet, &  Vlaeyen, 2013; Meulders & Vlaeyen, 2013).\nTherefore, we  hypothesized that the lumbar ROM during lifting would also,  but less strongly, be predicted by the scores on pictures of  the PHODASeV that are proprioceptively related to a lifting  manoeuver with a bent back.\nOur results showed that besides the PHODAlift, only  the scores on picture 1, depicting a person shovelling soil,  predicted the lumbar ROM.\nIn line with our hypothesis, the  scores on picture 1 were a less strong predictor for the lumbar ROM than the scores on the PHODAlift.\nInterestingly,  the lifting and shovelling task share similarities regarding  the threat value and movement characteristics, that is both  tasks were perceived as highly harmful and the person.\nSex [F]: a positive Std.\nBeta indicates that female sex is associated with a larger  range of motion.\n15322149, 2019, 6, Downloaded from https://onlinelibrary.\nPotentially, not only the proprioceptive relatedness is of importance to predict movement behaviour, but also the threat value of the activity.\nThis hypothesis is supported by two observations.\nFirst,  pictures showing activities in a clearly flexed position (i.\nproprioceptively similar), but which were rated as significantly less harmful than the PHODAlift, were not related  to the lumbar ROM.\nFor some patients, simply flexing the spine  might already be seen as a harmful movement, whereas  others might only perceive this as harmful when heavier  loads are being handled or when they cannot use an external support.\nSecond, a movement that was perceived as  equally harmful to the PHODAlift, but which was proprioceptively different (i.\nfalling backward on the grass), was  also not associated with the lumbar ROM.\nFor the same  reason, it can be explained that the scores on picture 10,  displaying a person lifting a crate from the trunk of a car,  were not correlated with the lumbar ROM.\nTABLE 5  Mean estimates and  comparison of healthy persons with  subgroups of patients with chronic low back  pain (CLBP) categorized into low, medium  and high levels of painrelated fear.\n1384 by University Of California, San, Wiley Online Library on [21/01/2023].\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nactivity was also regarded as highly harmful, the person's  spine is only slightly flexed, limiting the proprioceptive relatedness.\nactivities with a flexed  spine) as well as the perceived harmfulness are important  in order to predict the lumbar ROM.\nFrom a clinical perspective, the question thus  arises whether reducing the taskspecific fear will automatically lead to a normalization of the lumbar ROM during  that task.\naltered movement patterns) and central (e.\nmaladaptive beliefs) pain  mechanisms are associated with CLBP (Sheeran, Sparkes,  Caterson, BusseMorris, and Deursen (2012); O'Sullivan,  Caneiro, O'Keeffe, & O'Sullivan, 2016; Meier et al.\nWhile a particular mechanism may be dominant in certain  persons, many individuals present themselves with a mixed  pattern of peripherally and centrally mediated pain (Nijs et  al.\nDespite its overall effectiveness, a substantial number of  patients with CLBP does not achieve a clinically meaningful  reduction in disability after exposure therapy (Glombiewski  et al.\n, 2018), which suggests that other factors than painrelated cognitions and emotions might be responsible for the  patient's problem.\nFurthermore, changes in subjective measures of fear do not necessarily lead to synchronous changes  in behaviour (Rachman & Hodgson, 1974).\nTherefore, it would be  valuable to assess whether movement patterns change after  (exposure) treatment and, if so, whether these changes mediate the improvements in pain and disability.\nIn this respect, a treatment called cognitive functional  therapy (CFT) has been recently developed in the physical  therapy field (O'Sullivan et al.\nCognitive functional  therapy is a multidimensional behavioural approach combining graded exposure therapy with physical treatments  (e.\n, 2008), but  it is unclear whether CFT influences movement behaviour.\nIn contrast, several case studies that evaluated  patientspecific activities showed that an improvement in  pain and disability was associated with a less protective.\nTherefore, it might be more appropriate to evaluate the specific movements that were targeted during treatment instead  of using standardized tasks.\nSeveral limitations apply to this study.\nCategorizing participants into subgroups may limit the  power to detect smaller differences.\nHowever, this problem  is mainly present when a median split is used to categorize a predictor, but is largely avoided by discretizing it  into thirds, as we did in the current study (Gelman & Park,  2009).\nThe scores on the PHODA SeV, TSK and its subgroups in our study were slightly  lower compared to the normative data for patients with  CLBP (Leeuw et al.\nHowever, these normative data are mainly based on  severely disabled patient populations that were referred to  specialized pain clinics.\nTherefore, they might not be representative for the patients seen in primary care, such as the  ones in the current study (Leeuw et al.\nMoreover, cutoff values on the TSK that have  been used to include patients with either moderate (>34/68)  (Leeuw et al.\nOn the other hand,  lifting is a highly relevant activity that patients with CLBP  typically perceive as harmful (Leeuw et al.\nAs a consequence, reducing the fear for lifting  an object is often one of the treatment goals in this patient  population.\nof interest, especially because differences in these parameters have been shown between healthy persons and patients  with CLBP (Laird et al.\n, 2014; Lima, Ferreira, Reis, Paes, &  MeziatFilho, 2018).\nIn  this case, the total available ROM is typically measured using  a flexion in standing, when a person is asked to bend forward  as far as possible (Bible et al.\nHowever, some people  might have a fear of bending, irrespective whether this is a  simple flexion or a lifting task (Caneiro, O'Sullivan et al.\nConsequently, the ROM during flexion in standing  might not be a good indication of the total available ROM because it could also be limited due to the protective behaviour  (Geisser et al.\nFurthermore, it has been shown that the  lumbar flexion ROM during functional activities sometimes  exceeds the maximal lumbar ROM measured during flexion  in standing (Wade, Campbell, Smith, Norcott, & O'Sullivan,  2012).\nIn our opinion, the latter measure cannot be considered  to be the golden standard for measuring the maximal physiological ROM.\nTherefore, we used absolute instead of relative  values to express the ROM, and controlled for various factors  (e.\nsex and age) that could influence this outcome.\nFinally, the measurements were performed in a laboratory setting.\nBecause the context in which activities are performed can influence (avoidant) movement behaviour (Claes,  Vlaeyen, & Crombez, 2016), it would be valuable to evaluate  how people move during daily life activities in their personal  context.\nConsidering the limitations of the currently available  measurement systems, however, this would be very challenging from a technical point of view.\nThe present study confirmed our hypothesis that the lumbar  ROM during a lifting manoeuver was predicted by task specific, but not by general measures of painrelated fear.\nWe also expected that scores on pictures showing activities which were proprioceptively similar to the lifting task  would predict the lumbar ROM.\nHowever, our results suggest that besides the proprioceptive relatedness, also the  threat value should be similar to predict the lumbar ROM.\nFinally, only the patients with a low score on the taskspecific measure of painrelated fear had a similar lumbar  ROM compared to healthy persons.\nBased on these results,  we recommend to use taskspecific measures of painrelated fear when assessing the relationship with movement  behaviour.\nFurthermore, it would be of interest to investigate whether reducing taskspecific fear changes protective  movement behaviour, and whether these potential changes  mediate the improvements in pain and disability.\nconceptualized the study, collected and analysed the  data and wrote the manuscript.\nAll authors interpreted the  findings, commented on and revised the manuscript.\nAll authors approved the final version of the manuscript.\nJournal of Biomechancs, 82, 119.\nNormal functional range of motion of the lumbar  spine during 15 activities of daily living.\nBeliefs underlying painrelated fear and how they evolve: A qualitative investigation in people with chronic back pain and high painrelated fear.\nCognitive functional therapy for the management of low  back pain in an adolescent male rower: A case report.\nEvaluation of implicit associations between back posture and safety of bending and lifting in  people without pain.\nImplicit evaluations and physiological threat responses in people with persistent low back pain and fear of bending.\n15322149, 2019, 6, Downloaded from https://onlinelibrary.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nEvaluating common outcomes for measuring treatment success for chronic  low back pain.\nFearavoidance model of chronic pain: The next generation.\nThe enduring impact of what clinicians say to people with  low back pain.\nRelationship between different measures of painrelated fear and physical capacity of the spine  in patients with chronic low back pain.\nFear generalization in humans: Systematic review and  implications for anxiety disorder research.\nPainrelated fear, lumbar flexion, and dynamic EMG among persons  with chronic musculoskeletal low back pain.\nClinical Journal of Pain,  20, 6169.\nSplitting a predictor at the upper quarter or third and the lower quarter or third.\nConfirmatory factor analysis of the Tampa Scale for Kinesiophobia: Invariant twofactor model across low back pain patients and fibromyalgia  patients.\nInteraction between pain, movement, and physical activity: Shortterm benefits, longterm consequences, and targets for treatment.\nDevelopment and validation of the behavioral avoidance  testback pain (batback) for patients with chronic low back pain.\nPsychological features and their relationship to movementbased  subgroups in people living with low back pain.\nArchives of Physical  Medicine and Rehabilitation, 99, 121128.\nFear of movement is related to trunk stiffness in low back pain.\nA metaanalysis of fearavoidance and pain intensity: The paradox of chronic pain.\nComparing  lumbopelvic kinematics in people with and without back pain:  A systematic review and metaanalysis.\nExposure in vivo  versus operant graded activity in chronic low back pain patients:  Results of a randomized controlled trial.\nChronic low back pain and back muscle activity during functional tasks.\nUnderstanding the  etiology of chronic pain from a psychological perspective.\nPainrelated fear: A critical review of the related measures.\nNonspecific  low back pain.\nConsistency of a lumbar movement pattern across functional activities in people with low back pain.\nSensorbased postural feedback is more effective than conventional feedback to improve lumbopelvic movement control in patients with chronic low back pain: A randomised controlled trial.\nWithin/betweensession reliability and agreement of  lumbopelvic kinematics in the sagittal plane during functional  movement control tasks in healthy persons.\nThe impact of painrelated fear on neural.\npathways of pain modulation in chronic low back pain.\nPain Reports,  2, e601.\nThe acquisition and generalization of cued and contextual painrelated fear: An experimental study  using a voluntary movement paradigm.\nChanging beliefs for changing movement and  pain: Classificationbased cognitive functional therapy (CBCFT)  for chronic nonspecific low back pain.\nRegional differences in lumbar spinal posture and the influence of low back pain.\nWhat do the numbers mean? Normative data in chronic pain measures.\nLow back pain: Guidelines for the clinical classification of predominant neuropathic, nociceptive, or central sensitization pain.\nWhat do physiotherapists and manual handling advisors  consider the safest lifting posture, and do back beliefs influence their  choice? Musculoskelet Science and Practice, 33, 3540.\nCognitive functional therapy for disabling nonspecific chronic low  back pain: Multiple casecohort study.\nDiagnosis and classification of chronic low back  pain disorders: Maladaptive movement and motor control impairments as underlying mechanism.\nCognitive functional therapy:  An integrated behavioral approach for the targeted management of  disabling low back pain.\nA Study of the Natural  History of Back Pain.\nSpinal position sense and trunk muscle activity during sitting and standing in nonspecific chronic low back pain.\nPsychological factors are related to pain intensity in back healthy people who develop clinically relevant pain during prolonged standing: A preliminary study.\nPatients and physiotherapists views on  triggers for low back pain.\nThe pain catastrophizing scale: Development and validation.\nThe relationship between painrelated fear and lumbar flexion during natural recovery from low back  pain.\nEuropean Spine Journal, 17, 97103.\nAnatomy of the neck, trunk,  upper and lower limbs (3rd ed.\nEfficacy of classificationbased cognitive functional therapy  in patients with nonspecific chronic low back pain: A randomized  controlled trial.\nLearning to predict and control harmful events:  Chronic pain and conditioning.\nFear of movement/(re)injury in chronic low back pain and  its relation to behavioral performance.\nPainrelated fear: Exposurebased treatment of chronic  pain.\nInvestigation of spinal posture signatures and ground reaction  forces during landing in elite female gymnasts.\nJournal of Applied  Biomechanics, 28, 677686.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nThe relation between painrelated fear and disability: A metaanalysis.\nLumbar range of motion  in chronic low back pain is predicted by taskspecific,  but not by general measures of painrelated fear.\n1384 by University Of California, San, Wiley Online Library on [21/01/2023].\nSee the Terms and Conditions (https://onlinelibrary.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License."}