{"title": "41.pdf", "contents": "Despite the fact that almost anyone may experience an acute low back pain (LBP) episode at least once during his/her life, only a small minority develop a chronic low back pain (CLBP) problem (Waddell, 2004b).\nA biopsychosocial model may provide a better account because it also includes psychological and social factors (Waddell, 2004a).\n1Department of Medical, Clinical, and Experimental Psychology, Maastricht University, Maastricht, The Netherlands.\n2Department of Behavioral, Social, and Legal SciencesPsychology, Orebro University, Orebro, Sweden.\n3Department of Experimental-Clinical and Health Psychology, Ghent University, Ghent, Belgium.\n4Pain Management and Research Centre, University Hospital Maastricht, Maastricht, The Netherlands.\nOne psychological factor that has received much attention in the case of (chronic) pain is fear.\nBefore describing the role of fear in the domain of pain, let us first briefly examine fear and anxiety in general as an introduction.\nFear and Anxiety: A Brief Introduction.\nFear is the emotional reaction to a specific, identifiable and immediate threat, such as a dangerous animal or an injury (Rachman, 1998).\nFear may protect the individual from impending danger as it instigates defensive behavior that is associated with the fight or flight response (Cannon, 1929).\nDefensive escape behaviors reduce fear levels in the short term, but may strengthen the fear in the long run.\nFirst, people with a phobia (intense irrational fear) do not necessarily have a history of being exposed to a traumatic incident (Hermans et al.\nSecond, during extinction procedures, no unlearning takes place, but rather new learning that leaves the original association between the conditioned and unconditioned stimulus intact, making relapse likely (Bouton, 2002).\nThird, individual differences in vulnerabilities exist that can affect how likely fear will be experienced, acquired or maintained over time (Mineka and Zinbarg, 2006).\nAnxiety, in contrast to fear, is a future-oriented affective state and the source of threat is more elusive without a clear focus.\nEven though the components of anxiety are similar to those of fear, they are less intense.\nFurthermore, whereas fear motivates the individual to engage in defensive behaviors, anxiety is associated with preventative behaviors, including avoidance.\nAn important component of anxiety is hypervigilance, which occurs when the individual engages in environmental scanning for potential sources of threat, selectively attends to threatrelated rather than neutral stimuli, broadens the attention prior to the detection of these stimuli, and narrows the attention in the presence of such stimuli (Eysenck, 1992).\nBoth avoidance behavior and hypervigilance reduce anxiety in the short term, but may be counterproductive in the long run.\nClinically, the distinction between fear and anxiety is less evident, and these terms are frequently used interchangeably.\nBuilding upon the knowledge derived from the general fear and anxiety research, the contribution of fear and anxiety in the area of (chronic) pain has been increasingly acknowledged.\nPain-related fear and anxiety can best be defined as the fear that emerges when stimuli that are related to pain are perceived as a main threat.\nescape and avoidance behavior), as well as cognitive (e.\nFear of pain, fear of work-related activities, fear of movement, and fear of (re)injury have been described as often occurring in patients suffering pain.\nThe Fear-Avoidance Model of Pain.\n(1995) and Vlaeyen and Linton (2000) proposed a cognitive behavioral model of CLBP that has become known as the fear-avoidance model.\nWhen acute pain is perceived as non-threatening, patients are likely to maintain engagement in daily activities, through which functional recovery is promoted.\nThese dysfunctional interpretations give rise to pain-related fear, and associated safety seeking behaviors such as avoidance/escape and hypervigilance, that can be adaptive in the acute pain stage, but paradoxically worsen the problem in the case of long-lasting pain.\nThe long-term consequences, such as disability and disuse, in turn may lower the threshold at which subsequent pain will be experienced.\nThe terms fear and anxiety are often used interchangeably with regard to pain.\nIn this updated model, there is no longer a direct link between fear and avoidance behavior, because by definition one cannot avoid a threat that is already present.\nSince it is not yet evident that this updated model added value to the original one, and because of the remaining debate about clinical distinctiveness of fear and anxiety, we will use the term pain-related fear in the remainder of this review.\nThe Fear-Avoidance Model of Pain: Evidence for its Components.\nThe fear-avoidance model of chronic pain.\nBased on the fear-avoidance model of Vlaeyen and Linton (2000).\nan attempt to further validate the fear-avoidance model, basically focusing on the interrelationships between its constitutive components.\nThe component pain-related fear and its contribution in various stages of LBP will be separately addressed in section 3, because of its central position in the fearavoidance model and the large body of research dedicated to it.\nIn their review, Vlaeyen and Linton (2000) concluded that pain intensity is not a primary factor in avoidance behavior or disability.\nIt is possible that this may be the case in a subgroup of chronic pain patients, but it has become clear that high pain intensity is in itself a threatening experience that drives escape and avoidance (Eccleston and Crombez, 1999).\nIndeed, numerous recent studies have shown that pain intensity has a considerable contribution in explaining disability.\nFrom these current studies, it can be concluded that the association between pain and disability both during the acute and chronic stages of pain may be more important than previously suggested.\nThe term catastrophizing was first coined by Ellis (1962) for the process in which anxious patients dwell on the most extreme negative consequences conceivable.\nPain catastrophizing has consistently been associated with pain disability in pain patients (Peters et al.\n, 2005; Sullivan et al.\n, 2005a; Turner et al.\n80 Leeuw, Goossens, Linton, Crombez, Boersma, and Vlaeyen.\nHowever, all these studies are correlational, allowing no causal inferences.\nThis study experimentally manipulated the meaning assigned to a painful stimulus and examined its influence on the pain experience.\nHealthy volunteers, who were led to believe that a cold metal bar to the neck was hot, rated it as more painful and ascribed more damaging properties to it than other healthy volunteers, who were led to believe that the same bar was cold.\nProspective studies further demonstrated that initial pain catastrophizing is related to higher pain intensity in a variety of situations, e.\nduring a subsequent painful procedure (Edwards et al.\n, 2005; Sullivan et al.\n, 1995; Sullivan and Neish, 1999; Sullivan et al.\n, 2004b), after an operation (Granot and Ferber, 2005), and in the long-term adjustment to lower-limb amputation and phantom limb pain (Hanley et al.\nThere is also some evidence that pain catastrophizing may be considered as a precursor of painrelated fear.\n(in press) demonstrated that in LBP sufferers in the general population, pain catastrophizing was related to painrelated fear six months later, even after accounting for other contributing variables such as initial levels of pain-related fear.\n(2004b) found that initial levels of pain catastrophizing were related to subsequent increases in fear during internal atrial cardioversion.\nPain that is intense, or that is perceived as threatening, demands attention and may interrupt ongoing activities (Eccleston and Crombez, 1999; Pincus and Morley, 2001).\nVarious studies have demonstrated that excessive attention to pain is dependent upon.\nFor example, studies that found decreased cognitive task performance in fearful LBP patients interpreted this to be the result of painrelated fear directing attention to pain (Crombez et al.\n, 1999a, 2002a; de Gier et al.\n, 2003; Peters et al.\n, 2002; Eccleston et al.\nFurthermore, diminished attentional bias due to treatment appeared to be mainly explained by reductions in pain-related fear, suggesting that pain vigilance results from pain-related fear (Dehghani et al.\nAlso pain catastrophizing has been shown to increase the attentional demand of pain in experimental settings (Crombez et al.\n, 2002a; Van Damme et al.\n, 2002, 2004b; Vancleef and Peters, 2006).\nAlthough it might be suggested that excessive attention to pain mediates the relationship between pain-related fear and increased pain intensities, there is only little evidence supporting this idea (Crombez et al.\nEvidence converges upon the idea that attentional disruption by pain-related information is not the result of an initial shift of attention to the pain stimuli, but rather stems from difficulties in disengaging attention from these stimuli (Asmundson et al.\nMore evidence comes from studies showing that impeded disengagement seems to be pronounced in high catastrophizers (Van Damme et al.\n, 2004b) For example, it was demonstrated that high pain catastrophizers had more difficulty in disengaging their attention from pain cues than low catastrophizers, because of the erroneous conviction that these pain cues signaled subsequent pain targets (Van Damme et al.\nAdditionally, it may be that attentional engagement is facilitated by the anticipation of pain (Van Damme et al.\nInterestingly, it was found that an experimentally induced attentional bias was reduced during extinction, but that it easily returned when the feared stimulus was again encountered (Van Damme et al.\nIn sum, there is evidence that attention may be an important feature in pain perception as predicted by the model.\nAvoidance refers to behavior aimed at postponing or preventing an aversive situation from occurring (Kanfer and Philips, 1970).\nAlthough in case of chronic pain it is not possible to avoid the pain, it is possible to avoid the perceived threat, in this case the activities that are assumed to increase pain or (re)injury.\nVlaeyen and Linton (2000) presented an impressive overview of studies demonstrating that fearful CLBP patients performed less well on behavioral performance tasks, pointing to possible withdrawal, and thus avoidance, from these tasks.\nA number of more recent studies also support this assumption.\nFor example, pain-related fear was associated with decreased speed in both preferred and fast walking (Al-Obaidi et al.\n, 2003), with weakened muscle strength (Al-Obaidi et al.\n, 2000; Goubert et al.\nDisability refers to problems in executing daily life tasks and activities, in the home as well as the work situation.\nIt seems clear that avoidance behaviors as defined above have an impact on daily life tasks.\nThe selective attention to pain-related stimuli, and the associated difficulty with disengaging from these stimuli, might occur at the cost of vigilance to the usual tasks of daily life.\n, 2004; Goubert et al.\n, in press; Peters et al.\n, 2004; Turner et al.\n, 2001a; Woby et al.\nIn addition to the development of functional disability, frequent and enduring avoidance of daily activities may also result in gradual deterioration of a persons muscular system and fitness.\nThus far, lower or equal daily life activity levels were found when comparing CLBP patients with healthy controls, although the number of studies is rather small (Nielens and Plaghki, 2001; Spenkelink et al.\nTwo other aspects of disuse seem relevant: physical deconditioning, which can either be expressed in weakened muscle strength or reduced aerobic fitness, and disordered muscle coordination during physical activity (so-called guarded movements).\nTherefore, aerobic fitness level seems to be a more suitable measure of physical deconditioning.\nGenerally, the physical fitness of CLBP patients is found to be either lower or equal to that of healthy subjects (Verbunt et al.\nOnly one current study succeeded in demonstrating that CLBP patients have lower aerobic fitness than matched healthy counterparts, though this could not be explained by pain-related fear or other relevant variables (Smeets et al.\nAnother aspect related to disuse is disturbed trunk muscle coordination that CLBP patients can present during physical activity.\nOne study demonstrated that experimentally induced fear of pain had only subtle effects on the erector spinae during walking, while leaving the global pattern of trunk kinematics unaffected (Lamoth et al.\nMore evidence was found by Geisser et al.\n(2004), who showed that among CLBP patients pain-related fear was not only associated with reduced lumbar flexion and greater EMG in full flexion, but also to abnormalities in the muscle activity during flexion from the.\nThese changes in musculoskeletal functioning and flexion may be important for the understanding of how pain may interfere with daily life functioning.\nIn sum, neither lower physical activity levels nor the physical consequences of long-term avoidance behavior in CLBP patients were unambiguously confirmed.\nThis might explain their serious functional limitations despite unaffected levels of activity.\nTo elucidate the actual contribution of disuse in CLBP, in the future it may be important to study the consequences of LBP within an affected person instead of between groups (Verbunt et al.\nAn intriguing question concerns the etiology of pain catastrophizing and pain-related fear.\nAre there certain vulnerabilities that predispose individuals to overly attach negative appraisals to pain? If so, does this incline one to misinterpret ambiguous, but harmless, physical sensations as painful or threatening, thereby predisposing an individual to develop pain complaints (Arntz and Claassens, 2004; Pincus and Morley, 2001)? Asmundson et al.\n(1999) suggested that fear of pain may be secondary to the fundamental fear anxiety sensitivity, that is the fear of anxiety-related sensations associated with pain.\nIndeed, there is evidence that pain-related fear is related to anxiety sensitivity (Asmundson et al.\n, 2001), as well as injury/illness sensitivity (Vancleef et al.\n, 2006), which in turn contributes to the broader construct of trait anxiety (Reiss, 1991).\nAlong the same lines, the more general construct of negative affectivity (or neuroticism) has also been shown to lower the threshold at which pain is perceived as threatening (Gheldof et al.\n, 2006; Goubert et al.\nBecause negative affectivity, anxiety sensitivity, and fear of pain seem to share some potential overlap, and at the same time differ in terms of generality, Keogh and Asmundson (2004) proposed to follow the idea put forward by Lilienfeld et al.\n(1993) in the context of personality research, in approaching these constructs as part of an interrelated hierarchy.\nAlthough it is not quite clear which specific trait is important for the development and course of LBP, it may be suggested that certain relatively stable vulnerability traits are important and should not be overlooked.\nAlthough speculative, it may be that individuals with an increased vulnerability to catastrophizing and pain-related fear are less changeable in their fear avoidance beliefs than those without these vulnerabilities.\nFor clinical practice, it would therefore be important to identify these stable personality traits, since their presence may require a different, and more thorough approach, than when addressing fear avoidance beliefs in patients without these vulnerabilities.\nAbove, the support for the separate components of the fear-avoidance models is outlined.\nTo date, only two studies examined the interrelationships of various elements of the fear-avoidance model simultaneously using structural equation modeling.\n(2004b) showed that pain catastrophizing and pain-related fear mediated the relationship between neuroticism and pain vigilance, and that pain vigilance was associated with heightened pain severity.\nMoreover, neuroticism was found to moderate the relationship between pain severity and pain catastrophizing.\n(2006) demonstrated that pain catastrophizing was related to pain-related fear, depression and disability, that pain-related fear was related to depression and disability, and that both depression and disability were related to pain severity.\nAlthough not allowing for causal inferences, which actually constitute the basic premises of the model, these studies do support the associations between various elements of the fear-avoidance model.\nAlthough the fear-avoidance model was originally developed to explain the transition from acute to chronic pain, most of the research has been carried out with chronic pain patients, underscoring the evidence for pain-related fear as the mechanism behind the maintenance of chronic pain and pain disability.\nNevertheless, more recently, researchers have begun to study the influence of the role of pain-related fear in individuals with acute pain episodes, and a handful of studies have even gone a step further and focused.\non pain-related fear as a risk factor for the development of pain episodes in pain-free individuals.\nAs reviewed above, accumulating evidence seems to underscore the contribution of escape/avoidance behavior and hypervigilance in the area of chronic pain.\nFearful pain patients may continuously scan their environment for potential signals of pain, and when the detected stimuli are interpreted as a threat, the attention is more likely to stay attached to those stimuli (Van Damme et al.\nNot only may these disrupted attentional processes be associated with increased disability because of leaving less attention available for other tasks and activities, but also by leading to intensified pain (Arntz et al.\n, 1994; Arntz and Claassens, 2004).\nThe other possible maintaining factor is avoidance/escape behavior.\nWhen CLBP patients have detected a threatening situation, in this case a potential dangerous activity, they will either escape from the activity by not performing it at all, or avoid the activity by submaximal performance or the use of safety behaviors (Al-Obaidi et al.\n, 2000; Goubert et al.\nThis behavior fuels the painrelated fear of these patients even further, first because it prevents them from discovering that these activities are harmless, and second because it promotes disability and disuse.\nDue to differences in stringency in evaluating studies for their reviews, Linton (2000) concluded that fear avoidance beliefs were associated with both the inception and continuation of LBP, whereas Pincus et al.\nties of daily life (Buer and Linton, 2002), greater perceived disability (Gheldof et al.\n, 2003, 2006a,2006b), greater work loss (Grotle et al.\n, 2004), more frequent sick leave (Gheldof et al.\nDue to its associations with escape/avoidance behavior already during the acute pain phase, painrelated fear might contribute to the development of a chronic pain problem.\nSeveral prospective studies indeed go further in demonstrating that fear avoidance beliefs can influence the transition to CLBP and associated outcomes, such as disability and sick leave.\n(2002) showed that both heightened pain-related fear and pain catastrophizing during the acute phase increased the risk of future CLBP and disability.\nAccordingly, in acute LBP patients it was shown that initial elevated pain-related fear (Swinkels-Meewisse et al.\n, 2005), or rising levels of pain-related fear in the beginning of a new episode (Sieben et al.\n, 2002) were predictive of subsequent higher disability.\n, 2005), and to the recurrence of LBP and care seeking four years later (Burton et al.\nTwo studies found only minor contributions of pain-related fear during the acute pain phase (Boersma and Linton, 2005a; Sieben et al.\n, 2005a), whereas one study found pain-related fear to be unrelated to future disability (Sieben et al.\nHowever, in the study of Sieben et al.\n(2005b) high fearful patients were underrepresented, and this may have resulted in an underestimation.\nPain-Related Fear as a Vulnerability Factor for the Inception of Acute LBP.\nThe fear-avoidance model proposes that fear avoidance beliefs may come into play when an acute pain problem emerges.\nIt therefore seems sensible to assume that fear avoidance beliefs also exist in painfree people.\nThese beliefs are probably based on previous LBP experiences, personality traits (Goubert et al.\n, 2004b), or observational learning (Mineka and Zinbarg, 2006).\nRecent studies indeed demonstrated fear avoidance beliefs to be present in pain-free people.\npopulation reported pain-related fear comparable to, or only slightly lower, than acute and chronic pain patients (Houben et al.\nFurthermore, misconceptions, such as the belief that LBP is caused by tissue damage, were very common in the general population (Goubert et al.\nDuring pain, these misconceptions may trigger pain-related fear.\nThese fear avoidance beliefs may act as a vulnerability factor for the inception of a new LBP episode in pain-free people.\nFearful people may be more inclined to misinterpret ambiguous physical sensations as threatening or painful, and therefore have an increased likelihood to experience pain (Arntz and Claassens, 2004; Pincus and Morley, 2001).\nThere is indeed some evidence that fear avoidance beliefs may heighten the probability of subsequently developing a new pain episode.\nAdditionally, in workers who were currently pain free, a higher risk for future LBP onset was found for those who catastrophized about pain (Linton, 2005), and for those with heightened pain-related fear (Van Nieuwenhuyse et al.\nSince these studies included participants who were pain-free during the past year, it is important to recognize that the included participants were not pain-free in the sense that they had never experienced LBP before.\nDue to its high prevalence (Waddell, 2004b), it is very likely that these people had suffered from previous LBP episodes, which also might have influenced the initiation of a new episode.\nThe aforementioned findings suggest that painrelated fear may not only be associated with the inception of a LBP episode, but also with the transition from acute to CLBP, and the maintenance of a chronic pain problem.\nFrom this knowledge we may deduce that pain-related fear could be an important target for intervention.\nPain-Related Fear: An impeding Factor for Treatment?.\nA working alliance is of importance for positive treatment progress (Horvath and Symonds, 1991;.\nAlthough rather speculative, fearful CLBP patients may be more inclined to keep searching for biomedical explanations and solutions for their pain problem, may have a history with dissatisfactory health care encounters, may strive for pain relief instead of restoration of activities, and they may more frequently have co-morbid disorders (Hadjistavropoulos and Kowalyk, 2004; Kerns et al.\nBecause of these features, frustration may be triggered in both the patient and the therapist, thereby negatively affecting the therapeutic relationship (Hadjistavropoulos and Kowalyk, 2004).\nMore research is required to investigate whether pain-related fear actually impedes the patient-therapist relationship.\nPatients pain-related fear may be fed by the interaction with health care providers.\nIt might be possible that not only the health care providers facial expressions, but also the threatening diagnostic labels they use (e.\nBecause of the use of diagnostic terms that may be interpreted by patients as evidence for serious pathology, health care providers may inadvertently increase the threat value of pain.\nAdditionally, health care providers may also hold fear avoidance beliefs themselves, although fortunately the beliefs of health care providers generally appear to be in accordance with current guidelines (Koes et al.\nHowever, fear avoidance beliefs were found to some degree in health care providers.\nFor example, many would advise patients to avoid painful movements, some believed that sick leave is an adequate treatment, and some worried when their patients were in pain during exercise (Linton et al.\nMost interestingly, these beliefs were related to treatment recommendations.\n, 2005b), the more it was recommended that CLBP patients should restrict work and physical activities.\nIn addition to the detrimental consequences of inadequate advice, these fear avoidance beliefs of health care providers can induce or strengthen those of their patients, especially in fearful CLBP patients who are likely to be sensitive even to minor hesitations or inconsistencies.\nIt is not clear whether fearful CLBP patients can benefit optimally from traditional health care.\nFearful CLBP patients may sustain their avoidance behaviors regardless of the treatment message, when the disadvantageous consequences of avoidance behavior are neither explicitly addressed, nor managed.\nIn traditional health care, and especially in health care providers with a more biomedical orientation, the message that activity is beneficial is often accompanied by a note of caution especially if the pain increases.\nIt is not surprising then, that fearful CLBP patients may respond with more safety and avoidance behaviors to these treatments than those who are less fearful, thereby gaining less benefit from regular treatments.\nOne study indeed suggested that fear avoidance beliefs counteracted the beneficial effects of an exercise-based therapy (Al-Obaidi et al.\n, 2005), and another indicated that pain catastrophizing hampered the efficacy of usual practitioner care (Jellema et al.\nOn the contrary, it has been shown that especially for high fear avoiders a regular exercise program was more effective than usual general practitioner care (Klaber Moffett et al.\n, 2004), whereas lower fear avoidance beliefs were associated with less favorable outcomes following a stabilization exercise program (Hicks et al.\nOne of the questions, of course, is how these treatments have been delivered, and whether pain-related fear and the associated safety behaviors were adequately addressed.\nEffectiveness of Cognitive Behavioral Programs.\nSome recently reported cognitive behavioral treatments have included methods to address painrelated fear.\nThese programs have demonstrated promising results thus far, indicating that it can be beneficial to focus on decreasing pain-related fear.\nIt might therefore be that the presence of fear avoidance beliefs may debilitate outcome when usual treatment is applied, whereas fear-avoidance based treatments fail to be effective in the absence of painrelated fear.\nFor example, it was demonstrated that a short cognitive behavioral intervention was successful in reducing fear avoidance beliefs, together with diminishing the risk of pain continuation, over and above the rather strong natural recovery rate for acute LBP (Linton and Ryberg, 2001).\nThe association between pain-related fear and the effectiveness of treatments is also highlighted by brief educational sessions.\n, 1995), a straightforward educational campaign comprised of the advice to stay active and discouraging medical interventions, resulted in long-lasting reductions in fear avoidance beliefs in the community as well as in physicians, and in less workers compensation claims for LBP (Buchbinder et al.\nTaken together, these results suggest that cognitive behavioral programs, and even brief educational sessions, can effectively diminish disability, which might be due to reducing fear avoidance beliefs and pain catastrophizing.\nPain-related fear might therefore be an essential target for successful interventions.\nYet, the abovementioned treatments were not developed to specifically and systematically address pain-related fear.\nIt can be suggested that methodically addressing and diminishing fear might be even more powerful.\nExposure in vivo, which is a comprehensible example of an idiosyncratic treatment designed only for those with elevated levels of pain-related fear, may.\nFollowing the suggestions of Philips (1987), exposure in vivo treatment was developed to gradually confront patients with activities they feared and avoided for a long time due to the belief that these might be damaging for the back.\nThis treatment consists of four components: the choice of functional goals, education about the paradoxical effects of safety behaviors, the establishment of a fear hierarchy, and graded exposure to feared activities in the form of behavioral experiments.\nDue to gradual and repeated encounters with these feared activities, this treatment may provide patients with the most convincing evidence that expected detrimental consequences of these feared activities are in fact a catastrophic overestimation.\nDue to this, their fear may diminish and functional abilities might be promoted.\nFor the establishment of the fear hierarchy of activities, that constitutes the foundation for the rest of the therapy, The Photograph Series of Daily Activities (PHODA: Kugler et al.\n, 1999) may be the most suitable instrument.\nIt is comprised of photographs of various daily activities, of which patients have to indicate to what extent they think that these can be harmful to the back.\nThe PHODA provides therapists with a tangible tool that specifically assesses the patients beliefs about the harmfulness of certain activities for the back.\nSeveral experimental single case studies, including 2 to 6 patients each, have demonstrated the effectiveness of exposure in vivo as compared to graded activity in fearful CLBP patients, by reporting impressive reductions in pain-related fear and disability, as well as increases in activity levels in the home situation (Boersma et al.\nInterestingly, the educational part also produced improvements in self-reported painrelated fear and catastrophizing, although these improvements gained strength after subsequent exposure in vivo.\nMeasures of actual behavior, including accelerometer data, and self-reported ability to perform pre-defined goals, improved after the exposure sessions and not after the educational session (de Jong et al.\nFinally, the resumption of daily activities in patients suffering from complex regional pain syndrome was associated with decreases in pain-related fear, but not with a reduction in pain-intensity, which occurred only later in time (de Jong et al.\nGeneralization of Exposure in vivo.\nAn important assumption behind exposure in vivo is that the repeated experiences of being able to perform various activities without pain increases or inducing (re)injury to the back during treatment will extend to activities during daily life.\ng Bouton, 2002), several experimental studies suggest that generalization of these corrective encounters is rather limited in chronic pain patients.\n, 2005b), resulted in subsequent diminished overprediction of pain for those particular movements, but this effect failed to generalize to other dissimilar movements.\nIt might be that these patients learn an exception to the rule activities hurt rather than to change their general beliefs regarding the detrimental consequences of activities.\nInterestingly, these patients on the other hand tended to overgeneralize pain, such that once a certain movement had been painful it was assumed that it would remain painful in the future (Goubert et al.\nTranslated into treatment implications, these results emphasize the importance of practicing a wide variety of activities and movements, not only during treatment, but also in the home environment of the patient (Rowe and Craske, 1998a,b).\nAlthough there is no data as yet comparing exposure in vivo to behavioral experiments, it can be suggested that the addition of behavioral experiments may optimize generalization of corrective encounters.\nSummarizing, it can be stated that there is accumulating support for the fear-avoidance model.\nAs predicted from the vast literature on fear and anxiety, pain-related fear is associated with catastrophic (mis)interpretations of pain, hypervigilance, increased escape and avoidance behaviors, as well as with intensified pain intensity and functional disability.\nDisrupted attentional processes, and especially impeded attentional disengagement in the case of threatening stimuli, were found in fearful CLBP patients, as well as avoidance behavior as reflected in submaximal physical task performance.\nThere is less evidence for the existence of disuse in CLBP patients.\nPerhaps the disordered motor coordination is a more salient aspect of disuse than reduced fitness.\nFurthermore, evidence is accumulating that pain severity plays a more important role in disability than previously assumed.\nFinally, several personal vulnerabilities, such as fundamental fears or neuroticism, may influence whether someone will respond fearfully to a painful experience.\nPain-related fear may augment the vulnerability to develop new LBP episodes in currently pain-free people, may increase the risk for the continuation of LBP complaints, and may maintain complaints when they have become chronic.\nThis conception disregards the erratic and recurrent course of LBP for most people.\nFor example, the number and duration of episodes, fluctuations in pain intensity, level of disability, occupational consequences, and health care use can vary considerably between people suffering from LBP.\nThese individual differences in the course and consequences of LBP should be kept in mind when interpreting the contribution of pain-related fear during different stages of pain.\nIn fact, the research on contextual factors influencing the occurrence and reinstatement of fear waits to be extended to the area of pain.\nIt is also important to note that the fearavoidance model only accounts for the development and maintenance of problems in a subgroup of CLBP patients.\nVarious other factors besides pain-related fear may determine the progress of LBP.\nFurthermore, supportive evidence for the interrelations between the separate constructs of the fear-avoidance model does not provide evidence for causal interrelationships.\nCausality can only be established when each construct is experimentally manipulated.\nIt would be highly interesting to investigate the progression of interrelationships between the variables of the fear-avoidance model in a large cohort of acute back pain patients of whom some will develop subsequent chronic pain, for example by using Latent Trajectory Classes Analyses.\nAdditionally, exploring the effects of treatments by manipulating the individual constructs in the fear-avoidance model would shed light on the actual causal contributions.\nUntil now, a large number of cross-sectional and prospective studies at least point to the potential validity of the fearavoidance model.\nFor the future, a number of interesting issues remain that require further exploration.\nSome of these will be highlighted below.\nPain-Related fear: When is it Adaptive and when Dysfunctional?.\nDue to their protective and defensive function in the case of impending or immediate danger, it may be concluded that fear and anxiety are adaptive mechanisms for an individual, and in most cases they are indeed.\nBut when do they become dysfunctional? This is a complex issue as we lack objective measures of what is adaptive.\nthe presence or absence of real harm, and the consequences of fear on function and identity.\npain, when the pain is the result of an acute injury, pain-related fear is likely to be adaptive as it will direct attention towards the injury, thereby enhancing the probability of necessary care, e.\nHowever, in the case of enduring pain, when the pain may no longer be explained by injury, fear can become dysfunctional.\nThe persevering use of avoidance and escape behaviors in this chronic stage may be the result of misdirected problem-solving, in which patients keep seeking to solve their insoluble problem of pain release (Aldrich et al.\nHowever, in the case of chronic pain, these behaviors prevent the individual from disconfirming the level of threat.\nIn addition, hypervigilance and avoidance behavior will interrupt cognitive activity, interfere with daily tasks, and threaten major life goals and personal identity (Morley and Eccleston, 2004).\nThus, one could assert that fear, and painrelated fear in particular, is never dysfunctional, but it is the prolonged engagement in these safety behaviors that are dysfunctional.\nWhen to Target Pain-Related Fear?.\nMost treatments are developed for chronic pain patients, thereby disregarding earlier phases during which the development of CLBP can be tackled.\nA promising area lies in preventing dysfunctional reactions when a new pain episode is initiated.\nSince misconceptions about LBP and its management seem very common in the general population in addition to some health care providers, these provide an ultimate opportunity for prevention.\nEducational campaigns have proved their value in adaptively changing LBP beliefs and associated benefits (Buchbinder and Jolley, 2005; Burton et al.\n, 1999; Moore et al.\n, 2000; Symonds et al.\nAlthough it can be questioned whether changing fear avoidance beliefs will lead to actual behavior change (de Jong et al.\n, 2005b), the potential beneficial effects of educational campaigns should be more extensively explored.\nAnother challenge lies in the prevention of the development of enduring pain once an acute LBP episode is established.\nAn important example of this is the development (Linton and Hallden, 1998) of the Orebro Musculoskeletal Pain Screening Questionnaire, which identifies several psychological yellow flags which signal a heightened risk for chronification of complaints (Boersma and Linton, 2005b;.\nIn addition to identification of those at risk, prevention strategies should be developed that target these risk factors, thereby putting detrimental developmental processes in pain on hold (Linton and Andersson, 2000; Linton and Ryberg, 2001, Linton et al.\nPain-Related fear in Patients with Specific Pain Diagnoses.\nSo far, most of the work on pain-related fear has focused on patients with non-specific medical diagnoses such as back pain, chronic headache (Nash et al.\n, 2003; Turk et al.\n, 2004; Sterling et al.\n, 2003), and chronic fatigue syndrome (Nijs et al.\n, 2004; Silver et al.\nTheoretically, however, there is every reason to believe that fear processes would be applicable to specific pain problems as well.\nIndeed, the contribution of pain-related fear has been shown to extend to patients with osteoarthritis (Heuts et al.\n, 2004), burn pain (Sgroi et al.\n, 2005), knee injury (Kvist et al.\n, 2005) and neuropathic pain (de Jong et al.\nIt will be a challenge for future researchers to integrate fear reduction techniques in medical treatment and care for these patient groups.\nFear of pain and associated avoidance behaviors may not be the only kind of fear associated with chronic pain.\nGiven the debilitating consequences of longstanding avoidance behaviors, patients may present with multiple fears and concerns, including the inability to work (functional), having surgery (health), having to sell the house (financial) and being a burden to family members (social; Davies, 2003).\nFor chronic pain patients, another important concern may be social isolation that occurs in response to their diminished participation in daily life.\nIt therefore may be that concerns about social isolation in pain patients inadvertently increase their pain threshold.\nFollowing this theory, a distinction is made between approach and avoidance goals.\nApproach goals are those that the individual is hoping for, whereas avoidance goals consist of situations that have a negative value.\nbeing dependent upon others, it may therefore induce fear.\nFor example, Karoly and Ruehlman (1996) showed that in chronic pain patients, goal conflicts predicted anxiety levels over and above pain-related variables.\nAs mentioned before, fear is not always associated with avoidance behavior.\nRachman (2004) eloquently describes situations in which fearful individuals are willing to approach a frightening object or situation.\nFor example, both LBP patients who were requested to perform a lifting task (van den Hout et al.\n, 2001b), and healthy controls who were requested to immerse their hand in cold water (Severeijns et al.\n, 2005) with the instruction as long as possible demonstrated better performance after an experimentally induced negative mood as compared to those in positive mood.\nOne possible account for these findings is the so-called mood-as-input model, which predicts that task performance is the result of the interaction between mood and certain stop-rules.\nWhen individuals adopt an explicit or implicit As-Many-As-Can stop rule (they continue until satisfaction is reached about dealing with the task), negative mood will facilitate task performance, whereas positive mood will inhibit task performance.\nThe strength of the moodas-input model is that it provides specific predictions, including those that are based on the fear-avoidance model, but also those that are based on a novel theoretical basis that may account for findings inconsistent with the fear-avoidance model, such as task perseverance instead of avoidance despite pain-related fear.\n0002 of the Netherlands Organisation for Health Research and Development (ZonMw).\nWorrying about chronic pain: vigilance to threat and misdirected problem solving.\nThe influence of pain and pain-related fear and disability beliefs on walking velocity in chronic low back pain.\nThe relationship of anticipated pain and fear avoidance beliefs to outcome in patients with chronic low back pain who are not receiving workers compensation.\nThe role of anticipation and fear of pain in the persistence of avoidance behavior in patients with chronic low back pain.\nThe meaning of pain influences its experienced intensity.\nThe influence of anxiety on pain: Attentional and attributional mediators.\nFear-avoidance models of chronic pain: An overview.\nAnxiety sensitivity and disabling chronic health conditions: state of the art and future directions.\nBeyond pain: The role of fear and avoidance in chronicity.\nHypervigilance and attentional fixedness in chronic musculoskeletal pain: consistency of findings across modified stroop and dot-probe tasks.\nHow does persistent pain develop? An analysis of the relationship between psychological variables, pain and function across stages of chronicity.\nLowering fear-avoidance and enhancing function through exposure in vivo; A multiple baseline study across six patients with back pain.\nThe role of threat-expectancy in acute pain: effects on attentional bias, coping strategy effectiveness and response to pain.\nContext, ambiguity, and unlearning: sources of relapse after behavioral extinction.\nperformance in healthy controls, patients with sub-acute and chronic low back pain: a case-control study.\nEffects of a media campaign on back beliefs is sustained 3 years after its cessation.\nVolvo award winner in clinical studies: effects of a media campaign on back pain beliefs and its potential influence on management of low back pain in general practice.\nFear-avoidance beliefs and catastrophizing: occurrence and risk factor in back pain and ADL in the general population.\nInformation and advice to patients with back pain can have a positive affect.\nBodily changes in pain, hunger, fear and rage: an account of recent researches into the functions of emotional excitement.\nThe fearavoidance model of chronic pain: Validation and age analysis using structural equation modeling.\nWhen somatic information threatens, catastrophic thinking enhances attentional interference.\nAttention to chronic pain is dependent upon pain-related fear.\nThe effects of catastrophic thinking about pain on attentional interference by pain: no mediation of negative affectivity in healthy volunteers and in patients with low back pain.\nHypervigilance to pain: an experimental and clinical analysis.\nPain-related fear is more disabling than pain itself: evidence on the role of pain-related fear in chronic back pain disability.\nFear of pain, physical performance, and attentional processes in patients with fibromyalgia.\nReduction of pain-related fear in complex regional pain syndrome type I: the application of graded exposure in vivo.\nModification of attentional biases in chronic pain patients: a preliminary study.\nSelf-efficacy, fear avoidance, and pain intensity as predictors of disability in subacute and chronic musculoskeletal pain patients in primary health care.\nPain demands attention: A cognitive-affective model of the interruptive function of pain.\nAttention and somatic awareness in chronic pain.\nCatastrophizing predicts changes in thermal pain responses after resolution of acute dental pain.\nAn experimental study of shared sensitivity to physical pain and social rejection.\nReason and emotion in psychotherapy.\nAnxiety: the cognitive perspective.\nThe role of fearavoidance beliefs in acute low back pain: relationships with current and future disability and work status.\nActivity avoidance and function in persons with chronic back pain.\nPain-related fear, lumbar flexion, and dynamic EMG among persons with chronic musculoskeletal low back pain.\nThe centralization phenomenon and fear-avoidance beliefs as prognostic factors for acute low back pain: a preliminary investigation involving patients classified for specific exercise.\nThe effect of a fear-avoidance-based physical therapy intervention for patients with acute low back pain: results of a randomized clinical trial.\nThe differential role of pain, work characteristics and pain-related fear in explaining back pain and sick leave in occupational settings.\nPain and painrelated fear are associated with functional and social disability in an occupational setting: Evidence of mediation by painrelated fear.\nThe reluctance to generalize corrective experiences in chronic low back pain patients: a questionnaire study of dysfunctional cognitions.\nLow back pain, disability and back pain myths in a community sample: prevalence and interrelationships.\nThe role of neuroticism, pain catastrophizing and pain-related fear in.\nExposure to physical movement in chronic back pain patients: No evidence for generalization across different movements.\nThe roles of pain catastrophizing and anxiety in the prediction of postoperative pain intensity: a prospective study.\nFear-avoidance beliefs and distress in relation to disability in acute and chronic low back pain.\nMultidisciplinary rehabilitation for chronic low back pain: systematic review.\nPatienttherapist relationships among patients with pain-related fear.\nPsychosocial predictors of long-term adjustment to lower-limb amputation and phantom limb pain.\nPain coping strategies play a role in the persistence of pain in post-herpetic neuralgia.\nExtinction in human fear conditioning.\nRelation between working alliance and outcome in psychotherapy: A metaanalysis.\nFear of movement/injury in the general population: Factor structure and psychometric properties of an adapted version of the Tampa Scale for Kinesiophobia.\nHealth care providers orientations towards common low back pain predict perceived harmfulness of physical activities and recommendations regarding return to normal activity.\nHealth care providers attitudes and beliefs towards common low back pain: factor structure and psychometric properties of the HC-PAIRS.\nChanges in beliefs, catastrophizing, and coping are associated with improvement in multidisciplinary pain treatment.\nLearning foundations of behaviour therapy.\nMotivational implications of pain: chronicity, psychological distress, and work goal construal in a national sample of adults.\nNegative affectivity, catastrophizing, and anxiety sensitivity.\nSelective attentional bias for pain-related stimuli amongst pain fearful individuals.\nMotivation and adherence in the management of chronic pain.\nHigh fear-avoiders of physical activity benefit from an exercise program for patients with back pain.\nClinical guidelines for the management of low back pain in primary care: an international comparison.\nSurface electromyography of the paravertebral muscles in patients with chronic low back pain.\nThe Photograph series of Daily Activities (PHODA).\nFear of reinjury: a hindrance for returning to sports after anterior cruciate ligament reconstruction.\nMeasuring perceived harmfulness of physical activities in chronic low back pain patients: the Photograph Series of Daily Activities  Short electronic Version.\nPainrelated fear in low back pain: a prospective study in the general population.\nOutline of a fear-avoidance model of exaggerated pain perception: I.\nA review of psychological risk factors in back and neck pain.\nCan chronic disability be prevented? A randomized trial of a cognitive-behavior intervention and two forms of information for patients with spinal pain.\nEarly identification of patients at risk of developing a persistent back problem: the predictive validity of the Orebro Musculoskeletal Pain Questionnaire.\nThe effects of cognitive-behavioral and physical therapy preventive interventions on pain-related sick leave: a randomized controlled trial.\nAre fear-avoidance beliefs related to the inception of an episode of back pain? A prospective study.\nCan we screen for problematic back pain? A screening questionnaire for predicting outcome in acute and subacute back pain.\nA 5-year follow-up evaluation of the health and economic consequences of an early cognitive behavioral intervention for back pain: a randomized, controlled trial.\nA cognitive-behavioral group intervention as prevention for persistent neck and back pain in a non-patient population: a randomized controlled trial.\nThe back pain beliefs of health care providers: are we fearavoidant? J.\nActive therapy for chronic low back pain: part 3.\nFactors influencing self-rated disability and its change following therapy.\nMultimethod assessment of treatment process in chronic low back pain: comparison of reported pain-related anxiety with directly measured physical capacity.\nPatient-centredness: A conceptual framework and review of the empirical literature.\nA randomized trial of a cognitive-behavioral program for enhancing back pain self care in a primary care setting.\nSystematic review and meta-analysis of randomized controlled trials of cognitive behaviour therapy and behaviour therapy for chronic pain in adults, excluding headache.\nPredictive value of fear avoidance in developing chronic neck pain disability: consequences for clinical decision making.\nChronic fatigue syndrome: lack of association between pain-related fear of movement and exercise capacity and disability.\nAnxiety sensitivity, fear, and avoidance behavior in headache pain.\nCatastrophizing: a risk factor for postsurgical pain.\nIs pain-related fear a predictor of somatosensory hypervigilance in chronic low back pain patients? 40: 85103.\nDo fibromyalgia patients display hypervigilance for innocuous somatosensory stimuli? Application of a body scanning reaction time paradigm.\nThe joint contribution of physical pathology, pain-related fear and catastrophizing to chronic back pain disability.\nFearavoidance behavior and anticipation of pain in patients with chronic low back pain: A randomized controlled study.\nPain catastrophizing and kinesiophobia: predictors of chronic low back pain.\nA systematic review of psychological factors as predictors of chronicity/disability in prospective cohorts of low back.\nOutcome of subacute low back pain: influence of patients and rheumatologists characteristics.\nSynchrony and desynchrony in fear and avoidance.\nExploration of physicians recommendations for activities in chronic low back pain.\nExpectancy theory of fear, anxiety, and panic.\nAn experimental study of attention, labelling and memory in people suffering from chronic pain.\nThe role of fear of movement and injury in selective attentional processing in patients with chronic low back pain: a dotprobe evaluation.\nElectronic diary assessment of painrelated fear, attention to pain, and pain intensity in chronic low back pain patients.\nThe use of coping strategies in chronic low back pain patients: Relationship to patient characteristics and current adjustment.\nduction and return of fear.\nThe causal status of pain catastrophizing: an experimental test with healthy participants.\nPain catastrophizing is associated with health indices in musculoskeletal pain: a cross-sectional study in the dutch community.\nPain catastrophizing predicts pain intensity, disability, and psychological distress independent of the level of physical impairment.\nFear-avoidance in recovered burn patients: association with psychological and somatic symptoms.\nPain-related fear at the start of a new low back pain episode.\nA longitudinal study on the predictive validity of the fear-avoidance model in low back pain.\nThe role of fear of physical movement and activity in chronic fatigue syndrome.\nDo patients with chronic low back pain have a lower level of aerobic fitness than healthy controls?: Are pain, disability, fear of injury, working status, or level of leisure time activity associated with the difference in aerobic fitness level? Spine 31: 9098.\nReduction of Pain Catastrophizing Mediates the Outcome of Both Physical and CognitiveBehavioral Treatment in Chronic Low Back Pain.\nElectronic momentary assessment in chronic pain II: psychological pain responses as predictors of pain disability.\nAssessment of activities of daily living with an ambulatory monitoring system: a comparative study in patients with chronic low back pain and nonsymptomatic controls.\n, and den Ouden, D.\nCatastrophizing and internal pain control as mediators of outcome in the multidisciplinary treatment of chronic low back pain.\nLongitudinal validation of the fear-avoidance beliefs questionnaire (FABQ) in a Swiss-German sample of low back pain patients.\nThe development of psychological changes following whiplash injury.\nPredictors of return to work in patients sick listed for sub-acute low back pain: a 12-month follow-up study.\nThe effects of disclosure on pain during dental hygiene treatment: the moderating role of catastrophizing.\nAn experimental investigation of the relation between catastrophizing and activity intolerance.\nPsychologically based occupational rehabilitation: the Pain-Disability Prevention Program.\nThe Pain Catastrophizing Scale: Development and validation.\nDimensions of catastrophic thinking associated with pain experience and disability in patients with neuropathic pain conditions.\nPath model of psychological antecedents to pain experience: experimental and clinical findings.\nSecondary prevention of work disability: community-based psychosocial intervention for musculoskeletal disorders.\nAcute low back pain: pain-related fear and pain catastrophizing influence physical performance and perceived disability.\nFear of movement/(re)injury, disability and participation in acute low back pain.\nFear-avoidance beliefs, disability, and participation in workers and non-workers with acute low back pain.\nFear of movement/(re)Injury predicting chronic disabling low back pain: a prospective inception cohort study.\nAbsence resulting from low back trouble can be reduced by psyochosocial intervention at the work place.\nPrevalence of fear of pain and activity in patients with fibromyalgia syndrome.\nCatastrophizing is associated with pain intensity, psychological distress, and pain-related disability among individuals with chronic pain after spinal cord injury.\nPain 98: 127 134.\nRetarded disengagement from pain cues: the effects of pain catastrophizing and pain expectancy.\nThe anticipation of pain modulates spatial attention: evidence for pain-specificity in high-pain catastrophizers.\nPain 111: 392 399.\nDisengagement from pain: the role of catastrophic thinking about pain.\nFunctional disability in non-specific low back pain: the role of painrelated fear and problem-solving skills.\nThe effects of failure feedback and pain-related fear on pain report, pain tolerance and pain avoidance in chronic low back pain patients.\nThe role of physical workload and pain related fear in the development of low back pain in young workers: evidence from the BelCoBack Study; results after one year of follow up.\nBehavioral treatment for chronic low back pain: a sustematic review within the framework of the Cochrane Back Review Group.\nPain catastrophizing, but not injury/illness sensitivity or anxiety sensitivity, anhances attentional interference by pain.\nPain-related factors contributing to muscle inhibition in patients with chronic low back pain: an experimental investigation based on superimposed electrical stimulation.\nDisuse and deconditioning in chronic low back pain: concepts and hypotheses on contributing mechanisms.\nFear of injury and physical deconditioning in patients with chronic low back pain.\nPhysical activity in daily life in patients with chronic low back pain.\nCan pain-related fear be reduced? The application of cognitivebehavioural exposure in vivo.\nimental design in four patients with chronic low back pain.\nFear reduction in chronic pain: graded exposure in vivo with behavioral experiments.\nFear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nActive despite pain: the putative role of stop-rules and current mood.\nCognitive-behavioral treatments for chronic pain: what works for whom? Clinical Journal of Pain 21: 18.\nCatastrophic thinking about pain increases discomfort during internal atrial cardioversion.\nWork-related beliefs about injury and physical capability for work in individuals with chronic pain.\nThe epidemiology of back pain.\nAdjustment to chronic low back painthe relative influence of fear-avoidance beliefs, catastrophizing, and appraisals of control.\nAre changes in fear-avoidance beliefs, catastrophizing, and appraisals of control, predictive of changes in chronic low back pain and disability? European J.\nAnxiety sensitivity in the prediction of pain-related fear and anxiety in a heterogeneous chronic pain population."}