{"title": "49.pdf", "contents": "Relationship between psychological factors and spinal motor behaviour in low back pain: a systematic review and meta-analysis.\nAbstract This meta-analysis investigated whether more negative psychological factors are associated with less spinal amplitude of movement and higher trunk muscle activity in individuals with low back pain.\nFurthermore, it examined whether pain intensity was a confounding factor in this relationship.\nWe included studies that provided at least 1 correlation coefficient between psychological (pain-related fear, catastrophizing, depression, anxiety, and self-efficacy) and spinal motor behaviour (spinal amplitude and trunk muscle activity) measures.\nIn total, 52 studies (3949 participants) were included.\nThe results indicated that higher levels of pain-related fear, catastrophizing, and depression are significantly associated with reduced amplitudes of movement and larger muscle activity and were consistent across subgroup and moderation analyses.\nPain intensity did not significantly affect the association between these psychological factors and spinal motor behaviour and had a very small independent association with spinal motor behaviour.\nIn conclusion, the very small effect sizes found in the meta-analyses question the role of psychological factors as major causes of spinal movement avoidance in low back pain.\nLow back pain (LBP) is one of the main causes of disability worldwide, with severe socioeconomic burden.\n38,48 Physical and psychological factors have been repeatedly reported to contribute to LBP, and it was suggested that relationships exist between these elements and play a critical role in LBP-related disability.\n65,68 Unfortunately, the existence and exact nature of such relationships remain unclear, which limits the understanding of LBP and hinders the development of better treatment.\nOn the physical side, previous research demonstrated that patients with LBP have altered spinal motor behaviour.\nSpecifically, participants with LBP show reduced spinal amplitude and velocity of movement compared with asymptomatic controls during daily life activities and maximal range-of-motion (ROM) tests.\nFor instance, studies have shown that people with LBP have reduced amplitude of lumbar flexion during sit-tostand, lifting tasks, or maximal flexion tests.\nFurthermore, biomechanical models of LBP have suggested that patients with LBP demonstrate higher trunk muscle activity, especially during dynamic tasks.\nAmong these measures of muscle activity, the flexionrelaxation ratio (FRR) was shown to be consistently higher in patients with LBP, showing an absence of the typical relaxation at the end of maximal flexion.\nAltogether, these observations indicate that patients with LBP tend to move with a more rigid spinal motor behaviour.\nOn the other side, pain intensity and disability have been shown to be influenced by psychological factors in LBP populations.\nThese include cognitive and emotional factors, such as catastrophizing, self-efficacy, pain-related fear, anxiety, or depression.\n18,21,67,96,132 Studies also indicated that these psychological factors can be mediators and moderators of treatment efficacy.\nRegarding the relationships, psychological factors were often suggested to be the causes of motor behaviour alterations as described by multiple models.\n4,7,28,65,117,124 One example is the fear avoidance model (FAM), which states that a threatening appraisal of pain can induce pain-related fear that can then lead to an avoidance behaviour and disability.\nAddress: HESAV School of Health Sciences, Ave Beaumont 21, 1010 Lausanne, Switzerland.\nPAIN 162 (2021) 672686.\navoidance behaviour is particularly expressed by reduced spinal amplitude and velocity of movement as well as higher trunk muscle activity.\n31,65 However, although a relationship of this kind between pain-related fear and motor alterations has a strong theoretical rationale in LBP, it still requires validation and possibly improvement.\nIndeed, so far, studies that addressed the question of the relationship between pain-related fear and motor behaviour alterations in LBP producedinconsistentresults25,111andare mostlyobservational.\nBecause the variability in findings among publications could be due to differences in study specificities, there is a need for a systematic review with a meta-analysis to synthetize the available data in the literature and clarify the relationship between pain-related fear and motor behaviour in LBP.\nFor instance, to be plausible, the size of the relationship should be large, the findings should be consistent across multiple settings and multiple measures, and pain-related fear should precede spinal motor behaviour alterations.\nAlthough the FAM presents pain-related fear as the main cause of movement avoidance, other models suggest that other psychological factors also play an important role in the motor behaviour alterations of patients with LBP.\n4,7,28,95,117 The first additional factor of interest is catastrophic thinking, which has been shown to increase pain-related fear and has been associated with avoidance behaviours.\n20,65,68,102 The second is self-efficacy, which has been reported to mediate the relationship between pain-related fear and disability136 and was associated with reduced physical performance.\n107 Anxiety and depression are also of interest because they have been associated with pain-related fear and catastrophizing21,94.\nand are considered as possible contributors to spinal motor behaviour.\n12,95,118 Because a relationship between these 4 psychological factors and spinal motor behaviour can also be present, it is worth including them in the systematic review.\nThis study aimed to perform a systematic review and metaanalysis of the literature to synthetize current knowledge regarding the associations between psychological factors and spinal motor behaviour in LBP in an effort to improve our understanding of the relationships between these elements.\nIt was hypothesized that higher levels of pain-related fear, catastrophizing, anxiety, and depression, as well as lower levels of self-efficacy, would be associated with more rigid spinal motor behaviours, characterized by reduced amplitude and velocity of movement and larger trunk muscle activity during dynamic tasks.\nWhen analysing the relationships between psychological factors and spinal motor behaviour, one should be mindful of pain intensity, which could confound the analysis.\nIndeed, pain intensity has been shown to affect psychological factors, including pain-related fear,60 catastrophizing,77 and depression,115 whereas the relationship between pain intensity and spinal motor behaviour is still unclear.\n118,134 Therefore, a secondary aim of this study on LBP was to determine whether pain intensity is a confounder in the associations between psychological factors and spinal motor behaviour.\nThis review was registered in PROSPERO (CRD42018088680), and the PRISMA principles were followed for its reporting.\nTo be included in the systematic review and meta-analysis, the studies had to fulfil the following criteria:.\n(1) Population: studies testing adults with a diagnosis of nonspecific LBP, with or without leg pain.\n73 Studies on healthy participants with experimental LBP and individuals who recently recovered from LBP (in the past 3 months) were also included, as individuals who recently recovered from an acute LBP episode have been shown to continue to demonstrate spinal motor behaviour alterations and elevated pain-related fear scores.\n(2) Psychological factors: studies reporting the measurement of at least one of the following factors: (1) pain-related fear, (2) catastrophizing, (3) depression, (4) state anxiety, or (5) selfefficacy.\n(3) Spinal motor behaviour: studies reporting the measurement of at least one of the following characteristics during a dynamic task: (1) spinal amplitude of movement, (2) spinal velocity of movement, or (3) trunk muscle activity.\nIn addition, to be included, studies reporting the amplitude or velocity of movement had to have measured the lumbar region alone or in combination with other regions (eg, lumbar 1 thoracic spine or hips 1 lumbar spine 1 thoracic spine).\nThese measures of spinal movement can be collected during maximal ROM tests (eg, maximal bending and fingertip-to-floor [FTF]) or functional activities (eg, lifting a box).\nMeasures of the amplitude of movement had to be described in degrees (eg, lumbar flexion angle) or in centimetres (eg, FTF or Schober tests) and measures of the velocity of movement in degree per second.\nStudies reporting the spinal amplitude of movement using the sit-and-reach test were excluded, as it primarily measures the hamstrings flexibility.\n80 Studies with muscle activity data had to report the level of activity of anterior or posterior trunk muscles or the FRR to be included.\n(4) Study design: observation and intervention studies of crosssectional and longitudinal design reporting at least 1 psychological and 1 spinal motor behaviour measures.\nBecause LBP symptoms are known to fluctuate over time,58.\nto be included studies had to have measured psychological factors and spinal motor behaviour on the same day.\nIn addition, to avoid statistical bias, only baseline measurement was used in longitudinal studies with multiple data collection episodes.\n(5) Temporal precedence: studies measuring psychological factors before spinal motor behaviour.\n45,59 Because this information is often unavailable, studies for which the timing of measurement could not be determined were also included, but they were rated with a higher risk of bias and analyzed separately in sensitivity analyses.\n(6) Relationship assessment: studies for which at least 1 coefficient of correlation could be obtained between psychological and spinal motor behaviour measures.\nWhen one or more correlation coefficients were not reported in the article, the authors of the possibly eligible studies were contacted to obtain the missing correlations.\nAll authors were contacted at least 3 times before excluding the study.\nPublications were screened in 2 stages.\n) independently assessed titles and abstracts against inclusion and exclusion criteria.\nSecond, the 2 authors assessed the full text of the possibly eligible studies with the same criteria.\nThe results were compared between the 2 authors, and disagreements were resolved by consensus.\nIf necessary, a third author of this work was consulted (E.\nRisk of bias was assessed using an adapted version of the Quality in Prognostic Studies tool.\nIt evaluates the risk of bias of 6 different domains that may influence the analyses of interest in this study (see Supplementary Materials II, available as http://links.\n40 It should not be interpreted as an assessment of the included study quality per say but as an assessment of the possible bias in the context of the present review study.\n) independently assessed the risk of bias of the included studies.\nAny inconsistencies were resolved together by the 2 authors.\nThe first information to be extracted was the study objective, coded as either a study conducted primarily to assess the relationship between psychological and spinal motor behaviour measures or a study whose primary objectives were not to assess this relationship.\nFor participant characteristics, the following data were extracted: study population (coded as chronic, subacute, and acute LBP, recovered, or healthy with induced LBP), age, disability, gender (% female), and body mass index.\nFor questionnaires assessing a single psychological construct, the total score was extracted (eg, total score of the Pain Anxiety Symptom Scale (PASS) for pain-related fear).\nWhen a questionnaire assessed different constructs (eg, Common Mental Disorders Questionnaire with the anxiety and depression subscales), only the data of the subscale of interest were extracted.\nFor the Fear-Avoidance Beliefs Questionnaire (FABQ), if the total score was not available, the Physical Activity subscale was used.\nFor spinal motor behaviour, the type of measurement (coded as amplitude of movement, velocity of movement, or muscle activity), the method of measurement, and the actual measures were extracted.\nIn addition, the direction of movement was recorded (coded as flexion, extension, or lateral flexion).\nThe tool used to measure pain intensity (eg, Numeric Pain Rating Scale or Visual Analog Scale) and the recall period (coded as during specific activity, current, past day, past week, or unknown) were recorded alongside.\nPearson and Spearman correlation coefficients were recorded without distinction.\n50 When a correlation coefficient was not reported, other strategies were used to determine the effect size of the association between psychological, motor behaviour, and pain intensity measures.\nFirst, if a linear regression was available, the standardized beta coefficient was used instead of the correlation coefficient, as suggested by Peterson and Brown.\n93 Furthermore, in the case of reported group average values (eg, mean and SD of low and high depressed groups), a correlation coefficient was calculated using the mean standardized differences.\nWhen necessary, the sign of the correlation coefficients was reversed to be consistent among studies and to always have negative correlations corresponding to an association between worse psychological measures (eg, higher pain-related fear) and worse spinal motor behaviour measures (eg, less amplitude or higher trunk muscle activity).\nTherefore, associations between higher levels of pain-related fear, catastrophizing, depression, anxiety, and a more rigid spinal motor behaviour (less spinal amplitude and higher trunk muscle activity) are demonstrated with negative correlations.\nNegative correlations also indicate an association between lower levels of self-efficacy and less spinal amplitude and higher trunk muscle activity.\nData synthesis and meta-analysis.\nTo test our primary hypothesis, an overall meta-analysis for each psychological factor was performed, where results were averaged for studies measuring some characteristics in multiple ways.\nBased on the current literature, it was not possible to select a priori specific measures of spinal motor behaviour.\nTherefore, if a study included multiple measures for 1 psychological factor and/or spinal motor behaviour, the correlation coefficients were averaged across the multiple measures to yield to a single correlation coefficient.\n50 For instance, studies that had 1 motor behaviour measure but measured pain-related fear with 2 different questionnaires (eg, FABQ and Tampa Scale of Kinesiophobia) had their 2 correlation coefficients averaged.\nIn addition to the overall meta-analyses, subgroup, moderation, and sensitivity analyses were conducted to determine the effect of the variations in measurement specificities and of averaging multiple measures from the same study.\nBefore performing the meta-analytic procedures, the correlation coefficients were transformed using a Fishers Z transformation.\nThe meta-analyses were conducted using the random-effects model, as measurements differed among studies.\nModeration analyses were conducted with respect to age, gender, disability, study population, study objective, and psychological and motor behaviour measurements, using metaregression models.\nSubgroup analyses were also performed to evaluate the effect of variations in these properties.\nSensitivity analyses were conducted as well.\nFirst, we performed a sensitivity analysis to test the effect of selecting only flexion and FRR vs averaging them with other spinal behaviour measures, as these are particularly affected by pain and fear of movement.\n9,23,31 We also tested whether excluding measures that have opposite effect sizes than expected from the overall meta-analyses leads to the same results.\nFurthermore, 3 sensitivity analyses were performed to evaluate the effect of excluding studies with a high risk of bias with respect to the Quality in Prognostic Study items of: study participation, outcome measurement, and statistical analysis.\nFinally, a sensitivity analysis was conducted to test the effect of excluding studies with unknown temporal precedence.\nFinally, a meta-analytic structural equation modelling was used to test the hypothesis that pain intensity is a confounder in the relationship between psychological factors and spinal motor behaviour.\nPublication bias was assessed with funnel plots, as well as Eggers regression (,25 studies) or rank correlation (.\n98 All the calculations were performed using R software (R Development Core Team, 2017), particularly the metafor, robumeta, and metaSEM packages.\nFifty-two studies, with 3949 participants, were included in this review (Fig.\nTwenty-eight of these studies (1923 participants) were conducted primarily to assess the relationship between psychological and spinal motor behaviour measures.\nAll studies focused on a single population, except 1 study that tested a group of patients with acute LBP and a group of patients with chronic LBP.\n35 The population in this review was composed as follows: chronic LBP in 42 studies (3013 participants), acute LBP in 4 studies (250 participants), subacute LBP in 2 studies (77 participants), LBP without duration distinction in 2 studies (228 participants), recurrent LBP in 1 study (209 participants), healthy participants with induced LBP in 1 study (55 participants), and recovered LBP in 1 study (52 participants).\nThe risk of attrition was considered low in all studies because psychological factors and spinal motor behaviour were always measured within a short time window.\nThere was very limited risk of bias in the psychological factor measurement, as most of studies used reliable and validated questionnaires.\nFor the motor behaviour measurement, 5 studies were rated as moderate risk because they measured the amplitude of movement of the entire trunk (including the thoracic spine),31,55,81,127,138 and 12 studies were rated as high risk because they used global measures of spinal amplitude of movement (eg, FTF).\nTwenty-nine studies were rated as moderate risk of bias because no measure of pain intensity at the time of the psychological and motor behaviour measurements was available (eg, pain intensity was only measured as the average during the past week or information was missing).\n89,91,92,100,104,109,112,122,127,128,137,138 When the correlation coefficients with pain intensity were not available, the studies were rated as high risk of bias.\n5,41,86,100,103,108,122 This absence did not affect the overall meta-analyses; it limited only the metaanalytic structural equation model procedure assessing the confounding role of pain intensity.\nIn addition, 35 studies were rated with moderate risk of bias because it was not possible to determine whether the psychological factors were measured before the spinal motor behaviour.\n122,127,129,138 In addition, 7 studies were rated as high risk of bias.\nThis was due to an incomplete reporting of the correlation data,91,100,108 a reporting limited to the standardized beta,5 the use of partial correlations,57 and the necessity to calculate the effect size from group comparisons.\nThe meta-analyses for pain-related fear indicated a pooled correlation coefficient of 20.\n13 (95% confidence interval [CI] 20.\n09), with low heterogeneity (I2 5 25.\n1), meaning that higher levels of pain-related fear were associated with a more rigid spinal motor behaviour (less spinal amplitude and higher trunk muscle activity) (Fig.\nThis analysis was based on 41 studies (2832 participants).\nRegarding catastrophizing, the pooled correlation coefficient was 20.\n09) and the low heterogeneity (I2 5 1%, Q statistic: P 5 0.\nTherefore, higher levels of catastrophizing were associated.\nwith less spinal amplitude and higher trunk muscle activity.\nThis meta-analysis included 13 studies (756 participants).\nThe pooled correlation coefficient for depression was 20.\n4), showing that higher levels of depression were associated with less spinal amplitude and higher trunk muscle activity.\nThis meta-analysis, based on 14 studies (1570 participants),10,30,52,74,81,84,86,87,92,100,109,127,137,138 demonstrated a low heterogeneity (I2 5 1%, Q statistic: P 5 0.\nThe meta-analysis for anxiety, which was based on 4 studies (336 participants),41,52,97,118 reported a large heterogeneity (I2 5 64%, Q statistic: P 5 0.\nThe pooled correlation coefficient was 20.\nTwo studies reported self-efficacy data (130 participants).\n110,129 This resulted in a meta-analysis of large heterogeneity (I2 5 67%, Q statistic: P 5 0.\n08), with a pooled correlation coefficient of 20.\nModeration and subgroup analyses could only be conducted for 3 psychological factors: pain-related fear (Table 1), catastrophizing (Table 2), and depression (Table 3).\nInsufficient data were available for anxiety and self-efficacy.\nAge, gender, and disability.\nThese elements were not significant moderators in the association between psychological factors and spinal motor behaviour.\nThis element was not a significant moderator in the association between psychological factors and spinal motor behaviour for catastrophizing and depression.\nHowever, it significantly influenced the results of the meta-analysis for pain-related fear (Q(4) 5 25.\nBecause this result was largely due to one study with recovered LBP participants, we also performed a moderation analysis with only acute and chronic LBP.\nThe questionnaires used to measure catastrophizing and depression were not significant moderators in the association between psychological factors and spinal motor behaviour.\nOn the contrary, moderation analyses demonstrated a significant effect of the questionnaires used to measure pain-related fear (Q(5) 5 12.\nSpinal motor behaviour measurement.\nMeasuring spinal motor behaviour with spinal amplitudes or trunk muscle activity did not significantly moderate the results.\nAssociation between pain-related fear and spinal motor behaviour: The forest plot shows the association between pain-related fear and spinal motor behaviour.\nNegative correlation means that a higher level of pain-related fear is associated with less spinal amplitude of movement and higher trunk muscle activity.\nHowever, subgroup analyses showed smaller or nonsignificant effect sizes when trunk muscle activity is analysed alone (painrelated fear [r 5 20.\n01], catastrophizing [r 5 20.\nreaching tasks and gait) did not have correlation coefficients statistically significantly different from studies assessing maximal ROM.\nSensitivity analyses and publication bias.\nNegative association means that a higher level of catastrophizing is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe size of the square indicates by how much weight the study contributes to the pooled effect estimate.\nNegative association means that a higher level of depression is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe size of the square indicates by how much weight the study contributes to the pooled effect estimate.\nThe diamond represents pooled effect estimates.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\n1), studies that included in their objective to assess the relationship between psychological factors and spinal motor behaviour had larger effect sizes in the subgroup analyses.\nThe effect of pain intensity on the association between psychological factors and spinal motor behaviour was tested separately for pain-related fear, catastrophizing, and depression using the same data set as for the overall meta-analyses.\nThe effect of pain intensity with respect to anxiety and self-efficacy was not tested, as insufficient data were available.\nAs reported in Figure 7, the pooled correlation coefficient between pain-related fear and spinal motor behaviour without the confounding effect of pain intensity was 20.\n07), which is only slightly less than the correlation reported above with the confounding effect of pain intensity (20.\nSimilarly, the pooled correlation coefficients for catastrophizing and depression were only slightly reduced without the confounding effect of pain intensity.\nThis analysis also showed a small effect of pain intensity on spinal motor behaviour, with correlation coefficients ranging from 20.\nRelationships between psychological factors and spinal motor behaviour.\nAs hypothesized, pain-related fear and catastrophizing were found to be associated with a more rigid spinal motor behaviour (smaller spinal amplitude of movement and higher trunk muscle activity).\n16, respectively) and do not support pain-related fear and catastrophizing as major causes of a more rigid spinal motor behaviour.\nThe results of our meta-analyses can be considered as particularly robust, as they demonstrated a low heterogeneity, a narrow CI, and were consistent among studies (see sections 4.\nTherefore, the present synthesis suggests that spinal motor behaviour alterations in patients with LBP have only a small relationship with pain-related fear and catastrophizing.\nHigher levels of depression were also associated with a more rigid spinal motor behaviour but to an even smaller extent than painrelated fear and catastrophizing.\nThis suggests that not all psychological factors have the same relationship with spinal motor behaviour.\nAssociation between self-efficacy and spinal motor behaviour: The forest plot shows the association between self-efficacy and spinal motor behaviour.\nNegative association means that a higher level of self-efficacy is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe size of the square indicates by how much weight the study contributes to the pooled effect estimate.\nThe diamond represents pooled effect estimates.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nAltogether, this suggests that anxiety might have a role in spinal movement avoidance in patients with LBP and warrants further research.\nOverall analysis 41 2832 25.\nSubgroup analyses Amplitude of movement 33 2654 51.\n1) Only flexion 31 2401 53.\n1) Only extension 6 318 0.\n02) Muscle activity 14 778 0.\n41) Only FRR 8 631 55.\n07) ALBP 3 222 64.\nObjective not included 19 1424 0.\nFunctional movement 6 278 63.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nOverall analysis 13 756 0.\nSubgroup analyses Amplitude of movement 8 617 0.\n08) Only flexion 8 617 0.\n09) Muscle activity 6 175 64.\n21) Only anterior muscles 2 42 0 0.\n12) Only posterior muscles 4 141 56.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nThe meta-analytic structural equation modelling analyses showed that the association between pain-related fear, catastrophizing, and depression with spinal motor behaviour is independent from pain intensity.\nThis suggests that the effects of psychological factors are not confounded by pain intensity, therefore giving further support to our hypotheses.\nInterestingly, higher pain intensity was independently associated with less spinal amplitude and higher trunk muscle activity.\nAlthough pain intensity has often been considered as an important factor influencing movement,47 the effect sizes found in the meta-analyses were very small.\nAlthough it was not the primary purpose of our review, to our knowledge, this is the largest metaanalyses testing the relationship between pain intensity and spinal motor behaviour.\nThese results suggest that psychological factors and pain intensity have an independent and direct effect on spinal motor behaviour.\nNevertheless, future longitudinal studies should assess the theoretical cyclical relationship between pain intensity, pain-related fear, and spinal movement.\nIn this regard, our work rather supports the use of multidimensional cumulative factors to explain spinal movement avoidance in patients with LBP.\nModeration and subgroup analyses demonstrated consistent effect sizes across a wide range of study specificities, thus strongly supporting the findings in the overall meta-analyses.\nFirst, individual characteristics, such as age, gender, body mass index, duration of LBP, and level of disability, did not moderate the result of the meta-analyses.\nInterestingly, this suggests that psychological factors influence spinal motor behaviour regardless of the stage of LBP and the level of disability.\nNevertheless, future work is still needed to confirm this interpretation.\nAdditional studies with acute LBP participants are required, and future meta-analyses should consider integrating disability in the analyses, as we did with pain intensity.\nSecond, different types of measures of spinal motor behaviour resulted in similar effect sizes.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nBDI, Beck Depression Inventory; CI, confidence interval; CLBP, chronic low back pain; FRR, flexionrelaxation ratio.\nmovement measures produced similar effect sizes as the overall meta-analyses, and there were no differences when they were measured during flexion, extension, or lateral flexion.\nAlthough flexion is often described as the most feared movement by patients with LBP,8,24 our results did not indicate that pain-related fear has a larger relationship with spinal motor behaviour during flexion movements.\nSpecifically, measuring spinal kinematics during functional activities or maximal ROM tests, locally at the lumbar spine or with measures that included the whole trunk and the hips, did not produce statistically different effect sizes.\nThird, the type of questionnaire did not significantly influence the results for catastrophizing and depression.\nThe moderation analysis was, however, significant for pain-related fear, with the PASS being the only questionnaire reporting a significantly larger effect size.\nHowever, this result should be interpreted cautiously because of the large heterogeneity in the studies using the PASS and 1 major influential work.\nFirst, the study objective was a significant moderator in the pain-related fear meta-analysis, with studies that primarily assessed the association between psychological factors and spinal motor behaviour having larger effect sizes than studies that did not include this objective.\nSubgroup analyses with catastrophizing and depression also suggested an influence of the study objective.\nThese results suggest a publication bias in the literature, with studies aiming and publishing this association having larger effects.\nSecond, in subgroup analyses, studies based on muscle activity measurements produced smaller effect sizes for pain-related fear (r 5 20.\nResults for catastrophizing and depression were no more statistically significant when analysing only muscle activity measures.\n19; 4 studies), showing no consistency in the direction of the effect sizes for posterior muscle activity.\n15) but was in the opposite direction for catastrophizing (r 5 0.\nThe small effect sizes found in the meta-analyses do not support that pain-related fear, catastrophizing, and depression are major causes of avoidance of spinal movement.\nFurthermore, temporal precedence was not guaranteed in most of the included studies, which is another criteria needed to determine the plausibility of a causal relationship.\nFinally, the only element supporting the plausibility of a causal relationship is the consistency of the findings among studies, indicated by the small heterogeneity in the meta-analyses and the consistent results across subgroup and moderation analyses.\nConsequently, there is a need for future experimental research to detangle the complex relationships between psychological factors, spinal motor behaviour, and pain in individuals with LBP.\nInterestingly, a recent study reported a bidirectional relationship between fear and avoidance,126 suggesting that the causal relationship between these elements may need to be revisited.\nFuture research should also develop more relevant and specific measures of psychological factors and spinal motor behaviour, which may vary among individuals.\nThis review has some limitations related to the measurement of psychological factors, spinal motor behaviour, and pain intensity.\nFirst, included studies measured pain-related fear mostly with general questionnaires.\nHowever, avoidance may well be context-dependent, with some specific movements being feared and avoided, whereas others are not.\n125,133 The lack of relationship between self-report questionnaires and physical tests may be due to the lack of specificity of these questionnaires for particular tasks.\n95 Therefore, there is a need for studies using specific measures of pain-related fear, in relation to feared movements or activities.\n79 Clinicians should also tailor the assessment of pain-related fear and spinal motor behaviour to the individual,99 taking into account the movements that are feared, avoided, and painful.\nSecond, the avoidance of a specific movement might change depending on the context and the presence of competing goals.\n21 For instance, in studies assessing spinal kinematics during maximal ROM tests, fearful participants might have performed better than in daily living because they were following instructions.\nIf this would be the case, the amplitudes of movement and muscle activities in this review need to be considered more as an indicator of capacity of movement, rather than as a particular motor behaviour.\nTherefore, future studies should use objective measures of spinal motor behaviour that can capture avoidance behaviours and not only movement capacity.\nThird, in many studies, the recall period for pain intensity was undocumented or not limited to the day the other measures were recorded.\nThis may have decreased the precision of the relationships between pain intensity and spinal.\nTherefore, future studies should measure pain intensity at the same time as spinal motor behaviour and psychological factors.\nMeasuring pain with pain questionnaires could also provide additional information.\nAnother limitation is related to our broad inclusion criteria.\nAlthough studies with a high risk of bias in terms of population, motor behaviour measurement, or statistical analysis might have influenced the results, the sensitivity analyses demonstrated that the same general findings would have been obtained without these studies.\nThere were also limitations regarding data analysis.\nFirst, our moderation analyses for disability, age, and gender were performed with the mean characteristics of the study populations.\nTherefore, the effect of these variables was tested based on differences between studies but not based on individual differences.\nSecond, averaging data in studies reporting several measures of psychological factors and/or motor behaviour characteristics may have reduced the heterogeneity among movements, individuals, and studies and consequently lowered the pooled correlation coefficients.\n50 Although averaging data in case of multiple measurements is standard practice in metaanalyses, this approach could be particularly critical in the present work because spinal motor behaviour in patients with LBP is a complex and heterogeneous phenomenon, and it is yet unclear which measures of motor behaviour to take into account during which movements.\nIt should be noted that the absence of a standard to measure motor behaviour in LBP not only required the averaging of data within studies but also contributed to a heterogeneity of data across studies.\nThis heterogeneity could also have attenuated the findings of this systematic review.\nNevertheless, sensitivity and subgroup analyses demonstrated that including only a selection of measures from a study (flexion for spinal amplitude of movement and FRR for muscle activity), excluding measures with opposite effect sizes (posterior muscle activity), and analysing only spinal amplitude of movement (all directions) or only spinal amplitude of flexion led to comparable effect sizes.\nNonetheless, further research is warranted to identify the most relevant measures of psychological factors and/or motor behaviour characteristics.\nThird, correlation analyses have limitations (eg, range restriction), which may have influenced the estimation of the pooled correlations.\nThe meta-analyses demonstrated consistently that higher levels of pain-related fear, catastrophizing, and depression are associated with less spinal amplitudes and higher trunk muscle activity in individuals with LBP.\nImportantly, the relationships were independent from pain intensity.\nHowever, the effect sizes were small, questioning the major role of these psychological factors in a more rigid spinal motor behaviour.\nIn addition, this review identified associations of very small effect sizes between higher pain intensity and reduced spinal amplitudes and increased trunk muscle activity.\nThese results suggest that future research should consider using specific and individualized measures of psychological factors, pain intensity, and spinal motor behaviour.\nImportantly, there is a strong need for research testing the causal relationship between psychological factors and spinal movement avoidance in individuals with LBP.\nThe study was supported by a grant from the University of Applied Sciences and Arts Western Switzerland//HES-SO, Faculty of Health Science, and by the Profectus Foundation.\nArticle history: Received 7 May 2020 Received in revised form 17 August 2020 Accepted 24 August 2020 Available online 31 August 2020.\nComparison of lumbar paravertebral EMG patterns in chronic low back pain patients and non-patient controls.\nThe relationship of anticipated pain and fear avoidance beliefs to outcome in patients with chronic low back pain who are not receiving workers compensation.\nWhat functional aspects explain patients impression of change after rehabilitation for long-lasting low back pain? Physiother Res Int 2013; 18:16777.\nFear-avoidance beliefs, physical activity, and disability in elderly individuals with chronic low back pain and healthy controls.\nPsychological processes underlying the development of a chronic pain problem: a prospective study of the relationship between profiles of model and disability.\nClin J Pain 2006; 22:1606.\nImpact of the interaction between selfefficacy, symptoms and catastrophising on disability, quality of life and health in with chronic pain patients.\nWhat do people who score highly on the Tampa Scale of Kinesiophobia really believe? A mixed methods investigation in people with chronic non specific low back pain.\nFear of movement is not associated with objective and subjective physical activity levels in chronic nonspecific low back pain.\nClinical and psychological correlates of lumbar motion abnormalities in low back disorders.\nChronic low back pain patients walk with locally altered spinal kinematics.\nMulti-segment analysis of spinal kinematics during sit-to-stand in patients with chronic low back pain.\nLumbar and thoracic kinematics during step  up : comparison of threedimensional angles between patients with chronic low back pain and asymptomatic individuals.\nSelf-efficacy is more important than fear of movement in mediating the relationship between pain and disability in chronic low back pain.\nContribution of load expectations to neuromechanical adaptations during a freestyle lifting task: a pilot study.\nWhen somatic information threatens, catastrophic thinking enhances attentional interference.\nFearavoidance model of chronic pain: the next generation.\nClin J Pain 2012; 28:47583.\nDiscriminating healthy controls and two clinical subgroups of nonspecific chronic low back pain patients using trunk muscle activation and lumbosacral kinematics of postures and movements: a statistical classification model.\nThe enduring impact of what clinicians say to people with low back pain.\nCross-sectional survey of attitudes and beliefs about back pain in New Zealand.\nLow-back pain patients learn to adapt motor behavior with adverse secondary consequences.\nPhysiological and psychological predictors of short-term disability in workers with a history of low back pain: a longitudinal study.\nWorry and chronic pain: a misdirected problem solving model.\nComparisons in muscle function and training rehabilitation outcomes between avoidance-endurance modelsubgroups.\nQuantification of low back pain recovery using biomechanical, symptom, activities of daily living and work status measures [Doctoral dissertation].\nColumbus: The Ohio State University, 1998.\nClin J Pain 2004;20:619.\nFear-avoidance beliefs as measured by the Fear-Avoidance Beliefs Questionnaire: change in Fear-Avoidance Beliefs Questionnaire is predictive of change in self-report of disability and pain intensity for patients with acute low back pain.\nTrunk muscles activation pattern during walking in subjects with and without chronic low back pain: a systematic review.\nFear-avoidance beliefs and distress in relation to disability in acute and chronic low back pain.\nThe reasoned action approach applied to health behavior: role of past behavior and tests of some key moderators using meta-analytic structural equation modeling.\nMethods Ecol Evol 2011; 2:110.\nWhat low back pain is and why we need to pay attention.\nEffects of noxious stimulation and pain expectations on neuromuscular control of the spine in patients with chronic low back pain.\nShort-Term effects of Mulligan mobilization with movement on pain, disability, and kinematic spinal movements in patients with nonspecific low back pain: a randomized placebo-controlled trial.\nValue of predictive instruments to determine persisting restriction of function in patients with subacute non-specific low back pain: systematic review.\nThe environment and disease: association or causation? Proc R Soc Med 1965;58:295300.\n[46] Hill JC, Fritz JM.\nPsychosocial influences on low back pain, disability, and response to treatment.\nOne-year prognosis in sick-listed low back pain patients with and without radiculopathy: prognostic factors influencing pain and disability.\nEstimation of the biserial correlation and its sampling variance for use in meta-analysis.\nMethods of meta-analysis : correcting error and bias in research findings.\nLumbar kinematics, functional disability and fear avoidance beliefs among adults with nonspecific chronic low back pain.\nObserved outcomes associated with a quotabased exercise approach on measures of kinesiophobia in patients with chronic low back pain.\nPain intensity and abdominal muscle activation during walking in patients with low back pain.\nHow do risk factors work together? Mediators, moderators, and independent, overlapping, and proxy risk factors.\nA meta-analysis of fear-avoidance and pain intensity: the paradox of chronic pain.\nScand J Pain 2016;13:4358.\nSystematic review: occupational physical activity and low back pain.\nComparing lumbo-pelvic kinematics in people with and without back pain: a systematic review and meta-analysis.\nThe fear-avoidance model of musculoskeletal pain: current state of scientific evidence.\nChronic low back pain and back muscle activity during functional tasks.\nImpact of psychological factors in the experience of pain.\nThe effect of manual therapy and neuroplasticity education on chronic low back pain: a randomized clinical trial.\n[70] Louw A, Farrell K, Wettach L, Uhl J, Majkowski K, Welding M.\nImmediate effects of sensory discrimination for chronic low back pain: a case series.\nDeeducate to re-educate: aging and low back pain.\nPain-related fear: a critical review of the related measures.\nNon-specific low back pain.\nActive therapy for chronic low back pain.\nSpine (Phila Pa 1976) 2001;26: 9209.\nThe relationship between psychological factors and performance on the BieringSorensen back muscle endurance test.\nConsistency of a lumbar movement pattern across functional activities in people with low back pain.\nPain catastrophizing and function in individuals with chronic musculoskeletal pain.\nInfluence of chronic low back pain and fear of movement on the activation of the transversely oriented abdominal muscles during forward bending.\nLumbar range of motion in chronic low back pain is predicted by task-specific, but not by general measures of pain-related fear.\nCriterion-related validity of sit-and-reach tests for estimating hamstring and lumbar extensibility: a meta-analysis.\nMultimethod assessment of treatment process in chronic low back pain: comparison of reported pain-related anxiety with directly measured physical capacity.\nThe McGill Pain Questionnaire: major properties and scoring methods.\nFrom fear of movement-related pain and avoidance to chronic pain disability: a state-of-the-art review.\nRegional lumbar motion and patient-rated outcomes: a secondary analysis of data from a randomized clinical trial.\nPreferred Reporting Items for Systematic Reviews and Meta-Analyses: the PRISMA statement (reprinted from Annals of Internal Medicine).\nFunctional restoration for chronic low back pain: changes in depression, cognitive distortion, and disability.\nAre there differences in lifting technique between those with and without low back pain? A systematic review.\nEffectiveness of behavioral graded activity after first-time lumbar disc surgery: short term results of a randomized controlled trial.\nNeuromechanical responses after biofeedback training in participants with chronic low back pain: an Experimental Cohort Study.\nPain catastrophizing and trunk muscle activation during walking in patients with chronic low back pain.\nA systematic review of psychological factors as predictors of chronicity/disability in prospective cohorts of low back pain.\nThe fear avoidance model disentangled: improving the clinical utility of the fear avoidance model.\nSymptoms of depression as a prognostic factor for low back pain: a systematic review.\nEffectiveness of massage therapy for subacute low-back pain: a randomized controlled trial.\nChronic low back pain is highly individualised: patterns of classification across three unidimensional subgrouping analyses.\nDynamic surface electromyographic responses in chronic low back pain treated by traditional bone setting and conventional physical therapy.\nCausal assessment of occupational sitting and low back pain: results of a systematic review.\nPain catastrophizing moderates changes in spinal control in response to noxiously induced low back pain.\nPhysiotherapy post lumbar discectomy: prospective feasibility and pilot randomised controlled trial.\nEffect of movement control and stabilization exercises in people with extension related non -specific low back paina pilot study.\nEffect of low back pain on the kinematics and joint coordination of the lumbar spine and hip during sitto-stand and stand-to-sit.\nDo patients with chronic low back pain have a lower level of aerobic fitness than healthy controls?: are pain, disability, fear of injury, working status, or level of leisure time activity associated with the difference in aerobic fitness level? Spine (Phila Pa 1976) 2006;31:907.\n[108] Svendsen JH, Svarrer H, Laessoe U, Vollenbroek-Hutten M, Madeleine P.\nBiopsychosocial factors are associated with pain intensity, physical functioning and ability to work in female healthcare personnel with recurrent low back pain.\nThe relationship between pain-related fear and lumbar flexion during natural recovery from low back pain.\nEur Spine J 2008;17:97103.\nThe influence of pain-related fear on peak muscle activity and force generation during maximal isometric trunk exertions.\nPain-related fear predicts reduced spinal motion following experimental back injury.\nA diathesis-stress model of chronic pain and disability following traumatic injury.\nMeasurement of lumbar spine functional movement in low back pain.\nFear of injury and physical deconditioning in patients with chronic low back pain.\n[121] Vigotsky AD, Halperin I, Lehman GJ, Trajano GS, Vieira TM.\nFear of movement, quality of life, and self-reported disability in obese patients with chronic lumbar pain.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nThe fear-avoidance model of pain.\nThe opportunity to avoid pain may paradoxically increase fear.\nstrategies on physical impairment in individuals with chronic low back pain.\nPain-related anxiety in the prediction of chronic low-back pain distress.\nEvidence for the role of psychological factors in abnormal paraspinal activity in patients with chronic low back pain.\nSurface electromyography in the identification of chronic low back pain patients: the development of the flexion relaxation ratio.\nFear-avoidance beliefsa moderator of treatment efficacy in patients with low back pain: a systematic review.\nThe role of fear avoidance beliefs as a prognostic factor for outcome in patients with nonspecific low back pain: a systematic review.\nRethinking the fear avoidance model: toward a multidimensional framework of pain-related disability.\nThe effect of pain relief on dynamic changes in lumbar curvature.\nDifferences in standing and forward bending in women with chronic low back or pelvic girdle pain: indications for physical compensation strategies.\nSpine (Phila Pa 1976) 2008;33:33441.\nAssociation of lumbar spine stiffness and flexionrelaxation phenomenon with patient-reported outcomes in adults with chronic low back pain a single-arm clinical trial investigating the effects of thrust spinal manipulation.\nThe effects of Gua sha on symptoms and inflammatory biomarkers associated with chronic low back pain: a randomized active-controlled crossover pilot study in elderly.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited."}