[{"paragraph": {"text": "The spinal column is biomechanically stabilized by three subsystems: 1) passive subsystem that includes bone, cartilage, ligaments, intervertebral disc; 2) active subsystem that includes the paraspinal muscles; and 3) the neural control subsystem. the para are often conceptualized separately, but proprioception , which refers to afferent information arising from internal peripheral areas that contribute to postural control , joint stability , and several conscious sensations are functionally interdependent. Motor control and function include muscle recruitment, strength, and endurance. An important feedback component of neuromotor control is proprioception, which refers to afferent information arising from internal peripheral areas that contribute to postural control, joint stability, and several conscious sensations. Movement and control disorders presumably lead to a proprioceptive deficit, because of stress on local muscle spindles and joint receptors in the painful area resulting from stress to a joint caused by an individual’s maladaptive movement. Subsequently, abnormal joint and tissue loading during daily activities and postures may affect local proprioceptors and maintain this vicious cycle. Changes in muscle activity have been linked to spinal pain (muscle-tension or pain-spasm-pain model) or restriction of spinal motion (pain adaptation).", "sentences_with_results": [{"text": "Three subsystems biomechanically stabilize the spinal column: the passive subsystem includes bone, cartilage, ligaments, and intervertebral disc.", "clauses": [{"text": "The spinal column is biomechanically stabilized by three subsystems.", "triplet": {"subject": "The spinal column", "verb": "is biomechanically stabilized", "object": "by three subsystems"}}, {"text": "The passive subsystem is one of three subsystems.", "triplet": {"subject": "The passive subsystem", "verb": "is", "object": "one of three subsystems"}}, {"text": "the passive subsystem includes bone, cartilage, ligaments, and intervertebral discs.", "triplet": {"subject": "passive subsystem", "verb": "includes", "object": "bone, cartilage, ligaments, and intervertebral discs"}}]}, {"text": "The paraspinal muscles form the active subsystem that biomechanically stabilizes the spinal column.", "clauses": [{"text": "The paraspinal muscles are a group of muscles.", "triplet": {"subject": "The paraspinal muscles", "verb": "are", "object": "a group of muscles"}}, {"text": "the paraspinal muscles are responsible for stabilizing the spinal column.", "triplet": {"subject": "the paraspinal muscles", "verb": "are responsible for", "object": "stabilizing the spinal column"}}, {"text": "the paraspinal muscles form the active subsystem for this purpose.", "triplet": {"subject": "paraspinal muscles", "verb": "form", "object": "active subsystem"}}, {"text": "Biomechanically refers to the way in which the paraspinal musclesstabilizing.", "triplet": {"subject": "Biomechanically", "verb": "refers to", "object": "the way in which the paraspinal muscles stabilizing"}}, {"text": "Biomechanically refers to the way in which the muscles function in relation to the body's mechanics.", "triplet": {"subject": "Biomechanically", "verb": "refers", "object": "to the way in which the muscles function in relation to the body's mechanics"}}]}, {"text": "The neural control subsystem also plays a role in biomechanically stabilizing the spinal column.", "clauses": [{"text": "The neural control subsystem is involved in stabilizing the spinal column.", "triplet": {"subject": "The neural control subsystem", "verb": "is involved in", "object": "stabilizing the spinal column"}}, {"text": "the neural control subsystem also plays a role in biomechanically stabilizing the spinal column.", "triplet": {"subject": "the neural control subsystem", "verb": "plays", "object": "a role in biomechanically stabilizing the spinal column"}}]}, {"text": "People often conceptualize the para separately, but proprioception functionally interdepends on afferent information arising from internal peripheral areas.", "clauses": [{"text": "People often think of the para separately.", "triplet": {"subject": "People", "verb": "think", "object": "of the para separately"}}, {"text": "Proprioception relies on afferent information.", "triplet": {"subject": "Proprioception", "verb": "relies on", "object": "afferent information"}}, {"text": "afferent information comes from internal peripheral areas.", "triplet": {"subject": "afferent information", "verb": "comes", "object": "from internal peripheral areas"}}, {"text": "proprioception and the para have a functional interdependence.", "triplet": {"subject": "proprioception and the para", "verb": "have", "object": "a functional interdependence"}}]}, {"text": "The para are often conceptualized separately, but proprioception contributes to postural control, joint stability, and several conscious sensations.", "clauses": [{"text": "The para are often conceptualized separately.", "triplet": {"subject": "The para", "verb": "are often conceptualized", "object": "separately"}}, {"text": "Proprioception contributes to postural control.", "triplet": {"subject": "Proprioception", "verb": "contributes", "object": "to postural control"}}, {"text": "Proprioception contributes to joint stability.", "triplet": {"subject": "Proprioception", "verb": "contributes", "object": "to joint stability"}}, {"text": "Proprioception contributes to several conscious sensations.", "triplet": {"subject": "Proprioception", "verb": "contributes", "object": "to several conscious sensations"}}]}, {"text": "Afferent information arising from internal peripheral areas functionally interdepends with proprioception, which contributes to postural control, joint stability, and several conscious sensations.", "clauses": [{"text": "Afferent information comes from internal peripheral areas.", "triplet": {"subject": "Afferent information", "verb": "comes", "object": "from internal peripheral areas"}}, {"text": "afferent information interdepends with proprioception.", "triplet": {"subject": "afferent information", "verb": "interdepends", "object": "with proprioception"}}, {"text": "proprioception helps with postural control, joint stability, and conscious sensations.", "triplet": {"subject": "proprioception", "verb": "helps", "object": "with postural control, joint stability, and conscious sensations"}}]}, {"text": "Muscle recruitment is included in motor control and function.", "clauses": [{"text": "Muscle recruitment is a component of motor control and function.", "triplet": {"subject": "Muscle recruitment", "verb": "is", "object": "a component of motor control and function"}}, {"text": "motor control and function encompass muscle recruitment.", "triplet": {"subject": "motor control and function", "verb": "encompass", "object": "muscle recruitment"}}]}, {"text": "Strength is included in motor control and function.", "clauses": [{"text": "Motor control and function involve strength.", "triplet": {"subject": "Motor control and function", "verb": "involve", "object": "strength"}}, {"text": "Strength is a component of motor control and function.", "triplet": {"subject": "Strength", "verb": "is", "object": "a component of motor control and function"}}]}, {"text": "Endurance is included in motor control and function.", "clauses": [{"text": "Motor control and function include endurance.", "triplet": {"subject": "Motor control and function", "verb": "include", "object": "endurance"}}, {"text": "Endurance is a component of motor control and function.", "triplet": {"subject": "Endurance", "verb": "is", "object": "a component of motor control and function"}}]}, {"text": "Proprioception is an important feedback component of neuromotor control.", "clauses": [{"text": "Proprioception is a feedback component.", "triplet": {"subject": "Proprioception", "verb": "is", "object": "a feedback component"}}, {"text": "proprioception is important for neuromotor control.", "triplet": {"subject": "proprioception", "verb": "is", "object": "important for neuromotor control"}}]}, {"text": "Proprioception refers to afferent information arising from internal peripheral areas.", "clauses": [{"text": "Proprioception is a term that describes a type of sensory information.", "triplet": {"subject": "Proprioception", "verb": "is", "object": "a term that describes a type of sensory information"}}, {"text": "This sensory information is called afferent information.", "triplet": {"subject": "This sensory information", "verb": "is called", "object": "afferent information"}}, {"text": "Afferent information comes from internal peripheral areas of the body.", "triplet": {"subject": "Afferent information", "verb": "comes", "object": "from internal peripheral areas of the body"}}]}, {"text": "Proprioception contributes to postural control, joint stability, and several conscious sensations.", "clauses": [{"text": "Proprioception is a factor that contributes to postural control.", "triplet": {"subject": "Proprioception", "verb": "is", "object": "a factor that contributes to postural control"}}, {"text": "Proprioception is also involved in joint stability.", "triplet": {"subject": "Proprioception", "verb": "is involved", "object": "in joint stability"}}, {"text": "Additionally, proprioception plays a role in several conscious sensations.", "triplet": {"subject": "proprioception", "verb": "plays", "object": "a role in several conscious sensations"}}]}, {"text": "Presumably, movement and control disorders lead to a proprioceptive deficit.", "clauses": [{"text": "Movement and control disorders are conditions that affect a person's ability to move and control a person body.", "triplet": {"subject": "Movement and control disorders", "verb": "are", "object": "conditions that affect a person's ability to move and control a person's body"}}, {"text": "movement and control disorders can result in a deficit in proprioception.", "triplet": {"subject": "movement and control disorders", "verb": "can result in", "object": "a deficit in proprioception"}}, {"text": "Proprioception refers to the body's ability to sense its position and movement in space.", "triplet": {"subject": "Proprioception", "verb": "refers to", "object": "the body's ability to sense its position and movement in space"}}, {"text": "When there is a deficit in proprioception, it means that the person has difficulty perceiving and understanding where their body is in relation to its surroundings.", "triplet": {"subject": "there", "verb": "is", "object": "a deficit in proprioception"}}, {"text": "This deficit is believed to be caused by movement and control disordersthe body ability to sense its position and movement in space position and movement in space.", "triplet": {"subject": "This deficit", "verb": "is believed", "object": "to be caused by movement and control disorders, the body's ability to sense its position and movement in space"}}, {"text": "When there is a deficit in proprioception, a deficit in proprioception means that the person has difficulty perceiving and understanding where their body is in relation to its surroundings.", "triplet": {"subject": "deficit", "verb": "means", "object": "that the person has difficulty perceiving and understanding where their body is in relation to its surroundings"}}, {"text": "a deficit in proprioceptionthe person body is in relation to their body surroundings.", "triplet": {"subject": "a deficit in proprioception", "verb": "is", "object": "the person body in relation to their body surroundings"}}, {"text": "This deficit is believed to be caused by movement and control disorders.", "triplet": {"subject": "This deficit", "verb": "is believed", "object": "to be caused by movement and control disorders"}}]}, {"text": "Stress on local muscle spindles and joint receptors in the painful area results from stress to a joint caused by an individual's maladaptive movement.", "clauses": [{"text": "Stress is placed on local muscle spindles and joint receptors.", "triplet": {"subject": "Stress", "verb": "is placed on", "object": "local muscle spindles and joint receptors"}}, {"text": "stress occurs in the painful area.", "triplet": {"subject": "stress", "verb": "occurs", "object": "in the painful area"}}, {"text": "stress is caused by an individual's maladaptive movement.", "triplet": {"subject": "stress", "verb": "is caused by", "object": "an individual's maladaptive movement"}}, {"text": "an individual maladaptive movement leads to stress on a joint.", "triplet": {"subject": "an individual maladaptive movement", "verb": "leads to", "object": "stress on a joint"}}]}, {"text": "Abnormal joint and tissue loading during daily activities and postures may affect local proprioceptors.", "clauses": [{"text": "Abnormal joint and tissue loading can occur during daily activities and postures.", "triplet": {"subject": "Abnormal joint and tissue loading", "verb": "can occur", "object": "during daily activities and postures"}}, {"text": "abnormal joint and tissue loading may have an impact on local proprioceptors.", "triplet": {"subject": "abnormal joint and tissue loading", "verb": "may have", "object": "an impact on local proprioceptors"}}]}, {"text": "This may maintain the vicious cycle.", "clauses": [{"text": "Maintaining the vicious cycle is a possibility.", "triplet": {"subject": "Maintaining the vicious cycle", "verb": "is", "object": "a possibility"}}, {"text": "maintaining may contribute to maintaining the vicious cycle.", "triplet": {"subject": "maintaining", "verb": "contribute", "object": "the vicious cycle"}}]}, {"text": "Researchers have linked changes in muscle activity to spinal pain, specifically the muscle-tension or pain-spasm-pain model.", "clauses": [{"text": "Changes in muscle activity have been linked to spinal pain.", "triplet": {"subject": "Changes in muscle activity", "verb": "have been linked to", "object": "spinal pain"}}, {"text": "The specific model that explains linked is called the muscle-tension or pain-spasm-pain model.", "triplet": {"subject": "The specific model", "verb": "explains", "object": "linked"}}, {"text": "According to the muscle or pain model, muscle tension or spasms can cause pain in the spine.", "triplet": {"subject": "muscle tension or spasms", "verb": "can cause", "object": "pain in the spine"}}]}, {"text": "The pain adaptation theory suggests that changes in muscle activity can be linked to the restriction of spinal motion and subsequent spinal pain.", "clauses": [{"text": "The pain adaptation theory suggests that changes in muscle activity are connected to the restriction of spinal motion.", "triplet": {"subject": "The pain adaptation theory", "verb": "suggests", "object": "that changes in muscle activity are connected to the restriction of spinal motion"}}, {"text": "the restriction of spinal motion can lead to spinal pain.", "triplet": {"subject": "restriction of spinal motion", "verb": "can lead to", "object": "spinal pain"}}, {"text": "the pain adaptation theory proposes that changes in muscle activity are a contributing factor to spinal pain.", "triplet": {"subject": "the pain adaptation theory", "verb": "proposes", "object": "that changes in muscle activity are a contributing factor to spinal pain"}}]}], "sentences_without_results": []}}]