{"title": "13.The_Impact_of_Psychosocial_Factors_on_Low_Back.19.pdf", "contents": "There is growing consensus that psychosocial factors play a role in the development of LBP, although results are not consistent across studies.\nWithin a sample of 2556 middle-aged men and women from the Belstress study, baseline psychosocial factors were measured through self-administered questionnaires and related to prevalent cases of LBP after a mean time interval of 6.\nAfter adjustment for individual and physical risks, including occasional back pain at baseline, the prevalence rate of LBP in men is significantly related to baseline low decision latitude and low social support at work, and nonsignificantly to high job strain, low wage and job satisfaction, feeling stressed at work, and feeling depressed.\nHigh job insecurity, feeling stressed at work, and feeling depressed nonsignificantly increase the relative risks for LBP in women.\nBased on the results of this study, psychosocial factors (both work and nonwork-related) constitute nonnegligible risks for the development of LBP.\nLow back pain (LBP) is a considerable health problem in most Western countries.\nAccording to the Third European Survey on Working Conditions of 2000, 33% of European workers report backache, making it one of the most prevalent work-related health problems.\n1 Since most of the chronic low back disorders are believed to be multifactorial in origin, much research effort has been put in identifying different kinds of risk factors of LBP.\nThe occurrence and development of LBP is not only ascribed to individual characteristics but also to factors from the work environment.\nand physical work factors such as heavy lifting, repetitive motion, non-neutral body postures and vibration, are considered as established risks for back disorders.\nThere is growing consensus, however, that in addition to physical work load, psychosocial work characteristics play a role in LBP.\n47 The most common work-related psychosocial constructs in epidemiological research include factors like workload, limited control over work, job satisfaction, feeling stressed, and relationships at work.\nNumerous studies have emphasized the need to take into account both physical and psychosocial characteristics simultaneously in epidemiological studies on LBP.\n1417 There is general agreement that some association exists, but it is difficult to draw firm conclusions due to inconclusive evidence.\nThe inconsistency of study results is partly related to some crucial methodological issues, such as the study design, the assessment of exposure and outcome variables, and appropriate controlling for demographic and physical risk factors.\nThe aim of this study is to describe the impact of psychosocial factors, both workand nonwork-related, on the prevalence of LBP within a longitudinal study design.\n18 A total of 2821 workers from 9 different companies or public administrations were involved in the longitudinal part of the study.\nData were gathered at baseline between 1995 and 1998 and a second time in 20022003 after a mean time interval of 6.\n5% was reached at the second phase.\nFor the longitudinal analyses described here, workers whose job title changed during the time interval according to the first digit of the International Standard Classification of Occupations (265 subjects) were excluded.\nThe ethics committees of the University Hospital of Ghent and the Faculty of Medicine of the Free University of Brussels approved the Belstress study.\nAcknowledgment date: January 9, 2006.\nFirst revision date: February 2, 2006.\nSecond revision date: March 15, 2006.\nThird revision date: March 29, 2006.\nThe manuscript submitted does not contain information about medical device(s)/drug(s).\nFederal funds were received in support of this work.\nNo benefits in any form have been or will be received from a commercial party related directly or indirectly to the subject of this manuscript.\nPsychosocial factors at baseline were measured through self-administered questionnaires.\nFive items measured psychological job demands.\nReliability and validity of these scales within the Belstress study project have been demonstrated.\nPerception of job insecurity was measured with 2 questions from the Job Content Questionnaire.\nIn addition, the general questionnaire contains 3 items concerning job and wage satisfaction, and feeling stressed at work.\nThree psychosocial factors outside the work environment were assessed through baseline questionnaires.\nThe strength of social networks refers to a score based on 3 items regarding the number and nature of contacts with friends and family.\nOne question was added asking about the general satisfaction with private life.\n26 Five Job Content Questionnaire items regarding physical demands of the job were included: physical effort, lifting heavy loads, rapid physical activity, awkward body positions, and awkward arm positions.\n22 Trained observers medically examined participants at baseline.\nBody mass index (BMI) was calculated as body weight (kg) divided by the square of the height (m).\n27 Participants were classified as having LBP when they had had LBP of any kind for a total of 8 days or more during the previous 12 months.\nAll psychosocial risk factors were dichotomized.\nHigh job strain refers to the combination of high job demands (values above the median) and low decision latitude (values below the median).\nLow satisfaction with the job, wage, and private life refers to being (very) dissatisfied as opposed to neutral or (very) satisfied.\nParticipants were classified as stressed at work when they felt moderately or very stressed.\nThe upper quartile of the depression scale with scores of 18 or higher is considered to suffer from depressive feelings.\nHigh physical job demands are identified when respondents (fully) agree with the questions regarding physical effort, lifting heavy loads, rapid physical activity, awkward body positions, and awkward arm positions at work.\nA BMI between 25 and 29 kg/m2 is classified as overweight and a BMI of 30 kg/m2 or more as obesity.\nChi-square tests were carried out to explore whether cases with LBP differ from noncases in individual and physical characteristics at baseline.\nCox regression analyses were conducted in order to assess the impact of baseline psychosocial factors on LBP.\nIndividual and physical factors were included in the full model, regardless of the results of their univariate associations with the outcome variable.\n29 Adjustments were made for individual and sociodemographic variables (age, BMI, educational level, sector of employment, occasional back pain, smoking status, and living situation) in the first step, and, additionally, for physical factors (physical activity, physical effort, lifting heavy loads, rapid physical activity, awkward body positions, and awkward arm positions at work) in the next step.\nAnalyses were performed separately for men and women.\nAll analyses were conducted using SPSS 12.\nThe mean age of the sample at baseline was 43.\nIndividual and physical characteristics at baseline in cases and noncases are shown in Table 1.\nThe prevalence of cases with LBP is higher in participants with a lower educational level, workers from the public sector, those with occasional back pain at baseline, smokers, and workers with high physical job demands.\nWomen aged 45 years or more have more LBP than those who are younger.\nLBP is more frequent in men with overweight and obesity.\nThe relative risk for LBP in men is significantly increased with 37% by baseline low decision latitude and with approximately one fifth by baseline high job strain, low social support at work, low wage satisfaction, and feeling stressed at work.\nA nonsignificant association is noted regarding low job satisfaction in men.\nWithin the female population, nonsignificant associations are found with low decision latitude, high job insecurity, and feeling stressed at work.\nNo clear associations in men or women were found with psychological job demands.\nWithin this study design, we could not exclude workers with LBP at baseline because the Nordic Questionnaire was not available.\nHowever, information was available regarding occasional back pain at baseline.\nIn multivariate Cox regression analyses, individual and physical risk factors were included in the full model (Table 3).\nOverall, most relationships between psychosocial factors and LBP are not essentially mediated by individual or physical variables.\nAfter adjustment for individual, sociodemographic, and physical risks, the relative risk for LBP in men is significantly increased by baseline low decision latitude (relative risk 1.\nIn men, a borderline significant association is found with feeling stressed at work, and nonsignificant associations with high job strain, low job and wage satisfaction, and feeling depressed.\nThe relative risk for LBP in women is borderline significantly increased by feeling depressed, and nonsignificantly by high job insecurity and feeling stressed at work.\nReference categories are high unless stated otherwise.\nReference category is others.\nReference category refers to not feeling stressed or depressed.\nSignificant crude associations between LBP and baseline physical job demand items were identified in men and women, with relative risk ratios ranging from 1.\nAfter adjustment for individual and sociodemographic variables, nonsignificant associations are found with awkward body positions in men and awkward arm positions in women.\nNo interaction effects were found between psychosocial factors and physical job demands in relation to LBP.\nControlling for physical work factors does not reduce the strength of the associations between psychosocial factors and LBP extensively.\nThe aim of this longitudinal study was to explore the impact of psychosocial risk factors on LBP.\nWithin a sample of 2556 middle-aged men and women, psychosocial factors at baseline were related to the prevalence of cases with LBP after a mean time interval of 6.\nof psychosocial factors in the etiology of LBP, some recent reviews have emphasized the uncertainty of the exact relationship due to the lack of consistency in study results.\nBased on the results of this study, psychosocial factors constitute nonnegligible risks for LBP.\nMoreover, most associations are independent from occasional back pain at baseline, as well as from other individual and physical risk factors.\nAmong the psychosocial work characteristics, one of the significant and independent predictors of LBP in men is baseline low social support at work.\nSeveral studies reported that the most consistent and pronounced associations with back pain were situated in the field of worksite social support.\n8,9,3033 In reviewing prospective studies on psychosocial work characteristics and LBP, Hoogendoorn et al6 found strong evidence for low social support in the workplace as a risk factor.\nReference categories are high unless stated otherwise.\nReference category is others.\nReference category refers to not feeling stressed or depressed.\nSubstantial heterogeneity exists in the literature regarding the role of low job control and low job satisfaction in LBP.\nAlthough some reviews find support for a positive association between these factors and LBP,6,7,15 others contradict this.\nIn our longitudinal study, the prevalence of LBP is both related to psychosocial work characteristics themselves (low decision latitude and low social support in men and high job insecurity in women), as to employee reactions to work conditions (low job and wage satisfaction in men and feeling stressed at work in men and women).\nWhen assessing associations between psychosocial factors and LBP, the emphasis in most studies is on characteristics related solely to the work environment.\nHowever, psychosocial factors outside the work environment may also play an important role in the development of LBP.\nConditions of psychological or emotional distress, including depressive feelings and anxiety, have also been related to musculoskeletal disorders and LBP.\nSome notable gender differences were found in our study.\nOverall, psychosocial work factors proved to be important with respect to LBP, but to a lesser extent in women as compared to men.\nSimilar results were found in various other studies.\nWith respect to the effect of job demands, job control, and job satisfaction, the evidence for gender differences is inconclusive due to inconsistent results.\nNo evidence was found of a gender difference in the impact of social support at the workplace, which is not in line with the results of this study.\nAn important problem in many studies exploring the impact of psychosocial factors on LBP is the lack of proper adjustment for other risk factors, especially physical or biomechanical workload.\n6,16 In our study, however, relationships between psychosocial factors and future LBP are not essentially confounded by individual or physical variables.\nNevertheless, random error in the operationalization of LBP was minimized because of the use of the validated and standardized Nordic questionnaire for musculoskeletal symptoms.\n27 LBP in this study was identified as having had LBP for a total of 8 days or more during the previous 12 months, which is very common.\nThis led to similar results, although some of the associations did not reach statistical significance.\nSince the Nordic questionnaire was not included in the baseline questionnaire, it was not feasible to conduct prospective analyses on the subsample with no LBP at baseline.\nHowever, information was available regarding occasional back pain at baseline.\nWith the inclusion of this variable in multivariate analyses, it is fair to assume that the largest part of LBP at baseline is controlled for.\nMoreover, additional analyses after exclusion of all participants with occasional back pain at baseline roughly engendered similar results regarding psychosocial factors and LBP.\nA notable limitation of this study is that no information is available on possible changes in exposure to psychosocial factors between baseline and the assessment of LBP at the second study phase.\nParticipants whose job title changed during the time interval were excluded.\nThis was done in order to rule out changes in psychosocial work factors due to objective changes in the work environment.\nIn addition, measuring job characteristics at only one point in time increases the risk of misclassification due to inaccuracy in assessment.\nThe presence of a selection bias in the population should be taken into consideration when interpreting the results.\nFor the longitudinal results of this study, only those workers who were involved in both phases of the data collection were included.\nWithin the 9 participating companies, a total of 8783 employees had participated in the first study phase.\nAt the second study phase, more than half of this original population was no longer eligible due to retirement, resignation, dismissal, or decease.\nIt concerns primarily workers from lower educational levels, lower occupations, and older age groups.\nWithin 3 companies from the secondary or manufacturing sector, major reorganizations and restructuring measures had been carried out, as a result of which 73% of the original study sample was no longer at work there after the follow-up period.\nWithin 2 public administrations, 33% was no longer eligible, which was mostly due to natural retirements.\nObviously, this results in a healthy worker effect within our population.\nAt baseline, the drop-out population perceived significantly less job control.\nOur results provide additional support to the findings linking LBP to psychosocial risk factors.\nBoth work and nonwork-related psychosocial factors are associated with having LBP after 6.\nMoreover, the associations are independent from some important individual and physical risk factors, including occasional back pain at baseline.\nBased on the results of this study, both work and nonwork-related psychosocial factors constitute nonnegligible risks for LBP.\nThe associations between psychosocial factors and LBP are independent from some important individual and physical risk factors, including occasional back pain at baseline.\nIn women, psychosocial work factors were less important with respect to LBP as compared to men."}