{"title": "16.Low_Back_Pain_Patients_Learn_to_Adapt_Motor.7.pdf", "contents": "Low-Back Pain Patients Learn to Adapt Motor Behavior With Adverse Secondary Consequences.\nLow-Back pain patients learn to adapt motor behavior with adverse secondary consequences.\nWe hypothesize that changes in motor behavior in individuals with low-back pain are adaptations aimed at minimizing the real or perceived risk of further pain.\nThrough reinforcement learning, pain and subsequent adaptations result in less dynamic motor behavior, leading to increased loading and impoverished sensory feedback, which contribute to cortical reorganization and proprioceptive impairments that reduce the ability to control lumbar movement in a robust manner.\nLow-back pain tends to change motor behavior toward increased coactivation, reduced deep muscle activity, and less within-subject variance.\nMinimizing a weighted sum of costs, including the risk of losing control and nociceptive input, predicts these pain-related changes.\nIn addition to actual benefits with respect to risk and nociception, changes may be driven by maximization of perceived benefits.\nOriginally adaptive changes have negative consequences that may outweigh benefits in the long term.\nMotor control exercise is a commonly used treatment for LBP.\nAlthough systematic reviews support its effectiveness, like other treatments for LBP, the effect size is not large (33).\nMotor control in LBP is changed at many levels of the nervous system.\nStudies of individuals with and without LBP have reported differences in voluntary trunk muscle activation (45), trunk muscle reflexes (32), and trunk kinematics (20) and in cortical mapping of sensory inputs from (5), and motor outputs to (36), the trunk.\nFor example, according to a systematic review, there is support of both an increase and a decrease of trunk muscle activation in individuals with LBP (45).\nIn reinforcement learning, a reward (positive reinforcement) or the absence or reduction of a cost (negative reinforcement) increases the likelihood that a performed behavior will be repeated and thus learned.\nMotor control can be considered as the outcome of a learning process aimed at optimizing a combination of costs and rewards.\nFor clarity, either costs or rewards usually are inverted, such that a sum of weighted costs can be minimized or a sum of weighted rewards can be maximized.\nIn pain-free conditions, costs associated with control efforts or muscle activation are considered most important.\nWe assume that with LBP, weighting of costs associated with potential loss of control over posture and movement and costs associated with potential pain provocation increase, and one learns to minimize this new weighted sum of costs.\nvan Dien, Department of Human Movement Science, MOVE Research Institute Amsterdam, Vrije Universiteit Amsterdam, Van der Boechorststraat 9, NL-1081 BT Amsterdam, the Netherlands (E-mail: j.\nUnauthorized reproduction of this article is prohibited.\nactivation and movement patterns may differ between individuals, patients with LBP will tend to control posture and movement more rigidly, causing more stereotypical muscle activation and kinematics.\nThese secondary, long-term effects may contribute to recurrence and chronicity of back pain.\nFurthermore, these previous publications either assumed hardwired reflexive changes in motor behavior with pain (24) or did not address the processes underlying these changes (14,43,45).\nThe ideas proposed in this article likely are applicable to other movement-related pain syndromes, but we will limit ourselves here to LBP because this allows more specific testing of the hypotheses.\nThe aims of the present article were to describe this hypothesis.\nIn the first part of the article, we describe how LBP might induce learning that adapts motor behavior.\nWe provide a formalization of this part of the hypothesis in a simple optimization model of trunk motor control, which yields predictions on motor behavior in patients with LBP that we compare with empirical findings.\nIn the second part of the article, we describe how these changes on motor control may lead to adverse physiological, neurological, and mechanical effects and how these secondary effects might contribute to the persistence of LBP.\nBY WHAT MECHANISM DOES LBP AFFECT MOTOR CONTROL?.\nIn normal conditions, motor behavior is somewhat variable.\nThis is illustrated on the left, with the dotted lines representing near optimal movement trajectories of a marker on the trunk and the circles representing the area of end point positions of this marker over a series of repeated movements.\nWith incidence of LBP, variability will increase because nociception interferes with motor control.\nOnce the new optimal pattern (dashed line) is found, motor variability is reduced because costs of movement (pain, potential loss of control) may rapidly increase with changes in behavior.\nThis adaptive behavior may lead to secondary consequences in joint structures and muscles due to increased and more sustained muscle activity and to reorganization of the sensory and motor cortex because of the more stereotypical sensory feedback and selective muscle recruitment.\nThese changes may increase uncertainty about motor control and hence, perceived movement-related threats, which may further reinforce the adaptations in motor behavior.\nUnauthorized reproduction of this article is prohibited.\nExperimentally induced nociception from back muscles, or the resulting pain perception, changes control of trunk muscles in a manner resembling that observed in clinical LBP (9,45).\nNociception may modify motor control online by providing feedback regarding the consequence of the exerted control, possibly even in pain-free conditions.\nWe propose that changes in control arising from nociception and pain can be understood in the context of optimal control.\nIt has been suggested that movement planning occurs sequentially at two hierarchical levels: initially to plan the kinematic trajectory and subsequently to plan a muscle recruitment pattern that fits the planned kinematic trajectory (18).\nMany reinforcement learning studies have addressed adaptation in the control of goal-directed arm movements to mechanical perturbations.\nThe results differed in important ways from those in goal-directed arm movements.\nFirst, participants converged on an adapted center of mass trajectory after relatively few trials.\nThese differences were interpreted as indicating that the CNS takes other costs into account in addition to costs of movement.\nSpecifically, the risk of losing balance is significant.\nIf preventing balance loss is an objective of the CNS, then rapid convergence on an adapted trajectory (consistent with experimental results) is of great importance.\nHowever, this may represent a local minimum because further exploration to adapt would involve a steep increase in costs that may actually increase the risk of balance loss.\nMore generally, we suggest that motor control is the outcome of a learning process in which a weighted sum of costs is minimized.\nThe weighted sum comprises costs related to control effort and muscle activity, metabolic costs, and fatigue development, as well as costs that reflect more indirect effects of the selected motor pattern such as the risk of losing control over posture or movement and the possibility of pain provocation.\nThe task requires a given net moment (20 Nm) to be produced by these three muscles, which is comparable to standing with a slightly forward-inclined trunk.\nWe assumed that three costs govern the selection of a muscle recruitment pattern.\nThe value of the exponent p was set to 3 to minimize the loss of muscle force due to sustained activity, which has been shown to accurately predict muscle activity of trunk muscles (42) (reasonable predictions were generated with any p > 1).\nIn this simplified model, this effect can be achieved only through increasing muscle stiffness by means of coactivation.\nWe arbitrarily set p to 1.\nThe three cost functions were normalized to their maximum values over the range from zero to full activation for all muscles to assure equal scaling over the range of muscle activation from 0 to 1.\nThe costs as functions of the forces in the two extensor muscles are illustrated in the top panels of Figure 2.\nCosts 1 and 3 penalize high muscle forces, whereas cost 2 penalizes low muscle forces.\nWe explored the effects of changing the vector w to simulate the effects of LBP.\nUnauthorized reproduction of this article is prohibited.\nThis is accomplished by exploring the surface of the weighted cost function and converging on an optimal recruitment pattern that combines the muscle forces with the lowest cost (indicated by an asterisk).\nfunction from w(0) to w(1) shifts the optimal muscle recruitment pattern toward higher activation of the larger of the two extensor muscles, because of the higher weighting of admittance, which favors the muscle with the larger moment arm.\nIn addition, the level of antagonistic coactivation increases.\nFurthermore, the curvature of the surface of the weighted cost function around the optimum solution is steeper for w(1) than for w(0).\nThe model results predict higher coactivation, preferential recruitment of large superficial muscles, and less exploration with pain than in the pain-free condition.\nIt should be noted that the present cost function for pain is quite simplistic.\nIn reality, it could be that activity of one muscle provokes pain and that of another muscle does not.\nTherefore, we choose this simple cost function.\nAn important aspect of the proposed hypothesis is that.\nminimization is based on reinforcement learning.\nThis introduces the possibility for a feedback mechanism, where one change to the motor strategy leads to a perception of increased safety or decreased pain.\nThis may explain why increasing muscle activity can reduce perceived pain under a constant nociceptive input (19).\nWe recently have provided more specific data to this effect.\nThe upper body center of mass (CoM) is indicated by the red circle, the joint center of rotation (CoR) by the blue circle, with the inclination of the upper body leading to an external moment around the CoR of 20 Nm.\nThe right graphs show in the upper panels the three objectives outlined in the text as a function of forces produced by muscles 1 and 2.\nUnauthorized reproduction of this article is prohibited.\nparticipants were provided with a noxious stimulus during wrist movement, adaptation of the motor strategy led to reduced pain perception regardless of whether the noxious input was reduced by the adaptation (Bergin MJ, Tucker K, Hodges PW.\nIt is important to note that the proposed model does not predict local minima of the weighted sum of costs.\nLocal minima will occur when one of the objective functions is nonconvex.\nCHANGES IN MOTOR BEHAVIOR WITH LBP The proposed reinforcement learning model predicts that individuals with LBP will display 1) greater coactivation, 2) more activity of large superficial muscles, and 3) lower variability in muscle recruitment than individuals without pain.\nPainrelated changes will be driven not only by nociception but also by pain-related cognitions, such as fear or anticipation of pain, which would change weighting of the objectives similarly to nociception.\nBetween-subject variability in motor strategies may be larger among individuals with LBP than among those without pain.\nCoactivation The model predicts that coactivation increases during pain to reduce admittance.\nThese changes in muscle recruitment would be associated with small displacements after mechanical perturbations.\nIn line with the model predictions, experiments using experimental noxious stimuli to the low back have shown increased activity of trunk muscles and decreased displacements after trunk perturbations (8).\nPreferential Recruitment of Superficial Muscles The model predicts that pain biases recruitment toward superficial muscles with large moment arms relative to deep muscles with smaller moment arms.\nThis prediction is supported by studies on anticipatory activation of trunk muscles.\nThese studies have reported reduced and delayed activation of deep muscles relative to superficial muscles after administration of a noxious stimulus to the low back (10).\nIn addition, studies comparing participants with and without LBP have consistently reported delayed recruitment of deep muscles relative to superficial muscles (9,1113,25,28) and earlier activation of the superficial abdominal muscles in participants with LBP (30).\nWithin-Subject Variability The higher weighting of objectives related to admittance and nociception caused the surface of the weighted cost function to be more curved, which would suggest that exploration is limited by pain.\nThis prediction was supported in a recent study, where we applied a force field to the ankle during gait and provided noxious input to the tibialis anterior muscle.\nParticipants with and without pain adapted quickly to the force field to continue walking without loss of balance, but only the participants without pain were able to continue to refine their adaptation; participants with pain continued to use their initially adopted solution (Bouffard J, Salomoni SE, Mercier C, Tucker K, Roy JS, van den Hoorn W, Hodges PW, Bouyer LJ.\nIndividuals with chronic LBP have been reported to display lower variability of muscle recruitment (6,16) and lower variability of trunk kinematics (22,29) than individuals without pain.\nEffect of Pain-Related Cognitions In line with our hypothesis, the effects of LBP on trunk muscle activity (41) and trunk displacement after perturbations (17) are more pronounced in participants with high scores on pain catastrophizing or fear of movement.\nUnauthorized reproduction of this article is prohibited.\nConclusions Regarding Motor Behavior in LBP The model used to illustrate the hypothesis that changes in motor behavior with LBP are determined by reinforcement learning, which minimizes uncertainty and pain, is simplified.\nDespite this limitation, empirical observations are consistent with predictions overall.\nMoreover, pain-related perceptions moderate the effects of LBP on motor behavior (as proposed by the model), which leads to variance in effects between individuals and between conditions.\nFor instance, adaptive motor behavior may be more obvious in tasks that impose a substantial threat of pain.\nIncreased and more sustained trunk muscle activity would come at a cost in terms of muscle and spine loading.\nPatients maintaining sustained trunk muscle activity, even at a low level, may incur decreased muscle capabilities and related discomfort, or even pain of muscular origin (48), especially in the presence of sensitization.\nIncreased trunk muscle activation to reduce admittance also comes at the cost of increased spinal loading.\nFurthermore, low-level coactivation of trunk muscles may occur in LBP patients even at rest (45), implying sustained compression of the spine, which animal models implicate as a cause of intervertebral disc degeneration (23).\nThere also may be adverse mechanical consequences of the decreased variation that would be expected to accompany LBP.\nIt is increasingly recognized that some degree of variation in tissue mechanical loading is essential for tissue health (34).\nIn addition to mechanical consequences, adaptations in trunk control due to LBP can be expected to have neurological consequences.\nWe hypothesize that this may contribute to the changes in representations of the trunk in the somatosensory (37) cortex observed with LBP.\nIn turn, these changes in the sensory cortex could contribute to the impaired proprioception (35) and the related imprecision in control of trunk movement in individuals with chronic LBP (50).\nFurthermore, conventional muscle recruitment patterns, with relative inhibition of deep muscle activity, are associated with changes in representations of trunk muscles on the motor cortex in individuals with LBP (5).\nthe reduced motor variability (30), may limit the ability to relearn normal motor control even after LBP has receded.\nFurthermore, the predictions of our model that within-subject variance of trunk motor behavior is smaller in individuals with LBP than in individuals without pain needs further study, as does the prediction that between-subject variance is higher among individuals with LBP.\nFurthermore, the hypothesis suggests that motor control exercises should be aimed at increasing admittance, inhibition of superficial muscles and stimulation of deep muscles, training of proprioception, or instilling confidence in the ability to control lumbar motion.\nFinally, when designing interventions, the potential for a reduced ability to relearn normal motor control because of the presence of pain and the secondary effects thereof needs to be considered.\nThe preparation of this article was facilitated by a Koselleck award by the Deutsche Forschungsgemeinschaft to Herta Flor.\nPaul Hodges is supported by a research fellowship (APP1102905) and program grant (APP1091302) from the National Health and Medical Research Council of Australia.\nUnauthorized reproduction of this article is prohibited.\nChanges in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nPeople with chronic low back pain exhibit decreased variability in the timing of their anticipatory postural adjustments.\nFear of movement is related to trunk stiffness in low back pain.\nLamoth CJ, Daffertshofer A, Meijer OG, Lorimer Moseley G, Wuisman PI, Beek PJ.\nEffects of chronic low back pain on trunk coordination and back muscle activity during walking: changes in motor control.\nIntervertebral disc cell death is dependent on the magnitude and duration of spinal loading.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nTrunk muscle recruitment patterns in patients with low back pain enhance the stability of the lumbar spine.\nLow-level activity of the trunk extensor muscles causes electromyographic manifestations of fatigue in absence of decreased oxygenation.\nUnauthorized reproduction of this article is prohibited."}