{"title": "19.B.1-s2.0-S2468781216300224-main.pdf", "contents": "Kinematics of the lumbar spine and lower extremities were measured using 3D motion capture, while subjects picked up an object off the floor.\nPeople with LBP were examined and assigned to movement-based LBP subgroups.\nRepeated measures ANOVA tests were conducted to determine the effect of group and region on lumbar spine and lower extremity kinematics.\nA secondary analysis was conducted to examine the effect of LBP subgroup on lumbar spine kinematics.\nThere were no group differences in frontal or axial plane lumbar spine kinematics.\nConclusions: When evaluating movement during a functional task, the clinician should consider regional differences in the lumbar spine, pattern of movement, and lower extremity movement.\nLow back pain (LBP) is a common musculoskeletal condition that affects one third of the American population at any given point in time and up to 80% of Americans will experience LBP at some point during their lifetime (Andersson, 1999).\nWhen evaluating a patient with LBP, physiotherapists often use a movement-based approach to determine what movements may be related to the LBP problem or improve LBP symptoms in order to guide diagnosis and treatment (Sahrmann, 2002).\nmovement-based impairments during functional activities in people with LBP can provide a basis for modifying these activities during treatment.\nSeveral factors need to be considered when interpreting spine kinematics during functional activities.\nRecent studies provide strong evidence that there are regional differences in kinematics between the upper (L1-L3) and lower lumbar spine (L4-L5) (Dankaerts et al.\nexamined kinematics during sitting and reported that differences between LBP and control groups were only evident when the subjects were divided into LBP subgroups, and that movement-based measures can predict subgroup classification (Dankaerts et al.\nlower) and LBP subgroups are important factors to consider when interpreting spinal kinematics.\nSeveral investigators have examined lumbar spine and hip kinematics during functional tasks.\nThis research supports using kinematic analysis to differentiate between subjects with and without LBP during a lifting task.\nHowever, to our knowledge, no study has examined threedimensional spine and lower extremity kinematics during a multi-planar functional task that is routinely performed during daily activities, differentiating upper and lower lumbar spine segments, between a clinical population of people with LBP and people without LBP, and among movement-based LBP subgroups.\nThe purpose of this study was to examine differences in threedimensional lumbar spine and lower extremity kinematics in people with and without LBP during the functional task of picking up an object from the floor.\nBased on prior research, we hypothesized that people with LBP would demonstrate less lumbar flexion accompanied by greater lumbar rotation as has been reported in previous studies (Lee et al.\nBecause of the close coupling of the lower extremity and lumbar spine during the pick up task and that the lower extremities were free to move during the task, we also hypothesized that people with LBP would display greater lower extremity flexion compared to controls, in order to accomplish the task.\nA cross-sectional observational design was utilized to examine differences in kinematics between people with and without LBP.\nThe study was approved by the Human Subjects Research Committee at Nazareth College (Rochester, NY) and subjects provided written informed consent prior to participating.\nA sample of thirty-five people between the ages of 18e65 was recruited and tested in the Movement Analysis Laboratory at Nazareth College (Rochester, NY) from January 2011 through May 2013.\nEighteen subjects with LBP were recruited from two different outpatient orthopedic clinics where they were seeking treatment.\nSeventeen control subjects were recruited from the college campus and surrounding community, including physicians offices.\nSubjects with LBP were included if they reported a primary complaint of LBP for which they sought physical therapy treatment, and were tested prior to commencing treatment.\nSubjects without LBP were included if they had no history of LBP, and were matched to a subject in the LBP group based on age, gender, height, weight, and BMI.\nPeople were excluded from participating if they had a history of serious spinal or medical conditions, physical or mental disabilities, pregnancy, or with a BMI greater than 30 kg/m2.\nSubjects with LBP completed self-report questionnaires including a demographics form, Modified Oswestry Disability Index (ODI), Fear-Avoidance Beliefs Questionnaire (FABQ), and a numeric rating scale (NRS) for symptoms of LBP.\nThe modified ODI is a valid and reliable measure to assess perceived disability related to spine conditions (Fritz and Irrgang, 2001).\nSubjects with LBP rated their current symptoms and symptoms over the last seven days using an 11-point NRS (0  no pain, 10  worst imaginable pain).\nThe upper lumbar segment was defined by 2 markers 4 cm lateral to the spinous processes of L1 and a single marker on the spinous process of L3.\nThe lower lumbar segment was defined by 2 markers 4 cm lateral to the spinous processes of L4 and a single marker on the spinous process of L5.\nThe pelvis was defined by the markers placed on the posterior superior iliac spine, anterior superior iliac spine, posterior pelvis and iliac crests bilaterally.\nThree markers were placed on each thigh and lower leg segments bilaterally for lower extremity segments.\nCalibration markers were placed on the medial and lateral femoral condyles bilaterally for joint center calculations.\nThe functional method was used to calculate the location of hip joint centers, and an anatomical method was used to calculate knee joint center (Schwartz and Rozumalski, 2005).\nA small object of negligible weight (digital metronome) was placed on the floor six inches in front of each subject.\nThe subject was instructed to pick up the object as they normally would, at a self-selected speed and using a self-selected hand.\nSubjects were then asked to use the same hand to pick up the object across all three trials of the pickup task.\nDuring each trial, each subject with LBP was queried to determine whether LBP symptoms increased, decreased, or remained the same as a result of the pick up task.\nAfter motion capture testing, a clinical examination was conducted for all subjects with LBP, by a licensed physical therapist with advanced training in the Movement System Impairment (MSI) classification system (first author).\nSubjects were placed into movement-based subgroups (Rotation, Extension with Rotation, Flexion with Rotation) based on the direction of movement impairments and associated LBP symptoms.\nData from the optical motion capture system was postprocessed in Nexus (Vicon, Inc) and then exported to Visual-3D (C-motion, Inc.\nSegment angles were examined and movement time was defined from the start to the end of the down phase of each movement trial.\nMeasuring angular excursion provides an index of the range of movement, in a particular plane of motion, that the subject was required to control during the task.\nExcursion measures were used because each person was able to self-select a movement strategy for the task.\nBecause movement strategies and pickup hand varied across individuals, to normalize across all subjects, excursion was calculated to characterize the total amount of sagittal plane (extension to flexion), frontal plane (lateral bending from left to right), and axial plane (rotation from right to left) movement during the task.\nTo characterize pattern of lumbar region movement during the task, movement time was divided into quartiles (0e25%, 25e50%, 50e75%, 75e100%) and change in segment angle within each quartile was calculated for each plane of motion.\nAll kinematic measurements were averaged across the three movement trials.\nIndependent samples t-tests were used to test for differences between the LBP and control groups for age, gender, height, weight, BMI, and pick up movement time (Table 1).\nMixed model ANOVA tests were used to examine the effect of group (LBP, control) and lumbar region (upper, lower) on spine segment excursion and pattern of motion (movement quartiles) in each plane during the pickup task.\nMixed model ANOVA tests were used to examine the effect of group and segment (hip, knee) on lower extremity excursion in each plane.\nTo examine the effect of movement-based subgroup on kinematics during the pickup task, a subgroup analysis was conducted for only the LBP group (N  17).\nOne subject in the LBP group was not included in the subgroup analysis.\nThe subject was unable to complete the clinical examination component of the testing due to time constraints.\nA repeated measures ANOVA test was used to determine the effect of MSI subgroup (Rotation, Rotation with Extension, Rotation with Flexion) on lumbar spine excursion.\nPost-hoc tests were conducted for significant interaction effects.\nThere were no significant differences between groups in age, gender, height, weight, BMI, or pickup movement time (Table 1).\nLow back pain symptom characteristics are reported in Table 2.\nBased on subjective report, 70% of subjects reported having a LBP problem >6 months duration, while 30% of subjects reported having a LBP problem of <6 months duration.\nSubjects in the LBP group displayed more frontal plane movement than control subjects.\nSubjects in the Rotation with Flexion subgroup displayed more upper lumbar flexion and lateral bending compared to other subgroups, and people in the Rotation subgroup displayed more lower lumbar lateral bending than other subgroups.\nSeveral investigators have reported that people with LBP display less flexion movement and greater lumbar spine rotation and lateral bending than people without LBP during a variety of functional tasks (Lee et al.\nreported that all subjects displayed more lower lumbar than upper lumbar spine movement in the sagittal plane, but that history of LBP did not impact movement (Mitchell et al.\nSimilar to the prior research, we determined that subjects in both groups displayed more lower than upper lumbar spine movement in the sagittal plane during the pickup task.\nHowever, we determined that there were group differences in sagittal plane lumbar spine movement that varied based on region.\nSubjects with LBP displayed less lower but more upper lumbar flexion than control subjects in the sagittal plane.\nFurther, we found no significant differences in lumbar spine rotation and lateral bending between groups during the task.\nFindings from the current study may be different from previous studies, because the severity of LBP for subjects in the symptomatic group varies across studies.\nThe sample examined in the current study, however, is relevant to a clinical population because all subjects with LBP were seeking physical therapy treatment.\n* Median and range are provided for characteristics that were not normally distributed; Mean  standard deviation (SD) is provided for characteristics that are normally distributed.\nSeveral investigators have examined pattern of lumbar spine motion during a forward bending test movement (Esola et al.\nSubjects in the LBP group displayed significantly more upper lumbar flexion in the first 25% of the motion than control subjects.\nThese findings are consistent with those of Esola et al.\nsimilarity in findings between the studies may suggest that people with LBP display similar movement patterns during a clinical test of forward bending and related functional activity (pick up task).\nThese data support the need to examine lumbar spine movement throughout the functional task and not only at end-range.\nDifferent from the prior literature, three-dimensional kinematics of the hip and knee were examined in the current study (Mitchell et al.\nSubjects with LBP display significantly more frontal plane movement at the knee than control subjects.\nGreater frontal plane knee movement during functional activities that are repeated across the day, may increase stresses at these lower extremity joints, and be a potential explanation for increased risk of lower extremity injury in people with LBP (Leung et al.\nThere are several potential explanations fordifferences in lumbar spine and lower extremity movement between subjects with and without LBP.\nSecond, over time, subjects with LBP may have alterations in tissue mechanics, limiting lower lumbar region movement and redistributing this motion to the upper lumbar spine and lower extremities (Chan et al.\nLast, movement patterns may differ for subjects with LBP who have received previous therapy, during which they have been encouraged to increase lower extremity and decrease lumbar spine movement when picking up an object off the floor.\nAlthough we did not have adequate power to detect subgroup differences, subjects in movement-based subgroups appeared to move in predictable ways during the pick up task.\nThese movement-based subgroup differences are important to consider when evaluating a functional task and modifying movement during intervention.\nOne limitation of the current study is that a single functional task may not be impaired or provoke pain in all subjects with LBP.\nAny subject who was seeking care at one of the participating clinics was offered the opportunity to participate.\nTherefore, the sample was heterogeneous with regard to low back pain severity and chronicity.\nThis heterogeneity may have affected our results, because people with acute LBP may display differences in movement characteristics when compared to people with chronic LBP.\nHowever, this sample was very pragmatic of the population of patients seeking care in physical therapy.\nIn the current sample, only three people with LBP reported increased pain during the pickup task.\nIt is possible that the higher baseline of pain contributed to the pain experienced and lumbar spine and lower extremity kinematics during the task.\nHowever the current data supports that future research is needed with larger sample sizes to investigate kinematic differences among LBP subgroups during functional activities.\nLast, common to surface marker measurement approaches, there is the potential for skin motion artifact that may impacts kinematic measures.\nHowever, it is unlikely that skin motion artifact would be systematically different between the groups and explain the findings reported on in the current study.\nFurther, because of the magnitude of measurement error (~2) relative to the degree of movement in the frontal and axial planes (~4e6), it is possible that there was a group difference in these planes of movement during the task that could not be detected with the motion capture measures.\nAlthough there were no significant group differences in total excursion within each lumbar spine region, subjects with LBP displayed significantly more upper lumbar region flexion than control subjects during the early phases of the task.\nClinicians need to consider lumbar spine regional differences, pattern of movement, and lower extremity motion when evaluating movement during functional tasks in people with LBP and modifying movement during intervention.\nMore studies are needed to examine kinematic differences among movementbased LBP subgroups.\nThe New York Physical Therapy Research Designated Fund ($5000) and funding from the Nazareth College Faculty Scholarship and Innovation Grant ($1500) were used to fund this research.\nThe authors would like to thank Rebekah Sirtoli for her work on recruitment, data entry, and data processing for this project, and James Ebeling for assistance with creating the figure of the spine model used in this study.\nDifferences in sitting postures are associated with nonspecific chronic low back pain disorders when patients are subclassified."}