{"title": "20.B.1-s2.0-S0021929020303067-main.pdf", "contents": "Non-specific chronic low back pain (NSCLBP) is a major health problem, affecting about one fifth of the population worldwide.\nTo avoid further pain or injury, patients with NSCLBP seem to adopt a stiffer movement pattern during everyday living activities.\nHowever, it remains unknown how NSCLBP affects the lumbar lordosis angle (LLA) during repetitive activities such as walking or running.\nThis pilot study therefore aimed at exploring possible NSCLBP-related alterations in LLAs during walking and running by focusing on discrete parameters as well as continuous data.\nThirteen patients with NSCLBP and 20 healthy pain-free controls were enrolled and underwent a fullbody movement analysis involving various everyday living activities such as standing, walking and running.\nLLAs were derived from markers placed on the spinous processes of the vertebrae L1-L5 and S1.\nPatients with NSCLBP indicated reduced average LLAs during standing, walking and running and a tendency for lower LLA-ROM during walking.\nAnalyses of continuous data indicated the largest group differences occurring around 25% and 70% of the walking and 25% and 75% of the running cycle.\nThis study provides preliminary evidence that NSCLBP might affect LLAs during walking and running.\nThese results can be used as a basis for future large-scale investigations involving hypothesis testing.\nLow back pain (LBP) is a major global health problem, with up to 84% of the population having at least one episode of LBP during their lifetime and 23% developing a chronic form (Balague et al.\nIn order to develop better treatment and prevention strategies, a profound understanding of the underlying mechanisms of NSCLBP is of high importance.\nTo avoid further pain or injury, people move differently.\nAdaptions in trunk movement and their potential impact on LBP are gaining more and more attention as evolving evidence indicates that certain spinal movement strategies during daily activities might predispose individuals to persistent back problems in the long term through disruption of the load sharing of spinal tissues and muscle fatigue, promoting pro-nociceptive mechanisms and injury (Hodges and Smeets, 2015; van Dieen et al.\nAs such, throughout the past decade, several research groups have attempted to better understand lumbar spine function in NSCLBP, especially by studying everyday living activities such as walking, chair rising, object lifting, stepping up and running (Christe et al.\nHowever, these studies were based on differently defined rigid trunk segments and none of them considered the lumbar lordosis angle, which is a parameter that complements the findings of the above mentioned studies by providing additional information that might not be detected using rigid segments (Schmid et al.\nMoreover, the lumbar lordosis angle is a clinical parameter that is familiar to every clinician and might hence be fairly easily addressed in prevention or treatment protocols.\nFinally, and very importantly, they reduced the kinematic data to discrete parameters such as range of motion (RoM) and did not consider the continuous data over time, which might have led to the missing of valuable information.\nAmong several types of physical activity, walking and running are of the least expensive and most broadly accessible forms of physical activity and were shown to be associated with various health benefits (Hamer and Chida, 2008; Pedisic et al.\n, 2012), it is still not fully understood how LBP affects lumbar spine movement or vice versa during walking and running.\nFor these reasons, this pilot study aimed at exploring possible differences in lumbar lordosis angles during walking and running between patients with NSCLBP and healthy pain-free controls by focusing on discrete parameters as well as continuous data.\nThirteen patients with NSCLBP and 20 healthy controls were included in this pilot study (Table 1).\nPatients had to suffer from NSCLBP for at least three months and the healthy controls had to be free of pain with no prior history of NSCLBP.\nExclusion criteria for both groups were a history of specific LBP or nerve root pain, any disorders affecting the gait or running patterns, severe psychological disorders, anamnestically known pregnancy and breastfeeding less than 6 months postnatal as well as a body mass index (BMI) > 30 kg/m2.\nAdditional exclusion criteria for the patients with NSCLBP were intensive sporting activities of more than twice a week, a current back pain level of >5/10 points on the visual analog scale (VAS) (Jensen et al.\nThe study protocol was approved by the local ethics committee and all participants provided written informed consent.\nAll participants were invited for a visit at the movement analysis laboratory.\nPatients were first asked to rate their current back pain level using a VAS (0 = no pain, 10 = worst pain imaginable) and to complete the German version of the ODI (0%=no disability, 100%= bed-bound or exaggerating their symptoms) to quantify their perceived level of LBP-related disability (Jensen et al.\nTo allow for a detailed quantification of spinal motion, the configuration includes markers on the spinous processes of C7, T3, T5, T7, T9, T11 as well as L1-5 and S1 (sacrum).\nParticipants were then asked to perform a variety of everyday living activities including upright standing for 10 s as well as walking and running on a 10-meter level walkway at a normal self-selected speed.\nThe standing activity was performed once, whereas the walking and running activities were repeated until five valid trials were recorded.\nData pre-processing was conducted using the software package Vicon Nexus 2.\nLumbar lordosis angles were then calculated using a custom-built MATLAB-routine (R2019a, MathWorks Inc.\nIn brief, we applied a combination of a quadratic polynomial and a circle fit function to the sagittal plane trajectories of the markers from L1 to S1 and used the central angle theorem to derive the lumbar lordosis angle (expressed in degrees).\nAll calculations were carried out using MATLAB (R2019a, MathWorks Inc.\nTo explore possible differences in lumbar lordosis angles (discrete parameters and continuous data) between patients with NSCLBP and healthy pain-free controls, we calculated means and standard deviations as well as mean differences with 95%, 90%, 85%, 80% and 75% confidence intervals (CI) as suggested by Lee et al.\nPresented are mean with one standard deviation (SD) and range (in brackets).\nGroup differences were investigated using independent samples T-tests with an alpha-level set to 0.\nMean differences of the continuous data confirmed the generally lower lumbar lordosis angles in patients with NSCLBP, with the largest differences occurring around 25% and 70% of the walking and running cycles (confidence level at 85%) (Fig.\nIn addition, the movement pattern of the lumbar lordosis angles during running appeared to be reversed in NSCLBP patients, with an increasing instead of a decreasing angle after foot strike.\nA complete set of discrete and continuous angle data can be found in the Electronic Supplementary Material.\nThis pilot study aimed at exploring possible alterations in lumbar lordosis angles during walking and running in patients with NSCLBP compared to healthy pain-free controls.\nThe results indicated that patients with NSCLBP possibly adopt a generally less lordotic lumbar posture as well as a reduced motion during walking and a reversed movement pattern during running.\nThe attenuated lumbar lordosis angles in patients with NSCLBP are in line with the findings of a recent meta-analysis of 796 patients with LBP and 927 healthy controls (Chun et al.\n2015), the observed lordosis attenuation in NSCLBP patients might be interpreted as a protective or compensatory mechanisms.\nThe reversed movement pattern observed in our patients during running can probably be interpreted as an overcorrection of the trunk stiffening strategy and should be further investigated.\nEspecially during an activity with relatively high impacts such as running, these biomechanical changes might be of high clinical importance.\nOn the other side, one fifth (20%) of healthy controls presented a movement pattern that resembled the majority of patients with NSCLBP, i.\nStudies investigating spinal motion during object lifting in patients with NSCLBP as well as in healthy pain-free adults showed that individuals who believed that lifting an object with a round back is dangerous had altered lumbar spine kinematics (Matheve et al.\nA limiting factor of this study was that in a few cases (5 healthy controls during standing, walking and running; 1 patient during standing and walking), our 10-camera motion capture system was not able to fully identify all the lumbar spine markers and hence, no lumbar lordosis angles could be calculated in these cases.\nFor future studies, it is therefore advised to use more cameras or cameras with a higher resolution in order to avoid data loss due to technical limitations.\nFurthermore, even though the average ages of the two groups did not show statistically significant differences, patients appeared to be slightly older than the healthy controls, which could have influenced the outcomes.\nHowever, it is not expected that this age difference would explain a reversed movement pattern during running.\nIn summary, this study provides evidence that NSCLBP might affect the lumbar lordosis angle during walking and running.\nThese results can be used as a basis for future large-scale investigations involving hypothesis testing.\nTo further explore the reversed movement pattern during running, it does not make sense to use RoM as an outcome parameter but rather mean differences of the lumbar lordosis angles at about 25% and 75% of the running cycle.\nThe authors declared that there is no conflict of interest.\nThe authors thank the Swiss Physiotherapy Association (physioswiss) for financial assistance.\nChronic low back pain patients walk with locally altered spinal kinematics.\nLumbar range of motion in chronic low back pain is predicted by task-specific, but not by general measures of pain-related fear.\nLow back pain affects trunk as well as lower limb movements during walking and running.\nSpinal segments do not move together predictably during daily activities.\nLow back pain affects coordination between the trunk segments but not variability during running.\nIs lumbar lordosis related to low back pain development during prolonged standing?.\nMechanical coupling between transverse plane pelvis and thorax rotations during gait is higher in people with low back pain.\nLow-back pain patients learn to adapt motor behavior with adverse secondary consequences."}