{"title": "21.B.1-s2.0-S1050641103000415-main.pdf", "contents": "This paper provides an analysis of the literature on trunk muscle recruitment in low-back pain patients.\nTwo models proposed in the literature, the painspasmpain model and the pain adaptation model, yield conflicting predictions on how lowback pain would affect trunk muscle recruitment in various activities.\nThe two models are outlined and evidence for the two from neurophsysiological studies is reviewed.\nNeither of the two models is unequivocally supported by the literature.\nThese data and further data on timing of muscle activity and load sharing between muscles suggest an alternative model to explain the alterations of trunk muscle recruitment due to low-back pain.\nIt is proposed that motor control changes in patients are functional in that they enhance spinal stability.\nLow-back pain (LBP) is one of the most prevalent and costly health problems in western society [7].\nIn spite of extensive research efforts, the causes of LBP are still elusive and treatment effects are unsatisfactory.\nTo design a rational program for secondary prevention, it needs to be established whether behavioral responses displayed by patients should be considered adaptive and supportive of recovery or as adverse and contributing to a vicious cycle leading to chronicity.\nThe aim of the present paper therefore is to more systematically review the literature on effects of clinical and experimentally induced LBP on trunk muscle activation in terms of levels of activation, the timing of activation, and load sharing between muscles.\nactivation will be derived for each model.\nSecond, studies on trunk muscle activation in LBP patients will be reviewed.\nThe results from the studies reviewed will be compared to the model predictions.\nPain occurring immediately after acute trauma is often accompanied by intense contractions of muscles surrounding the injured structures.\nThis is thought to be functional, since it will prevent motion of the injured structures.\nIn clinical practice, it is often assumed that similar muscular reactions occur following non-traumatic pain.\nIn these cases, it is not the functional, adaptive nature of such a response that is emphasized but rather its possible adverse consequences.\nTreatment modalities based on this model involve relaxation and stretching of muscles.\nMost tissues in the low back, including, muscle, tendon, ligament, bone, endplate, and annulus fibrosus, are innervated by thin myelinated and unmyelinated fibers with free nerve endings.\nThese afferents, which are considered to be nociceptors, enter the posterior horn, from where they project onto higher centers giving rise to the perception of pain.\nLeft side: Feedback of nociceptive afferents (N) via excitatory interneurons (E) on the alpha motorneuron () will cause increased muscle activation (spasm).\nRight side: Feedback of nociceptive afferents (N) on the gamma motorneuron () will increase the afference of the muscle spindles (s), which activates the alpha motorneurons directly and via excitatory interneurons (E), which will cause increased muscle activation.\nThey proposed that nociceptors affect the output of muscle spindles via direct excitatory projections on the gamma motorneurons.\nThe increased muscle spindle output will cause hyperexcitability of the alpha motorneuron pool.\nThe common denominator in the two theories is the hyperexcitability of the alpha motorneuron pool, which could form the basis for more sustained and more intense muscle activity in pain patients as compared to controls.\nSeveral basic neurophysiological studies have been performed to verify the existence of the pathways proposed to underlie the painspasmpain cycle.\nEvidence of hyperexcitability of the alpha motorneuron pool due to nociceptive stimuli was found in cats after mechanical or chemical noxious stimulation of facet joints, fascia, ligaments, periosteum, and muscle.\nLikewise resting EMG levels in rat masticatory muscles were found to be increased after induction of pain.\nThis effect did however last only up to 10 min.\nExperimental results in humans are limited.\nHowever, resting EMG levels were increased in human masticatory muscles [124], although the effect was only short-lived.\nPart of the neurophysiological studies inspired by the painspasmpain model focused on the pathway proposed by Johansson and Sojka [59], by looking at the effects of nociceptive afference on muscle spindle activity.\nIn addition, most of this work involved animal experiments with anesthetized or decerebrate animals, greatly reducing or excluding any influence from the brain.\nThe pain-adaptation model (see below) states that the effects of peripheral projections of nociceptors onto alpha motorneurons are modulated by central nervous influences related to voluntary activity.\nFurthermore, it has been suggested that higher levels of muscle activation can occur as part of a response to pain as a psychological stressor [57].\nTherefore, testing the model with data obtained in studies of induced or clinical pain in awake humans may provide further information.\nThe basic tenet in the painspasmpain model is that pain will result in more sustained and increased muscle activation.\nThe model predicts that, in every submaximal task as well as in rest, muscle activation will be higher in patients as compared to healthy individuals.\nBy mechanical necessity this implies that cocontraction of agonist and antagonist muscles occurs in the patients.\nThe pain-adaptation model was proposed by Lund et al.\nThe model predicts observations to lie in the ticked boxes (equal, higher, and lower refer to equal, higher, or lower EMG amplitudes in patients as compared to controls).\nThe effects of such a control strategy would be that movement velocity is reduced and movement excursions are limited.\nThese kinematic effects are believed to prevent pain provocation.\nA neural pathway suggested to account for the recruitment changes in the pain-adaptation model consists of the nociceptors that project on the alpha motorneuron via both inhibitory and excitatory interneurons (Fig.\nWhether the output of inhibitory or excitatory interneurons dominates depends on the motor command.\nThe pain-adaptation model has motivated several neurophysiological studies addressing the effects of induced pain.\nSchwartz and Lund [113] found noxious pressure to cause changes in EMG and kinematics during cyclic jaw movements in decerebrate rabbits, which were consistent with the pain adaptation model.\nIn an induced pain condition postural activity of the jaw muscles was increased with respect to baseline.\nThus, in line with the model no consistent evidence for an effect of pain on resting activity of these muscles was found.\nClear evidence in support of the pain-adaptation model was found in a study by Graven-Nielsen et al.\nInduced pain in human gastrocnemius muscle was found to decrease the activity of this muscle during gait, while the activity of the tibialis anterior, its antagonist, increased.\nThe reverse was found when pain was induced in the tibialis anterior muscle.\nFurthermore, motor unit firing rates were found to decrease in human forearm muscles after injection of hypertonic saline [14].\nThe pain-adaptation model predicts muscle activation to be reduced in agonists and increased in antagonists, irrespective of the level of exercise.\n[78] used the term antagonists to refer to muscles that are lengthening and agonists to refer to muscles that are shortening.\nThis interpretation is based on the predicted effects on kinematics.\nThis definition does clearly define agonists and antagonists in isometric as well as dynamic contractions.\nThe implications of this definition may clearly deviate from the definition based on shortening versus lengthening.\nThe references thus retrieved were screened on the basis of titles and abstracts and those papers apparently fulfilling our inclusion criteria (see below) were selected for further study.\nTo be included studies had to be published in peerreviewed journals in the English language.\nThe study had to comprise a statistical comparison of trunk muscle activation (EMG amplitude, timing or recruitment pattern) between LBP patients and controls, or between an induced back pain condition and a no back pain condition.\nTo test the model predictions outlined above, the experimental tasks performed by the subjects were classified according to Tables 1 and 2.\nWe further categorized the studies based on the characteristics of the patient group, the matching between patient and control group, and group size.\nIn addition, details on data acquisition and analysis methods were noted.\nThe most important issue in this respect was the normalization of EMG amplitudes.\nIn general, absolute EMG amplitudes depend on many factors unrelated to the level of muscle activation, such as thickness of tissues overlying the muscle.\nConsequently, a systematic between-group difference may be expected when patients and controls are not carefully matched.\nPatients will tend to be less physically active than controls, which could cause a difference in thickness of the subcutaneous fat layer.\nTo obtain a signal independent of such factors, normalization of EMG amplitudes to the amplitudes obtained in maximum voluntary contractions (MVC) is often used.\nNormalization to submaximal contractions does not provide a solution, because in patients the EMG amplitudes during these submaximal tests can be expected to be similarly affected as the levels during the experimental task.\nTherefore, non-normalized EMG amplitudes are to be preferred in clinical studies.\nA relatively small number of studies was retrieved that dealt with timing of muscle activation and patterns of load sharing between muscles.\nThese were separately reviewed in a more qualitative way.\nThe model predicts observations to lie in the double ticked boxes (equal, higher, and lower refer to equal, higher, or lower EMG amplitudes in patients as compared to controls).\nThis material was used for testing the predictions of the painspasmpain model and the pain-adaptation model.\nThe 30 studies together described 101 separate experimental tasks, which were classified according to Tables 1 and 2.\nThis classification made it necessary to include two extra categories.\nA number of studies reported on EMG of the LES in or around full trunk flexion.\nThese tasks would comprise two separate classifications in Tables 1 and 2, for which the predictions of the pain-adaptation model diverged.\nTherefore, these studies were also summarized as a separate class (task 3/4).\nThe classifications of the experimental tasks in the 30 studies and the outcomes have been summarized in Table 4.\nThe majority of studies involved measurements of EMG in rest postures, mainly standing and sitting.\nVery few studies dealt with maximal exertions.\nNeither of the two models is consistently supported by the literature summarized in Table 4.\nMost clearly diverging predictions by the two models are made regarding rest postures and submaximal concentric contractions.\nRegarding submaximal concentric contractions, the pain-adaptation model predicts decreased activation and the pain spasmpain model predicts increased activation.\nRegarding concentric contractions no clear trend is discernible.\nThe trend in studies on submaximal isometric exertions appears in line with the general idea behind the pain-adaptation model that activation of agonistic muscles is reduced, though not when using a definition of agonistic activity based on movement direction.\nMost of these studies involved generating an extensor moment against gravity.\nThe magnitude of the external load was usually not strictly controlled.\nvation in the patient group could be due to slight postural adjustments.\nIt is important to note that part of the support for the pain-adaptation model relies on predictions of equal muscle activation in patients and controls.\nOf course, this equality cannot be statistically assessed.\nMany of the results on the first row (equal EMG amplitudes) in Table 4 could be due to a lack of discriminative power of the studies concerned.\nWe therefore omitted studies with a lack of power due to low subject numbers.\nNormalization may lead to biased results, therefore also studies in which normalization of EMG or exertion levels might account for the (lack of) effects were omitted (six studies of which three also had a low number of subjects).\nThe overview in Table 5 shows two classes of tasks for which fairly strong evidence exists that increased muscle activation can occur in the patient group, i.\nIn full flexion, most healthy subjects show complete electromyographical silence of the LES.\nThis phenomenon is called flexionrelaxation.\nIn many patients flexionrelaxation is absent.\nThese findings appear to contradict the pain-adaptation model.\nThe symbols =, +, and  refer to equal, higher, or lower EMG amplitudes in patients as compared to controls.\nNumbers refer to the numbers of the studies in Table 3 and the letters refer to the experimental task in the study also given in Table 3.\nEqual, higher, and lower refer to equal, higher, or lower EMG amplitudes in patients as compared to controls.\nNumbers refer to the numbers of the studies in Table 3 and the letters refer to the experimental task in the study also given in Table 3.\nThe results were not statistically tested and judging from the graphs appear very weak in some subjects.\n[10] studied the effects of induced pain in the lumbar erector spinae during walking.\nThey found a significant increase in activation, which was most pronounced during the ipsilateral swing phase.\nDuring the double-support phase LES activation was found to be reduced.\n[141] tested subjects in trunk flexion and extension movements.\nIn full flexion, increased activity was found on the injected painful and noninjected painless side, which was associated with a reduced range of motion.\nHowever, when subjects overcame this limitation of the range of motion by instruction and feedback, the increase in activity on the painful side remained.\nDuring re-extension the LES activation was found to be reduced, this effect also remained on the painful side when the subject was guided to perform the movement identical to the painless control movement.\nThe results of the studies showed no consistent support for either of the two models.\nNine studies were retrieved that focused on effects of clinical pain on timing of trunk muscle activation.\nHemborg and Moritz [43] found a longer period of LES activation during lifting and lowering of loads.\nThis effect may be associated with the absence of flexionrelaxation in patients.\n[73], studied the recruitment order of the LES and the hip extensors (gluteus maximus and hamstrings) during flexionextension movements.\nThe recruitment order was the same in patients and controls.\nOnly the duration of gluteus activity was reduced in patients.\nHodges and coworkers performed a number of studies on timing of trunk muscle activation prior to and shortly after rapid voluntary movements of the limbs.\nAnticipatory activation of the transversus abdominus muscle was a consistent finding in the controls, but was absent in the patients.\nIn general trunk muscle activation in the patients was delayed.\nThe amplitude of the LES response to sudden loading also was reduced.\nAgain these studies do not consistently support either of the two models.\nThe results found by Hemborg and Moritz [43] appear more in line with the painspasm pain model, whereas the results of the perturbation experiment could be considered more in line with the pain-adaptation model in the sense that reduced excitability was found.\nLoad sharing between muscles was studied in nine of the studies retrieved.\nAlexiev [5] reported a significant difference between painful and painless sides in patients, with lower activation on the painful side, when exerting isometrically against resistance.\nNo asymmetry in the controls was found, but groups were not directly compared.\n[52] reported significantly more asymmetry in muscle activation during standing in patients as compared to controls.\nTriano and Luttges [130] reported significantly more asymmetry of paraspinal EMG amplitudes.\nNo significant differences were found in a study on standing [3] and a study on gait [10].\n[39] found more asymmetric activation in patients than in controls during ramp contractions.\nIn the patients, the temporal pattern of activation on each side was highly irregular without covariation of the moment produced.\nThis suggests that load sharing was variable over time in the patient group.\n[97] studied load sharing between abdominal muscles during an exercise called abdominal hollowing.\nAlthough activation levels of the internal oblique and rectus abdominus muscles were not different between patients and controls, the ratio of the two was different with a higher activation of rectus abdominus relative to the internal oblique in the patient group.\nNo differences between patients and matched controls were found.\nIn contrast, we did find consistent evidence in the ramp contractions and planar motions that the LES was more active relative to the thoracic erector spinae in the patient group as compared to the control group.\nIn the free motions ratios of antagonist over agonist EMG amplitudes were higher in the patients, indicating more cocontraction.\nSimulation with a mechanical model suggested that these changed recruitment patterns would enhance spinal stability in the patient group.\nThe literature reviewed here reveals that neither one of the two models adequately predicts the effects of back pain on trunk muscle activation.\nThese changes appear to be adaptive in that heavy exertion of painful muscles and high accelerations that may impose a risk of pain provocation are avoided.\nHowever, in other cases increased activation is found, conflicting with the prediction of the pain-adaptation model.\nMoreover, the wide variance in results within and between subjects appears irreconcilable with the hardwired neural pathway proposed in the pain-adaptation model.\nIn addition, some of the data reviewed indicate that pain may in some cases lead to disturbances of motor control, which are not likely to be adaptive, such as for instance left/right asymmetry of LES activation and the erratic temporal pattern of LES activation reported by Grabiner et al.\nAs we will argue below, a loss of control may actually be one of the reasons why muscle activation patterns are adapted.\nWe suggest that instances of increased activation may be adaptive in nature.\nThe nature of these adaptations however appears much more complicated than suggested by the pain-adaptation model.\nIt is also conceivable that between-subject variation may occur due to differences between patients in the developmental stage of their low-back disorder.\nHowever, most of the studies reviewed have included only patients with chronic LBP.\nIn this study each LBP patient was found to show increased LES activation during at least one of the five experimental tasks, but when analyzing the data per task no differences between patients and controls were found.\nWe surmise that the changes observed due to pain in general are aimed at avoiding noxious tensile stresses in injured structures.\nThe increased activation in rest postures, which reflects increased cocontraction and the changes in load sharing between lumbar and thoracic erector spinae may be aimed at enhancing stability.\nThese injuries and especially those of the intervertebral discs have a substantial effect on the mechanical behavior of the spine.\nThis buckling occurs at a very high velocity, which might preclude muscular corrections.\nConsequently, adaptations of muscular activation might be required to compensate for the reduced stiffness.\nFurthermore, several studies have shown that LBP patients are characterized by a reduced endurance of the trunk extensor muscles.\nOn the basis of these findings it is likely that LBP patients will be less able to rapidly develop trunk muscle force.\nThis would limit their capacity to correct perturbations of trunk equilibrium and prevent spinal instability.\nIn addition, reduced proprioception [15,37] and disturbances of postural control [80] have been found in back pain patients.\nThe same study demonstrated increased reaction times in LBP patients.\nIn summary, all three subsystems that subserve spinal stability (the passive system, the control system and the muscular system [98]) appear to be affected in LBP, though not necessarily all at the same time.\nThe reduction in passive spinal stiffness would increase the risk of buckling under perturbations, whereas the changes in the control system and muscular system would impair the capacity to respond to perturbations.\nAlterations of trunk muscle recruitment patterns might be functional in LBP patients, since they would stiffen the trunk, thus precluding the probability of perturbations to which the patient could not adequately respond.\nThe above rationale might also account for the disappearance of anticipatory muscle activation and the consequent anticipatory postural adjustments in back pain patients preceding fast limb movements.\nHealthy subjects generally use specific anticipatory control to counteract ensuing perturbations of trunk equilibrium.\nA good example of an everyday activity in which the mechanical nature of the perturbation is a priori unknown to the subject is the lifting of a load.\nBesides the positive effect of pain-related changes in muscular recruitment, some negative consequences are likely to occur.\nHyperactivity could cause pain in the muscles themselves, as proposed in the painspasmpain model.\nHowever, the increased activation reported in the literature review is generally only small or moderate.\nMaybe more importantly, both cocontraction and selective derecruitment of muscles will limit functional abilities of patients.\nIt is possible that changes in recruitment of trunk musculature remain present after their functional significance has disappeared, when injured structures have recovered.\nNevertheless, caution should be exercised when rehabilitating LBP patients with the sole purpose of restoring a normal muscle recruitment pattern.\nThe abnormalities may represent compensation mechanisms to stabilize the spine.\nThe problem a clinician is facing then, is to differentiate between adaptive changes and unwanted residuals of former injury.\nFurther scientific research may provide the knowledge and methods to support clinical decision-making.\nThe changes observed are task-dependent, related to the individual problem and hence highly variable between and probably within individuals.\nWe propose that the alterations in trunk muscle recruitment in patients are functional in that they reduce the probability of noxious tissue stresses by limiting range of motion and providing stabilization of the spine.\nThis explanation should be tested in future experiments specifically designed to refute hypotheses derived from it.\nThe authors would like to thank Onno Meijer and Claudine Lamoth, for reviewing earlier versions of the text.\nThis project was partially supported by NIH grant 5R01 AR 46844 and a grant provided by the Institute for Fundamental and Clinical Human Movement Sciences.\nSchandler, omparative analysis of paraspinal and frontalis EMG, heart rate and skin conductance in chronic low back pain patients and normals to various postures and stress, Scand.\nDe, Differences in electromyographic activity in the multifidus muscle and the iliocostalis lumborum between healthy subjects and patients with sub-acute and chronic low back pain, Eur.\nJaap van Dieen obtained a PhD in Human Movement Sciences from the Faculty of Human Movement Sciences at the Vrije Universiteit Amsterdam in the Netherlands.\nSince June 1996 he has been employed at this faculty, currently as professor of biomechanics.\nHe is chairing the ergonomics program at this faculty.\nIn addition, he is the head of a research group focusing on mechanical and neural aspects of musucloskeletal injuries.\nHis main research interest is on control of muscles of the trunk and upper extremity, where especially the interaction of muscle coordination, fatigue, joint load and stability is an important research topic.\nJaap van Dieen was the first author of over 30 and a coauthor of a similar number of papers in international scientific journals.\nHe serves on the editorial boards of the Journal of Electromyohraphy and Kinesiology and Human Movement Sciences and is a regular reviewer for several other journals and funding agencies.\nSelen received a BS degree in Applied Physics from the Hogeschool Enschede in 1999 and completed his MS in 2002 at the Faculty of Human Movement Sciences at the Vrije Universiteit in Amsterdam.\nHe is currently a PhD student in the Institute for Fundamental and Clinical Human Movement Sciences (IFKB) at the Vrije Universiteit.\nHis research interests include the influence of joint stiffening through co-contraction on movement variability.\nJacek Cholewicki is a spinal biomechanist and Associate Professor of Orthopaedics and Rehabilitation at Yale University School of Medicine in New Haven, Connecticut.\nHe holds cross-appointments to the departments of Mechanical Engineering and Biomedical Engineering where he teaches a graduate and undergraduate course in biomechanics.\nHe received his Bachelor, Masters, and PhD degrees in Kinesiology from the University of Waterloo in Canada in 1986, 1990, and 1994, respectively.\nHis research addresses the issues of lumbar and cervical spine function, spine injury mechanisms, tissue loading, and biomechanical modeling using both in vivo and in vitro experimental approaches.\nHis current research interests include motor control of spine stability and the effectiveness of abdominal belts."}