{"title": "22.B.Spine_Loading_Characteristics_of_Patients_With_Low.9.pdf", "contents": "Patients with low back pain and asymptomatic individuals were evaluated while performing controlled and free-dynamic lifting tasks in a laboratory setting.\nAn important, yet unresolved, issue associated with low back pain is whether patients with low back pain experience spine loading that differs from that of individuals who are asymptomatic for low back pain.\nThis is important to understand because excessive spine loading is suspected of accelerating disc degeneration in those whose spines are damaged already.\nIn this study, 22 patients with low back pain and 22 asymptomatic individuals performed controlled and free-dynamic exertions.\nTrunk muscle activity, trunk kinematics, and trunk kinetics were used to evaluate threedimensional spine loading using an electromyographyassisted model in conjunction with a new electromyographic calibration procedure.\nPatients with low back pain experienced 26% greater spine compression and 75% greater lateral shear (normalized to moment) than the asymptomatic group during the controlled exertions.\nThe increased spine loading resulted from muscle coactivation.\nIncreased muscle coactivation and greater body mass resulted in significantly increased absolute spine loading for the patients with low back pain, especially when lifting from low vertical heights.\nThe findings suggest a significant mechanical spine loading cost is associated with low back pain resulting from trunk muscle coactivation.\nPatient weight control and proper workplace design can minimize the additional spine loading associated with low back pain.\nAn important, yet unresolved, issue associated with low back pain (LBP) is whether the spine loadings of patients with LBP differ from those of individuals who are asymptomatic for LBP.\nRecent studies1,3 have suggested that excessive mechanical loading on spinal structures that already are compromised can progressively affect disc degeneration, possibly resulting in chronic LBP.\nThere have been several attempts toward a better understanding of the biomechanical differences between patients with LBP and asymptomatic individuals.\nStudies have explored the strength differences between patients with LBP and asymptomatic individuals22,24,30,48,49,51,58.\nAlthough most of these studies have identified differences in strength production capacity, they do not offer much insight into the nature of the loading imposed on the spine.\nOther studies6,9,25,26,54,55,57,58 have attempted to document the back muscle electromyographic (EMG) activities.\nnone have determined whether the increased coactivity translated into higher spine loading.\nDeterministic biomechanical models have been developed that estimate spine loads in uninjured individuals by assuming that specific internal structures must support an external load moment and contribute to internal spine loading.\nThese facts suggest that patients with LBP may use very different muscle activation patterns to generate internal load support, making deterministic models inappropriate for patients with LBP.\nClearly, to predict spine loads in patients with LBP, the clinician must be able account for atypical recruitment patterns of the trunk muscles.\nUnfortunately, patients with LBP are unable or unwilling to produce such exertions.\nRecently, studies in the authors laboratory have developed an EMG calibration procedure based on submaximal exertions that nevertheless can estimate maximal EMG.\nGiven this development in EMG calibration, a study intended to compare spine loads of patients with LBP with those of asymptomatic individuals was designed.\nPartial funding for this study was supplied by a grant from the Ohio Bureau of Workers Compensation.\nOf the 44 participants in this study, 22 (12 males and 10 females) had LBP at the time of the testing and were recruited from the orthopedic practice of one of the authors (P.\nGross anthropometric characteristics are reported in Table 1.\nAll the participants were involved in both phases of the testing.\nWhile in this posture, the participants were asked to control sagittal extension exertion by ramping up to a predetermined force exertion level for 2 seconds.\nPhase 2 testing was intended to evaluate whether kinematic compensation occurred in patients with LBP, as compared with asymptomatic participants.\nThis phase used a repeatedmeasures within-subject design.\nThe independent variables in this study were group membership (LBP vs asymptomatic), weight lifted, and lift origin.\n* Scale is from 0 (no pain) to 10 (worse pain).\nThe lifts ended with the body in an upright position and the weight located at elbow height.\nElectromyographic activity was collected with the use of bipolar silversilver chloride electrodes.\nThe electrodes recorded activity at the 10 major trunk muscle sites consisting of right and left muscle pairs of erector spinae, latissimus dorsi, rectus abdominis, external oblique muscles, and internal oblique muscles.\ntrode placements have been described previously.\nSkin impedances were maintained below 100 K.\nElectromyographic calibration normalization testing and Phase 1 testing were performed using an asymmetric reference frame.\nDuring Phase 2 testing, trunk kinematics were documented with a lumbar motion monitor.\nThe device design, accuracy, and application have been reported previously.\nAll signals were collected simultaneously at 100 Hz using customized Windows-based software developed in the Biodynamics Laboratory (Columbus, OH).\nA new EMG calibration procedure reported recently does not require maximal exertion for calibration of the EMG signal.\nThe EMGforce relation (slope) is established by a series of low-level exertions performed in flexion, extension, and axial twisting.\nThe overlay (boxes) indicates the lift origins.\nEMC defines the midpoint of this region.\nThe expected maximum contraction, as a substitute for maximum voluntary contraction, was derived from regression equations describing the relations between maximum exerted trunk moments and anthropometric measurements for 120 subjects.\nTo quantify the extent of low back impairment associated with the experimental subjects, a dynamic functional assessment was performed using the lumbar motion monitor.\nThis method has been thoroughly reported and validated.\nOver the past 18 years, the authors laboratory has developed a three-dimensional dynamic biomechanical model that can determine how the vertebral joint at L5S1 is loaded during a dynamic motion10,1518,3537,4345,50,56.\nThe model has been validated for forward bending,16,45 lateral bending,36 and twisting35 exertions and adjusted for anatomic gender differences.\nTwo additional biomechanical measures were defined in this study.\nThe coactivity index was defined as the activity of the antagonist muscles relative to agonist muscle activities.\nOn arriving at the Biodynamics Laboratory, the subjects first were informed about the study procedures, their prerogative to refuse performance of a particular lift, and their need to inform experimenters about any further discomfort.\nConsent to participate was acquired via a document approved by the University Institutional Review Board.\nSecond, anthropometric measurements were collected, and surface electrodes then were applied using standard placement procedures.\nNext, the participant was positioned in the pelvic support structure in the asymmetric reference frame, and the EMG calibration procedure was performed.\nThis procedure was followed by the Phase 1 experiment, in which the subjects completed the three targeted extension exertions.\nAfter a rest period, Phase 2 test conditions were completed twice for each load weight condition.\nAll six lift region conditions (Figure 2) were completed for each weight before the increase to the next weight.\nIn this test, the participants were required to keep their feet stationary on the force plate, but were free to move the rest of the body as they wished.\nRepeated measures analyses of variance (ANOVA) were performed for the spine load variables to explore whether differences exist between individuals with LBP and asymptomatic individuals.\nWhen statistically significant independent variables were identified, post hoc analyses (Tukey multiple pairwise comparisons) were performed to determine the source of the significant effects.\nPhase 1 Evaluation of the controlled exertions indicated that the LBP group experienced significantly greater (47%) absolute compression and lateral shear (103%) than the asymptomatic group (Table 3).\nIn addition, the LBP group exhibited statistically significant increases in muscle activities for all 10 muscles, averaging 123% of the asymptomatic group values (Figure 5).\nAs expected (but not shown), increases in exertion levels also resulted in significant linear increases in both absolute and normalized spine loads.\nNo interactions between group membership and exertion levels were significant.\nPhase 2 Under the free-dynamic lifting conditions, the patients with LBP experienced approximately 20% greater magnitude of external moment and about 21% greater absolute spine compression (Table 3).\nThey also experienced significantly larger cumulative compression, lateral shear, and anteroposterior shear.\nKinematic analyses indicated that the participants with LBP significantly reduced their trunk and hip kinematics in terms of sagittal position and velocity, as compared with the asymptomatic group, when lifting from origins farther away from the spine (greater moment arms), and when lifting from locations with a lower vertical origin (Figure 6).\nCumulative loading was particularly large (average, 70%) in the LBP group when the participants lifted from lower origins (Figure 7), and when they lifted the heavier box weights (Figure 8).\nThe kinematic compensations were effective at reducing the relative effect of spine loading, as evidenced by a lack of significance for any spine loading variables normalized per unit of moment exposure.\nHowever, this was accomplished at the cost of greatly restricted movement.\nNormalized lateral shear and compression force for individuals with low back pain and asymptomatic individuals during controlled static exertions (Phase 1).\nAs in Phase 1, the LBP group displayed significantly more muscle activity in all 10 trunk muscles (Figure 9).\nThis study represents the first quantitative EMG-assisted biomechanical evaluation of spine loading differences between individuals with and those without LBP.\nThe use of a new EMG calibration procedure in conjunction with a well-developed EMG-assisted model allowed the authors to show that LBP subjects experience significantly greater spine loads than asymptomatic individuals when subjected to the same postural loading conditions.\nAfter normalization for differences in body mass, patients with LBP experienced 26% more compression and 75% more lateral shear than their asymptomatic counterparts.\nIn the current study, when the body mass of the patients with LBP also was considered, absolute compression values represented almost a 50% increase over those for the asymptomatic group and more than a 100% increase in lateral shear over that for the asymptomatic group under all exertion conditions.\nUnder unrestricted lifting conditions, the participants with LBP kinematically compensated for their back pain, thereby minimizing external moment exposure.\nHowever, the LBP groups coactivity along with their increased body mass offset any spine loading benefits that might have been derived from these kinematic reductions in movements.\nTherefore, under realistic situations, patients with LBP typically experience significantly greater spine loads.\nUnder Phase 1 conditions, this LBP group subset experienced 28% and 38% greater normalized and absolute compression, respectively.\nHowever, under Phase 2 conditions, the LBD group reduced their flexion by 30% and their torso velocity by 60%.\nThese changes reduced the external moment to levels that were less than those of their matched asymptomatic group counterparts, but resulted in virtually identical spine loads.\nThe larger body mass of the typical patient with LBP11,12,29 would further increase spine loading.\nThe degree of spine loading experienced by the LBP group was strongly dependent on the lift origin height and the moment arm distance, with greater spine loading occurring at lower lift heights and farther from the spine.\nFurthermore, these same conditions were associated with greater differences in coactivations, and most likely were those related to guarding.\nThese findings suggest a strong musculoskeletal system reaction to the patients body weight during a lift when the moment is great or the lift must be performed at a low level.\nThese findings suggest two implications.\nFirst, body weight appears to play a major role in spine loading for the LBP group, imposing much greater spine loading than would be expected for asymptomatic subjects of equal size.\nThe findings suggest that patients with LBP could benefit greatly from weight control during the recovery process.\nSecond, when patients with LBP return to a workplace that requires materials handling, it is even more important that the workplace be designed to accommodate their capabilities than it would be for asymptomatic individuals.\nLBP, it is important to arrange the workplace so that loads can be lifted at waist height with the lift origin close to the body.\nBecause guarding and trunk muscle coactivation appear to exert a strong influence on the magnitude of spine loading, it might be expected that patients with LBP and greater impairment might generate more coactivation, and therefore greater spine loading.\nIn the current study, follow-up analyses identified many significant trends between the extent of low back disorder, as measured by the authors functional analysis test, and both peak and cumulative spine loading.\nTable 4 summarizes these relations for various lift origins, showing that nonlinear models can explain up to 45% of the variance between impairment and spine compression.\nThere is a monotonic, yet nonlinear, relation between spine loading and degree of impairment as measured in this study.\nThese increases in spine loading associated with LBP may accelerate degeneration of the spine.\nrecently showed that even minor damage to a vertebral body endplate leads to progressive structural changes in the intervertebral discs.\nIn addition, because the patients with LBP performed the lifting tasks over a longer period, there may also have been an additional risk because of cumulative spine loading.\nFor the tasks described in our study, the cumulative lateral shear, anteroposterior, and compressive loads were 44%, 59%, and 57% higher, respectively, for patients with LBP.\nRecent studies have suggested that increased LBP risk can indeed be related to cumulative loading.\nTherefore, given the current findings, it would be expected that the risk of further spine damage would be even greater when patients with LBP are exposed to greater levels of cumulative loading.\nFirst, the exposure to loading occurred over a short (2-hour) test period.\nUnder realistic, longer exposure to lifting conditions, the detrimental effects of spine loading may be much greater.\nHowever, subjects may adapt better under these prolonged conditions.\nFurther testing is needed to resolve this issue.\nSecond, the current LBP population consisted primarily of patients with pain from suspected muscular origins.\nA similar study needs to be conducted in which patients with structural disorders are tested to determine whether they would respond in a similar fashion.\nThird, future studies may want to explore spine loading for patients with acute, as compared with chronic, LBP.\nThe LBP population in the current study did not offer statistical power sufficient for exploring this issue.\nFourth, the new normalization technique is based on the assumption that both LBP and asymptomatic individuals have the same muscle control strategies.\nFuture research needs to establish whether a difference may exist.\nFinally, spine loading was evaluated in this study for a limited range of materials-handling tasks.\nFuture studies could use similar spine-loading analysis techniques to investigate spine loads associated with other forms of work performed by patients with LBP.\nIn conclusion, this is the first EMG-driven biomechanical evaluation of spine loading in patients with LBP, as compared with spine loading in asymptomatic individuals.\nR2 shows the percentage of variance explained.\nSpine loading increased with increasing impairment, primarily as result of increased trunk muscle coactivation.\nAlthough patients with LBP kinematically adjusted their postures to minimize external moment exposure, these compensations did not offset the increased loading resulting from coactivation (guarding) and from the large body mass typical of patients with LBP.\nThe study suggests that most patients with LBP would benefit greatly from reduction in body weight, kinematic conditioning, and efforts to design materials-handling tasks so that lift origins are close to the body and at reasonable lift heights.\nPatients with low back pain produced higher spine loads during highly controlled exertions than their asymptomatic counterparts.\nDuring free-dynamic lifting, patients with low back pain were found to compensate by reducing flexion and motion, thus reducing trunk moment.\nHowever, the impact of body mass and increased muscle coactivity was greater than the kinematic compensation because patients with low back pain had higher spinal compression, particularly when lift origins were below the waist.\nThe authors acknowledge the contribution of Michael Jorgensen to certain parts of this study.\nSustained loading generates stress concentrations in lumbar intervertebral discs.\nMuscle lines-of-action affect predicted forces in optimization-based spine muscle modeling."}