{"title": "26.B.s00421-010-1637-x.pdf", "contents": "Decreased variability in postural control strategies in young people with non-specific low back pain is associated with altered proprioceptive reweighting.\nAbstract Optimal postural control is an essential capacity in daily life and can be highly variable.\nThe purpose of this study was to investigate if young people have the ability to choose the optimal postural control strategy according to the postural condition and to investigate if non-specific low back pain (NSLBP) influences the variability in proprioceptive postural control strategies.\nThe role of proprioception in postural control was directly examined by means of muscle vibration on triceps surae and lumbar multifidus muscles.\nRoot mean square and mean displacements of the center of pressure were recorded during the different trials.\nTherefore, healthy controls seem to have the ability to choose a more optimal postural control strategy according to the postural condition.\nIn contrast, young people with NSLBP showed a reduced capacity to switch to a more multi-segmental postural control strategy during complex postural conditions, which leads to decreased postural robustness.\nOptimal postural control is an essential capacity in daily activities and can be highly variable.\nWhen postural conditions change, the central nervous system (CNS) must identify and selectively focus on the most reliable sensory inputs to provide optimal control.\nInputs from the vestibular, the visual and the proprioceptive system are weighted by the CNS.\nWithin the inverted pendulum postural control model, where the body pivots as a rigid segment around one joint, two strategies can be distinguished.\nWhile this strategy could be sufficient in simple postural conditions such as standing on a flat surface, in more complex postural tasks it might fail.\nTo achieve optimal stability in more difficult postural conditions, according to the inverted pendulum model, the resulted motion to maintain balance is primarily generated at the trunk and the hips (i.\nOne factor that could disturb the optimal multi-segmental postural control is non-specific low back pain (NSLBP).\nIndividuals with NSLBP have been observed to have decreased postural robustness during standing, particularly when the standing task becomes more difficult such as standing on an unstable support surface (Mientjes and Frank 1999; Mok et al.\nSeveral studies already evaluated proprioceptive changes in people with NSLBP by determining the lumbosacral position sense.\nHowever, these studies did not evaluate repositioning errors in combination with postural sway characteristics.\nHence, it remains unclear if proprioceptive impairments are associated with reduced postural robustness.\nThese studies only evaluated standing postural conditions, so the role of proprioceptive reweighting as a characteristic of variability in postural control strategies (during standing as well in sitting conditions) was not evaluated specifically.\nTo have more insight into the variability of postural control strategies and its changes in people with NSLBP, it is recommended to investigate this under a variety of different postural conditions (e.\nA decrease in variability of anticipatory adjustments (APAs) during postural control has been observed in an experimental-induced acute NSLBP and in recurrent NSLBP (Moseley and Hodges 2006; Jacobs et al.\nTo get more insight into the selection variability of postural control strategies upon the condition and the possible role of impaired proprioception, investigating the specific role of proprioception during diverse postural conditions is essential.\nTherefore, this study had two aims.\nThe first aim of this study was to investigate if healthy people show variability in their proprioceptive postural control strategy to ensure postural robustness during increased postural complexity.\nTo investigate this first aim, different postural conditions (standing on a stable and unstable surface and sitting) were chosen.\nFurthermore, muscle vibration, known as a strong stimulus for muscles spindles (Roll and Vedel 1982), was used to more specifically appraise the role of proprioception.\nThe second aim was to investigate if age-matched people with NSLBP show a similar variability in postural strategy.\nIt was hypothesized that healthy persons regulate.\nOne hundred fifty-six students (47 men, 109 women) volunteered in this study.\nAll subjects were included or excluded in the study by an experienced musculoskeletal physical therapist.\nIn addition, they had to score the pain at the moment of testing on a numerical rating scale (NRS).\nSubjects were included in the NSLBP group if they reported a NRS [ 0 and if they scored ODI-2 [ 6 at the moment of the test.\nThe healthy controls did not report any pain (NRS = 0) and had an ODI-2 score of 0.\nCharacteristics of all subjects are presented in Table 1.\nAll subjects gave their written informed consent and all test procedures were approved by the Medical Research Ethics Committee of K.\nPostural sway characteristics were measured using a sixchannel force plate (Bertec Corporation, Ohio, USA).\nTo evaluate trunk position in space, two piezo-resistive accelerometers (ICSensors, UK), also connected with the data-acquisition system, were placed on the spinous processes of thoracic (T1) and sacral (S2) vertebra in upright posture.\nIn six trials, the role of proprioception in postural control was directly examined by means of muscle vibration, known as a powerful stimulus of Ia afferents (Roll and Vedel 1982).\nTherefore, two muscle vibrators (self-manufactured with Maxon motors, Switzerland) were used.\nVibration was applied bilaterally to triceps surae muscles or to lumbar multifidus muscles, respectively.\nMuscle vibration was initiated 15 s after the start of the trial for duration of 15 s.\nActivation and deactivation of the vibrators were manually controlled.\nThe frequency of the vibration was set at 60 Hz and the amplitude was approximately 0.\nThese characteristics of vibration were chosen to induce maximal illusory joint movement and were demonstrated to induce a significant muscle lengthening illusion in healthy individuals (Roll and Vedel 1982; Cordo et al.\nWhen the CNS is using the signals of the vibrated muscles for postural control, larger directional sways are expected.\nWhen triceps surae muscles are vibrated in a healthy subject during standing, a postural sway in backward direction is expected; when lumbar multifidus muscles are vibrated during standing, a healthy subject is expected to show a postural sway in a forward direction.\nDuring standing, the sacrum-pelvis will be considered as the mobile body part compared to the stationary trunk.\nSo, the resulting illusion of lumbar multifidus muscle lengthening during vibration corresponds with a posterior pelvic tilting and thus a posterior center of pressure (COP) displacement.\nConsequently, the illusion during lumbar multifidus muscle vibration corresponds with a trunk flexion and thus an anterior COP displacement.\nTo appraise postural stability and proprioceptive postural control in quiet stance, two test conditions were used: (1) an upright standing condition on a stable support surface and (2) an upright standing condition on an unstable support surface (foam), respectively.\nTo appraise proprioceptive postural control in sitting, subjects sat on a stable stool with the feet stable.\nIn all standing conditions, subjects had to stand barefoot on the force plate (Trials 1, 2, 3, 4) or on the foam (Trials 5, 6, 7, 8) with the arms loosely hanging along the body, both heels 10 cm separated and the forefeet in a free splayed out position.\nFeet position is standardized in all trials using a transparency sheet to mark off both feet.\nThe foam condition is used to create a postural condition in which ankle proprioceptive signals are less reliable and therefore the CNS should rely more on other proprioceptive signals to control posture (Ivanenko et al.\nIn all sitting trials (9, 10, and 11), subjects sat on a stable stool with height adjusted to create a rectangle between the greater trochanter (lateral femoral condyle line) and the lateral femoral condyle (lateral malleolus line), respectively.\nFeet position was standardized using the same transparency sheet from the standing trials.\nSubjects were asked to adopt a usual sitting posture with the arms loosely hanging along the body.\nIn all trials, vision was occluded and subjects were asked to remain as immobile, but relaxed as possible in upright standing or usual sitting posture, respectively (Fig.\nPostural sway characteristics from the force plate readings were collected and calculated using Spike2 (CED, Cambridge, UK) and Microsoft Excel software, for all trials of both groups.\nFurther data reduction was performed by calculating the root mean square (RMS) values of the COP displacements for the stability trials (1, 2, 5, 6,) and the mean values for the muscle vibration trials in order to appraise the directional effect of muscle vibration on COP displacement.\nThe COP displacements in the muscle vibration trials were analyzed over two epochs: the 15 s preceding and the 15 s during muscle vibration.\nPositive values correspond to forward COP displacement, negative values correspond to backward displacement.\nA score equal to 1 corresponds to 100% reliance on triceps surae muscle afference.\nA score equal to 0 corresponds to 100% reliance on lumbar multifidus muscle afference.\nWhere a significant main and interaction effect was found, post hoc tests (Tukeys unequal N HSD) were performed to further analyze the detailed effects.\nAll data are presented as mean  standard deviations (SDs).\nThe statistical analysis was performed with Statistica 9 (Statsoft, Oklahoma, USA).\nFigure 2 illustrates the results of the stability trials.\nIn the foam conditions, however, larger forward sways were observed by the healthy control group compared to the individuals with NSLBP when vibration is applied on the lumbar multifidus muscles (Trial 8; p \\ 0.\n1 Experimental set-up: a standing on a stable support; b standing on an unstable support (foam) with application of muscle vibration on triceps surae muscles; and c usual sitting on an adjustable stool.\nduring sitting, significantly larger sways were recorded when vibration was applied on lumbar multifidus muscle in the healthy group compared to the people with NSLBP (Trial 11; healthy: 0.\nFigure 3 illustrates the results of the vibration trials during standing on a firm support surface and standing on foam.\nFigure 4 illustrates the results of the vibration trials during sitting.\nFigure 5 displays the RPW values for both groups during the different postural conditions.\nThe main finding of this study is that young people with NSLBP (compared to healthy controls) show a stronger ankle-steered proprioceptive postural strategy during standing on a stable support surface and in a condition, where this strategy is less appropriate (i.\nThis may lead to decreased postural robustness during standing.\nFurthermore, in a condition where lumbar proprioceptive afference is expected to be crucial (sitting), persons with NSLBP are not able to rely on this afference to control posture.\nResults of this study demonstrate greater AP sways of the COP when standing on an unstable support surface and when performing a ballistic arm movement on an unstable support.\nThese findings are in agreement with the results of previous research, where larger AP sways were found when the postural task became more difficult and vision was occluded (Mientjes and Frank 1999; Mok et al.\nThey found that the less the subjects swayed in a stable condition, the more they swayed in an unstable support surface (foam) condition.\nThese findings might indicate that the adopted postural strategy of persons with NSLBP is effective for easy postural conditions; however, this postural strategy seems to fail in more complex postural conditions leading to decreased postural robustness.\nIn the present study, we used muscle vibration, known as a powerful stimulus of muscle spindles, to evaluate the role of proprioception in postural control directly (Roll and Vedel 1982; Cordo et al.\nIt is demonstrated that (1) people with NSLBP demonstrate larger backward sways during triceps surae muscle vibration when standing on a stable support compared to the control group and (2) healthy people demonstrate significantly more forward sway during multifidus muscle vibration when standing on a foam support.\nThese findings illustrate clearly that proprioceptive differences are an influencing factor in this strategy selection.\nThe higher RPW values in the group with NSLBP compared to healthy controls when standing on a stable or an unstable support and during sitting indicate that the NSLBP group relies less on back muscle proprioceptive inputs independent of the postural condition.\nThis reduced multi-segmental strategy seems to be adequate in stable support conditions, but leads to decreased postural robustness in unstable support conditions.\nLumbosacral proprioceptive deficits were suggested as a possible reason why people with NSLBP could not switch to a more appropriate postural control strategy upon the condition (Mok et al.\n2004), but a specific evaluation of the proprioceptive system did not occur.\nThese results are in accordance with previous studies showing that people with NSLBP used a more ankle-steered strategy to maintain upright position while healthy controls.\nIn contrast, Isableu and Vuillerme 2006 demonstrated that some healthy people use an ankle strategy in all conditions.\nThese findings suggest that there might be differences in strategy selection in young healthy people, based on different central or peripheral proprioceptive processing.\nIt may be possible that these people are at higher risk to get NSLBP in the future, due to impaired proprioception of the lumbosacral area.\nIt is hypothesized that these proprioceptive changes may cause less fine-tuned control of the spine during postural control which may increase the risk to induce more mechanical stress on the spinal column causing (recurrent) NSLBP (Hodges and Moseley 2003).\nProspective studies investigating the role of reduced variability caused by altered proprioceptive inputs in postural control strategies are needed to clarify the role of reduced variability as a causing factor for NSLBP.\nFurthermore, during sitting, people with NSLBP also show higher RPW values compared to the healthy controls.\nThis suggests that they use less afferent signals from the back muscles in a condition where these signals are expected to play a predominant role in postural control.\nThese results underscore the hypothesis that in NSLBP lumbosacral proprioceptive impairment is associated with decreased postural control variability.\nThe underlying mechanism causing the altered proprioceptive steering in people with NSLBP remains still unclear.\nA possible mechanism underlying the decreased reliance on back muscle proprioception in patients with NSLBP might be a different muscle spindle density in the paraspinal muscles.\nMuscle spindles tend to concentrate mainly where oxidative muscle fibers predominate, often in the deeper and central portions of muscles (Kokkorogiannis 2004).\nIndividuals with NSLBP have been observed to have more fatigable muscle fibers due to decreased oxidative capacity (Mannion et al.\nConsequently, lumbar multifidus vibration might cause a smaller effect.\nThis hypothesis warrants further investigation.\nIn these studies, fear of movement and painrelated beliefs were suggested as influencing factors.\n(2008b) demonstrated that only healthy persons show lower RPW values during standing on an unstable support surface compared to a firm surface condition, whereas people with NSLBP showed similar RPW values in both postural conditions.\nThese earlier findings are in contrast with our findings demonstrating that healthy controls have lower RPW values in all postural conditions.\nThus, our results demonstrated that both young people with NSLBP and healthy controls have the ability to make a proprioceptive switch, but this capacity to switch is observed to be reduced in people with NSLBP.\nThese findings suggest that age may be an important factor in the capacity of varying postural control strategies and the associated sensory reweighting variability.\nIt might be possible that at a certain age, young people with NSLBP move from adaptive switchable postural control strategies to more rigid postural control strategies based on less variability in somatosensory reweighting.\nProspective studies in different age groups are necessary to further explore this hypothesis.\nIn addition, in this study, fear may be likely ruled out as a causing factor for the reduction in postural strategy variability as there were no significant differences in the scores on FABQ and TSK questionnaires between the NSLBP and the control group.\nMoreover, the people with NSLBP had a low mean pain score of 2/10 at the time of testing, so pain is probably not the predominant factor responsible for the reduction in proprioceptive postural strategy variability.\nSome limitations of our study warrant discussion.\nFirst, a very young population with minimal pain and disability scores was investigated.\nTherefore, the results of this study cannot be generalized to the average NSLBP patient population.\nMoreover, a sub-classification based on pain aggravating movements and postures was not made.\nIt could be possible that the people with NSLBP are still robust in some pain-free postures, but less robust in the pain aggravating postures.\nAnother limitation of this study is that only rather static postural conditions (sitting and standing) were tested.\nMuscle vibration, used to appraise the proprioceptive steering, could be influenced by skin thickness.\nin the current study there were no significant differences in height and weight between both groups.\nMoreover, body mass indexes of both groups were fairly low (Table 1).\nWhile more optimal investigation of proprioceptive changes may optimize treatment of persons with NSLBP, it remains difficult in clinical practice to evaluate these changes without the use of precise and accurate instruments as in a laboratory setting.\nTherefore, based on the laboratory results, a functional clinical test battery should be developed and its concurrent validity should be assessed before wider integration into clinical practice.\nA large amount of multi-segmental postural correction possibilities depending on the postural task should be included in exercise programs.\nYoung healthy people have the ability to choose the optimal multi-segmental postural control strategy according to the postural condition.\nThis loss of variability in strategy selection is associated with a decreased postural robustness.\nProspective studies are needed to further clarify the relation between reduced variability of postural control strategies and the development, reoccurrences or maintenance of NSLBP.\nAllum JH, Bloem BR, Carpenter MG, Hulliger M, Hadders-Algra M (1998) Proprioceptive control of posture: a review of new concepts.\nSpine 25(8):989994 Brumagne S, Cordo P, Verschueren S (2004) Proprioceptive weighting changes in persons with low back pain and elderly persons during upright standing.\nBrumagne S, Janssens L, Janssens E, Goddyn L (2008a) Altered postural control in anticipation of postural instability in persons with recurrent low back pain.\nGait Posture 4:657662 Brumagne S, Janssens L, Knapen S, Claeys K, Suuden-Johanson E (2008b) Persons with recurrent low back pain exhibit a rigid postural control strategy.\nEur Spine J 17(9):11771184 Carver S, Kiemel T, Jeka JJ (2006) Modeling the dynamics of sensory reweighting.\nBiol Cybern 95(2):123134 Cordo PJ, Gurfinkel VS, Brumagne S, Flores-Vieira C (2005) Effect of slow, small movement on the vibration-evoked kinesthetic illusion.\nSpine 31(17):20172023 della Volpe R, Popa T, Ginanneschi F, Spidalieri R, Mazzocchio R, Rossi A (2006) Changes in coordination of postural control during dynamic stance in chronic low back pain patients.\nGait Posture 24(3):349355 Descarreaux M, Blouin JS, Teasdale N (2005) Repositioning accuracy and movement parameters in low back pain subjects and healthy control subjects.\nEur Spine J 14(2):185191 Dolan KJ, Green A (2006) Lumbar spine reposition sense: the effect of a slouched posture.\nClin Biomech (Bristol, Avon) 21(9):881892 Hodges PW, Moseley GL (2003) Pain and motor control of the lumbopelvic region: effect and possible mechanisms.\nJ Electromyogr Kinesiol 13(4):361370 Horak FB, Nashner LM (1986) Central programming of postural movements: adaptation to altered support-surface configurations.\nExp Brain Res 174(4):763768 Ivanenko YP, Talis VL, Kazennikov OV (1999) Support stability influences postural responses to muscle vibration in humans.\nEur J Neurosci 11(2):647654 Jacobs JV, Henry SM, Nagle KJ (2009) People with chronic low back pain exhibit decreased variability in the timing of their anticipatory postural adjustments.\nMacDonald DA, Moseley GL, Hodges PW (2006) The lumbar multifidus: does the evidence support clinical beliefs? Man Ther 11(4):254263 Mannion AF, Weber BR, Dvorak J, Grob D, Muntener M (1997) Fibre type characteristics of the lumbar paraspinal muscles in normal healthy subjects and in patients with low back pain.\nJ Orthop Res 15(6):881887 Mientjes MI, Frank JS (1999) Balance in chronic low back pain patients compared to healthy people under various conditions in upright standing.\nClin Biomech (Bristol, Avon) 14(10):710716 Mok NW, Brauer SG, Hodges PW (2004) Hip strategy for balance control in quiet standing is reduced in people with low back pain.\nSpine (Philadelphia, PA, 1976) 29(6):107112 Morasso PG, Schieppati M (1999) Can muscle stiffness alone stabilize upright standing? J Neurophysiol 82(3):16221626 Moseley GL, Hodges PW (2006) Reduced variability of postural strategy prevents normalization of motor changes induced by back pain: a risk factor for chronic trouble? Behav Neurosci 120(2):474476 Newcomer KL, Laskowski ER, Yu B, Johnson JC, An KN (2000) Differences in repositioning error among patients with low back pain compared with control subjects.\nSpine 25(19):24882493 OSullivan PB, Mitchell T, Bulich P, Waller R, Holte J (2006) The relationship between posture and back muscle endurance in industrial workers with flexion-related low back pain.\nMan Ther 11(4):264271 Paulus I, Brumagne S (2008) Altered interpretation of neck proprioceptive signals in persons with subclinical recurrent neck pain 1.\nExp Brain Res 177(3):411418 Radebold A, Cholewicki J, Polzhofer GK, Greene HS (2001) Impaired postural control of the lumbar spine is associated with delayed muscle response times in patients with chronic idiopathic low back pain.\nSpine 34(11):12331238 Vlaeyen JW, Kole-Snijders AM, Boeren RG, van Eek H (1995) Fear of movement/(re)injury in chronic low back pain and its relation to behavioral performance."}