{"title": "29.B.ISSLS_Prize_Winner__Smudging_the_Motor_Brain_in.3.pdf", "contents": "Unauthorized reproduction of this article is prohibited.\nFascicles of the lumbar  paraspinal muscles are differentially activated during function.\nHuman studies indicate this may be associated with a spatially  separate array of neuronal networks at the motor cortex.\nLoss of  discrete control of paraspinal muscle fascicles in LBP may be  because of changes in cortical organization.\nData were collected from 9 individuals with recurrent  unilateral LBP and compared with 11 healthy participants from an  earlier study.\nFine-wire electrodes selectively recorded myoelectric  activity from short/deep fascicles of deep multifi dus (DM ) and long/ superfi cial fascicles of  longissimus erector spinae (LES), bilaterally.\nMotor cortical organization was investigated using transcranial  magnetic stimulation at different scalp sites to evoke responses in  paraspinal muscles.\nLocation of cortical representation (center of  gravity; CoG) and motor excitability (map volume) were compared  between healthy and LBP groups.\nIndividuals with LBP had a more posterior location of  LES center of gravity, which overlapped with that for DM on both  hemispheres.\nIn healthy individuals, LES center of gravity was  located separately at a more anterior location to that for DM.\nIncreased overlap in motor cortical representation of DM and  LES may underpin loss of differential activation in this group.\nFor instance, interventions to reverse muscle atrophy  12   would differ from those to alter muscle recruitment.\n13  Recent  insights into motor cortex organization using noninvasive  magnetic brain stimulation provide a unique opportunity to  explore neural mechanisms associated with movement changes in pain.\nDifferential control of paraspinal muscles is compromised  in LBP.\nAcknowledgment date: October 14, 2010.\nThe manuscript submitted does not contain information about medical  device(s)/drug(s).\nNo benefi ts in  any form have been or will be received from a commercial party related  directly or indirectly to the subject of this manuscript.\nAddress correspondence and reprint requests to Paul Hodges, NHMRC Centre  of Clinical Research Excellence in Spinal Pain, Injury and Health, School of  Health and Rehabilitation Sciences, The University of Queensland, Brisbane,  QLD 4072 Australia; E-mail:  p.\nchanges in recurrent LBP and suggest motor rehabilitation that  includes training of differential activation of the paraspinal muscles  may be required to restore optimal control in LBP.\nUnauthorized reproduction of this article is prohibited.\nChanges in brain organization may underlie changes in paraspinal muscle activation.\nRecent brain mapping studies using transcranial magnetic  stimulation (TMS) suggest separate regions of the motor cortex underpin discrete activation in healthy individuals.\nAlthough organization of these cortical networks  has not been studied in LBP, responsiveness (excitability) of  corticomotor pathways to paraspinal muscles using TMS is  reduced  11  and the motor cortical map for other trunk muscles  is reorganized.\nThis study aimed to investigate organization of areas of the  motor cortex associated with inputs to different paraspinal  muscle fascicles in individuals with recurring episodes of LBP.\n20  Participants were  included in the LBP group if they had nonspecifi c episodic  unilateral LBP (  buttock pain) lasting longer than 3 months  with periods of symptom aggravation and remission.\nLBP participants had minimal pain at time of  testing and symptoms were not aggravated by experimental  procedures.\nPain-free participants were included in the earlier  study if they had no history of back or lower limb pain or  injury that limited their function and/or required treatment  from a health profession.\nParticipants were excluded from  both groups if they had any major circulatory, neurological,  respiratory disorders, recent or current pregnancies, previous  spinal surgery, analgesic or anti-infl ammatory medication  in the past month, or participation in trunk muscle exercise  in the past 12 months.\nSubject demographics are shown in   Table 1 .\nThe institutional medical research ethics committee approved the study and procedures conformed to the  Declaration of Helsinki.\nElectrodes  were inserted  via hypodermic needles with ultrasound guidance into DM and LES bilaterally ( Figure 1 ), adjacent to the  L4 spinous process.\nEMG data were amplifi ed 2000 times, band-pass fi ltered between 20 and 1000 Hz and sampled at 2000 Hz using  a Power1401 Data Acquisition System with Spike2 software  (Cambridge Electronic Design, Cambridge, UK ).\nAs motor-evoked potentials (MEPs) were diffi cult to elicit at  rest,  21    23  motor cortex stimulation was conducted during submaximal paraspinal muscle contractions.\nSubjects sat comfortably with their arms crossed and feet on the fl oor.\nThree  maximum voluntary contractions of the paraspinal muscles  against resistance for approximately 3 seconds were used  to determine submaximal contraction intensity.\nThe highest  root-mean-square EMG for 1 second was identifi ed from the  DM bilaterally.\nThe target DM activation during TMS was  set at approximately 20% of this value (feedback provided  on a monitor) and achieved by leaning forward with the back  straight.\n20  ,  22    Motor cortex mapping was conducted using a 7-cm fi gureof-eight coil to excite neuronal networks associated with  paraspinal muscles.\nThe coil handle was oriented along the  sagittal plane to induce currents in an anterior direction.\nThis  coil orientation provides consistent paraspinal MEPs with  minimal concurrent excitation of the opposite hemisphere.\n22   Subjects wore a tight-fi tting bathing cap and the vertex  was  determined using the International 10/20 system.\n25  Participants rested  for 1 minute after stimulation of each site to minimize fatigue.\nUnauthorized reproduction of this article is prohibited.\nMEP amplitudes were averaged at each scalp site across subjects after  normalization to the peak response to produce a topographical map ( Figure 1 ).\nNormalized values less than 25% of peak  values were removed and the remaining responses were rescaled from 0% to 100%.\nRemoval of small amplitude MEPs  minimally affects TMS maps.\nAlthough  map volume is sensitive to changes in corticomotor excitability, the CoG is a valid and repeatable measure of a muscles  motor cortex representation.\nMap volume, CoG location, and MEP onset at the optimal site were  compared between muscles, group, and side using repeated  measures analyses of variance.\nThe Duncan test was used for   post hoc analyses.\nA separate analysis compared CoG location, map volume, and MEP onset between the painful and  nonpainful sides (Pain) for the LBP group.\nThe relationship  between pain intensity/duration and cortical measures (CoG  coordinates and map volume) were investigated using the  Pearson correlation.\nRESULTS   Data were rejected for left DM and right LES from one LBP  participant each because of poor EMG quality.\nAs MEPs contralateral to the stimulated cortex were consistently elicited, mapping was only undertaken using this data.\nDotted lines denote sagittal and frontal planes,  intersecting at the vertex.\nA, Stimuli over the motor cortex excite intracortical neurons that provide synaptic input to corticospinal cells.\nC, The descending  volley excites the spinal motoneurons and results in a motor-evoked  potential (MEP), mainly in the contralateral muscles.\nD, MEPs were  recorded in both muscles from stimuli applied at each point on the  grid placed over the scalp and aligned to the vertex (Cz).\nUnauthorized reproduction of this article is prohibited.\nThis work has implications for motor rehabilitation that aims to restore optimal  control of paraspinal muscles for management of LBP.\nFor instance, motor cortical stimulation in cats elicits fl exion of the contralateral forelimb and anticipatory postural adjustments in the supporting forelimb.\n29  Human data  demonstrate reduced trunk muscle postural activity with limb  movements when motor cortex is inhibited with submotorthreshold TMS.\nLBP is associated with adaptive changes in organization of  cortical neuronal networks.\nThe posterior shift in LES representation refl ects motor cortex reorganization and cannot be accounted for by changes in excitability.\nIt may  reduce the potential to independently control these muscles.\nThe degree of differential motor control is related to discrete organization of motor cortical networks; for example,  discrete representation of individual fi ngers on the primary  motor and sensory cortices are related to independent fi ne  control of fi nger movements.\nData for left/right and  pain/nonpainful sides were not different and are not separately identifi ed in the fi gure.\nNote reduced map volume in LBP group compared with healthy  individuals.\nR indicates right; L, left.\nUnauthorized reproduction of this article is prohibited.\nAlthough current data provide evidence of changes to the  motor cortex and corticospinal tracts, the exact mechanisms  of how pain induces such changes require further investigation.\nAmplitudes of changes in the sensory representation of the back  42  and motor threshold  11  are related  to pain duration.\nNo relationship was identifi ed in our data.\nYet,  despite the small sample, fi ndings were consistent across subjects and yielded signifi cant results.\nFor practical reasons, subjects were only required to match DM EMG during TMS.\nWe  did not control LES EMG.\nAlthough this may increase intersubject variability in motor cortical excitability for LES, this  does not compromise our main fi nding as CoG measures are  less affected by motor excitability.\nAlthough it is beyond this study to  speculate on how best to restore cortical organization, studies  in focal hand dystonia suggest redifferentiation of discrete  fi nger representation is possible with training of isolated fi nger .\nrepresenting adjacent fi ngers in focal hand dystonia, reduces the isolation of fi nger movements.\nThus, we cannot directly  investigate the relationship between organization and function.\nNevertheless, this work provides the basis for studies  into the relationship between cortical remodeling and altered  trunk muscle coordination.\nMotor cortex reorganization supports the notion that the  nervous system adopts a new strategy for movement/stability  with LBP.\nFirst, when pain is induced  in healthy individuals, trunk muscle EMG increases in keeping with the goal to protect the spine, although the pattern  varies between individuals.\nReorganization of LES but not  DM appears consistent with the proposal that reorganization  of inputs to long/superfi cial fascicles underpins the adaptive  search for a new motor strategy.\nThe isolation of some motor control changes to  the painful side  14  may question the association between motor control and symmetrical changes in cortical organization.\nHowever, many changes in motor control are not systematically related to the side of pain.\nFor instance, unilateral experimental pain induces variation in motor coordination that  is not exclusive to the pain side.\nDM and LES map volume was reduced in LBP.\nHowever, it is not possible to determine whether those changes were  because of effects at the cortex or spinal cord as excitability of  both may affect the responsiveness to TMS.\n38  Recent animal  39   and human  40  studies highlight opposite changes at the cortex  and spinal cord, making interpretation impossible without  techniques that isolate measures to a specifi c site.\nIn animal  studies, responsiveness to stimulation over the brain increased .\nUnauthorized reproduction of this article is prohibited.\n19  In addition, motor training with specifi c activation of deep abdominal muscles can reverse pain-associated  reorganization at the motor cortex  9  and this is associated  with improved motor behavior.\nDiff erential activation is associated with discrete organization of neuronal networks at the motor cortex.\nLoss of discrete organization of diff erent fascicles  of the paraspinal muscles at the motor cortex is  observed in individuals with recurrent low back pain.\nReorganization at the motor cortex may underpin  this loss of diff erential activation in low back pain.\nDifferences in multifi dus and iliocostalis lumborum activity between healthy subjects  and patients with sub-acute and chronic low back pain .\nRapid atrophy of the lumbar multifi dus follows experimental disc or nerve root injury .\nReorganization of the motor cortex is associated with postural control defi cits in recurrent low back  pain .\nDisc herniationrelated back pain impairs feed-forward control of paraspinal muscles .\nDifferent ways to balance  the spine: subtle changes in sagittal spinal curves affect regional  muscle activity .\nDeep and superfi cial fi bers  of the lumbar multifi dus muscle are differentially active during voluntary arm movements .\nIndividual fascicles of the paraspinal muscles are activated by discrete cortical networks in humans .\nMotor-evoked potentials elicited from human  erector spinae muscles by transcranial magnetic stimulation .\nMotor cortex may be involved in feedforward postural responses of the deep trunk muscles .\nUnauthorized reproduction of this article is prohibited.\nTrunk muscle recruitment patterns in patients with low back pain enhance the stability  of the lumbar spine .\nCorticomotor excitability of  back muscles is affected by intervertebral disc lesion in pigs .\nExtensive reorganization of primary somatosensory cortex in chronic back pain patients .\nMotor training of the  lumbar paraspinal muscles induces immediate changes in motor  coordination in patients with recurrent low back pain ."}