{"title": "32.7631.full.pdf", "contents": "Multiplecorticalareasareinvolvedinpainprocessing,includingtheprimarysomatosensorycortex(S1)andtheanteriorcingulatecortex (ACC).\nHere, we provide the first evidence that intra-regional remodeling within the mouse S1 accelerates chronic pain behavior by modulating neuronal activity in the ACC, one of the important cortical areas for chronic pain.\nUsing two-photon Ca2 imaging, we found that the spontaneous activity oflayer2/3neuronsintheS1andthenresponsetosensoryandlayer4stimulationsincreasedunderchronicpainconditions.\nInaddition, pharmacological attenuation and facilitation of S1 activity attenuated and facilitated the chronic pain behavior, respectively.\nFurthermore, electrical response of the ACC to peripheral stimulation successfully correlated with S1 neuronal activity, and inhibition of ACC activity alleviated the mechanical allodynia.\nIntroduction Chronic pain is a major health issue all over the world, and is caused by tissue or nerve injury under different disease conditions.\nTreatment of chronic pain is a clinical challenge because the mechanisms are less well known.\nSince pain-related areas may interact with each other in processing pain information (Moisset and Bouhassira, 2007), we focused on layer 2/3 (L2/3) excitatory neurons of the S1, which integrate sensory information originating from peripheral nerves and transmit the signals to other pain-related cortical areas (Ferezou et al.\nTo induce chronic inflammatory pain, 40 l of Complete Freunds adjuvant (CFA) (Sigma) was injected subcutaneously into the hindpaw 1 week before experiments.\nControl mice were injected with 40 l of saline only.\nAll relevant experimental protocols were approved by the Animal Research Committee of the National Institutes of Natural Sciences, Japan.\nThe skull was exposed and cleaned.\nA 3-mm-wide cranial window was made above the S1.\nFor imaging of intrinsic signals, the cortical surface was illuminated by blue light-emitting diodes (490 nm).\nThe authors declare no competing financial interests.\nCorrespondence should be addressed to Dr.\nCa 2 indicators (OGB-1 or fura-2) were excited at 800 nm, and Venus and sulforhodamine 101(SR101) were excited at 950 nm.\nHindpaw stimulation was repeatedly applied at each plane.\nThe baseline intensity, F0, was obtained by averaging the intensity values during the prestimulus period (5 s).\nCells were considered responsive if the fluorescence intensity change was 10% of baseline value, because we can clearly distinguish responses from baseline.\nIn some experiments, we placed a bipolar electrode (Inter Medical) at the depth of 500550 m below the cortical surface.\nElectrical pulses were generated using a stimulator (SEN-7203, Nihon Kohden) attached to an isolator unit (SS-403J, Nihon Kohden).\nTen pulses of 200 s constant current (10100 A, interval of 1 min, 20 Hz) were applied in each trial.\nElectrical recordings were made using the conventional whole-cell patch-clamp recording technique at a holding potential of 60 mV (Axopatch 700B, Molecular Devices).\nPatch pipettes were filled with the internal solution, which contained (in mM:) 130 cesium methanesulfonate, 4 CsCl, 2 EGTA, 4 Mg-ATP, and 10 HEPES, 5 QX314, pH 7.\nEvoked EPSCs were recorded from the L2/3 pyramidal neurons in the S1 hindpaw area in the presence of 50 M.\nData were acquired using pCLAMP 10 software, filtered at 2 kHz, digitized at 10 kHz.\nA craniotomy was made in the region overlying the ACC and S1.\nAfter amplification (ER-91, NeuroData) and bandpass filtering (101 kHz), the signal was sent to an analog-to-digital converter (PowerLab/4ST).\n1% fluorescein isothiocyanate (FITC)] was applied to the L2/3 region of the S1 hindpaw area, and drug expansion was assessed by the fluorescence from FITC.\nThe mechanical allodynia tests were performed before injection of saline or CFA into the hindpaw, 7 d after the injection, and after drug injection using the von Frey test (Chaplan et al.\nA small hole (1 mm) was made on the skull above the S1, and drugs (CNQX, vehicle containing 1% DMSO, SR95531) were injected using a glass pipette at the L2/3 region under brief anesthesia, using isoflurane (13% as needed) inhalation with 30% oxygen balanced with nitrogen.\nThus, we used injection of 1 mM CNQX in this study.\nFor drug application to the ACC, small holes were made on the skull.\nb, Typical traces of spontaneous Ca 2 transients (red dots) were obtained from different L2/3 neurons.\nTherespondingcellratioandresponseprobabilityweredeterminedasthe numberofresponsivecellsdividedbytotalimagedcellsateachplane,andasthenumberofresponsivetrialsdividedbythetotal number of trials, respectively.\nCortical Activities Accelerate Pain Behavior.\nAll values are expressed as mean  SEM.\nStatistical comparisons were performed using ANOVA followed by a Bonferroni test or unpaired Students t test.\nThe difference between cumulative distributions was assessed using the KolmogorovSmirnov test.\nResults CFA was injected into the hindpaw of a wild-type mouse or a VGAT-Venus mouse (see Material and Methods) to generate a chronic inflammatory pain model.\npaw area was identified by optical imaging of intrinsic signals (Fig.\nCumulative probability histograms were significantly different between the control and CFA-injected mice (Fig.\nTo clearly distinguish the activity of L2/3 excitatory neurons, which integrate and transmit sensory information to other cortical areas, the L2/3 excitatory neuronal activity elicited in response to hindpaw pressure stimulation was examined by fura-2 Ca 2 imaging (Kameyama et al.\nThe L2/3 excitatory neuronal activity of the CFA-injected mice in response to sensory stimulation increased in responding cell ratio (22.\nThese results clearly demonstrate the hyperexcitability of L2/3 excitatory neurons in chronic pain conditions.\nIntracortical remodeling between the L2/3 and L4 in the S1 contributes to the hypersensitivity of L2/3 excitatory neuronstosensorystimulationunderchronicpainconditions.\nCells expressing Venus (inhibitory neurons, green) and cells stained with SR101 (astrocytes, red) were excluded from the analysis.\nExcitabilityofL2/3excitatoryneuronsofS1evoked by electrical stimulation of the L4 region increased in the CFA-injected mice.\nError bars represent SEM.\nEvoked Ca 2 transients increased with respect to the responding cell ratio, response probability per responding cell, and amplitude, compared with the respective values of control mice (control, 3 animals; CFA, 4 animals) (Fig.\nThe obtained intensity response curves revealed that the amplitudes of EPSCs evoked by electrical stimulation of the L4 region were increased in the CFAinjected mice compared with the control mice (Fig.\nThis increased synaptic input from L4 to L2/3 pyramidal neurons also suggests that the intra-regional network from L4 to L2/3 excitatory neurons is remodeled in chronic pain conditions.\nTo directly examine the role of hyperactivities of S1 neurons in pain behavior under a chronic inflammatory pain condition, CNQX (1 mM, 1 l) was microinjected into the surface area of the S1 in CFA-injected mice.\nHowever, an injection of a GABAA receptor antagonist, SR95531, decreased the paw-withdrawal threshold in control mice (Fig.\nThus, this result suggests that S1 neuronal hyperactivity contributes to the facilitation of mechanical allodynia under chronic pain conditions.\n, 2007), the plastic change may modulate activity of other pain-related cortical areas, which may contribute to expression of mechanical allodynia.\nUnder normal conditions (control mice), local CNQX (1 mM, 1 l) injection into the S1 did not alter the slope of fEPSP of the ACC in response to electrical stimulation of the hindpaw (Fig.\nIn contrast, disinhibition of S1 activity by local application of SR95531 (3 M, 1 l) into the S1 facilitated sensory-evoked fEPSP in the ACC in control mice (Fig.\nTo clarify the role of the ACC activity in chronic pain behavior, we applied CNQX into the ACC, which increased paw-withdrawal thresholds (Fig.\nDiscussion Cortical plasticity of the S1 has been discussed in chronic pain as a maladaptive memory formation (Vartiainen et al.\nIn the present study, in vivo imaging with single-cell resolution further demonstrated the increased excitability of L2/3 excitatory neurons.\nIn the S1, neurons in the S1 code intensity and location of touch and pain stimulations (Kenshalo and Isensee, 1983).\nThe S1 reorganization occurs constantly in response to the inputs from peripheral afferent neurons to the L2/3 neurons, which exhibit activitydependent plasticity, such as long-term potentiation (Walcott and Langdon, 2002; Ismailov et al.\nSince hyperexcitability in peripheral neurons enhances nociceptive inputs to supraspinal sites in chronic pain conditions (Urban and Gebhart, 1999; Woolf and Salter, 2000), such increased inputs may have caused the observed activity-dependent plastic changes in the afferents to L2/3 neurons within the S1, as seen in spinal circuits (Woolf and Salter, 2000).\nIn pain models with exaggerated pain sensation, functional plastic change occurs within the ACC (Wei and Zhuo, 2001) and structural change of layer 5 neurons occurs in the S1 (Kim and Nabekura, 2011).\nThus, the functional and structural plastic change within the pain-related cortical areas may have a critical role in chronic pain syndrome.\nWe demonstrated that pharmacological inhibition of excitatory synaptic transmission in L2/3 of the S1 successfully attenuated the mechanical allodynia and hyperexcitable activity of the ACC, while disinhibition of the transmission facilitated the pain behavior (Fig.\nExcessive sensory information from the L2/3 excitatory neurons in the S1 to the ACC may increase the activity of the ACC.\nThe experience of pain is a result of both sensory and emotional aspects, which are independently processed via different pathways involving the S1 and ACC, respectively (Price, 2000; Moisset and Bouhassira, 2007), and both types of cortical areas have been expected to interact with each other (Rainville et al.\nThe S1 neuronal activity modulated mechanical allodynia.\na, Microinjection of AMPA receptor antagonist CNQX into the L2/3 region attenuated mechanical allodynia in CFAinjected mice (closed circles, 5 mice), but did not result in any observable changes in control mice (open circles, 3 mice).\nCortical Activities Accelerate Pain Behavior.\nexcitatory neurons may modulate the ACC neuronal activity via indirect pathways, and the possibility of the direct pathways still exists.\nActually, in the present study, inhibition of ACC neuronal activity attenuated the chronic pain behavior (Fig.\nHowever, it could not be excluded that the modulation of S1 activity directly manipulates pain behavior, which inturnmayaltertheACCactivityevokedby sensory stimulation, since neurons in the S1 code intensity and location of pain stimulations (Kenshalo and Isensee, 1983).\nThis study may shed light on the central mechanisms of chronic pain and provide a new efficienttherapeuticstrategyagainstchronic pain by focusing on the interaction between the S1 and ACC.\nReferences Allen CB, Celikel T, Feldman DE (2003) Longterm depression induced by sensory deprivation during cortical map plasticity in vivo.\nChaplan SR, Bach FW, Pogrel JW, Chung JM, Yaksh TL (1994) Quantitative assessment of tactile allodynia in the rat paw.\nCheetham CE, Hammond MS, Edwards CE, Finnerty GT (2007) Sensory experience alters cortical connectivity and synaptic function site specifically.\nEndo T, Spenger C, Hao J, Tominaga T, Wiesenfeld-Hallin Z, Olson L, Xu XJ (2008) Functional MRI of the brain detects neuropathic pain in experimental spinal cord injury.\nEto K, Arimura Y, Nabekura J, Noda M, Ishibashi H (2007) The effect of zinc on glycinergic inhibitory postsynaptic currents in rat spinal dorsal horn neurons.\nKamatani D, Hishida R, Kudoh M, Shibuki K (2007) Experience-dependent formation of activity propagation patterns at the somatosensory S1 and S2 boundary in rat cortical slices.\nKameyama K, Sohya K, Ebina T, Fukuda A, Yanagawa Y, Tsumoto T (2010) Difference in binocularity and ocular dominance plasticity between GABAergic and excitatory cortical neurons.\nKenshalo DR Jr, Isensee O (1983) Responses of primate SI cortical neurons to noxious stimuli.\nThe S1 neuronal activity modulated ACC activity.\nCoronal sectional images of the S1 and ACC show an area of drug diffusion (green, FITC) (right top) and the location of the recording electrode (red, DiI) (right bottom).\nIn the slice containing the ACC, fluorescence from FITC was not detected.\nThe slope (dotted line) was then analyzed.\nTTX broadly applied to the brain surface completely abolished the response (bottom).\nMicroinjection of SR95531 (3 M) to the S1 enhanced the electrical response to hindpaw stimulation in the ACC of control mice.\nf,MicroinjectionofCNQXintotheACCattenuatedmechanicalallodyniainCFA-injectedmice(closedcircles, 4 animals), but injection of vehicle did not alter the thresholds (open square, 4 animals).\nError bars represent SEM.\nPetrovic P, Ingvar M, Stone-Elander S, Petersson KM, Hansson P (1999) A PET activation study of dynamic mechanical allodynia in patients with mononeuropathy.\nShibuki K, Hishida R, Murakami H, Kudoh M, Kawaguchi T, Watanabe M, Watanabe S, Kouuchi T, Tanaka R (2003) Dynamic imaging of somatosensory cortical activity in the rat visualized by flavoprotein autofluorescence.\nVartiainen N, Kirveskari E, Kallio-Laine K, Kalso E, Forss N (2009) Cortical reorganization in primary somatosensory cortex in patients with unilateral chronic pain.\nWalcott EC, Langdon RB (2002) Synaptically driven spikes and long-term potentiation in neocortical layer 2/3.\nWang Y, Kakizaki T, Sakagami H, Saito K, Ebihara S, Kato M, Hirabayashi M, Saito Y, Furuya N, Yanagawa Y (2009) Fluorescent labeling of both GABAergic and glycinergic neurons in vesicular GABA transporter (VGAT)-venus transgenic mouse.\nCortical Activities Accelerate Pain Behavior."}