{"title": "33.Disinhibition_of_the_primary_somatosensory_cortex.13.pdf", "contents": "Abstract Fibromyalgia (FM) is a chronic widespread pain condition linked to central sensitization.\nAltered excitability of sensorimotor cortex has been proposed as an underlying pathology of FM.\nThis study aimed to investigate intracortical excitability of the primary somatosensory cortex (S1) and its potential role in clinical pain in patients with FM.\nSomatosensory evoked magnetic fields were recorded in 17 right-handed females with FM and 21 age-, sex-, and handedness-matched healthy control subjects.\nPaired-pulse median nerve stimulation was delivered to the left and right wrist.\nWe assessed the peak-to-peak amplitudes of the N20mP35m and peak amplitude of each N20m and P35m component.\nPaired-pulse suppression (PPS) of the second response was quantified as the ratio of the amplitudes of the second to the first response.\nPatients with FM displayed significantly higher PPS ratio for the N20mP35m in both hemispheres, indicating reduced intracortical inhibition in the S1.\nNotably, PPS ratio for the P35m was higher in patients with FM than in healthy controls, whereas no differences were apparent in PPS ratio for the N20m in both hemispheres.\nFor both the N20mP35m and the P35m in the left hemisphere, PPS ratios were positively associated with the sensory pain on the shortform McGill Pain Questionnaire.\nThis study demonstrated that intracortical inhibition in the S1 is compromised bilaterally in patients with FM, and the extent of disinhibition can be closely associated with increased clinical pain.\nOur results suggest that changes of intracortical inhibition of the S1 may contribute to the pathophysiology of FM pain.\nFibromyalgia (FM) is a chronic pain syndrome characterized by widespread pain and tenderness, often accompanied by fatigue, nonrestorative sleep, and cognitive dysfunction.\nWe hypothesized that intracortical inhibition of the S1 would be reduced in patients with FM, ie, patients with FM would demonstrate higher PPS ratios than healthy control (HC) subjects, and that the higher reductions of inhibition would be associated with increased clinical pain.\nSponsorships or competing interests that may be relevant to content are disclosed at the end of this article.\nSupplemental digital content is available for this article.\nUnauthorized reproduction of this article is prohibited.\nNineteen right-handed female patients were recruited from the outpatient clinics of the Rheumatology Departments of the Seoul National University Hospital (SNUH) and Hallym University Sacred Heart Hospital.\nAll examinations, except diagnosis and self-report questionnaires, were conducted at SNUH to ensure consistency of the results.\nEligibility criteria for patients with FM were: (1) meeting the American College of Rheumatology 1990 criteria for primary FM,56 (2) having a duration of widespread pain at least 3 months, but less than 10 years, (3) experiencing a pain intensity of at least 40 on the 0to 100-mm pain visual analog scale over the past week, (4) between 30 and 60 years of age, and (5) willing to stop taking medications known to influence the somatosensory system (eg, analgesics, antidepressants, and anticonvulsants) at least 3 days before the assessments.\nAge-, gender-, and handedness-matched 21 HC subjects were recruited by local advertisement.\nExclusion criteria were same as for patients.\nThe study protocol was approved by the Institutional Review Board at SNUH and Hallym University Sacred Heart Hospital and was conducted in compliance with the Declaration of Helsinki.\nAll participants provided written informed consent.\nFor patients with FM, the disease duration (since the onset of widespread pain) and the number of tender points (as assessed by the treating rheumatologist using manual palpation upon inclusion) were registered.\nBeck Depression Inventory,2 Beck Anxiety Inventory,1 and the Fibromyalgia Impact Questionnaire3 were assessed.\nSensory and affective components of pain quality were assessed by the short-form McGill Pain Questionnaire (SF-MPQ).\nDemographic and clinical characteristics of the participants are presented in Table 1.\nThe left and right median nerves were stimulated at the wrist with 0.\nWe defined the sensory threshold as the lowest level of electrical stimulus intensity that produces the subtle tactile sensation on the skin of the wrist.\nThe motor threshold was determined as the lowest level of stimulus intensity for eliciting a visible twitch of the abductor pollicis brevis muscle.\nAll thresholds were determined twice and then averaged.\nThe stimulus intensity was set to 130% of each subjects motor threshold during the recording,14 where all participants did not feel any painful sensation.\nThis was checked before and after MEG recordings.\nSingleand paired-pulse stimuli with an interpulse interval of 100 milliseconds were presented alternatively in 1 run.\n16 The interstimulus interval between the singleand paired-pulse stimuli was 3 seconds.\nThe subjects were instructed not to pay attention to the stimulus and to keep their gaze fixed on a cross, shown in the center of the display in front of them.\n16 The order of the stimulation on the left and right median nerves at the wrist was randomized across subjects.\nNeuromagnetic signals were recorded with a 306-channel wholehead neuromagnetometer (VectorView; Elekta Neuromag,.\nDuring the MEG recordings, the subjects sat comfortably under the helmet-shaped sensor array and were asked to keep their heads as still as possible.\nThe location of head position indicator coils with respect to 3 anatomical landmarks, the nasion and 2 preauricular points, were measured by using a 3-dimensional digitizer (FASTRAK; Polhemus, Colchester, VT), to allow alignment of the MEG and MRI coordinate systems.\nThe x-axis passed through the 2 preauricular points with the positive direction to the right.\nThe positive y-axis passed through the nasion, and the z-axis pointed upward.\nHigh-resolution T1-weighted MRIs were obtained from all subjects, except for 1 HC subject due to claustrophobia, using a Siemens 3T scanner (Siemens Magnetom TrioTim; Siemens, Erlangen, Germany).\nThe analysis period of 400 milliseconds included a prestimulus baseline of 100 milliseconds.\nEpochs with amplitudes exceeding 3000 fT/cm for MEG channel or 150 mV for electrooculogram were excluded from the average.\nUnauthorized reproduction of this article is prohibited.\nThe data of 2 FM subjects were excluded from further analyses for the following reasons: excessive rejections of epochs due to signals contaminated by eye movements and the absence of MEG data with left median nerve stimulation.\nBased on these analysis procedures, the baseline corrected responses of N20m and P35m were obtained (Fig.\nelectrical stimuli were modeled in the time domain as equivalent current dipoles (ECDs).\n11 This source analysis was performed blind to group status.\nThe ECD, which best explains the measured data, was determined at around 35 milliseconds to obtain an S1 source with a high signal-to-noise ratio28 by a leastsquares search using a subset of 24 gradiometers over contralateral parietal areas.\nSource identification for this subject was determined by considering coordinates, peak latencies, and orientations of the modeled sources.\nAfter identifying the single dipole, the entire analysis period and all channels were taken into account in computing the time-varying single-dipole model.\nThe location and orientation of the ECD were fixed.\nTo validate the single-dipole model, measured MEG signals were compared with the responses predicted by the model.\nThe higher ratios are associated with reduced PPS, whereas lower ratios are associated with stronger PPS.\nIndividual MRIs were spatially normalized in the Talairach.\nSource locations of the S1 responses in the head coordinates were transformed into Talairach coordinates using Brain Electrical Source Analysis software (version 5.\nBeck Depression Index score 19.\nOut of the 19 patients involved in the study, 17 whose MEG data were analyzed are described.\nAdditionally, analgesics were used by 71%, antidepressants by 71%, and anticonvulsants by 35% of these patients.\nAll the values are expressed as mean (SD).\nThe clear response deflections were found after single-pulse median nerve stimulation (A).\nThe earliest downward deflection peaking at 20 milliseconds (N20m) and the following deflections of opposite polarity peaking at 27 milliseconds (P35m) were identified after the stimulus onset.\nAfter strong N20m and P35m responses to the first pulse of the paired-pulse stimulation, clear but weaker N20m and P35m responses to the second pulse of the paired-pulse stimulation was observed (B).\nThe N20m and P35m responses to the second pulse of the paired-pulse stimulation were shown, after subtracting the response to a single-pulse from the paired-pulse stimulation (C).\nBlack triangles indicate stimulus onset.\nUnauthorized reproduction of this article is prohibited.\nTwenty HC subjects whose MRI data were available are included in deriving the source location in the Talairach coordinates.\nThe PPS ratios of S1 response were compared using repeatedmeasures analysis of variance (ANOVA) with hemisphere.\nSource locations of the S1 responses were compared in each hemisphere separately by means of repeated-measures ANOVA with coordinate (x, y, and z) as the within-subject factor and group (FM and HC) as the between-subject factor.\nThe Mauchlys test of sphericity was used to evaluate whether the sphericity assumption was violated.\nTherefore, linear regression analysis was performed with the PPS ratio as an independent variable, and the sensory and affective pain scores of the SF-MPQ and pain intensity on a visual analog scale (past week) as a dependent variable.\nSince FM is a disorder with varying clinical characteristics (eg, depressive and anxiety symptoms), we would like to determine if these symptoms were reflected in our findings.\nThus, the potential relationship between depressive or anxiety symptoms of FM patients and the PPS ratio were tested using Pearsons correlation in an exploratory fashion.\nWe performed all statistical analyses using the SPSS 13.\nThe sources of the P35m response were located in the posterior bank of the central sulcus, corresponding to area 3b of S1.\nIn an HC subject, the amplitudes of the second response were markedly suppressed as compared with the first response in both hemispheres (A).\nIn this subject, N20mP35m PPS ratios for the left and right hemisphere were 0.\nIn contrast, in patients with FM, amplitudes of the second response were comparable with the first response in both hemispheres (B).\nIn this subject, N20mP35m PPS ratios for left and right hemispheres were 0.\nIn the FM group, the mean coordinates (in millimeters) were x 5 242.\nIn the HC group, the mean coordinates (mm) were x 5 242.\nAs such, the mean PPS ratio for the N20mP35m in both the left and the right hemispheres were higher in patients with FM than in HC subjects (Table 2).\nRegarding the N20mP35m amplitude, there was no main.\nFigure 4 shows the relationship between the PPS ratio and clinical pain intensity in FM patients.\nAfter correcting for multiple comparisons, a higher PPS ratio for the N20mP35m in the left hemisphere was significantly associated with higher clinical pain ratings in the sensory (r2 5 0.\nIn our exploratory analysis, we did not find any significant correlation between PPS ratios.\nUnauthorized reproduction of this article is prohibited.\nextent of disinhibition can be closely associated with increased clinical pain.\nHowever, the paininduced cortical reorganization and maladaptive neuroplasticity in the S1 has been suggested to be involved in the development and maintenance of chronic pain.\n25,35,44,50 Reorganization of the somatotopic map within S1 was closely related to clinical pain in other chronic pain disorders such as phantom limb pain or complex regional pain syndrome.\n25 showed higher PPS ratio in the hemispheres contralateral to both the affected and unaffected hands in patients with complex regional pain syndrome type I.\nPrevious FM studies have revealed evidence of cortical reorganization of the S1 due to central sensitization associated with persistent pain.\nSeveral electrophysiological and neuroimaging studies assessing brain activity during painful stimulus in patients with FM showed widespread augmented activation in brain regions including the S1.\nThus, cortical reorganization appearing as reduced intracortical inhibition of the S1 may be responsible for chronic pain in patients with FM.\nThis cortical reorganization may explain the diffuse tenderness and widespread pain,49 as well as disturbances in body perception, such as reduction in awareness of limb positions and phantom swelling of the hands commonly reported by patients with FM.\nIt has been suggested that the analgesic effects produced by motor cortex stimulation are related to the restoration of defective intracortical inhibition.\nThe location of the S1 source was superimposed on the brain MRI of a representative HC subject (A) and FM patient (B).\nWhite and black circles indicate the location of the contralateral S1 response after right and left median nerve stimulation, respectively.\nEach left and right source waveform was generated in the contralateral S1 after the right and left median nerve stimulation, respectively.\nThe vertical dotted lines indicate the stimulus onset.\nUnauthorized reproduction of this article is prohibited.\nBased on studies in animals, both presynaptic and postsynaptic GABAergic inhibitions have emerged as important regulators of PPS.\nRecent studies using in vivo magnetic resonance spectroscopy provided direct evidence of dysfunction of GABAergic system in FM.\n6 Patients with FM had lower GABA level within the right anterior insula.\nRed (FM) and blue (HC) circles indicate location of the contralateral primary somatosensory response to left and right median nerve stimulation.\nAll the values are expressed as mean (SD).\nUnauthorized reproduction of this article is prohibited.\nposterior insula was positively correlated with pressure pain threshold, suggesting alterations of inhibitory neurotransmission in FM.\nAdditional assessments of GABA levels in the S1 might further contribute to the interpretation of our results.\n33 reported that FM patients showed an augmented S1 response to subjectively matched painful pressure stimulation on tender points.\nThey reasoned that enhanced responses in somatosensory and prefrontal areas could reflect an increased sensitization or lack of inhibition.\nDifferences found between studies can be attributed to 2 points; first, it might stem from the use of different stimulus sites (tender vs nontender points) and properties (painful vs nonpainful).\nFirst, the interpulse interval of 100 milliseconds has been shown to be sufficiently short to identify a significant PPS in the S1.\nHowever, higher PPS ratios in patients with FM were only found for P35m but not for N20m.\nThird, a recent study in HC subjects demonstrated no significant difference in PPS ratios when comparing different stimulus intensities (250% of the sensory threshold and 100%, 120%, and 140% of the motor threshold).\n14 Moreover, the stimulus intensity for the left and right median nerves was not different between the groups in our study.\nThus, it is unlikely that the stimulus intensity might have affected between-group differences of PPS ratio.\nFinally, although the subjects were instructed not to pay attention to the stimulus, the fixed order of stimuli could act as a possible confounder, in a way which affects anticipation of or attention to the next stimulus.\nHowever, in previous somatosensory evoked field studies, the amplitude of the S1 response was not changed by paying attention to the stimuli.\nThus, we consider it is highly unlikely that the fixed order of stimuli affected the response to singleor paired-pulse stimuli in individual subjects and altered the PPS ratio of the N20mP35m response.\nThese findings should be interpreted with caution.\n41 demonstrated that motor cortex excitability and intracortical modulation in patients with FM was not different between patients with and without taking medications.\nTherefore, medication effects on cortical excitability in our study might be considered minimal as compared with disease effects.\nIn the clinical correlation analyses between PPS ratio and clinical pain, a significant result was only found in the left hemisphere.\nWe have no clear explanation for this finding at this stage.\nWe speculated that this could be due to a hemispheric imbalance of disinhibition.\nThe sensory dimension of clinical pain was measured by the SF-MPQ (A and B).\nThe average pain intensity over the past week was rated on a VAS (C).\nUnauthorized reproduction of this article is prohibited.\nChanges of the PPS ratio (A2s/A1) can be influenced by the amplitude of the second response or by the amplitude of the first response.\nIn this study, however, the amplitudes of N20mP35m and P35m in response to the first pulse of the paired stimuli (A1) and the second pulse of the paired stimuli after subtracting the response to a single pulse (A2s) were not different between FM patients and HC subjects.\nTaken together, our results cannot determine which amplitudes contribute to a reduced PPS ratio in patients with FM.\nhibition in the S1 is compromised bilaterally in patients with FM, and the extent of disinhibition can be closely associated with increased clinical pain.\nOur results suggest that changes of intracortical inhibition of the S1 may contribute to the pathophysiology of FM pain.\nThe authors have no conflicts of interest to declare.\nJerbi K, Litvak V, Maess B, Oostenveld R, Parkkonen L, Taylor JR, van Wassenhove V, Wibral M, Schoffelen JM.\nsomatosensory cortex is determined by GABA-mediated intracortical inhibition.\nCognitive behavioral therapy increases pain-evoked activation of the prefrontal cortex in patients with fibromyalgia.\nPatients with fibromyalgia display less functional connectivity in the brains pain inhibitory network.\nMotor cortex rTMS restores defective intracortical inhibition in chronic neuropathic pain.\nsomatosensory cortex in aged humans is associated with impaired tactile acuity.\nmuscle to sensorimotor cortex contributes to enhanced steady-state isometric contraction in humans.\nGarcia-Blanco S, Poca-Dias V, Harrison BJ, Contreras-Rodriguez O, Monfort J, Garcia-Fructuoso F, Deus J.\nUnauthorized reproduction of this article is prohibited.\nThe motor system shows adaptive changes in complex regional pain syndrome.\nGarcia-Blanco S, Poca-Dias V, Harrison BJ, Contreras-Rodriguez O, Monfort J, Garcia-Fructuoso F, Deus J.\nTugwell P, Campbell SM, Abeles M, Clark P, Fam AG, Farber SJ, Fiechtner JJ, Michael Franklin C, Gatter RA, Hamaty D, Lessard J, Lichtbroun AS, Masi AT, McCain GA, John Reynolds W, Romano TJ, Jon Russell I, Sheon RP.\nUnauthorized reproduction of this article is prohibited."}