{"title": "37.The_Journal_of_Physiology_-_2017_-_Roux_-_Functional_architecture_of_the_somatosensory_homunculus_detected_by.pdf", "contents": "Functional architecture of the somatosensory homunculus detected by electrostimulation.\nacquire accurate MNI coordinates of the functional areas of the somatosensory homunculus.\nr We found some similarities but also substantial differences with the previous, seminal works.\nr We propose a new drawing of the human somatosensory homunculus according to MNI space.\nAbstract In this prospective electrostimulation study, based on 50 operated patients with no sensory deficit and no brain lesion in the postcentral gyrus, we acquired coordinates in the standard MNI space of the functional areas of the somatosensory homunculus.\nThe 3D brain volume of each patient was normalized to that space to obtain the MNI coordinates of the stimulation site locations.\nFor 647 sites stimulated on Brodmann Area 1 (and 1025 in gyri nearby), 258 positive points for somatosensory response (40%) were found in the postcentral gyrus.\nIn the contralateral BA1, the hand representation displayed not only medial-to-lateral and little-finger-to-thumb somatotopy, but also rostral-to-caudal discrete somatotopy, with the tip of each finger located more caudally than the proximal phalanx.\nWe detected a medial-to-lateral, tip-to-base tongue organization but no rostral-to-caudal functional organization.\nPositivestimulations were detected through the on/off outbreak effect and discriminative touch sensations were the sensations reported almost exclusively by all patients during stimulation.\nUnlike the previous, seminal works of Penfield and colleagues, we detected no sensations such as sense of movement or desire to move, no somatosensory responses outside the postcentral gyrus, and no bilateral responses for face/tongue stimulations.\nWe propose a rationalization of the standard drawing of the somatosensory homunculus according to MNI space.\n1978), named Brodmann areas (BA) 3a, 3b, 1, and 2 (Brodmann 1909; Vogt & Vogt, 1919), areas 3a and 3b being located within the central sulcus, area 1 in the crown of the postcentral gyrus, and area 2 more caudally in the postcentral sulcus (White et al.\nAnimal studies have shown that BA 3a receives inputs from muscles and joints, whereas BA 3b and 1 receive from the skin, and BA 2 can combine skin and proprioceptive information (Kandel et al.\nIn primates, there is a cortical magnification of certain body parts (hand, mouth) in the postcentral gyrus (Kaas et al.\nsystematic mapping of the human somatosensory cortex has been performed in a large number of subjects.\nThe presentstudywasbasedon50patientswithnosomatosensory deficit (intact patients).\nParameters of excitability of human primary somatosensory areas in conscious individuals are also discussed.\nPatients less than 18 years old were excluded.\nThe National Consultative Committee of INSERM (Institut National de la Sante et de la Recherche Medicale) gave its approval for the storage of patients data and preservation of their anonymity.\nTo preserve patient privacy, this study was not registered in a publicly accessible database.\nHowever, the study conformed to the standards set by the Declaration of Helsinki.\nAll the patients and their families gave their informed consent for a study of the functional areas by direct brain mapping and each chart was discussed pre-operatively in a surgical staff meeting with different neurosurgeons.\nOnce 50 brain mappings had been included, the study was closed.\nData from successive brain mappings were prospectively collected by the same team using the same protocol throughout the 8 years of the study (June 2008June 2016).\nTwo main conditions of inclusion were defined: patients should have no initial sensory deficit and no brain lesion directly located in the postcentral gyrus.\nPatients were examined regarding their absence of initial sensory deficit using clinical tests (see Table 1 for preoperative testing details).\nBefore the operation, each patient underwent three tests: the tuning fork test; the warm/cold test; and the two-points discriminative test on the cheek, the hand (index finger) and the foot (hallux).\ndiscriminative distance is around 4 mm in the index (both sexes), 7 mm in the cheek (both sexes), and 11 mm for males and 13 mm for females in the hallux, with no differences between the left and right sides.\nOur criteria for exclusion were: patients with a discrimination threshold double the normal and/or any perturbed tuning fork or warm/cold test results on any of the three tested regions.\nElectrostimulation for brain mappings was performed to help with the removal of recently discovered brain lesions.\nWe found 15 WHO grade I and II gliomas, 25 WHO grade III and IV gliomas, 4 arteriovenous malformations or cavernomas, 5 metastases and 1 grade II meningioma.\nThey were located in 29 right and 21 left hemispheres.\nThe mean age of patients was 49.\nNineteen of the patients were women.\nThirty-seven patients had been recently treated with antiepileptic drugs, always less than 3 months before the operation.\nNone of them had chronic intractable epilepsy.\nTwo-point threshold discriminative test: None of the patients of our study had a discriminative deficit in the tested zones and none failed the tuning fork or warm/cold tests in any of the 3 different regions tested.\nOur awake brain mapping protocol was based on 20 years experience (Roux et al.\nAnaesthetic drugs can, in theory, interfere with stimulation thresholds.\nOur objective during brain mapping was to avoid any anaesthetic drugs.\n5 mg g1) (EMLA) was applied in the supraorbital and auriculotemporal regions.\nLidocaine (1%) with adrenaline (epinephrine; 1:100,000) was infiltrated to block the supraorbital, auriculotemporal, and occipital nerves.\nAdditionally, the Mayfield head holder (Ohio Medical, Cincinnati, OH, USA) pin site and the surgical skin incision line were infiltrated.\nThe depth of procedural sedation was adjusted to keep the patients vital signs stable.\nPropofol infusion was stopped during the dural opening (around 10 min before brain mapping) and the patient was fully awakened.\nOnce the cortical mapping procedure was completed, patients were put back to sleep using the same protocol for the rest of the operation.\nA neuronavigational system was used to guide tumour removal.\nAnatomical structures (gyri and sulci) were identified according to this neuronavigational data and the visual identification of the shape of gyri and sulci.\nThe cortex was directly stimulated before any surgical approach using the bipolar electrode of the Nimbus cortical stimulator (1 mm electrodes; Innopsys, Toulouse, France) with biphasic square wave pulses of 1 ms duration and 50 Hz trains.\nThe maximum train duration of each stimulation was 5 s.\nThe afterdischarge threshold was determined by electrocorticography using a strip electrode.\nAlthough this point remains controversial, the afterdischarge threshold seemed to change little from site to site during one short mapping session (Ojemann, 1993).\nThe level of electrostimulation was always kept 1 mA below that expected to cause electrical diffusion and afterdischarges so as to ensure that the stimulated area remained accurately localized on the area of cortex under study.\nIf any afterdischarge (or epilepsy) was detected, the protocol was adapted to the afterdischarge threshold found.\npatients acknowledged feeling something.\nPatients were encouraged to report their sensations during stimulation.\nThepatientslevelofalertnessintheabsenceofstimulation was regularly evaluated throughout the testing, as further assurance that changes during stimulation were not random events.\nNon-reproducible interferences (positive responses to electrostimulation) were not included in this study.\nIf allowed by electrocorticography results, the intensity of stimulation was raised to as high as 10 mA if necessary to obtain a response.\nIf patients felt any unpleasant sensation or pain at any time, or any sensation that could evoke seizures, the stimulation was stopped and the intensity reduced.\ntrained by clinical requirements, the possibility of delivering stimulations was limited.\nWe tested only what was really useful for the treatment of the patients.\nStimulation around and between detected positive areas may not have been tested because such testing was not clinically relevant for the patient.\nThis legitimate constraint limited the ability to find complete somatotopies of the part of the body tested in individual patients.\nThese divisions are similar to those used for primate studies (Mountcastle, 2005).\nBecause of their localizations deep in the sulci, BA3a, BA3b, and BA2 were not accessible to electrostimulation.\nThus, the current functional exploration focused on BA1.\nWhen a functional site was found, it was marked by a sterile ticket of 0.\nIt was decided that the minimal spatial resolution of our electrostimulation technique corresponded to the size of the bipolar electrode separated by 3 mm.\nOnce a positive functional area was detected, the cortical areas located 3 mm from it were also tested.\nLeft and right hemispheric regions stimulated.\nWe obtained normalized coordinates of stimulation site locations that were per-operatively visualized and positioned on original 3D images provided by the neuronavigation software (Brain Lab).\nFor each positive site, MNI space coordinates (X, Y, Z) were obtained and stored year by year in an Excel database, with a detailed account of the type of response obtained.\nOver 647 sites stimulated in BA1, we found 258 positive areas (40%).\nThe mean general positive intensity threshold was 2.\nTingling (discriminative touch domain) was the main and almost exclusive sensation reported by all patients.\nPain was felt only once by one patient; another also had a bad taste in the mouth and another reported burning in the hand during some stimulations.\nNo other sensations (from the proprioception domain for instance) were detected.\nStrictly no other isolated, positive somatosensory sensation was found among the 1025 stimulations performed outside the postcentral gyrus.\nAs expected, the ventral parts of the fingers were somatotopically organized from the medial-to-lateral aspects of postcentral gyrus and were symmetrically similar in the right and left hemispheres (Fig.\nFinger responses were found in 34 patients and the medial-to-lateral somatotopy was respected with no aberrant localization.\nNevertheless, some rare individual variations were noted: two stimulations in two different patients elicited tingling not in individual fingers but in all fingers.\nThey were located in the main postcentral somatotopic representation of the digits.\nOnly one patient reported sensations in the dorsal part of her fingers when one cortical area was stimulated.\nMore areas were found for the thumb (41 areas) and 2nd finger (31 areas), than for the 3rd finger (25 areas), the 4th finger (19 areas) and the little finger (21 areas).\nAll MNI coordinates of finger positive points are available in Table 3A.\nWe found a certain dispersion of the points between the right and left hemispheres.\nDispersions were computed by calculating the Euclidean distance (in mm) between each stimulation point and the barycentre of the corresponding finger.\nThis was probably due to the template we used, which was not strictly symmetric.\nIn addition to this medial-to-lateral sequence, 10 patients felt either the tip or the base of at least one finger during electrostimulation.\nFurthermore, four patients displayed both tip and base finger phalange representation, all of them with a caudal discrete representation of the finger tip.\nFourteen patients displayed a medial-to-lateral hemispheric tongue somatotopy with the tip of the tongue located more medially than the middle of the tongue or its base (Fig.\nPatients felt tingling exclusively on the contralateral space of the tongue.\nOverall, the medial-to-lateral space devoted to the tongue in BA1 was quite large, around 2.\nAlthough a rostral-to-caudal somatotopy (for instance different cortical representation for the lateral and the central parts of the tongue) may exist for the human tongue, no such organization was detected.\nAll MNI coordinates of tongue positive points are available in Table 3B.\nFigure 4 shows the somatotopic sequence of the human body with MNI coordinates.\nVarious contralateral representations of the skin from the feet, knee, abdomen, thorax, eyebrows, gums or jaws were detected in BA1, among other sensations.\nAll MNI coordinates of body positive points are available in Table 3C.\nSince the seminal works of Penfield and collaborators (Penfield & Rasmussen, 1950; Penfield & Jasper, 1954), no other work has studied the human somatosensory cortex with so many subjects, whatever the mapping technique.\nThe analysis of MNI coordinates demonstrated that BA1 of the somatosensory cortex in humans was organized somatotopically from the medial to lateral and anterior to posterior parts of the postcentral gyrus.\nThe contralateral cutaneous areas of the body are represented in small patches of cortex and, although almost all cutaneous parts of the contralateral body were found at least once in this series, two main zones were detected: the hand and the face/tongue.\nOther body zones were found much more rarely.\nThe hand and the face/mouth areas occupied parts of the cortex that were proportionally much larger than their cutaneous surface area, because of their much more marked discriminative properties and small receptive fields.\nThe relatively high number of positive responses found for hand and face/tongue is an indirect sign that the human brain multiplies the cortical representations of small receptive fields to increase its discriminative abilities for these two body regions.\nWe observed that the displacement of the bipolar electrode on the cortex located adjacent to a positive area often induced another interference.\nOverall, the medial-to-lateral space (X MNI coordinates) devoted to the fingers in BA1 was around 1.\nIndividual analysis showed the rostral-to-caudal somatosensory cortical representation of the ventral part of the skin of the fingers.\nThis rostral-to caudal somatotopy was detected at least once in all 5 fingers.\nE, group analysis confirmed this somatotopic representation with average X, Y, Z MNI coordinates for the group of fingertip points located more posteriorly (X = 41.\nThis study showed that the finger topography is organized with the tip of the fingers located more posteriorly than their base, in both group and single subject analysis.\nIt is also in line with previous.\nThis figure is composed of isolated points found punctually in some patients and of multiple points found in four individual patients (marked 1, 2, 3 and 4 in square boxes).\nAlthough a certain degree of variation may exist within this part of the postcentral gyri in the exact location of the tip, middle, and base of the tongue somatosensory cortical localizations, individual somatotopy respects the tip/medialbase/lateral tongue somatotopy.\nThe coordinate of the caudal discrete representations of fingertips in area 1 found in group analysis (X = 47; Y = 31; Z = 53) by Blankenburg et al.\nThe human cortical representation of the tongue occupies a territory at least as large as that of thehandbetween,medially,thelipsand,morelaterally,the pharynx, but its organization is radically different for the tongue, with the tip of the tongue localized more medially than its base.\nIn those patients with intact postcentral gyrus, somatosensory responses were obtained with mean thresholds around 2.\nWe found that the age of the patients and the presence of antiepileptic drugs had no effect on these thresholds.\nNevertheless, other factors that we did not test could also intervene.\nThese possibilities need to be investigated by a subsequent study.\nMany patches of cortex were observed to be unresponsive to stimulation.\nIn our opinion, the reason may have been that the neurons under the electrostimulation probe did not respond in a way visible to us during the operation.\nobtained depended only on the ability of the patient to be conscious of his/her sensation and to report it.\nNothing is known about the possible diffusion of this stimulation in deep brain structures.\nClinical information (and further scientific data) could thus have been missed.\nAlthough our study matches many findings by Penfield and co-workers, four main differences can be noted.\nThe medial-to-lateral somatotopic sequence of the eyebrows, eyes, cheeks, both lips, teeth, gums, jaws, pharynx, and larynx is shown.\nThey also described a small second sensory area in the superficial bank of the Sylvian fissure of the precentral gyrus (Penfield & Roberts, 1959).\nWe detected no somatosensory responses outside the postcentral gyrus.\nOne hypothesis is that paradoxical responses may not have been uncommon in the epileptic patients treated by Penfield, particularly in those with organic lesions and chronic epilepsy (Urasaki et al.\nSome of Penfields patients had huge brain lesions around the central gyri and thus possible cerebral reorganizations.\nThe findings of somatosensory responses outside the postcentral gyri may not have been uncommon.\nThirdly, Penfields team also described some sensations.\nPenfield & Rasmussen (1950) did not identify in the cortex because of its small size.\nSeldom studied, the somatotopic representation of the dorsal surface of the digits could be comparable to that of the ventral surface in human area 3b (Druschky et al.\nDuring their career, Penfield and colleagues used different types of stimulators, the frequency of which was not always controlled (Penfield and Roberts, 1959).\nIt is possible that the accuracy of the stimulator we used, in terms of localization (with 3 mm wide electrodes) and stability of the electric frequency, allowed us to detect such rare sensations.\nEvidence for a rostral-to-caudal somatotopic organization in human primary somatosensory cortex with mirror-reversal in areas 3b and 1.\nI: Morphology and cytoarchitecture of the central sulcus.\nThe authors declare that they have no competing interests.\nThis work was supported by the CNRS (Centre National pour la Recherche Scientifique).\nExperiments were performed at The University of Toulouse III.\ncarried out the experiments.\nanalysed and interpreted the data.\nAll authors revised the article critically for important intellectual content.\nAllauthorshaveapprovedthefinalversionofthemanuscriptand agree to be accountable for all aspects of the work.\nAll persons designated as authors qualify for authorship, and all those who qualify for authorship are listed."}