{"title": "40.FA.1-s2.0-S1529943020300462-main.pdf", "contents": "Clinical Study Catastrophization, fear of movement, anxiety, and depression are associated with persistent, severe low back pain and disability.\nPATIENT SAMPLE: Participants were selected from the SpineData registry (Denmark), which enrolls individuals with LBP of 2 to 12 months duration without radiculopathy and without satisfactory response to primary intervention.\nOUTCOME MEASURES: Psychological characteristics, including catastrophization, depression, fear of movement, and anxiety, were examined at baseline using a validated screening questionnaire.\nCurrent, typical, and worst pain in the past 2 weeks were assessed by 11-point numeric rating scales and an average pain score was calculated.\nStatistical analysis involved multivariable Poisson regression to investigate the association between psychological factors and the number of episodes of severe pain or disability.\nThis study received no direct funding.\nMultivariable Poisson regression showed a relationship between catastrophization, depression, fear of movement, and anxiety and a greater number of time points with severe LBP and disability, after adjusting for age, gender, body mass index, and duration of symptoms.\nHowever, when all psychological factors were added to the regression model, only catastrophization and depression remained significantly associated.\nFDA device/drug status: Not applicable.\nCONCLUSIONS: This study showed that persistent, severe LBP, and disability is common in a secondary care population with LBP and is associated with a variety of psychological risk factors, in particular catastrophization and depression, highlighting the importance of considering these factors in the design and evaluation of outcomes studies for LBP.\nLow back pain (LBP) is the most common cause of disability globally [1] and is associated with a huge socioeconomic burden [2].\nTo develop effective treatment and prevention strategies, modifiable risk factors for persistent, severe LBP, and disability need to be identified.\nSystematic reviews have found catastrophizing and depression to be associated with worse outcomes from LBP and disability [811]; however, there is limited evidence to support a relationship between both anxiety and fear of movement and LBP [1214].\nThis study aimed to determine whether the psychological factors of catastrophization, depression, fear of movement, and anxiety are associated with persistent, severe LBP, and disability.\nWe hypothesized that all of the psychological characteristics would show an association with persistent, severe LBP, but that some factors may play a greater role.\nWe conducted a nested cohort study within the Danish SpineData registry.\nOf the 35,466 patients presenting to the center from January 2011 to July 2014, only 3,552 (10%) declined to be involved, resulting in 31,914 (90%) recruited to the registry.\nThe Spine Center is a tertiary care facility and to be eligible for referral patients must have nonspecific LBP of 2 to 12 months duration and not report radiculopathy or satisfactory response to primary interventions.\nSerious pathology such as fracture, cancer, or infection is ruled out before presentation at the Spine Center.\nPatients at the Spine Center receive a variety of treatments, including both surgical management and conservative interventions, such as massage, physiotherapy, and chiropractic treatment, with many patients receiving more than one treatment.\nThe current study included patients that presented between September 2013 and October 2014, completed the SpineData questionnaire at baseline and 1-year follow-up, and had a lumbar spine magnetic resonance image taken within 30 days of presentation.\nAccording to Danish law, the study did not require ethical approval from the Region of Southern Denmark Human Research Ethics Committee (HREC) (letter of exemption is available in Danish from the authors on request) and was exempt from ethical review by the Monash University HREC (Project number: CF15/3054 -2015001289).\nData on age, gender, height (cm), and weight (kg) were collected at baseline.\nBody mass index (BMI, kg/m2) was calculated from height and weight measurements.\nThe onset of low back symptoms was reported by patients at baseline, and the date of the initial presentation to the Spine Center was also recorded.\nSymptom duration before presentation was calculated as the time from symptom onset to initial consultation.\nParticipants were asked whether they had a previous history of spinal surgery for LBP, as well as several questions regarding their employment, including how they would rate their level of work satisfaction on a scale from 0 to 10 (with higher scores indicating greater work satisfaction).\nParticipants were required to score above the cut-off values on both depression questions to have depression [16].\nLBP intensity and disability were assessed at baseline and 1-year follow-up.\nAverage pain was dichotomized for each time point (ie, baseline and 1year follow-up), with a score of 7/10 being considered severe [18], and participants were grouped according to whether they had severe pain at neither, one or both time points.\nThose participants with pain at two time points were considered to have persistent LBP.\nDisability from LBP was assessed by the 23-item Danish language Roland-Morris Disability Questionnaire [19].\nParticipant characteristics were reported based on the number of time points at which participants reported.\nTo determine whether continuous variables were normally distributed, we visually inspected histograms of these data.\nDemographic, psychological, pain and disability data were compared between those who did and did not return for follow-up.\nUnivariate and multivariable Poisson regression models were used to determine whether psychological variables were associated with the number of time points at which severe LBP and disability were reported.\nTwo multivariable models were used, with the first adjusting for age, gender, BMI and symptom duration, and the second adjusting for age, gender, BMI, symptom duration and all other psychological variables.\nThe distribution of symptom duration was skewed, so this variable was log transformed before use in the multivariable analyses.\nThe same models were run using negative binomial regression to check for over dispersion, but the results were identical so Poisson regression was deemed appropriate.\nFear of movement 2 I should not do physical activities which (might) make my pain worse.\nWhere psychological domains were formed from two items, the scores were averaged.\nmultivariable analyses were conducted using the multivariable model 1 described in the primary analysis.\nThe cohort had a mean (SD) age and BMI of 44.\nBoth univariate and multivariable analyses, with adjustment for age, gender, and BMI, symptom duration, showed that catastrophization, fear of movement, anxiety, and depression were positively associated with the number of time points with severe LBP (Table 3).\nCurrent, typical, and worst pain in the past 2 weeks were scored on the visual analogue scale (VAS).\nAverage pain was calculated, with severe pain defined as an average score of 7/10 [18].\nThe participant characteristics of those with and without a history of spinal surgery for LBP, depression, and work dissatisfaction are presented in Supplementary Tables 1 to 3.\nWe found a similar result when we investigated individuals that reported depression.\nThese findings suggest that future studies should examine the role of anxiety either as a risk factor or outcome for severe pain in individuals with a history of surgery or depression.\nThere was an association between all psychological characteristics and the number of time points with severe disability in both univariate and multivariable analysis, after adjusting for age, gender, BMI, and symptom duration.\nIn the second multivariable analysis, which adjusted for all psychological factors as well as age, gender, BMI, and symptom duration, the association between both catastrophization and depression, and severe disability from LBP remained significant (catastrophization RR 1.\nWhen examining individuals who had a history of spinal surgery for LBP, multivariable analyses showed that the association between psychological factors and severe disability is similar to those without a history of spinal surgery.\nDisability was assessed on the 23-item Danish language RMDQ.\nThis 1-year, prospective cohort study found that catastrophization, fear of movement, depression, and anxiety were associated with persistent, severe LBP, and disability, after adjusting for age, gender, BMI, and symptom duration.\nFurthermore, after adjusting for all of the psychological factors, only catastrophization and depression remained significantly associated with reporting persistent, severe LBP, and disability.\nThese findings suggest that a variety of psychological characteristics are risk factors for severe LBP and disability, but that catastrophization and depression are particularly important in high levels of persistent, severe pain, and disability, highlighting the need to consider these factors when examining outcome studies for LBP.\nThese data highlight that not only are high levels of pain and disability common in a secondary care population with LBP of at least 2 months duration, but that persistence of severe pain and disability is also a major problem.\nThe significant proportion of psychological comorbidities identified in this cohort highlights the need to consider a biopsychosocial approach to management of severe, persistent LBP in these individuals.\nA range of different psychological factors, including catastrophization, fear of movement, anxiety, and depression, were found to be important risk factors for persistent, severe LBP, and disability.\nHowever, only catastrophization and depression were found to be independently associated with both severe LBP and disability.\nAlthough these findings are consistent with systematic reviews which have found both catastrophizing [11] and depression to be associated with LBP [810], the reviews did not specifically examine the severity of the pain, or the relationship of these factors with disability.\nThe current study was longitudinal, used validated screening questions and cut-off values for all psychological factors, and investigated both severe pain and disability.\nThe study findings show an association between psychological factors and the primary outcomes of LBP and disability and highlight the importance of considering these factors when designing and evaluating outcomes studies.\nThe current study did not find clear evidence for an association between fear of movement or anxiety and the number of time points with severe LBP and disability, when adjustment was included for other psychological variables.\nThere is growing evidence to indicate that interventions, such as behavioral treatment, targeted at psychological factors are effective in the management of chronic LBP.\nWe found catastrophization and depression to be independently associated with persistent, severe LBP, and disability in individuals with LBP in secondary care.\nThese findings highlight the exciting potential for future studies to examine psychological outcomes throughout the treatment course to determine if early treatment of pain prevents the development of psychological problems, and conversely, if early treatment of psychological factors assists in resolving back pain in certain patient phenotypes.\nHowever, when baseline demographic characteristics were compared between those with and without outcome data at follow-up, there was no significant difference in patient characteristics, such as BMI, pain levels, history of spinal surgery for LBP, and psychological characteristics.\nA key strength of this study was its design: a large, prospective, cohort study with a 1-year follow-up of individuals with LBP.\nIn addition, we adjusted regression models for all psychological factors to determine the independent relationship of individual psychological factors with the number of episodes of severe LBP and disability.\nThis study showed that persistent, severe LBP, and disability are common in a secondary care population with LBP and are associated with a variety of psychological risk factors, in particular catastrophization and depression, highlighting the importance of considering these factors when designing and evaluating outcome studies for LBP."}