{"title": "41.s10865-006-9085-0.pdf", "contents": "The fear-avoidance model is a cognitive-behavioral account that explains why a minority of acute low back pain sufferers develop a chronic pain problem.\nThis paper reviews the current state of scientific evidence for the individual components of the model: pain severity, pain catastrophizing, attention to pain, escape/avoidance behavior, disability, disuse, and vulnerabilities.\nFurthermore, support for the contribution of pain-related fear in the inception of low back pain, the development of chronic low back pain from an acute episode, and the maintenance of enduring pain, will be highlighted.\nFinally, available evidence on recent clinical applications is provided, and unresolved issues that need further exploration are discussed.\nDespite the fact that almost anyone may experience an acute low back pain (LBP) episode at least once during his/her life, only a small minority develop a chronic low back pain (CLBP) problem (Waddell, 2004b).\nA traditional biomedical model that focuses upon structural and biomechanical abnormalities cannot sufficiently explain chronic pain and its associated disability.\nOne psychological factor that has received much attention in the case of (chronic) pain is fear.\nBefore describing the role of fear in the domain of pain, let us first briefly examine fear and anxiety in general as an introduction.\nThree recent findings in fear research are notable.\nEven though the components of anxiety are similar to those of fear, they are less intense.\nFurthermore, whereas fear motivates the individual to engage in defensive behaviors, anxiety is associated with preventative behaviors, including avoidance.\nBoth avoidance behavior and hypervigilance reduce anxiety in the short term, but may be counterproductive in the long run.\nClinically, the distinction between fear and anxiety is less evident, and these terms are frequently used interchangeably.\nBuilding upon the knowledge derived from the general fear and anxiety research, the contribution of fear and anxiety in the area of (chronic) pain has been increasingly acknowledged.\nPain-related fear and anxiety can best be defined as the fear that emerges when stimuli that are related to pain are perceived as a main threat.\nFear of pain, fear of work-related activities, fear of movement, and fear of (re)injury have been described as often occurring in patients suffering pain.\n(1995) and Vlaeyen and Linton (2000) proposed a cognitive behavioral model of CLBP that has become known as the fear-avoidance model.\nThis particular model provides an explanation of why CLBP problems and associated disability develop in a minority of those experiencing acute LBP.\nWhen acute pain is perceived as non-threatening, patients are likely to maintain engagement in daily activities, through which functional recovery is promoted.\nIn contrast, a vicious circle may be initiated when the pain is catastrophically (mis)interpreted.\nThese dysfunctional interpretations give rise to pain-related fear, and associated safety seeking behaviors such as avoidance/escape and hypervigilance, that can be adaptive in the acute pain stage, but paradoxically worsen the problem in the case of long-lasting pain.\nThe long-term consequences, such as disability and disuse, in turn may lower the threshold at which subsequent pain will be experienced.\nThe terms fear and anxiety are often used interchangeably with regard to pain.\n(2004) tried to differentiate between fear and anxiety and presented an updated fear-anxietyavoidance model.\nIn this updated model, there is no longer a direct link between fear and avoidance behavior, because by definition one cannot avoid a threat that is already present.\n1, both the fear and anxiety pathways are graphically presented.\nSince it is not yet evident that this updated model added value to the original one, and because of the remaining debate about clinical distinctiveness of fear and anxiety, we will use the term pain-related fear in the remainder of this review.\nBelow, the current scientific evidence for the separate elements of the fear-avoidance model will be discussed.\nThe component pain-related fear and its contribution in various stages of LBP will be separately addressed in section 3, because of its central position in the fearavoidance model and the large body of research dedicated to it.\nUntil recently, the research literature on the fear-avoidance model did not ascribe a role of importance to pain intensity.\nIn their review, Vlaeyen and Linton (2000) concluded that pain intensity is not a primary factor in avoidance behavior or disability.\nIt is possible that this may be the case in a subgroup of chronic pain patients, but it has become clear that high pain intensity is in itself a threatening experience that drives escape and avoidance (Eccleston and Crombez, 1999).\nIndeed, numerous recent studies have shown that pain intensity has a considerable contribution in explaining disability.\nFor example, pain was strongly related to functional.\nFrom these current studies, it can be concluded that the association between pain and disability both during the acute and chronic stages of pain may be more important than previously suggested.\nThe term catastrophizing was first coined by Ellis (1962) for the process in which anxious patients dwell on the most extreme negative consequences conceivable.\nPain catastrophizing can best be conceived as the cognitive element of the fear network, besides physiological reactivity and behavioral responses, and refers to the process during which pain is interpreted as being extremely threatening (Crombez et al.\nPain catastrophizing has consistently been associated with pain disability in pain patients (Peters et al.\n(2002) provided prospective support that initial levels of pain catastrophizing were related to subsequent activity intolerance.\nHowever, all these studies are correlational, allowing no causal inferences.\nIn this context, a study by Arntz and Claassens (2004) is notable.\nThis study experimentally manipulated the meaning assigned to a painful stimulus and examined its influence on the pain experience.\nHealthy volunteers, who were led to believe that a cold metal bar to the neck was hot, rated it as more painful and ascribed more damaging properties to it than other healthy volunteers, who were led to believe that the same bar was cold.\nThe damaging interpretation mediated the relationship between the experimental manipulation and the pain experienced.\nThere is also some evidence that pain catastrophizing may be considered as a precursor of painrelated fear.\n(2004b) found that initial levels of pain catastrophizing were related to subsequent increases in fear during internal atrial cardioversion.\nFor example, studies that found decreased cognitive task performance in fearful LBP patients interpreted this to be the result of painrelated fear directing attention to pain (Crombez et al.\nFurthermore, diminished attentional bias due to treatment appeared to be mainly explained by reductions in pain-related fear, suggesting that pain vigilance results from pain-related fear (Dehghani et al.\nAlthough it might be suggested that excessive attention to pain mediates the relationship between pain-related fear and increased pain intensities, there is only little evidence supporting this idea (Crombez et al.\nInstead, pain-related fear and pain vigilance seem to contribute independently to the experience of pain (Arntz and Claassens, 2004; Roelofs et al.\nEvidence converges upon the idea that attentional disruption by pain-related information is not the result of an initial shift of attention to the pain stimuli, but rather stems from difficulties in disengaging attention from these stimuli (Asmundson et al.\nIn sum, there is evidence that attention may be an important feature in pain perception as predicted by the model.\nAvoidance refers to behavior aimed at postponing or preventing an aversive situation from occurring (Kanfer and Philips, 1970).\nAlthough in case of chronic pain it is not possible to avoid the pain, it is possible to avoid the perceived threat, in this case the activities that are assumed to increase pain or (re)injury.\nAvoidance behavior might thus be reflected in submaximal performance of activities.\nVlaeyen and Linton (2000) presented an impressive overview of studies demonstrating that fearful CLBP patients performed less well on behavioral performance tasks, pointing to possible withdrawal, and thus avoidance, from these tasks.\nA number of more recent studies also support this assumption.\nDisability refers to problems in executing daily life tasks and activities, in the home as well as the work situation.\nDisability may be a logical consequence of prolonged avoidance behavior and hypervigilance.\nIt seems clear that avoidance behaviors as defined above have an impact on daily life tasks.\nAlso hypervigilance may contribute to disability.\nThe selective attention to pain-related stimuli, and the associated difficulty with disengaging from these stimuli, might occur at the cost of vigilance to the usual tasks of daily life.\nIndeed, a large body of research found that CLBP patients with heightened levels of pain-related fear report increased disability (Boersma and Linton, 2005a; Denison et al.\nIn addition to the development of functional disability, frequent and enduring avoidance of daily activities may also result in gradual deterioration of a persons muscular system and fitness.\nThus far, lower or equal daily life activity levels were found when comparing CLBP patients with healthy controls, although the number of studies is rather small (Nielens and Plaghki, 2001; Spenkelink et al.\nTwo other aspects of disuse seem relevant: physical deconditioning, which can either be expressed in weakened muscle strength or reduced aerobic fitness, and disordered muscle coordination during physical activity (so-called guarded movements).\nTherefore, aerobic fitness level seems to be a more suitable measure of physical deconditioning.\nGenerally, the physical fitness of CLBP patients is found to be either lower or equal to that of healthy subjects (Verbunt et al.\nOnly one current study succeeded in demonstrating that CLBP patients have lower aerobic fitness than matched healthy counterparts, though this could not be explained by pain-related fear or other relevant variables (Smeets et al.\nAnother aspect related to disuse is disturbed trunk muscle coordination that CLBP patients can present during physical activity.\nOne study demonstrated that experimentally induced fear of pain had only subtle effects on the erector spinae during walking, while leaving the global pattern of trunk kinematics unaffected (Lamoth et al.\nMore evidence was found by Geisser et al.\nThese changes in musculoskeletal functioning and flexion may be important for the understanding of how pain may interfere with daily life functioning.\nIn sum, neither lower physical activity levels nor the physical consequences of long-term avoidance behavior in CLBP patients were unambiguously confirmed.\nIt may be that these patients avoid certain activities, that is those that are assumed to increase pain or (re)injury, but in general maintain their physical activity levels comparable to healthy people who may be, in general, inactive themselves (Verbunt et al.\nTo elucidate the actual contribution of disuse in CLBP, in the future it may be important to study the consequences of LBP within an affected person instead of between groups (Verbunt et al.\nAn intriguing question concerns the etiology of pain catastrophizing and pain-related fear.\nAre there certain vulnerabilities that predispose individuals to overly attach negative appraisals to pain? If so, does this incline one to misinterpret ambiguous, but harmless, physical sensations as painful or threatening, thereby predisposing an individual to develop pain complaints (Arntz and Claassens, 2004; Pincus and Morley, 2001)? Asmundson et al.\nIndeed, there is evidence that pain-related fear is related to anxiety sensitivity (Asmundson et al.\nAlong the same lines, the more general construct of negative affectivity (or neuroticism) has also been shown to lower the threshold at which pain is perceived as threatening (Gheldof et al.\nBecause negative affectivity, anxiety sensitivity, and fear of pain seem to share some potential overlap, and at the same time differ in terms of generality, Keogh and Asmundson (2004) proposed to follow the idea put forward by Lilienfeld et al.\nAlthough it is not quite clear which specific trait is important for the development and course of LBP, it may be suggested that certain relatively stable vulnerability traits are important and should not be overlooked.\nAlthough speculative, it may be that individuals with an increased vulnerability to catastrophizing and pain-related fear are less changeable in their fear avoidance beliefs than those without these vulnerabilities.\nFor clinical practice, it would therefore be important to identify these stable personality traits, since their presence may require a different, and more thorough approach, than when addressing fear avoidance beliefs in patients without these vulnerabilities.\nTo date, only two studies examined the interrelationships of various elements of the fear-avoidance model simultaneously using structural equation modeling.\n(2004b) showed that pain catastrophizing and pain-related fear mediated the relationship between neuroticism and pain vigilance, and that pain vigilance was associated with heightened pain severity.\nMoreover, neuroticism was found to moderate the relationship between pain severity and pain catastrophizing.\n(2006) demonstrated that pain catastrophizing was related to pain-related fear, depression and disability, that pain-related fear was related to depression and disability, and that both depression and disability were related to pain severity.\nAlthough not allowing for causal inferences, which actually constitute the basic premises of the model, these studies do support the associations between various elements of the fear-avoidance model.\nAlthough the fear-avoidance model was originally developed to explain the transition from acute to chronic pain, most of the research has been carried out with chronic pain patients, underscoring the evidence for pain-related fear as the mechanism behind the maintenance of chronic pain and pain disability.\nOne of the key mechanisms in the maintenance of anxiety disorders is the prolonged use of safety behaviors including escape from, and avoidance of, threatening situations, and the selective attention towards the possible sources of threat.\nAs reviewed above, accumulating evidence seems to underscore the contribution of escape/avoidance behavior and hypervigilance in the area of chronic pain.\nNot only may these disrupted attentional processes be associated with increased disability because of leaving less attention available for other tasks and activities, but also by leading to intensified pain (Arntz et al.\nWhen CLBP patients have detected a threatening situation, in this case a potential dangerous activity, they will either escape from the activity by not performing it at all, or avoid the activity by submaximal performance or the use of safety behaviors (Al-Obaidi et al.\nThis behavior fuels the painrelated fear of these patients even further, first because it prevents them from discovering that these activities are harmless, and second because it promotes disability and disuse.\nDue to differences in stringency in evaluating studies for their reviews, Linton (2000) concluded that fear avoidance beliefs were associated with both the inception and continuation of LBP, whereas Pincus et al.\n(2002) concluded that there was too little support for this conclusion and that instead distress and depressive mood affected the transition to chronicity.\nMore recently, several studies have investigated pain-related fear during the acute pain phase.\nDue to its associations with escape/avoidance behavior already during the acute pain phase, painrelated fear might contribute to the development of a chronic pain problem.\nSeveral prospective studies indeed go further in demonstrating that fear avoidance beliefs can influence the transition to CLBP and associated outcomes, such as disability and sick leave.\n(2002) showed that both heightened pain-related fear and pain catastrophizing during the acute phase increased the risk of future CLBP and disability.\nHeightened initial levels of pain-related fear were also found to be related to decreased probability of returning to work and greater probability of being on sick leave (Boersma and Linton, 2005b; Fritz et al.\nThe fear-avoidance model proposes that fear avoidance beliefs may come into play when an acute pain problem emerges.\nIt therefore seems sensible to assume that fear avoidance beliefs also exist in painfree people.\nRecent studies indeed demonstrated fear avoidance beliefs to be present in pain-free people.\nDuring pain, these misconceptions may trigger pain-related fear.\nThese fear avoidance beliefs may act as a vulnerability factor for the inception of a new LBP episode in pain-free people.\nThere is indeed some evidence that fear avoidance beliefs may heighten the probability of subsequently developing a new pain episode.\nAdditionally, in workers who were currently pain free, a higher risk for future LBP onset was found for those who catastrophized about pain (Linton, 2005), and for those with heightened pain-related fear (Van Nieuwenhuyse et al.\nSince these studies included participants who were pain-free during the past year, it is important to recognize that the included participants were not pain-free in the sense that they had never experienced LBP before.\nDue to its high prevalence (Waddell, 2004b), it is very likely that these people had suffered from previous LBP episodes, which also might have influenced the initiation of a new episode.\nFrom this knowledge we may deduce that pain-related fear could be an important target for intervention.\nThis, however, raises the question of how pain-related fear might best be tackled within treatment.\nMead and Bower, 2000), but pain-related fear could hamper the formation of this alliance.\nAlthough rather speculative, fearful CLBP patients may be more inclined to keep searching for biomedical explanations and solutions for their pain problem, may have a history with dissatisfactory health care encounters, may strive for pain relief instead of restoration of activities, and they may more frequently have co-morbid disorders (Hadjistavropoulos and Kowalyk, 2004; Kerns et al.\nMore research is required to investigate whether pain-related fear actually impedes the patient-therapist relationship.\nPatients pain-related fear may be fed by the interaction with health care providers.\nAdditionally, health care providers may also hold fear avoidance beliefs themselves, although fortunately the beliefs of health care providers generally appear to be in accordance with current guidelines (Koes et al.\nHowever, fear avoidance beliefs were found to some degree in health care providers.\nFor example, many would advise patients to avoid painful movements, some believed that sick leave is an adequate treatment, and some worried when their patients were in pain during exercise (Linton et al.\nMost interestingly, these beliefs were related to treatment recommendations.\nIn addition to the detrimental consequences of inadequate advice, these fear avoidance beliefs of health care providers can induce or strengthen those of their patients, especially in fearful CLBP patients who are likely to be sensitive even to minor hesitations or inconsistencies.\nIt is not clear whether fearful CLBP patients can benefit optimally from traditional health care.\nFearful CLBP patients may sustain their avoidance behaviors regardless of the treatment message, when the disadvantageous consequences of avoidance behavior are neither explicitly addressed, nor managed.\nIn traditional health care, and especially in health care providers with a more biomedical orientation, the message that activity is beneficial is often accompanied by a note of caution especially if the pain increases.\nIt is not surprising then, that fearful CLBP patients may respond with more safety and avoidance behaviors to these treatments than those who are less fearful, thereby gaining less benefit from regular treatments.\nOn the contrary, it has been shown that especially for high fear avoiders a regular exercise program was more effective than usual general practitioner care (Klaber Moffett et al.\nSome recently reported cognitive behavioral treatments have included methods to address painrelated fear.\nThese programs have demonstrated promising results thus far, indicating that it can be beneficial to focus on decreasing pain-related fear.\nIn line with the idea of matching treatments to specific patient characteristics (Vlaeyen and Morley, 2005), it was demonstrated that usual general practitioner care was less suitable in cases of high pain catastrophizing, whereas a minimal intervention focusing on risk factors for chronicity appeared to be more appropriate in the case of elevated fear avoidance beliefs (Jellema et al.\nFor example, it was demonstrated that a short cognitive behavioral intervention was successful in reducing fear avoidance beliefs, together with diminishing the risk of pain continuation, over and above the rather strong natural recovery rate for acute LBP (Linton and Ryberg, 2001).\nThe association between pain-related fear and the effectiveness of treatments is also highlighted by brief educational sessions.\nTaken together, these results suggest that cognitive behavioral programs, and even brief educational sessions, can effectively diminish disability, which might be due to reducing fear avoidance beliefs and pain catastrophizing.\nPain-related fear might therefore be an essential target for successful interventions.\nYet, the abovementioned treatments were not developed to specifically and systematically address pain-related fear.\nIt can be suggested that methodically addressing and diminishing fear might be even more powerful.\nFollowing the suggestions of Philips (1987), exposure in vivo treatment was developed to gradually confront patients with activities they feared and avoided for a long time due to the belief that these might be damaging for the back.\nThis treatment consists of four components: the choice of functional goals, education about the paradoxical effects of safety behaviors, the establishment of a fear hierarchy, and graded exposure to feared activities in the form of behavioral experiments.\nDue to gradual and repeated encounters with these feared activities, this treatment may provide patients with the most convincing evidence that expected detrimental consequences of these feared activities are in fact a catastrophic overestimation.\nDue to this, their fear may diminish and functional abilities might be promoted.\nFor the establishment of the fear hierarchy of activities, that constitutes the foundation for the rest of the therapy, The Photograph Series of Daily Activities (PHODA: Kugler et al.\nIt is comprised of photographs of various daily activities, of which patients have to indicate to what extent they think that these can be harmful to the back.\nThe PHODA provides therapists with a tangible tool that specifically assesses the patients beliefs about the harmfulness of certain activities for the back.\nBesides clinical purposes, the PHODA has also been utilized as a measurement tool, and has been shown to have excellent psychometric properties (Leeuw et al.\nSeveral experimental single case studies, including 2 to 6 patients each, have demonstrated the effectiveness of exposure in vivo as compared to graded activity in fearful CLBP patients, by reporting impressive reductions in pain-related fear and disability, as well as increases in activity levels in the home situation (Boersma et al.\nMeasures of actual behavior, including accelerometer data, and self-reported ability to perform pre-defined goals, improved after the exposure sessions and not after the educational session (de Jong et al.\nFinally, the resumption of daily activities in patients suffering from complex regional pain syndrome was associated with decreases in pain-related fear, but not with a reduction in pain-intensity, which occurred only later in time (de Jong et al.\nAn important assumption behind exposure in vivo is that the repeated experiences of being able to perform various activities without pain increases or inducing (re)injury to the back during treatment will extend to activities during daily life.\ng Bouton, 2002), several experimental studies suggest that generalization of these corrective encounters is rather limited in chronic pain patients.\n, 2005b), resulted in subsequent diminished overprediction of pain for those particular movements, but this effect failed to generalize to other dissimilar movements.\nInterestingly, these patients on the other hand tended to overgeneralize pain, such that once a certain movement had been painful it was assumed that it would remain painful in the future (Goubert et al.\nFor exposure in vivo treatment, it would be interesting to investigate whether the overprediction of injury is as difficult to generalize to dissimilar movements as the overprediction of pain.\nTranslated into treatment implications, these results emphasize the importance of practicing a wide variety of activities and movements, not only during treatment, but also in the home environment of the patient (Rowe and Craske, 1998a,b).\nAlthough there is no data as yet comparing exposure in vivo to behavioral experiments, it can be suggested that the addition of behavioral experiments may optimize generalization of corrective encounters.\nSummarizing, it can be stated that there is accumulating support for the fear-avoidance model.\nAs predicted from the vast literature on fear and anxiety, pain-related fear is associated with catastrophic (mis)interpretations of pain, hypervigilance, increased escape and avoidance behaviors, as well as with intensified pain intensity and functional disability.\nDisrupted attentional processes, and especially impeded attentional disengagement in the case of threatening stimuli, were found in fearful CLBP patients, as well as avoidance behavior as reflected in submaximal physical task performance.\nThere is less evidence for the existence of disuse in CLBP patients.\nStudies on aerobic fitness level, which seems the most appropriate measure of physical deconditioning, have demonstrated inconsistent findings thus far.\nTherefore, more research is required to establish whether CLBP patients actually have lower physical activity levels and experience associated physical consequences.\nPerhaps the disordered motor coordination is a more salient aspect of disuse than reduced fitness.\nFurthermore, evidence is accumulating that pain severity plays a more important role in disability than previously assumed.\nFinally, several personal vulnerabilities, such as fundamental fears or neuroticism, may influence whether someone will respond fearfully to a painful experience.\nPain-related fear may augment the vulnerability to develop new LBP episodes in currently pain-free people, may increase the risk for the continuation of LBP complaints, and may maintain complaints when they have become chronic.\nThis conception disregards the erratic and recurrent course of LBP for most people.\nThese individual differences in the course and consequences of LBP should be kept in mind when interpreting the contribution of pain-related fear during different stages of pain.\nIn fact, the research on contextual factors influencing the occurrence and reinstatement of fear waits to be extended to the area of pain.\nIt is also important to note that the fearavoidance model only accounts for the development and maintenance of problems in a subgroup of CLBP patients.\nVarious other factors besides pain-related fear may determine the progress of LBP.\nFurthermore, supportive evidence for the interrelations between the separate constructs of the fear-avoidance model does not provide evidence for causal interrelationships.\nCausality can only be established when each construct is experimentally manipulated.\nIt would be highly interesting to investigate the progression of interrelationships between the variables of the fear-avoidance model in a large cohort of acute back pain patients of whom some will develop subsequent chronic pain, for example by using Latent Trajectory Classes Analyses.\nDue to their protective and defensive function in the case of impending or immediate danger, it may be concluded that fear and anxiety are adaptive mechanisms for an individual, and in most cases they are indeed.\nHowever, in the case of enduring pain, when the pain may no longer be explained by injury, fear can become dysfunctional.\nThus, one could assert that fear, and painrelated fear in particular, is never dysfunctional, but it is the prolonged engagement in these safety behaviors that are dysfunctional.\nMost treatments are developed for chronic pain patients, thereby disregarding earlier phases during which the development of CLBP can be tackled.\nA promising area lies in preventing dysfunctional reactions when a new pain episode is initiated.\n, 2005b), the potential beneficial effects of educational campaigns should be more extensively explored.\nIn addition to identification of those at risk, prevention strategies should be developed that target these risk factors, thereby putting detrimental developmental processes in pain on hold (Linton and Andersson, 2000; Linton and Ryberg, 2001, Linton et al.\nTheoretically, however, there is every reason to believe that fear processes would be applicable to specific pain problems as well.\nIt will be a challenge for future researchers to integrate fear reduction techniques in medical treatment and care for these patient groups.\nFear of pain and associated avoidance behaviors may not be the only kind of fear associated with chronic pain.\nFor chronic pain patients, another important concern may be social isolation that occurs in response to their diminished participation in daily life.\nIt therefore may be that concerns about social isolation in pain patients inadvertently increase their pain threshold.\nAlthough this theoretical framework appears a promising avenue for broadening current fear-avoidance models, research efforts have just started.\nFor example, Karoly and Ruehlman (1996) showed that in chronic pain patients, goal conflicts predicted anxiety levels over and above pain-related variables.\nAs mentioned before, fear is not always associated with avoidance behavior.\nRachman (2004) eloquently describes situations in which fearful individuals are willing to approach a frightening object or situation.\nIn some cases, fear may even be associated with persistence rather than avoidance.\nWhen individuals adopt an explicit or implicit As-Many-As-Can stop rule (they continue until satisfaction is reached about dealing with the task), negative mood will facilitate task performance, whereas positive mood will inhibit task performance.\nThe strength of the moodas-input model is that it provides specific predictions, including those that are based on the fear-avoidance model, but also those that are based on a novel theoretical basis that may account for findings inconsistent with the fear-avoidance model, such as task perseverance instead of avoidance despite pain-related fear.\nThe meaning of pain influences its experienced intensity.\nAttention to chronic pain is dependent upon pain-related fear.\nCatastrophizing predicts changes in thermal pain responses after resolution of acute dental pain.\nExposure to physical movement in chronic back pain patients: No evidence for generalization across different movements.\nPain coping strategies play a role in the persistence of pain in post-herpetic neuralgia.\nHealth care providers orientations towards common low back pain predict perceived harmfulness of physical activities and recommendations regarding return to normal activity.\nPredictors of outcome in patients with (sub)acute low back pain differ across treatment groups.\nChanges in beliefs, catastrophizing, and coping are associated with improvement in multidisciplinary pain treatment.\nHigh fear-avoiders of physical activity benefit from an exercise program for patients with back pain.\nChronic fatigue syndrome: lack of association between pain-related fear of movement and exercise capacity and disability.\nPain catastrophizing predicts pain intensity, disability, and psychological distress independent of the level of physical impairment.\nAcute low back pain: pain-related fear and pain catastrophizing influence physical performance and perceived disability.\nAbsence resulting from low back trouble can be reduced by psyochosocial intervention at the work place.\nCatastrophizing is associated with pain intensity, psychological distress, and pain-related disability among individuals with chronic pain after spinal cord injury.\nPain catastrophizing, but not injury/illness sensitivity or anxiety sensitivity, anhances attentional interference by pain.\nAre changes in fear-avoidance beliefs, catastrophizing, and appraisals of control, predictive of changes in chronic low back pain and disability? European J."}