{"title": "44.s13104-020-05356-z.pdf", "contents": "Lorimer Moseley6 , Michael Nicholas7 , Lee OSullivan1 ,  Rachel Park1 , Glen Russell1 , Michele Sterling8,9  and Paul W.\nIt remains unclear why  many individuals experience persistent and recurrent symptoms after an acute episode whereas others do not.\nA  longitudinal cohort study was established to address this problem.\nThis paper outlines the methodology and compares baseline characteristics between acute LBP and control, and LBP participants with and without  follow-up.\nResults: 133 individuals with acute LBP and 74 pain-free individuals participated.\nBio-psycho-social and behavioural  measures were collected at baseline and 3-monthly for 12 months (LBP) or 3 months (control).\nPain and disability  were recorded fortnightly.\nBaseline characteristics were mostly similar between those who did and did not return  for follow-up.\nInitial analyses of this cohort have revealed important insights into the pathways involved in acute-tochronic LBP.\nThese and future findings will provide new targets for treatment and prevention of persistent and recurrent LBP.\nIf material  is not included in the articles Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the  permitted use, you will need to obtain permission directly from the copyright holder.\nIntroduction Low back pain (LBP) is the worlds leading cause of disability [1] and is associated with enormous and escalating  costs to society [2].\nAlthough psychosocial factors have generally been  considered stronger predictors of long-term outcome  than diagnostic or injury-related factors [5, 6], they only  explain a small proportion of the variance in outcome  [6, 7].\nWith this incomplete understanding of factors  related to LBP outcome, it is not surprising that most  treatments have modest effects at best [10] and are generally unable to prevent recurrence/persistence of pain  [11].\nThird, there is growing evidence that behavioural factors such as sleep interact with the biopsychosocial  components of LBP, but their contribution to outcome is  unknown.\nFurther, little is known of the time course  of changes in each of the biopsychosocial domains over  12 months following an acute LBP episode.\nThere is  strong foundation to evaluate whether candidate biological factors, along with their possible interaction with psychosocial factors, contribute to the transition from acute  LBP to that of persistent/recurrent symptoms.\nThis paper outlines the participants,  measures and data collection schedule, and compares  baseline characteristics between acute LBP and control,  and follow-up and non-follow-up LBP participants.\nMeasures of sleep, physical activity, alcohol consumption and smoking were  grouped separately in a behavioural domain as they  cross between classical domains.\nEligible participants  completed a series of detailed online questionnaires  related to their pain and disability level, health, demographics, behaviour, and psychosocial status within 24 h  of undertaking a laboratory-based session (~ 4 h) at the  University of Queensland to assess biological variables.\nonline questionnaires) were repeated at 3, 6 and 9 months  for LBP participants, and at 3 months for control participants.\nAt 12 months, questionnaires were completed by  all participants in the LBP group in addition to a separate  12-month recall questionnaire relating to the trajectory  of their LBP since initial assessment for the study.\nParticipants were also instructed (and reminded) via email  to report their pain and disability level every fortnight for  3 (controls) or 12 months (LBP) via an online survey.\nFor  some analyses that have been conducted to date, these  pain and disability data have been used to classify LBP  participants as either unrecovered, partially recovered  or recovered at follow-up (for details see Additional  file 1: Table S2).\nParticipants were recruited  through advertisements around the University campus and local community, social media, three nearby  hospitals and via a professional recruitment agency  (Trialfacts).\nScreening was conducted using two different methods.\nInitially, eligibility was determined via email and/ or phone, and when this method was used the reason(s)  for exclusion at this initial screening were not recorded.\nThis was replaced with an automated online screening  questionnaire from April 2014, with reasons for exclusion  recorded.\nParticipants did not need to be experiencing their first  ever LBP episode.\nPrevious LBP was recorded for inclusion as a covariate.\nControl participants were included if  they had not experienced LBP within the last month in  addition to meeting the exclusion criteria in Additional  file 1: Table S3.\nPotential LBP participants who  reported < 1 on the pain NRS and/or the RMDQ, or provided no scores in the past week were excluded from the  study (N = 8).\nRespondents rate how often over the past week they  experienced symptoms associated with depression using a  four-point Likert scale ranging from 0 (rarely or none of the  time) to 3 (most or all of the time).\nResponses to questions are quantified on a five-point Likert  scale ranging from 0 (not at all) to 4 (all the time) with  respect to how often the respondent experiences certain  thoughts and feelings when in pain.\nRespondents rate how confidently they can perform a range  of activities using a seven-point Likert scale.\nResponses to each item are quantified on  a four-point Likert scale from 1 (totally disagree) to 4 (totally  agree).\nVenous blood was drawn, clotted (30 min, room  temperature), and serum was separated by centrifugation  (2500 rpm, 15 min) before storing at  80 C.\nTS and CS were applied to the lower back  or forearm.\nThe CPM response was calculated as the difference between  the TS scores obtained before and during the CS.\nA higher TS  score during the CS than baseline indicated pain inhibition  (expressed as a positive value).\nA lower TS score during the CS  than baseline indicated pain facilitation (negative value).\nParticipants sat in a semi-sitting position  with their pelvis fixed and a cable attached either behind or in  front of their trunk via a harness.\nOn instruction, participants  pulled against the cable with a force of 12.\nThe cable was released at an unpredictable time for 10 repetitions in each direction and the response of 12 abdominal and  back muscles were recorded with surface EMG electrodes  using placement described previously.\nThe trunk was perturbed by  the unexpected release of one of the weights.\nThe task was  repeated 10 times in each direction with the order of directions randomised.\nTrunk kinematics and cable force were used  to estimate system properties.\nParticipants performed three 30-s trials (separated by a 1 min rest  period) with eyes open, eyes closed and with feedback of  the seat position in the anteroposterior direction (target on  a computer screen).\nIn an additional trial, participants were  perturbed by release, at an unexpected time, of a weight  (3% body weight) attached behind the trunk.\nFeedback was  provided until the perturbation.\nStanding postural control Laboratory measure: Postural control was measured with participants standing barefoot and blindfolded on a force plate  for 75 s.\nCoordinates of CoP were recorded.\nScores from each  dimension (range: 03) are individually reported as component scores and summed to derive a sleep quality maximum  score.\nResponses to each item are quantified on a five-point Likert scale from 0 to 4.\nAn item receives a score of 1 if it is applicable to the respondent or a score of 0 if it is not.\nThese participants were excluded from the dataset.\nThe final cohort  included 133 and 74 participants in the LBP and control  groups, respectively, for analyses.\nAll variables were measured in a  standardised order for each participant.\nBiological measures were those we considered to be the most promising  candidate factors for predicting LBP recurrence/persistence based on previous research and plausible rationales  founded on clinical, epidemiological and fundamental  research.\nAs it was not our  intention to withhold treatment over the study period,  we collected information regarding health care and medication use so that treatment variables can be included as  covariates.\nThe  planned sample size was not achieved due to feasibility  issues as outlined in the limitations section.\nAs biological measures were not performed at 12 months, all participants  were invited to complete the standard 3-montly questionnaire in addition to a separate recall questionnaire at  12 months, irrespective of whether or not they had continued or dropped out earlier.\nTen control  participants did not return for follow-up at 3 months.\nThe findings of baseline (acute LBP) characteristics  presented here provide a foundation for future longitudinal analyses.\nWhether the findings can be generalised to  a larger or clinical sample of individuals with early-acute  LBP requires further and detailed studies of the condition during the early-acute phase.\nDespite the rate of loss  to follow-up, most occurred after the first session, and  baseline characteristics were generally similar between  those who did and not return for follow-up.\nOngoing analyses focus on elucidating  the role of trunk neuromuscular, kinematic, mechanical  and morphological properties, along with their possible  interactions with psychosocial/behavioural features, in  predicting LBP outcome.\nIt was not possible to collect blood samples at a  standardised time during the day for each participant at each time-point.\nTo account for the diurnal  variations in cytokines [41], time of blood collection  was recorded for inclusion as a potential confounder  when interpreting cytokine levels.\nRefer to Table 1 for other abbreviations.\nParticipants who answered other to question 25 of the Job Content Questionnaire were removed prior to analysing the job insecurity scale.\nAuthors contribution Conceived and designed the study: DK, PH, WVDH, MB, JC, AK, LM, MN and  MS.\nAll authors revised the  manuscript.\nAll authors read and approved the final manuscript.\nThe funders had no role in the study design, data collection  and analysis, decision to publish, or preparation of the manuscript.\nAvailability of data and materials All data are held at The University of Queensland, Brisbane, Australia, and  handled confidentially in a de-identified format.\nCurrently, only the research  team has access to the data.\nEthics approval and consent to participate The study was approved by The University of Queenslands Human Research  Ethics Committee (ID: 2010000045), Royal Brisbane & Womens Hospital  Human Research Ethics Committee (ID: HREC/13/QRBW/268), and the Uniting  Care Health Human Research Ethics Committee (ID: 1404).\nAll participants  provided written informed consent, were informed of their right to withdraw  from the study at any time without penalty, and were informed of the study  purpose.\nCompeting interests The authors declare that they have no competing interests.\nAiraksinen O, Brox JI, Cedraschi C, Hildebrandt J, Klaber-Moffett J, Kovacs  F, et al.\ngold Open Access which fosters wider collaboration and increased citations .\nAt BMC, research is always in progress.\nDelayed trunk muscle reflex responses increase the risk of low back  injuries.\nChanges in the  mechanical properties of the trunk in low back pain may be associated  with recurrence.\nA call for a prudent interpretation of  the literature by Schipholt et al.\nPublishers Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."}