{"title": "46.B.European_Journal_of_Pain_-_2019_-_Matheve_-_Lumbar_range_of_motion_in_chronic_low_back_pain_is_predicted_by_task‐specific_.pdf", "contents": "Lumbar range of motion in chronic low back pain is predicted by  taskspecific, but not by general measures of painrelated fear.\nThis  study explored whether taskspecific, instead of general measures of painrelated  fear can predict movement behaviour.\nResults: Lumbar ROM was predicted by taskspecific, but not by general measures  of painrelated fear.\nCompared to healthy persons, patients with CLBP used  significantly less ROM, except the subgroup with a low score on the taskspecific  measure of painrelated fear, who used a similar ROM.\nConclusions: Our results suggest to use taskspecific measures of painrelated fear  when assessing the relationship with movement.\nIt would be of interest to investigate  whether reducing taskspecific fear changes protective movement behaviour.\nSignificance: This study shows that lumbar range of motion in CLBP is predicted by  taskspecific, but not by general measures of painrelated fear.\nThis suggests that  both in clinical practice and for research purposes, it might be recommended to use  taskspecific measures of painrelated fear when assessing the relationship with  movement behaviour.\nThis may help to disentangle the complex interactions between  painrelated fear, movement and disability in patients with CLBP.\nThe fearavoidance model postulates that catastrophic  thoughts about pain can lead to painrelated fear, which in  turn may result in avoidant behaviour (Crombez, Eccleston,  Damme, Vlaeyen, & Karoly, 2012; Vlaeyen, Crombez, &  Linton, 2016).\nWhile the temporary avoidance of certain activities might be beneficial in case of acute injury, this behaviour becomes maladaptive once the tissues have healed  (Hodges & Smeets, 2015).\nThis is relevant for patients with  chronic low back pain (CLBP) in particular, because in about  90% of this population no pathoanatomical cause can be detected to explain the pain (Maher, Underwood, & Buchbinder,  2017).\nDespite the absence of clear tissue damage, a subgroup  of patients with CLBP adopts a protective movement strategy  by stiffening the spine, resulting in a reduced lumbar range of  motion (ROM) during active movements (O'Sullivan, 2005).\nBased on the fearavoidance model, it has been hypothesized that especially patients with CLBP who are displaying  higher levels of painrelated fear would show this protective behaviour (Geisser, Haig, Wallbom, & Wiggert, 2004).\nThe discrepancy between the  abovementioned hypothesis and the results from crosssectional studies could possibly be explained by the fact that only  general measures of painrelated fear, such as the Tampa scale  for kinesiophobia (TSK) and the Fearavoidance beliefs questionnaire (FABQ), have been used to examine the association  with movement patterns.\nAlthough some patients with CLBP  may present with a generalized fear of movement, others might  be fearful of particular activities only, without achieving a high  score on the TSK or the FABQ.\nAs such, taskspecific measures of painrelated fear could be more appropriate to assess  the relationship with movement patterns (Leeuw, Goossens,  Breukelen, Boersma, & Vlaeyen, 2007; Oliveira et al.\nIf patients do not resume their normal movement patterns  after an acute episode of low back pain (LBP), but maintain  a protective movement behaviour, the latter can become a  source of ongoing peripheral nociceptive input by loading  the spine in a suboptimal manner, which in turn can contribute to the persistence of CLBP (Hodges & Smeets, 2015;  O'Sullivan, 2005).\nTherefore, painrelated fear may not only  influence central pain processing but also peripheral pain  mechanisms.\nFrom a clinical perspective, it would be of interest to identify modifiable factors that are related to movement patterns which deviate from those of healthy persons.\nThis would allow to specifically target therapy towards these  sources of altered movement, potentially leading to improved  treatment outcomes for patients with CLBP.\nIn this study, a standardized lifting task was used to  examine the association between lumbar ROM and measures of painrelated fear in patients with CLBP.\nWe hypothesized that lumbar ROM during a lifting task would  be predicted by taskspecific, but not by general measures  of painrelated fear.\nSecond, based on the observation that  painrelated fear can generalize to movements that are  proprioceptively similar to the initial painful movement  (Meulders & Vlaeyen, 2013), we expected that patients  who are fearful of activities similar to lifting would perform the lifting task with less lumbar ROM.\nFinally, the  lumbar ROM of healthy persons and patients with CLBP  was compared with each other.\nWe hypothesized that patients with lower scores on the taskspecific measure of  painrelated fear would have a similar lifting pattern compared to healthy persons, whereas patients who selfreport  fear of lifting would use less lumbar ROM.\nThis crosssectional study is a preplanned analysis of baseline measurements of a randomized controlled trial (Matheve,  Brumagne, Brumagne, Demoulin, & Timmermans, 2018).\nAll the data presented in this paper were collected on the  same day.\nFiftyfour healthy persons and 55 patients with chronic non specific LBP participated in this study.\nParticipants were recruited via private GP and physiotherapy practices and via  social media.\nHealthy participants were excluded when  they experienced at least 1 day of selfreported LBP in the  past year that interfered with daily life activities or sought  professional help for their LBP in the past year (Sorensen,  George, Callaghan, & Dillen, 2016).\nPersons willing to participate in the study were initially screened via a structured  telephone interview, and eligibility was confirmed when participants arrived in the laboratory, prior to the start of the tests.\nEthical approval was obtained from the Ethics Committees of  Hasselt University and Jessa Hospital, Belgium.\nAll participants gave written informed consent before being included  in the study.\nFirst, participants completed a series of questionnaires after  which a movement analysis was performed during a lifting  task.\nPatients were also asked to complete a question on the duration of the LBP.\nRoland Morris Disability Questionnaire (RMDQ) (Roland  & Morris, 1983): The RMDQ contains 24 questions about  the effect of LBP on daily activities, which have to be answered with yes or no.\nA higher score (range 024) represents  a higher level of disability.\nPain Catastrophizing Scale (PCS) (Sullivan, Bishop, &  Pivik, 1995): The PCS contains 13 questions relating to the  patients negative thoughts and feelings during pain.\nEach  question has to be answered on a 5point scale (0 = not at all,  4 = always), resulting in a score between 0 and 52.\nA higher  score corresponds with a higher level of pain catastrophizing.\nFor patients with  CLBP, two subscales can be discerned in the TSK.\nThe activity  avoidance subscale (TSKAA) specifically measures activity  avoidance and fear of reinjury, whereas the Somatic Focus  subscale (TSKSF) assesses to which extent patients believe  that their LBP can be attributed to a serious underlying medical  problem (Goubert et al.\nBecause it has previously been  hypothesized that the TSKAA might be a better predictor for  the lumbar ROM than the TSKtotal or TSKSF (Demoulin et  al.\nForty consecutive pictures  of daily life activities are shown on a computer screen.\nA total  score (0100) per participant was calculated by averaging  the scores of the 40 pictures.\nAlthough the PHODASeV assesses the perceived harmfulness of specific activities, the total score on the PHODA SeV (PHODAtotal) gives a general rating of perceived  harmfulness as it is the average of all scores on the individual tasks.\nAs such, the PHODAtotal does not specifically  relate to the lifting task in this study.\nTherefore, the scores  on the PHODAtotal, TSKtotal, TSKAA and TSKSF were  considered as general measures of painrelated fear.\nLifting task The participants started from their habitual standing position.\nThe task was performed five times at a selfselected pace.\nTo standardize the lifting task for the participant's height, the top of the box was positioned 10 cm below  the apex of the subjects' patella.\nParticipants stood with both  feet at a distance of 15 cm from the box.\nlumbopelvic kinematics have been previously shown (Bauer  et al.\nFirst, the L1 and  S1 levels were palpated in a standardized way (Tixa, 2015).\nHereafter, the system was calibrated and the sensors were  placed at the level of the spinous process of L1 and S1 using  doublesided tape.\nBoth the palpation and sensor placement  were performed with the participant in a relaxed standing position.\nThe movement analysis started by recording the habitual  standing position of the participants.\nFor each repetition, the  maximal deviation from the starting position was calculated  and expressed in absolute values.\nLumbar spine angles were  calculated from the orientation of the L1sensor relative to that  of the S1sensor.\nTo obtain a more reliable measurement of  the movement patterns, an average of the five repetitions was  calculated.\nA multiple linear regression was performed to examine the  predictive value of painrelated fear for the lumbar ROM  during the lifting task.\nFirst, a basic model was constructed  that only contained the controlling variables age, sex, current  pain, pain catastrophizing, duration of LBP and disability.\nSingle correlation coefficients were used to analyse  whether the lumbar ROM was associated with any of the  scores on the individual pictures of the PHODASeV, other  than the PHODAlift.\nScores of pictures showing a  significant correlation with the lumbar ROM were entered  in a regression analysis together with the same controlling  variables as described above.\nTo compare the lumbar ROM of healthy persons with  those of patients with CLBP, six regression analyses were  performed, using age and sex as controlling variables.\nFirst,  healthy persons were compared with the CLBP group as a  whole.\nData are mean (SD), unless otherwise stated.\nBeta indicates that female sex is associated with a larger range of motion.\nThis subgroup analysis  was performed for each of the painrelated fear measures.\nDunnett's post hoc test was used to compare each subgroup  of patients (low, middle or high level of painrelated fear)  with the group of healthy persons.\nBaseline characteristics of the participants can be found in  Table 1.\nA total of 178 patients with CLBP and 56 healthy  participants were screened for participation.\nThe results from the regression analyses are presented in  Table 2.\nIn all of the models, female sex was predictive for  an increased lumbar ROM and current pain had a negative  predictive value for lumbar ROM.\nPHODAlift was negatively associated  with lumbar ROM, indicating that patients who scored higher  on the PHODAlift used less lumbar ROM during the lifting  task.\nThe correlations between each picture of the PHODA SeV and the lumbar ROM can be found in Table 3.\nIn each of the regression analyses used to compare lumbar ROM between healthy persons and (subgroups of) patients with CLBP, the variable group was significant (see  Supporting Information Table S1).\nPost hoc tests indicated  that the whole group and all the subgroups of patients with  CLBP used significantly less ROM compared to the healthy  subjects (all pvalues  0.\nThe aim of this study was to investigate whether taskspecific or general measures of painrelated fear were predictive for the lumbar ROM during a lifting task.\nThe results  supported our hypothesis that lumbar ROM was predicted  by taskspecific, but not by general measures of painrelated  fear.\nSecond, we expected that patients who were fearful of  activities similar to lifting would perform the lifting task with  less lumbar ROM.\nOnly the scores on picture 1, displaying  a person shovelling soil, were predictive for lumbar ROM  during the lifting manoeuver.\nlow, medium and high) based on the  painrelated fear scores used significantly less ROM than the  healthy control group, except the subgroup with low scores  on the taskspecific measure of painrelated fear, which used  a ROM similar to the healthy subjects.\nHigher levels of painrelated fear have consistently been  associated with increased pain and disability in patients suffering from CLBP (Kroska, 2016; Zale, Lange, Fields, &  Ditre, 2013).\nMoreover, the reduction in painrelated fear is  predictive for a better treatment outcome in this population,  which implies that this fear should be addressed when present (Wertli et al.\nTo achieve this, Vlaeyen, Morley,  Linton, Boersma, and Jong (2012) developed a graded exposure in vivo treatment for patients with CLBP who are displaying elevated levels of painrelated fear.\nOne of the key  aspects of graded exposure therapy is to establish a personal  fear hierarchy using the PHODASeV in order to gather information about which specific movements are feared and  avoided (Leeuw et al.\nBased on this information, patients will (gradually) be exposed to feared movements and  activities.\nThis could be considered as a  limitation of the construct validity of the PHODASeV, and  therefore, it has been recommended to relate PHODASeV  scores with the performance on behavioural tests (Leeuw et  al.\nThe general measures of painrelated fear were not related to the lumbar ROM, which is in line with the results  from most (Demoulin et al.\nIn this respect, it could be argued  that specifically including the PCS into the basic model  of our study might have attenuated the predictive value of  the painrelated fear measures because both variables are  closely linked in the fearavoidance model (Vlaeyen et al.\nHowever, there was no multicollinearity and removing the PCS from the basic regression model did not influence results.\nA potential explanation for the lack of predictive value of  the general painrelated fear measures is that some patients  with CLBP might be afraid of particular movements only,  without perceiving physical activity in general (e.\nFearavoidance beliefs are shaped by many  factors, including pain characteristics (e.\nEspecially, the influence of the  latter has gained more attention in recent years.\nWhile most  healthcare practitioners regard exercises and staying active  as beneficial for CLBP, many of them consider lifting with a  bent back as harmful for the lumbar spine, although there is  no good evidence to support this belief (Nolan, O'Sullivan,  Stephenson, O'Sullivan, & Lucock, 2018).\nis plausible that misinformed patients will become fearful to  perform this specific task, resulting in a protective movement  behaviour with a restricted lumbar ROM, without necessarily  regarding general physical activity as harmful.\nBesides the influence of the abovementioned factors,  learning processes are fundamental for acquiring painrelated fear and avoidant behaviour.\nWhen a lifting manoeuver  is followed by an episode of LBP, lifting itself may become  associated with pain.\nAs a consequence, patients may develop  a fear for lifting and avoid this activity (respondent conditioning).\nWhen the avoidance of lifting results in less pain, this  behaviour will be reinforced (operant conditioning) (Linton,  Flink, & Vlaeyen, 2018; Vlaeyen et al.\nA specific  feature of respondent conditioning is stimulus generalization  (Vlaeyen, 2015).\nThis occurs when a stimulus that is similar  to the original feareliciting stimulus will also provoke a fear response.\nThe strength of this response follows a gradient  which depends on how closely these stimuli match with each  other (Vlaeyen, 2015).\nAlthough these concepts were initially  based on research in anxiety disorders (Dymond, Dunsmoor,  Vervliet, Roche, & Hermans, 2015), Meulders et al.\nTherefore, we  hypothesized that the lumbar ROM during lifting would also,  but less strongly, be predicted by the scores on pictures of  the PHODASeV that are proprioceptively related to a lifting  manoeuver with a bent back.\nOur results showed that besides the PHODAlift, only  the scores on picture 1, depicting a person shovelling soil,  predicted the lumbar ROM.\nIn line with our hypothesis, the  scores on picture 1 were a less strong predictor for the lumbar ROM than the scores on the PHODAlift.\nBeta indicates that female sex is associated with a larger  range of motion.\nPotentially, not only the proprioceptive relatedness is of importance to predict movement behaviour, but also the threat value of the activity.\nFor some patients, simply flexing the spine  might already be seen as a harmful movement, whereas  others might only perceive this as harmful when heavier  loads are being handled or when they cannot use an external support.\nFor the same  reason, it can be explained that the scores on picture 10,  displaying a person lifting a crate from the trunk of a car,  were not correlated with the lumbar ROM.\nThe number of participants in each subgroup of the PRFmeasure was as follows: Low (n = 18), Medium  (n = 18), High (n = 19), except for the TSKAA subgroups: Low (n = 16), Medium (n = 20), High (n = 19).\nCompared to healthy persons, only the patients with a  low score on the PHODAlift used a similar lumbar ROM  during lifting.\nFrom a clinical perspective, the question thus  arises whether reducing the taskspecific fear will automatically lead to a normalization of the lumbar ROM during  that task.\nDespite its overall effectiveness, a substantial number of  patients with CLBP does not achieve a clinically meaningful  reduction in disability after exposure therapy (Glombiewski  et al.\nFurthermore, changes in subjective measures of fear do not necessarily lead to synchronous changes  in behaviour (Rachman & Hodgson, 1974).\nTherefore, it would be  valuable to assess whether movement patterns change after  (exposure) treatment and, if so, whether these changes mediate the improvements in pain and disability.\nIt has been  shown that CFT improves painrelated cognitions and emotions (O'Sullivan, Dankaerts, O'Sullivan, & O'Sullivan,  2015; Vibe Fersum, O'Sullivan, Skouen, Smith, & Kvale,  2013), as does exposure therapy (Leeuw et al.\nTherefore, it might be more appropriate to evaluate the specific movements that were targeted during treatment instead  of using standardized tasks.\nSeveral limitations apply to this study.\nCategorizing participants into subgroups may limit the  power to detect smaller differences.\nFurthermore, using a certain cutoff for categorizing  patients is somewhat arbitrary.\nHowever, these normative data are mainly based on  severely disabled patient populations that were referred to  specialized pain clinics.\nSecond, because we only included a lifting task to assess  the predictive value of painrelated fear, we cannot make any  statements concerning other movements.\nAs a consequence, reducing the fear for lifting  an object is often one of the treatment goals in this patient  population.\nThird, we only used the maximal lumbar ROM as a measure of movement behaviour and we did not differentiate  between ROM of the lower and upper lumbar spine.\nConsequently, the ROM during flexion in standing  might not be a good indication of the total available ROM because it could also be limited due to the protective behaviour  (Geisser et al.\nFurthermore, it has been shown that the  lumbar flexion ROM during functional activities sometimes  exceeds the maximal lumbar ROM measured during flexion  in standing (Wade, Campbell, Smith, Norcott, & O'Sullivan,  2012).\nIn our opinion, the latter measure cannot be considered  to be the golden standard for measuring the maximal physiological ROM.\nFinally, the measurements were performed in a laboratory setting.\nBecause the context in which activities are performed can influence (avoidant) movement behaviour (Claes,  Vlaeyen, & Crombez, 2016), it would be valuable to evaluate  how people move during daily life activities in their personal  context.\nThe present study confirmed our hypothesis that the lumbar  ROM during a lifting manoeuver was predicted by task specific, but not by general measures of painrelated fear.\nWe also expected that scores on pictures showing activities which were proprioceptively similar to the lifting task  would predict the lumbar ROM.\nHowever, our results suggest that besides the proprioceptive relatedness, also the  threat value should be similar to predict the lumbar ROM.\nFinally, only the patients with a low score on the taskspecific measure of painrelated fear had a similar lumbar  ROM compared to healthy persons.\nBased on these results,  we recommend to use taskspecific measures of painrelated fear when assessing the relationship with movement  behaviour.\nFurthermore, it would be of interest to investigate whether reducing taskspecific fear changes protective  movement behaviour, and whether these potential changes  mediate the improvements in pain and disability.\nWe would like to thank Dr.\nAll authors interpreted the  findings, commented on and revised the manuscript.\nAll authors approved the final version of the manuscript.\nPain in context:  Cues predicting a reward decrease fear of movement related pain  and avoidance behavior.\nFear of movement is related to trunk stiffness in low back pain.\nAdditional supporting information may be found online in  the Supporting Information section at the end of the article."}