{"title": "48.B.FA.2020.04.01.20049999.full.pdf", "contents": "No reuse allowed without permission.\nNOTE: This preprint reports new research that has not been certified by peer review and should not be used to guide clinical practice.\nYet, it is unknown if similar psychomotor interactions already exist .\nkinematics in a healthy cohort of pain-free adults without a history of chronic pain.\nHigh-resolution spinal kinematics were assessed using an optical motion capturing system.\nsensitive analyses were performed based on statistical parametric mapping.\nNo reuse allowed without permission.\nSuch beliefs can increase protective behaviors, including control of posture .\nmechanical loading on spinal tissues, which might result in ongoing nociceptive input in the long term .\nbias towards lifting with a flexed spine is dangerous, compared to lifting with a neutral spine, in patients .\nWith respect to this, there is a lack of studies measuring lumbar spine flexion during lifting .\nfear of lifting is linked to reduced sagittal plane lumbar range of motion (ROM) in chronic non-specific LBP .\nThe results of this study indicate an unfavorable trunk stiffening .\nNo reuse allowed without permission.\nThe study protocol was approved by the local ethics committee (Kantonale Ethikkommission .\nprovided written informed consent prior to any study-related activities.\nThey were invited for a single visit .\nNo reuse allowed without permission.\nparticipants violated the task instructions, resulting in non-valid trials.\nThree-dimensional marker positions were tracked using a 20-camera optical motion capturing system .\nNo reuse allowed without permission.\nT3, T5, T7, T9, T11, L1 to L5 and S1 were used for tracking of spinal motion.\nPost-processing was carried out with a custom-built MATLAB routine (R2019a, MathWorks Inc.\nNo reuse allowed without permission.\nTo obtain ROM values for the analyzed tasks, continuous angles were reduced .\nStatistical calculations were performed using SPSS (version 23, SPSS Inc.\ndistribution of the questionnaire data, Spearmans rank correlation coefficient was used for correlation .\nthere are no relationships between continuous spinal angles .\nNo reuse allowed without permission.\nFour subjects had to be excluded from the analysis, resulting in a final sample of 57 pain-free healthy .\nThe reasons for the exclusions were technical issues that led to the loss of the kinematic .\nThe analysis of the PHODA harmfulness ratings indicated similar threat values for the a priori chosen item .\nNo reuse allowed without permission.\nNo significant correlations were found between the TSK-G and PHODA-total, PHODA-lift, PHODA-.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo significant relationships were found .\nRegarding the PHODA items, only the PHODA-falling score showed a statistically significant correlation .\nNo reuse allowed without permission.\neffects of pain-related fear on thoracic motion were observed.\nHowever, we only observed the above-mentioned relationship in the time-sensitive SPM .\nIn the current study, only the PHODA item showing a person falling backwards on the grass demonstrated .\nanalysis yielded segment-spanning relationships between the PHODA-falling scores and lumbar spine .\nNo reuse allowed without permission.\nA protective strategy might be beneficial .\nIndividuals scoring high on the PHODA-lift item seem to particularly stiffen the L4/L5 motion .\nHence, those individuals might be at risk for facilitation of degenerative processes .\nNo reuse allowed without permission.\nHowever, more recent studies do not support this notion.\nA recent systematic review concluded that the current advice to avoid lumbar flexion .\nThere are some limitations of the current study that need to be mentioned.\nneutral spine in everyday activities has been greatly exaggerated and might even have detrimental effects.\naffect lumbar segmental motion in pain-free adults.\nNo reuse allowed without permission.\nThis research was supported by the Swiss National Science Foundation (SNF, Bern, Switzerland).\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\nMulti-segmental thoracic spine kinematics measured dynamically .\nActive trunk stiffness increases with co-contraction.\npain is predicted by task-specific, but not by general measures of pain-related fear.\nNo reuse allowed without permission.\nComponents Contribute to the Recognition of Each Emotion.\nDynamic and static overloading induce early degenerative  processes in caprine lumbar intervertebral discs.\nNo reuse allowed without permission.\nNo reuse allowed without permission."}