{"title": "49.Relationship_between_psychological_factors_and.3.pdf", "contents": "In total, 52 studies (3949 participants) were included.\nThe pooled correlation coefficients (95% confidence interval; number of participants) were 20.\nThe results indicated that higher levels of pain-related fear, catastrophizing, and depression are significantly associated with reduced amplitudes of movement and larger muscle activity and were consistent across subgroup and moderation analyses.\nPain intensity did not significantly affect the association between these psychological factors and spinal motor behaviour and had a very small independent association with spinal motor behaviour.\nIn conclusion, the very small effect sizes found in the meta-analyses question the role of psychological factors as major causes of spinal movement avoidance in low back pain.\nExperimental studies with more specific and individualized measures of psychological factors, pain intensity, and spinal motor behaviour are recommended.\nLow back pain (LBP) is one of the main causes of disability worldwide, with severe socioeconomic burden.\nOn the physical side, previous research demonstrated that patients with LBP have altered spinal motor behaviour.\nSpecifically, participants with LBP show reduced spinal amplitude and velocity of movement compared with asymptomatic controls during daily life activities and maximal range-of-motion (ROM) tests.\nFor instance, studies have shown that people with LBP have reduced amplitude of lumbar flexion during sit-tostand, lifting tasks, or maximal flexion tests.\nFurthermore, biomechanical models of LBP have suggested that patients with LBP demonstrate higher trunk muscle activity, especially during dynamic tasks.\nAmong these measures of muscle activity, the flexionrelaxation ratio (FRR) was shown to be consistently higher in patients with LBP, showing an absence of the typical relaxation at the end of maximal flexion.\nAltogether, these observations indicate that patients with LBP tend to move with a more rigid spinal motor behaviour.\nOn the other side, pain intensity and disability have been shown to be influenced by psychological factors in LBP populations.\n18,21,67,96,132 Studies also indicated that these psychological factors can be mediators and moderators of treatment efficacy.\nRegarding the relationships, psychological factors were often suggested to be the causes of motor behaviour alterations as described by multiple models.\n4,7,28,65,117,124 One example is the fear avoidance model (FAM), which states that a threatening appraisal of pain can induce pain-related fear that can then lead to an avoidance behaviour and disability.\nSponsorships or competing interests that may be relevant to content are disclosed at the end of this article.\nSupplemental digital content is available for this article.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\navoidance behaviour is particularly expressed by reduced spinal amplitude and velocity of movement as well as higher trunk muscle activity.\nBecause the variability in findings among publications could be due to differences in study specificities, there is a need for a systematic review with a meta-analysis to synthetize the available data in the literature and clarify the relationship between pain-related fear and motor behaviour in LBP.\nAlthough a meta-analysis based on observational data cannot demonstrate causality, it could still provide information on the plausibility of such existence.\nFor instance, to be plausible, the size of the relationship should be large, the findings should be consistent across multiple settings and multiple measures, and pain-related fear should precede spinal motor behaviour alterations.\nAlthough the FAM presents pain-related fear as the main cause of movement avoidance, other models suggest that other psychological factors also play an important role in the motor behaviour alterations of patients with LBP.\nThis study aimed to perform a systematic review and metaanalysis of the literature to synthetize current knowledge regarding the associations between psychological factors and spinal motor behaviour in LBP in an effort to improve our understanding of the relationships between these elements.\nIt was hypothesized that higher levels of pain-related fear, catastrophizing, anxiety, and depression, as well as lower levels of self-efficacy, would be associated with more rigid spinal motor behaviours, characterized by reduced amplitude and velocity of movement and larger trunk muscle activity during dynamic tasks.\nWhen analysing the relationships between psychological factors and spinal motor behaviour, one should be mindful of pain intensity, which could confound the analysis.\nThis review was registered in PROSPERO (CRD42018088680), and the PRISMA principles were followed for its reporting.\n73 Studies on healthy participants with experimental LBP and individuals who recently recovered from LBP (in the past 3 months) were also included, as individuals who recently recovered from an acute LBP episode have been shown to continue to demonstrate spinal motor behaviour alterations and elevated pain-related fear scores.\nThese measures of spinal movement can be collected during maximal ROM tests (eg, maximal bending and fingertip-to-floor [FTF]) or functional activities (eg, lifting a box).\nMeasures of the amplitude of movement had to be described in degrees (eg, lumbar flexion angle) or in centimetres (eg, FTF or Schober tests) and measures of the velocity of movement in degree per second.\nStudies reporting the spinal amplitude of movement using the sit-and-reach test were excluded, as it primarily measures the hamstrings flexibility.\n80 Studies with muscle activity data had to report the level of activity of anterior or posterior trunk muscles or the FRR to be included.\nto be included studies had to have measured psychological factors and spinal motor behaviour on the same day.\nIn addition, to avoid statistical bias, only baseline measurement was used in longitudinal studies with multiple data collection episodes.\nThis criterion was used because temporal precedence is a compulsory condition to evaluate the plausibility of a causal relationship.\nWhen one or more correlation coefficients were not reported in the article, the authors of the possibly eligible studies were contacted to obtain the missing correlations.\nAll authors were contacted at least 3 times before excluding the study.\nFirst, PubMed, CINAHL, PsycINFO, Embase, OTseeker, and the Cochrane Central Register of Controlled Trials were searched from their inception until February 2018 for relevant articles.\nSearches were also made in the clinical registries of ClinicalTrials.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nFinally, a forward citation search for the selected articles was performed in the Web of Science.\nPublications were screened in 2 stages.\nDifferences were discussed until consensus was reached between the 2 authors.\nIn case of uncertainty, the publication was kept to the next stage.\nSecond, the 2 authors assessed the full text of the possibly eligible studies with the same criteria.\nThe results were compared between the 2 authors, and disagreements were resolved by consensus.\nIf necessary, a third author of this work was consulted (E.\nRisk of bias was assessed using an adapted version of the Quality in Prognostic Studies tool.\nIt evaluates the risk of bias of 6 different domains that may influence the analyses of interest in this study (see Supplementary Materials II, available as http://links.\nAny disagreement was resolved by consensus.\nAny inconsistencies were resolved together by the 2 authors.\nThe first information to be extracted was the study objective, coded as either a study conducted primarily to assess the relationship between psychological and spinal motor behaviour measures or a study whose primary objectives were not to assess this relationship.\nFor participant characteristics, the following data were extracted: study population (coded as chronic, subacute, and acute LBP, recovered, or healthy with induced LBP), age, disability, gender (% female), and body mass index.\nThe psychological measures, as well as the type of questionnaire used for the measurement, were also recorded.\nFor questionnaires assessing a single psychological construct, the total score was extracted (eg, total score of the Pain Anxiety Symptom Scale (PASS) for pain-related fear).\nWhen a questionnaire assessed different constructs (eg, Common Mental Disorders Questionnaire with the anxiety and depression subscales), only the data of the subscale of interest were extracted.\nFor the Fear-Avoidance Beliefs Questionnaire (FABQ), if the total score was not available, the Physical Activity subscale was used.\nFor spinal motor behaviour, the type of measurement (coded as amplitude of movement, velocity of movement, or muscle activity), the method of measurement, and the actual measures were extracted.\nIn addition, the direction of movement was recorded (coded as flexion, extension, or lateral flexion).\nPain intensity measures were also extracted, when available.\nThe tool used to measure pain intensity (eg, Numeric Pain Rating Scale or Visual Analog Scale) and the recall period (coded as during specific activity, current, past day, past week, or unknown) were recorded alongside.\nThe correlation coefficients between (1) psychological and spinal motor behaviour measures, (2) psychological and pain intensity measures, and (3) spinal motor behaviour and pain intensity measures, as well as the corresponding sample sizes (present in the publications or obtained after having contacted the authors), were recorded in the extraction tables.\nPearson and Spearman correlation coefficients were recorded without distinction.\nFirst, if a linear regression was available, the standardized beta coefficient was used instead of the correlation coefficient, as suggested by Peterson and Brown.\nStudies without explicit correlation coefficient reporting were rated with a high risk of bias and tested separately in sensitivity analyses.\nWhen necessary, the sign of the correlation coefficients was reversed to be consistent among studies and to always have negative correlations corresponding to an association between worse psychological measures (eg, higher pain-related fear) and worse spinal motor behaviour measures (eg, less amplitude or higher trunk muscle activity).\nTherefore, associations between higher levels of pain-related fear, catastrophizing, depression, anxiety, and a more rigid spinal motor behaviour (less spinal amplitude and higher trunk muscle activity) are demonstrated with negative correlations.\nNegative correlations also indicate an association between lower levels of self-efficacy and less spinal amplitude and higher trunk muscle activity.\nTo test our primary hypothesis, an overall meta-analysis for each psychological factor was performed, where results were averaged for studies measuring some characteristics in multiple ways.\nBased on the current literature, it was not possible to select a priori specific measures of spinal motor behaviour.\nTherefore, if a study included multiple measures for 1 psychological factor and/or spinal motor behaviour, the correlation coefficients were averaged across the multiple measures to yield to a single correlation coefficient.\n50 For instance, studies that had 1 motor behaviour measure but measured pain-related fear with 2 different questionnaires (eg, FABQ and Tampa Scale of Kinesiophobia) had their 2 correlation coefficients averaged.\nFor the overall meta-analyses, spinal motor behaviour measures from different types, movements, planes of motion, and regions of measurement were considered comparable, and the correlation coefficients obtained with these measures were averaged.\nIn addition to the overall meta-analyses, subgroup, moderation, and sensitivity analyses were conducted to determine the effect of the variations in measurement specificities and of averaging multiple measures from the same study.\nBefore performing the meta-analytic procedures, the correlation coefficients were transformed using a Fishers Z transformation.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\ninverse Fishers Z transformation was then used to calculate the pooled correlation coefficient resulting from themeta-analyses.\nThe meta-analyses were conducted using the random-effects model, as measurements differed among studies.\nAll the correlation coefficients were inspected visually in the forest plots to find influential cases and correctly interpret the results.\nModeration analyses were conducted with respect to age, gender, disability, study population, study objective, and psychological and motor behaviour measurements, using metaregression models.\nSensitivity analyses were conducted as well.\nFirst, we performed a sensitivity analysis to test the effect of selecting only flexion and FRR vs averaging them with other spinal behaviour measures, as these are particularly affected by pain and fear of movement.\nFurthermore, 3 sensitivity analyses were performed to evaluate the effect of excluding studies with a high risk of bias with respect to the Quality in Prognostic Study items of: study participation, outcome measurement, and statistical analysis.\nFinally, a sensitivity analysis was conducted to test the effect of excluding studies with unknown temporal precedence.\nFinally, a meta-analytic structural equation modelling was used to test the hypothesis that pain intensity is a confounder in the relationship between psychological factors and spinal motor behaviour.\nFifty-two studies, with 3949 participants, were included in this review (Fig.\nTwenty-eight of these studies (1923 participants) were conducted primarily to assess the relationship between psychological and spinal motor behaviour measures.\nAll studies focused on a single population, except 1 study that tested a group of patients with acute LBP and a group of patients with chronic LBP.\nThe most frequent source of bias in the included studies was the inclusion of participants with a history of surgery, as some spinal surgery might affect movement behaviour.\nstudies that did not mention this population characteristic were rated as moderate risk.\nIn addition, 6 studies were rated with a high risk of bias with respect to the study participation.\nThis rating was due to an inclusion restricted to participants with limited kinesiophobia,104 the study of healthy participants with induced back pain,116 the study of participants who recently recovered from an acute episode of back pain,113 the study of patients with CLBP who received noxious stimuli,41 and the study of participants who had a recent discectomy.\nThe risk of attrition was considered low in all studies because psychological factors and spinal motor behaviour were always measured within a short time window.\nThere was very limited risk of bias in the psychological factor measurement, as most of studies used reliable and validated questionnaires.\nTwenty-nine studies were rated as moderate risk of bias because no measure of pain intensity at the time of the psychological and motor behaviour measurements was available (eg, pain intensity was only measured as the average during the past week or information was missing).\nTwenty-five studies were rated as moderate risk of bias because they reported multiple measures for the same characteristics, and correlation coefficients had to be averaged for the metaanalyses.\nThis was due to an incomplete reporting of the correlation data,91,100,108 a reporting limited to the standardized beta,5 the use of partial correlations,57 and the necessity to calculate the effect size from group comparisons.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nactivity measures, velocity of movement measures were not entered in the overall meta-analyses.\nThe meta-analyses for pain-related fear indicated a pooled correlation coefficient of 20.\nThis analysis was based on 41 studies (2832 participants).\nTherefore, higher levels of catastrophizing were associated.\nThis meta-analysis included 13 studies (756 participants).\nThe pooled correlation coefficient for depression was 20.\nThis meta-analysis, based on 14 studies (1570 participants),10,30,52,74,81,84,86,87,92,100,109,127,137,138 demonstrated a low heterogeneity (I2 5 1%, Q statistic: P 5 0.\nThe meta-analysis for anxiety, which was based on 4 studies (336 participants),41,52,97,118 reported a large heterogeneity (I2 5 64%, Q statistic: P 5 0.\nThe pooled correlation coefficient was 20.\nTwo studies reported self-efficacy data (130 participants).\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nModeration and subgroup analyses could only be conducted for 3 psychological factors: pain-related fear (Table 1), catastrophizing (Table 2), and depression (Table 3).\nInsufficient data were available for anxiety and self-efficacy.\nThese elements were not significant moderators in the association between psychological factors and spinal motor behaviour.\nThis element was not a significant moderator in the association between psychological factors and spinal motor behaviour for catastrophizing and depression.\nBecause this result was largely due to one study with recovered LBP participants, we also performed a moderation analysis with only acute and chronic LBP.\nThe questionnaires used to measure catastrophizing and depression were not significant moderators in the association between psychological factors and spinal motor behaviour.\nSubgroup analyses reported pooled correlation coefficients for the PASS of 20.\nMeasuring spinal motor behaviour with spinal amplitudes or trunk muscle activity did not significantly moderate the results.\nNegative correlation means that a higher level of pain-related fear is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe diamond represents pooled effect estimates.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nreaching tasks and gait) did not have correlation coefficients statistically significantly different from studies assessing maximal ROM.\nSimilarly, the plane of motion was not a moderator, and no significant differences were found between studies measuring flexion, extension, or lateral flexion.\nFinally, the method used to measure spinal amplitudes of movement (eg, FTF, inclinometer, or marker-based measurement) was not a significant moderator.\nResults of all sensitivity analyses demonstrated similar results to the overall meta-analyses (Supplementary materials VI, available as http://links.\nAssociation between catastrophizing and spinal motor behaviour: The forest plot shows the association between catastrophizing and spinal motor behaviour.\nNegative association means that a higher level of catastrophizing is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe diamond represents pooled effect estimates.\nAssociation between depression and spinal motor behaviour: The forest plot shows the association between depression and spinal motor behaviour.\nNegative association means that a higher level of depression is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe diamond represents pooled effect estimates.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nThe effect of pain intensity on the association between psychological factors and spinal motor behaviour was tested separately for pain-related fear, catastrophizing, and depression using the same data set as for the overall meta-analyses.\nThe effect of pain intensity with respect to anxiety and self-efficacy was not tested, as insufficient data were available.\nAs reported in Figure 7, the pooled correlation coefficient between pain-related fear and spinal motor behaviour without the confounding effect of pain intensity was 20.\nSimilarly, the pooled correlation coefficients for catastrophizing and depression were only slightly reduced without the confounding effect of pain intensity.\nThis analysis also showed a small effect of pain intensity on spinal motor behaviour, with correlation coefficients ranging from 20.\nOn the other hand, the correlation between pain intensity and psychological factors was 0.\nAs hypothesized, pain-related fear and catastrophizing were found to be associated with a more rigid spinal motor behaviour (smaller spinal amplitude of movement and higher trunk muscle activity).\nTherefore, the present synthesis suggests that spinal motor behaviour alterations in patients with LBP have only a small relationship with pain-related fear and catastrophizing.\nHigher levels of depression were also associated with a more rigid spinal motor behaviour but to an even smaller extent than painrelated fear and catastrophizing.\nThis suggests that not all psychological factors have the same relationship with spinal motor behaviour.\nAssociation between anxiety and spinal motor behaviour: The forest plot shows the association between anxiety and spinal motor behaviour.\nNegative association means that a higher level of anxiety is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe diamond represents pooled effect estimates.\nNegative association means that a higher level of self-efficacy is associated with less spinal amplitude of movement and higher trunk muscle activity.\nThe black squares represent the correlation coefficient and the horizontal line the 95% confidence interval (also display in number on the right side of the image).\nThe diamond represents pooled effect estimates.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nAnxiety was not associated with spinal motor behaviour, but these results relied on only 4 studies with large heterogeneity.\nNevertheless, pain-related fear and anxiety are 2 concepts that frequently overlap in the FAM.\nAltogether, this suggests that anxiety might have a role in spinal movement avoidance in patients with LBP and warrants further research.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nUnfortunately, only 2 studies with opposite correlation coefficients were available for self-efficacy, and no conclusion could be drawn from the meta-analysis.\nThe meta-analytic structural equation modelling analyses showed that the association between pain-related fear, catastrophizing, and depression with spinal motor behaviour is independent from pain intensity.\nThis suggests that the effects of psychological factors are not confounded by pain intensity, therefore giving further support to our hypotheses.\nInterestingly, higher pain intensity was independently associated with less spinal amplitude and higher trunk muscle activity.\nAlthough pain intensity has often been considered as an important factor influencing movement,47 the effect sizes found in the meta-analyses were very small.\nTherefore, our results suggest that pain intensity is not a major cause of spinal motor alteration in patients with LBP.\nAlthough it was not the primary purpose of our review, to our knowledge, this is the largest metaanalyses testing the relationship between pain intensity and spinal motor behaviour.\nThese results suggest that psychological factors and pain intensity have an independent and direct effect on spinal motor behaviour.\nModeration and subgroup analyses demonstrated consistent effect sizes across a wide range of study specificities, thus strongly supporting the findings in the overall meta-analyses.\nFirst, individual characteristics, such as age, gender, body mass index, duration of LBP, and level of disability, did not moderate the result of the meta-analyses.\nInterestingly, this suggests that psychological factors influence spinal motor behaviour regardless of the stage of LBP and the level of disability.\nAdditional studies with acute LBP participants are required, and future meta-analyses should consider integrating disability in the analyses, as we did with pain intensity.\nSecond, different types of measures of spinal motor behaviour resulted in similar effect sizes.\nSubgroup analyses included only studies that tested the parameter noted in the first column.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nmovement measures produced similar effect sizes as the overall meta-analyses, and there were no differences when they were measured during flexion, extension, or lateral flexion.\nAlthough flexion is often described as the most feared movement by patients with LBP,8,24 our results did not indicate that pain-related fear has a larger relationship with spinal motor behaviour during flexion movements.\nFurthermore, the method of assessment of spinal amplitudes of movement did not influence the results of the meta-analyses.\nSpecifically, measuring spinal kinematics during functional activities or maximal ROM tests, locally at the lumbar spine or with measures that included the whole trunk and the hips, did not produce statistically different effect sizes.\nSome subgroup analyses suggested small differences yet without statistical significance.\nThird, the type of questionnaire did not significantly influence the results for catastrophizing and depression.\nThe moderation analysis was, however, significant for pain-related fear, with the PASS being the only questionnaire reporting a significantly larger effect size.\n113 The small differences reported in subgroup analyses between questionnaires assessing pain-related fear may be due to different constructs assessed by these questionnaires, such as beliefs about pain and movement, fear of pain, movement or activity, and avoidance of movements or activities.\nAlthough most of the study specificities did not influence the results of the meta-analyses, there were 2 interesting aspects that did influence the effect sizes.\nFirst, the study objective was a significant moderator in the pain-related fear meta-analysis, with studies that primarily assessed the association between psychological factors and spinal motor behaviour having larger effect sizes than studies that did not include this objective.\nResults for catastrophizing and depression were no more statistically significant when analysing only muscle activity measures.\nAlthough the FRR is usually considered as a more robust measure in patients with LBP,32,130 our results also demonstrated inconsistencies for this measure.\nPossible explanation for these inconsistent results may be related to the heterogeneity of the methods to measure trunk muscle activity, such as data normalization or the angle of spinal flexion, and is in agreement with previous observations of variability of muscle data.\n1,31,32,87,121,130 Overall, these findings suggest that measures of spinal amplitude are more consistently associated with psychological factors than measures of trunk muscle activity and may better reflect movement avoidance.\nThe small effect sizes found in the meta-analyses do not support that pain-related fear, catastrophizing, and depression are major causes of avoidance of spinal movement.\nBased on the Bradford Hill criteria,45 the strength of the association in observational studies should be high for a causal relationship to be plausible, which was not the case in our meta-analyses.\nFurthermore, temporal precedence was not guaranteed in most of the included studies, which is another criteria needed to determine the plausibility of a causal relationship.\nFinally, the only element supporting the plausibility of a causal relationship is the consistency of the findings among studies, indicated by the small heterogeneity in the meta-analyses and the consistent results across subgroup and moderation analyses.\nFirst, included studies measured pain-related fear mostly with general questionnaires.\n125,133 The lack of relationship between self-report questionnaires and physical tests may be due to the lack of specificity of these questionnaires for particular tasks.\n79 Clinicians should also tailor the assessment of pain-related fear and spinal motor behaviour to the individual,99 taking into account the movements that are feared, avoided, and painful.\nSecond, the avoidance of a specific movement might change depending on the context and the presence of competing goals.\n21 For instance, in studies assessing spinal kinematics during maximal ROM tests, fearful participants might have performed better than in daily living because they were following instructions.\nTherefore, future studies should use objective measures of spinal motor behaviour that can capture avoidance behaviours and not only movement capacity.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nTherefore, future studies should measure pain intensity at the same time as spinal motor behaviour and psychological factors.\nMeasuring pain with pain questionnaires could also provide additional information.\nAnother limitation is related to our broad inclusion criteria.\nAlthough studies with a high risk of bias in terms of population, motor behaviour measurement, or statistical analysis might have influenced the results, the sensitivity analyses demonstrated that the same general findings would have been obtained without these studies.\nThere were also limitations regarding data analysis.\nFirst, our moderation analyses for disability, age, and gender were performed with the mean characteristics of the study populations.\nTherefore, the effect of these variables was tested based on differences between studies but not based on individual differences.\nIt should be noted that the absence of a standard to measure motor behaviour in LBP not only required the averaging of data within studies but also contributed to a heterogeneity of data across studies.\nThis heterogeneity could also have attenuated the findings of this systematic review.\nThird, correlation analyses have limitations (eg, range restriction), which may have influenced the estimation of the pooled correlations.\nThe meta-analyses demonstrated consistently that higher levels of pain-related fear, catastrophizing, and depression are associated with less spinal amplitudes and higher trunk muscle activity in individuals with LBP.\nImportantly, the relationships were independent from pain intensity.\nIn addition, this review identified associations of very small effect sizes between higher pain intensity and reduced spinal amplitudes and increased trunk muscle activity.\nThese results suggest that future research should consider using specific and individualized measures of psychological factors, pain intensity, and spinal motor behaviour.\nThe authors have no conflicts of interest to declare.\nThe study was supported by a grant from the University of Applied Sciences and Arts Western Switzerland//HES-SO, Faculty of Health Science, and by the Profectus Foundation.\nFear of movement is not associated with objective and subjective physical activity levels in chronic nonspecific low back pain.\nChronic low back pain patients walk with locally altered spinal kinematics.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nSelf-efficacy is more important than fear of movement in mediating the relationship between pain and disability in chronic low back pain.\nLow-back pain patients learn to adapt motor behavior with adverse secondary consequences.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nPoor back muscle endurance is related to pain catastrophizing in patients with chronic low back pain.\nLumbar range of motion in chronic low back pain is predicted by task-specific, but not by general measures of pain-related fear.\nPain catastrophizing moderates changes in spinal control in response to noxiously induced low back pain.\nBiopsychosocial factors are associated with pain intensity, physical functioning and ability to work in female healthcare personnel with recurrent low back pain.\nPain-related fear is associated with avoidance of spinal motion during recovery from low back pain.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nPain-related fear predicts reduced spinal motion following experimental back injury.\nSelf-efficacy mediates the relation between pain-related fear and outcome in chronic low back pain patients.\nCopyright  2020 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited."}