{"title": "51.B.FA.s10865-005-9011-x.pdf", "contents": "In recent years, several studies have pointed out the importance of pain-related fear in the development and maintenance of chronic pain.\nAn important instrument for measuring painrelated fear in the context of low back pain is the Tampa Scale for Kinesiophobia (TSK).\nRecently, a version of this questionnaire has been developed for administration among the general population (TSK-G).\nTo determine the factor structure of the TSK-G, data from a random sample of the Dutch general population were studied separately for people who had had back complaints in the previous year, and people who had been without back complaints.\nFor both groups the TSK-G appeared to consist of one, internally consistent, factor of 12 items.\nThe one-factor TSK-G also appeared valid after comparison with scores on measures of catastrophizing and general health status.\n(1990), scientific attention for the concept of pain-related fear in relation to chronic pain has increased.\nSeveral studies have shown the relevance of fear-avoidance beliefs in this field (Lethem et al.\nThis model presents a possible pathway by which injured patients either become mired in a negative spiral leading to disability, or successfully recover.\nwho is convinced that his/her body is extremely vulnerable, weak, and must be carefully protected from overstrain) is likely to be fearful of movement/(re)injury when experiencing pain.\nThese fearful reactions are associated with increased muscular reactivity and avoidance, and in the long run they may lead to disuse, depression, and disability.\nOn the other hand, a patient who does not catastrophize about pain will be more likely to resume daily activities and recover successfully.\nHowever, from a prevention point of view it would be worthwhile to find out whether the fear of movement/(re)injury also occurs in the general population.\nIf this is the case, the more fearful people might be at greater risk of developing chronic low back pain, when confronted with a low back pain episode.\nResearch indeed showed that the presence of fear-avoidance beliefs about work in the acute state of low back pain predicted disability 4 weeks later (Fritz et al.\nIn addition, a study by Buer and Linton (2002) showed that fear-avoidance beliefs and pain catastrophizing already existed in the general population of nonpatients.\nBesides fear-avoidance beliefs in the general population, health care providers also tend to hold fear-avoidance beliefs.\n(1995b) conducted a principal component analysis with oblique rotation on all 17 items.\nFive items were excluded from the analysis because their factor loading was smaller than 0.\nAll four reversed key items were excluded because item analysis showed that these items had a weak association with the total TSK score (Clark et al.\nThe results showed that for both chronic low back pain patients and fibromyalgia patients, the two-factor model of Clark et al.\nMoreover, the two-factor model was found to be invariant across both patient groups, indicating that the model is robust in both the samples of patients with pain.\nThese findings were confirmed by Roelofs et al.\nUntil now, research with the TSK has been carried out only among patients with pain.\nAs mentioned before, from a prevention point of view it would be interesting to be able to measure painrelated fear in the general population.\nA first step before actually using the TSK-G in research would consist of testing it psychometrically, and comparing the results to those of the original TSK.\nFor this purpose, the current study uses data from a large Dutch community sample that completed several questionnaires for the Dutch population-based Musculoskeletal Complaints and Consequences Cohort study (DMC3-study) (Picavet et al.\nThe purpose of the current study was (1) to determine the factor structure of the TSK-G, (2) to determine the internal consistency of the TSK-G factors, and (3) to examine the validity of the TSK-G by comparing scores on the TSK-G with data gathered.\nAll participants were recruited through the DMC3-study, a nationwide study of the prevalence and course of musculoskeletal complaints in the Netherlands in 1998 and 1999 (Picavet et al.\nThe study consisted of two parts.\nFirst, a booklet of questionnaires was sent to a random sample of 8000 persons aged 25 and above, living in the Netherlands, stratified by 10 years age group and sex.\nThis sample was drawn from the Dutch population register of 1998.\nPeople who did not return the booklet received a maximum of two reminders (after 3 and after 6 weeks).\nIn total, 3664 persons returned the questionnaire.\nAs a part of this first booklet, people were also asked to state if they were willing to complete a follow-up questionnaire.\nThose who agreed received a second booklet 6 months after the first.\nFor the current study, data only from the first booklet were used.\nFurthermore, persons only between 25 and 65 years of age were included in the analyses.\nSubjects who had missing values on the TSK-G in the first booklet were excluded, leaving a total of 2240 persons with valid data.\nAnalyses were carried out separately for people with and without back complaints at the moment of completing the questionnaire or in the year before, because the presence of back pain is assumed to influence the results.\nThus, the sample consisted of 1029 persons with back complaints and 1211 persons without back complaints.\nThe booklet consisted of 28 pages in full color, with items regarding the presence of musculoskeletal complaints, consequences of these complaints, determinants, other physical complaints, and sociodemographic variables.\nFor these complaints, questions were asked about the duration, seriousness, and course.\nThe Pain Catastrophizing Scale (PCS) is a 13item questionnaire, in which patients reflect upon past experiences of pain and have to indicate on a 5-point scale (ranging from not at all to constantly) to which degree they experienced painrelated thoughts and feelings.\nA higher score on the PCS points towards a higher degree of pain catastrophizing cognitions.\nThe PCS has been found to be sufficiently reliable and valid (Severeijns et al.\nThe RAND-36 (Zee and Sanderman, 1993) was included in the booklet as a measure of general health status.\nIt is a short version of the RAND Health Insurance Study Questionnaire consisting of 36 items divided over 9 subscales: (1) physical functioning, (2) social functioning, (3) role restrictions due to physical problems, (4) role restrictions due to emotional problems, (5) mental health, (6) vitality, (7) pain, (8) perceived general health, and (9) perceived changes in health status.\nA higher score on these subscales denotes a better health status.\nThe RAND-36 bears close resemblance to the SF-36.\nThe TSK consists of 17 statements, which have to be rated on a 4-point scale ranging from strongly disagree to strongly agree.\nFor the TSK-G, items have been rephrased in such a way that people without low back pain can complete them.\nA higher score on the TSK-G reflects a higher degree of fear of movement/(re)injury.\nThe sample consisted of persons with and without low back complaints in the previous year.\nSince a recent experience with low back pain could influence scores on the TSK-G, it was decided to carry out the analyses for the people with and without complaints, separately.\nExploratory factor analysis was carried out with a Principal Axis Factor Analysis (PAF) with an oblique rotation, using SPSS 11.\nFactors were extracted until the Eigenvalue dropped below 1 or until the Eigenvalue hardly changed between two subsequent factors, visible as a levelling off in the Scree plot.\nIf an item loaded on more than one factor, the item was removed if the difference in loading was below 0.\nConfirmatory factor analysis was done by means of the LISREL 8.\nModifications were carried out until changes in Chi-square of the modifications dropped below 4, or until the NonNormed Fit Index (NNFI) reached the level of 0.\nThe first model and the final model were tested for identification (i.\nAn identified model should yield a perfect fit on all parameter estimates.\nInternal consistency was determined by calculating Cronbachs alpha.\nscores on these other variables could be predicted from scores on the TSK-G, when controlling for demographic variables, by means of regression analyses.\nAs described before, a total of 2240 persons were included in the analyses.\nMean age was 45.\n3% of the persons included were males.\nThe groups with and without low back complaints in the year prior to completing the questionnaire consisted of 1029 and 1211 persons, respectively.\nBefore starting with the exploratory factor analysis both samples were randomly split in half.\nFor the exploratory factor analysis a sample of 515 persons with low back complaints and 605 persons without low back complaints was available.\nBefore factor analysis, inter-item correlations were computed.\nThese showed that the four reversed key items (4, 8, 12, and 16) had generally low intercorrelations with the other TSK-G items.\nFurthermore, preliminary factor analyses with all 17 TSK-G-items showed that these four items were never included in factors with other items, but always formed separate factors by themselves.\n2004), and since feedback from clinical experience has also shown that patients find these reversed key items confusing, it was decided not to include them in any further analysis.\nA PAF with oblique rotation was carried out on the remaining 13 items for the samples of persons with and without low back complaints, separately.\nReasons for exclusion: A = Small inter-item correlations, B = Factor loading below 0.\nExamination of Eigenvalues in combination with the Scree plot pointed towards a one-factor solution.\nSubsequent factor analysis showed that item 11 had an insufficient factor loading.\nThe remaining 12 items made up one factor.\nTotal variance explained was 31.\nFactor analysis of the sample of persons without low back complaints followed the same pattern.\nA confirmatory factor analysis was carried out using the LISREL 8.\nSince the TSK-G-items are scored on a 4-point scale, and item scores are therefore not normally distributed, polychoric correlations were used as input instead of Pearson correlations.\nFor the sample of persons with low back complaints, results provided by LISREL showed that the one-factor model fitted reasonably to the data (Non-Normed Fit Index (NNFI) = 0.\nAfter adding an error covariance between items 13 and 14, the NNFI reached the level of 0.\nChi-square for this model was 161.\nNext, the same procedure was followed for the second half of the sample of persons without low back complaints.\nHowever, LISREL provided several suggestions for improvement through adding error covariances.\nThe NNFI reached the level of 0.\nBoth the first and final models were identified.\nTo determine the validity of the TSK-G, sumscores were compared to scores on measures of pain catastrophizing and selected subscales of general health status.\nAs a measure of pain catastrophizing a sumscore on the PCS was calculated.\nSince both samples with and without low back pain showed the same factor structure, it was decided to join both samples and carry out the following analyses on the group as a whole.\nHowever, in the regression analyses, having low back pain or not was added as a covariate.\nOther covariates in the regression analyses were gender and age.\nPearson correlations are shown in Table II.\nAs can be seen, a higher degree of pain-related fear is associated with a higher degree of pain catastrophizing and lower general health status.\nRegression analyses show that TSK-G-score is a significant predictor in all cases and even the strongest predictor when it comes to pain catastrophizing, physical and social functioning, and perceived general health.\nSimilar to previous psychometric research with the TSK, it appears that the four reversed key items of the TSK-G provide problems for persons completing the questionnaire.\nIt was therefore decided to remove these four items from further analysis.\nThe content of these four items does seem relevant upon the first glance.\nFrom the remaining 13 items of the TSK-G, only one was excluded during exploratory factor analysis because of a factor loading that was too low.\nIn the adapted item from the TSK-G, less emphasis is put on the potential threat of something being wrong with the back.\nThus, it might be that this item taps less into the concept of pain-related fear, and because of this is excluded from factor analysis.\nFurthermore, the TSK-G item contains a double negation, which can be confusing for the person completing the scale.\nSumming up, exploratory factor analysis showed that the TSK-G consists of one factor, made up out of 12 items, and this structure was the same for people with and without low back complaints in the year before completing the questionnaire.\nInternal consistency (Cronbachs alpha) was 0.\nConfirmatory factor analysis on the second half of the sample of persons with and without low back complaints showed similar results to the exploratory analysis.\nFor the persons with low back complaints an adequately fitting model was found with the addition of one error covariance.\nFor the people without low back complaints, four error covariances were added before the model fitted sufficiently.\nThe addition of several covariances might be an indication that the factor structure needs adaptation, since it shows that there is variance unexplained by the proposed model.\nThis is especially necessary if these covariances show a distinct pattern.\nHowever, no pattern was observed in this case.\nPearson correlation coefficients showed that a higher degree of painrelated fear was associated with a higher degree of catastrophizing cognitions and poorer health as measured on the subscales of the RAND-36.\nThe magnitude of the correlations is not really high, but scores are not compared to a gold standard but to measures of concepts that are expected to be related.\nRegression analyses also showed TSK-G scores to be consistently associated with scores on pain catastrophizing and general health as measured by the RAND-36 subscales.\nIt was the strongest predictor with regard to pain catastrophizing, physical and social functioning, and perceived general health, when controlling for age, gender, and whether or not a person had had back complaints during the last year.\nUntil now, only a few studies with the TSK-G have been carried out.\n(2002) used the data from the DMC3-study to determine whether future back complaints could be predicted from scores on the TSK-G.\nAll 17 items were used to calculate a sumscore, which was predictive of low back pain and disability measured with the follow-up questionnaire of the DMC3-study (Picavet et al.\nPatients completed the regular TSK, whereas healthy controls completed the TSK-G.\nAlthough not very likely, it is possible that the results would have been different if the conclusions of the current study had been known.\nSeveral studies have shown low back pain to be a medical, social, and economical problem (Waddell, 1998).\nAttention of clinicians has therefore shifted towards prevention of chronicity.\nThe TSK-G can be useful in determining people at risk for developing chronic back complaints.\nThe current study gives preliminary data with regard to the TSK-G.\nMore extensive data are needed on the predictive value of the (one factor; 12 item) TSK-G for developing (chronic) low back complaints.\nScores on the TSK-G were normally distributed, were similar for people with and without low back complaints, and varied almost along the full range of the scale.\nCut-off points on the 12-item TSK-G (with 17-item TSK-G scores between parentheses) based on the 2240 people included in the current study would be 21 (32) points for a median-split.\nFor the use of this method, prospective data are needed on TSK-G scores and whether or not people have developed chronic low back pain.\nBy making a graph of true positives versus false positives for several cut-off points, the optimal cutoff point can be determined.\nThis method could not be used in the current study, since no data were available on the development of chronic low back pain.\nIt might be expected that this is the case, since the TSK-G is merely an adaptation of the items from the TSK, and so the scale can be administered to people without complaints.\nHowever, it needs to be studied first whether scores gathered on the TSK-G are still useful as a measure of painrelated fear when a person has developed low back complaints, or if the regular TSK should then be administered.\nIn conclusion, the factor structure of the TSK-G appears to be similar for people with and without low back complaints.\nThe TSK-G consists of one internally consistent factor, made up of 12 items.\nThe other item that was excluded during factor analysis might still be used in the questionnaire, if it is phrased differently.\nHowever, both adaptations will require the TSK-G to be psychometrically studied again.\nPreliminary examination of the validity also points in the expected direction.\nHigh TSK scores predict pain catastrophizing, pain intensity, and pain-related health indices, even when controlling for the presence of low back pain.\nIt is recommended to use TSK-G as a measure of pain-related fear in general population studies.\nThe authors thank the National Institute for Public Health and the Environment for kindly providing the data for this study."}