{"title": "54.FA.ENEURO.0107-18.2018.full.pdf", "contents": "Abstract Fear of pain demonstrates significant prognostic value regarding the development of persistent musculoskeletal pain and disability.\nIts assessment often relies on self-report measures of pain-related fear by a variety of questionnaires.\nFurthermore, the relationship of pain-related fear to other anxiety measures such as state or trait anxiety remains ambiguous.\nWe applied a pattern regression approach in 20 human patients with nonspecific chronic low back pain to reveal predictive relationships between fear-related neural pattern information and different pain-related fear questionnaires.\nMore specifically, the applied multiple kernel learning approach allowed the generation of models to predict the questionnaire scores based on a hierarchical ranking of fear-related neural patterns induced by viewing videos of activities potentially harmful for the back.\nWe sought to find evidence for or against overlapping pain-related fear constructs by comparing the questionnaire prediction models according to their predictive abilities and associated neural contributors.\nThis neuroscientific approach might ultimately help to further understand and dissect psychological pain-related fear constructs.\nThe authors declare no competing financial interests.\nPain-related fear, often assessed through self-reports such as questionnaires, has shown prognostic value and clinical utility for a variety of musculoskeletal pain disorders.\nThe current study describes a novel neuroscientific approach using machine learning of neural patterns within the fear circuit of chronic low back pain patients that has the potential to identify neural commonalities or differences among the various constructs.\nFor the assessment of PRF, various questionnaires exist based on potentially different constructs such as fear of movement/injury and reinjury/kinesiophobia, fear avoidance beliefs, or pain anxiety.\n, 2011; Kreddig and Hasenbring, 2017), brain research provides evidence for a functional differentiation of fear and anxiety.\nTherefore, advances in neuroimaging enable exploring the subcortical/cortical contributions to PRF constructs by examining interrelations between self-reported emotional states and brain response patterns.\nSpecifically, machine learning techniques such as multivariate pattern analysis (MVPA) applied to functional magnetic resonance imaging (fMRI) data make it possible to directly study the predictive relationship between a contentselective cognitive or emotional state (expressed as a label) and corresponding multivoxel fMRI activity patterns (Haynes, 2015; Hebart and Baker, 2017).\nTherefore, we provoked PRF by presenting video clips of daily activities including bending and lifting (harmful condition) and harmless activities such as walking (harmless condition) in a sample of 20 patients with nonspecific chronic LBP.\nWe applied a pattern regression analysis in combination with multiple kernel learning (MKL) to assess potential neural predictors of the various PRF constructs based on the weighting of (1) harmful and harmless conditions (condition weights) and (2) pattern information within subcortical and cortical fear-processing regions (region weights).\nWe first contrasted the different PRF questionnaires in terms of their model performance, namely the ability of the model to predict the questionnaire scores based on brain response patterns across fear-processing regions.\nIf the PRF questionnaires share overlapping PRF constructs, then the region weights should be similarly distributed across fear-processing regions.\nPatients The study was approved by the Ethics Committee Zurich (Switzerland), and all patients provided written informed consent before participation.\nThe study was conducted in accordance with the Declaration of Helsinki.\nPatients were recruited via local chiropractic and physiotherapy centers as well as via on-line advertisements.\nInclusion criteria were low back pain of at least 6 months duration and age between 18 and 65 years.\nSelf-report measures of pain-related fear PRF was assessed using several questionnaires: (1) The Tampa Scale of Kinesiophobia (TSK) questionnaire (Kori et al.\nWe also thank Sergio Maffioletti from S3IT (University of Zurich, Zurich, Switzerland) for technical support regarding the supercomputing environment.\nDue to additional versions of the original 17-item TSK questionnaire, we also calculated the questionnaire scores of the 13and 11-item TSK versions (TSK-13, TSK-11).\n(3) The short version of the pain anxiety symptoms scale (PASS-20) assesses fear and anxiety responses related to pain including cognitive, physiologic, and motor response domains (McCracken and Dhingra, 2002).\nItems on the PASS-20 are measured on a 6-point Likert scale.\nand relate to four different subscales, including cognitive anxiety (PASS-C), fear (PASS-F), physiology (PASS-P), and escape/avoidance (PASS-E; Roelofs et al.\nThe German version of the PASS-20 has an internal consistency of   0.\nFurthermore, patients were asked to fill out the painDETECT questionnaire, which includes three 11-point numeric rating scales, with 0 being no pain and 10 being the worst imaginable pain to assess current pain, strongest, and average pain intensity in the previous 4 weeks (Freynhagen et al.\nFinally, to investigate potential differences or shared variance between PRF and general anxiety, we used the State-Trait Anxiety Inventory (STAI), the most widely used self-report measure of anxiety, which includes two subscales (Spielberger and Gorsuch, 1983; Julian, 2011): the State Anxiety Scale (S-Anxiety) assesses current levels of anxiety, whereas the Trait Anxiety Scale (T-Anxiety) evaluates more stable aspects of anxiety such as anxiety proneness (Julian, 2011).\nAll questionnaires were administered at the fMRI appointment before brain scanning.\nEach imaging session started with a survey scan, a B1 calibration scan (for MultiTransmit), and a SENSE reference scan.\nHigh-resolution anatomic data were obtained with a 3D T1-weighted (T1w) turbo field echo scan.\nFunctional time series were acquired using whole-brain gradient-echo echoplanar imaging sequences (365 volumes), consisting of 37 slices in the axial direction (anterior commissureposterior commissure angulation) with the following parameters: FOV  240  240 mm2; acquisition matrix  96  96; slice thickness  2.\nFurthermore, we created video clips of three activities rated as less harmful, such as walking up and down the stairs and walking on even ground (harmless condition).\nPresentation software (Neurobehavioral Systems) was used to present the video clips in a pseudorandomized order (no more than two identical consecutive trials).\nThe patients were asked to carefully observe the video clips, which were displayed using MRcompatible goggles (Resonance Technology).\nThe three harmful and harmless activities were each presented five times (30 trials total).\nAfter the observation of each video clip, the patients were asked to rate the perceived harmfulness of the activity on a visual analog scale (VAS) anchored with the endpoints not harmful at all (0) and extremely harmful (10).\nAll ratings were performed using an MR-compatible track ball (Current Designs).\nEach T1w volume was skullstripped using antsBrainExtraction.\nThe skullstripped T1w volume was coregistered to the skullstripped ICBM 152 Nonlinear Asymmetrical MNI template version 2009c using nonlinear transformation implemented in ANTs version 2.\nFunctional data were slice time corrected using AFNI (Cox, 1996) and motion corrected using MCFLIRT version 5.\nMotion-correcting transformations, T1w transformation, and MNI template warp were applied in a single step using antsApplyTransformations version 2.\nThree tissue classes were extracted from T1w images using FSL FAST version 5.\nIndependent component analysis-based automatic removal of motion artifacts (AROMA) was used to generate aggressive motion-related noise regressors.\nFor each patient, a design matrix was built with separate regressors for the harmful and harmless activities, respectively (15 harmful and 15 harmless stimuli).\nA high-pass filter with a cutoff of 128 s was used to remove low-frequency noise.\nFinally, for each patient, voxelwise  images for each condition were computed and served as the input images for the MVPA.\nA pattern of activity can represent many more different states than each voxel individually, which leads to an information-based view compared with the activation-based view of univariate analyses (Hebart and Baker, 2017).\nMVPA was performed using routines implemented in PRoNTo version 2.\nFor the readout of multivariate neural information that might serve as a potential score estimator of the different PRF questionnaires, we applied a newly introduced pattern regression approach based on supervised machine learning and testing phases using MKL.\nThis approach allows determination of the contribution of each brain region (region weights) and condition (condition weights) to the final decision function of the model in a hierarchical manner by simultaneously learning and combining the different linear kernels that are based on support vector machines (SVMs; Rakotomamonjy et al.\nCompared with conventional MVPA methods based on whole-brain voxel weight maps, this procedure provides a straightforward approach to draw inferences on the region level without the need for multiple comparison correction (Schrouff et al.\nTo account for possible differential contributions of the harmful and harmless conditions to the decision function, we included the individual SPM  images of each condition as separate modalities in the MKL model (condition weights).\nFurthermore, we trained MKL regression models based on the harmfulness ratings collected during the fMRI measurements (mean ratings of the harmful condition and harmless condition, respectively).\nTo reduce the risk of overfitting for each model, we applied a nested cross-validation procedure using a leave-one-subject-out cross-validation scheme to train the model including optimization of the model hyperparameter C (range, [0.\nAs a note, by controlling the expected proportion of false-positives, FDRcontrolling procedures provide less stringent control of type I errors compared with other procedures, such as the Bonferroni correction, which control the probability of at least one type I error.\nFeature selection To further reduce the risk of overfitting and based on a priori knowledge of brain regions involved in fear processing, we limited the feature space to bilateral fear-related brain regions including the amygdala, hippocampus, thalamus, anterior cingulate, insula, and medial prefrontal, and orbitofrontal cortices (Meier et al.\nBrainSuite was also used to generate surfaces of the selected AAL regions for visualization.\nUnlike in conventional correlation analysis, however, a negative correlation would indicate poor performance.\nFurthermore, for each model, we report the nMSE because the different questionnaires are based on different score ranges.\nTo explore possible differential contributions of fear-related brain regions to the prediction models, we report the contribution rank of each brain region (region weight) within each condition (condition weight) provided by the MKL approach (see Table 5).\nImportantly, the selection of regions by the MKL model might be influenced by small variations in the dataset (because of the leave-one-subject-out cross-validation) and might therefore lead to different subsets of regions being selected across cross-validation steps (folds).\nProviding a quantification of this variability, the expected ranking (ER; see Table 5) characterizes the stability of the region ranking across folds, as follows: The closer the ER to the ranking of the selected fold, the more consistent is the ranking of the respective brain region across folds.\nOn the other hand, if the ER is different from the ranking, this means that the ranking might be variable across folds.\nRatings, questionnaire scores, and correlations Importantly, the comparison of the ratings during fMRI measurements demonstrated that the potentially harmful activities were perceived as being significantly more harmful compared with the harmless activities (paired t test: T  8.\nDescriptive statistics of the different questionnaires as well as the age and sex of the patients are summarized in Table 1.\n032) models demonstrated a significant decoding performance.\nThe decoding performances of the FABQ models (FABQ and FABQ-W) were driven by a major contribution of the harmful condition (88% and 87%, respectively).\nWithin this condition, the left thalamus (rank 1), the right amygdala (rank 2) and the left hippocampus (rank 3) contributed 69% of the total region weights in the FABQ model (Table 5, section A, Fig.\nIn both FABQ models, the right amygdala also demonstrated an association with the harmless con-.\nIn comparison, the TSK models demonstrated a moderate contribution of the harmful condition (TSK-13, 60%; TSK11, 66%).\nCurrent research suggests a functional differentiation characterized by subcortical regions processing fast fear responses to an imminent threat (defensive responses) and cortical systems processing complex cognitions related to fear and anxiety where the threat is distal in space or time (LeDoux and Pine, 2016; Qi et al.\nBrain regions (feature set) were identified as follows: thalamus (1); hippocampus (2); amygdala (3); insula (4); mOFC: rectus (5), Frontal_Sup_Orb (6), Frontal_Med_Orb (7); lOFC: Frontal_Mid_Orb (8), Frontal_Inf_Orb (9), mPFC: Frontal_Sup_Medial (10); anterior cingulate cortex: Cingulum_Ant (11).\nThe current MVPA approach using MKL demonstrated the feasibility to neuronally dissect the proposed constructs of PRF self-reports based on their subcortical/ cortical predictors during PRF-related brain activity.\nThe results revealed that while the variability across individuals of some questionnaires, specifically the FABQ and FABQ-W, TSK-13, TSK-11, and T-Anxiety scales, was predictable from response patterns in fear-related, dissociable neural sources on subcortical and cortical levels, this was not the case for the FABQ-PA, the TSK-11 subscales (TSK-11-AA and TSK-SF), the PASSs, and the S-Anxiety scale.\nFurthermore, the on-line ratings of perceived harmfulness were not decodable from fear-related brain response patterns.\nFABQ and TSK The FABQ and FABQ-W scales demonstrated the best model performances among the investigated PRF questionnaires, which were characterized by a strong contribution of neural information in the harmful condition (condition weights, 88% and 87%, respectively).\nInterestingly, the FABQ-PA scale did not show a predictive association with fear-related brain response patterns.\nIn support of this, the FABQ-W scale qualified for a clinical prediction rule regarding improvement after spinal manipulation, whereas the FABQ-PA scale did not (Flynn et al.\nWith respect to the region weights, the FABQ models were mainly driven by subcortical neural contributions involving the thalamus, hippocampus, and the amygdala, while frontal brain regions played a minor role.\nHowever, it has been shown recently that parts of dorsal midline thalamic structures are necessary for fear memory processing by directly targeting the hippocampus, which plays an important role for context-dependent emotional memory (Penzo et al.\nHowever, the heterogeneous structure consisting of several nuclei is not essential for the experience of fear, which has been demonstrated in patients with amygdala lesions (Anderson and Phelps, 2002; Feinstein et al.\nA recent opinion article (LeDoux and Hofmann, 2018) suggested that subjective feelings of fear and anxiety do not initially arise from subcortical activity of the fear circuit centered around the amygdala.\nThus, amygdala activity and mediated physiologic responses of fear and anxiety might be, at its best, only a correlate of subjective feelings of fear and anxiety (LeDoux and Hofmann, 2018).\nAmong the TSK scales, the TSK-13 and the TSK-11 demonstrated a predictive association with fear-related brain response patterns, albeit with less contribution of the harmful condition compared with the FABQ scales (TSK-13, 60%; TSK-11, 66%).\nThis result might reflect the progress of previous research regarding the psychometric properties of the different TSK versions.\nInterestingly, no predictive association could be learned by MKL using the TSK-11 subscale labels (TSK-11-SF and TSK-11-AA scores).\nAlthough these two lower-order factors (activity avoidance and somatic focus) are reflective of the higher-order construct fear of movement and (re)injury/kinesiophobia, the nonsignificant result might indicate that they are associated with inconsistent neural patterns across individuals.\nRegarding the region weights of the TSK models, the right lOFC provided the most predictive information for the two TSK scales (TSK-13, 52%; TSK-11, 60%).\nInterestingly, the higher cortical contributions of the TSK models were clearly dissociable from the largely subcortical contributions involving the amygdala, hippocampus, and thalamus that predicted the FABQ scores.\nTo conclude, the FABQ scales demonstrated high PRF sensitivity (harmful condition weights  87%) and were linked to subcortical predictors that have been associated with fear responses to an imminent threat and defensive behavior (McNaughton and Corr, 2004; LeDoux and Pine, 2016).\nThere may be several explanations.\nFirst, although the FABQ and the TSK have been specifically developed for patients with musculoskeletal pain, the PASS is suitable for various pain phenotypes (Crombez et al.\nThe superiority of the FABQ scale (driven by the FABQ-W) in decoding performance compared with the TSK and PASSs might also be influenced by the backspecific items of the FABQ in conjunction with the nature of the PRF-provoking stimuli (back-straining movements).\nNevertheless, the FABQ has also been adapted to shoulder pain, where it demonstrated better factor structure and a stronger association with disability compared with the TSK-11 (Mintken et al.\nHowever, fear responses specifically related to a patients pain and/or potentially painful movements might be more relevant for explaining disability in chronic LBP than general trait anxiety responses (McCracken et al.\nThe current results are in line with this notion.\nFirst, most of the PRF measures did not show a significant relationship with state or trait anxiety.\nThis suggests that the trait anxiety measure is associated with neural content irrespective of the harmfulness of a stimulus, provoked by, for example, enhanced attention to visual information processed in fear-related brain regions; Berggren et al.\nIt might further indicate that the T-Anxiety scale captures neural responses that are associated with a more generalized fear response.\nThis is in line with the proposed functional differentiation of neural structures regarding fear in response to an imminent threat (defensive response) and cognitive fear/ anxiety (distal, uncertain threat) whereas the latter involves more rostral cortical structures such as the mPFC and mOFC (McNaughton and Corr, 2004; LeDoux and Pine, 2016).\nMoreover, research on self-report measurements indicates that trait anxiety is relatively distinct from tissue damage fear, which supports a behavioral and neural dissociation of trait anxiety and PRF (Cooper et al.\nHarmfulness ratings Interestingly, although the PRF-provoking harmful activities were rated as significantly more harmful compared with the harmless activities, the ratings of perceived harmfulness during fMRI measurements were not decodable from fear-related brain response patterns.\nThe weak relationships between ratings of perceived harmfulness and self-report measures of PRF might be explained by the specificity of the potentially harmful movements depicted by the PHODA items.\nNamely, the ratings of perceived harmfulness were specifically related to back-straining movements such as bending and lifting, while the PRF measures might also be associated with other potentially harmful movements.\nIdeally, the predictive model should be trained and tested with completely independent data.\nFor these reasons, the differences of the prediction models are unlikely to be caused by the small sample size.\nA further limitation is related to the sparsity approach (L1 regularization) of the MKL algorithm currently implemented in PRoNTo, which does not select brain regions with highly correlated neural information.\nFinally, the study design only allows interpretations of PRF to back-straining movements and LBP.\nTherefore, conclusions related to other musculoskeletal conditions should be drawn with caution.\nThe FABQ scales demonstrated strong predictive power with high sensitivity to the harmful condition and were associated with subcortical fear-processing regions (amygdala, thalamus, hippocampus).\nThe TSKs were more related to neural response patterns of the OFC, potentially indicating that the construct of kinesiophobia is more related to higher-order brain structures associated with anxiety, while the FABQ scales are more related to subcortical defensive responses to fear.\nThe PASS and its subscales failed to demonstrate a predictive association with fear-related brain response patterns.\nFrom a clinical point of view, it might indicate that the various PRF questionnaires, although often correlating, indeed measure different fear phenotypes related to pain.\nTherefore, the results emphasize the need to carefully consider the different PRF questionnaires in research and clinical settings as their constructs do not appear to be interchangeable.\nAnderson AK, Phelps EA (2002) Is the human amygdala critical for the subjective experience of emotion? Evidence of intact dispositional affect in patients with amygdala lesions.\nAue T, Hoeppli M-E, Piguet C, Hofstetter C, Rieger SW, Vuilleumier P (2015) Brain systems underlying encounter expectancy bias in spider phobia.\nAvants BB, Epstein CL, Grossman M, Gee JC (2008) Symmetric diffeomorphic image registration with cross-correlation: evaluating automated labeling of elderly and neurodegenerative brain.\nBarke A, Preis MA, Schmidt-Samoa C, Baudewig J, Krner-Herwig B, Dechent P (2016) Neural correlates differ in high and low fear-avoidant chronic low back pain patients when imagining back-straining movements.\nBehzadi Y, Restom K, Liau J, Liu TT (2007) A component based noise correction method (CompCor) for BOLD and perfusion based fMRI.\nd, Demanet J, Yuen KSL, Kalisch R, Brass M (2017) Pattern analyses reveal separate experience-based fear memories in the human right amygdala.\nCaneiro JP, OSullivan P, Smith A, Moseley GL, Lipp OV (2017) Implicit evaluations and physiological threat responses in people with persistent low back pain and fear of bending.\nCooper AJ, Perkins AM, Corr PJ (2007) A confirmatory factor analytic study of anxiety, fear and behavioral inhibition system measures.\nCrombez G, Vlaeyen JW, Heuts PH, Lysens R (1999) Pain-related fear is more disabling than pain itself: evidence on the role of pain-related fear in chronic back pain disability.\nDilger S, Straube T, Mentzel H-J, Fitzek C, Reichenbach JR, Hecht H, Krieschel S, Gutberlet I, Miltner WHR (2003) Brain activation to phobia-related pictures in spider phobic humans: an event-related functional magnetic resonance imaging study.\nDougherty PE, Karuza J, Savino D, Katz P (2014) Evaluation of a modified clinical prediction rule for use with spinal manipulative therapy in patients with chronic low back pain: a randomized clinical trial.\nFeinstein JS, Buzza C, Hurlemann R, Follmer RL, Dahdaleh NS, Coryell WH, Welsh MJ, Tranel D, Wemmie JA (2013) Fear and panic in humans with bilateral amygdala damage.\nFernandes O, Portugal LCL, Alves RCS, Arruda-Sanchez T, Rao A, Volchan E, Pereira M, Oliveira L, Mourao-Miranda J (2017) Decoding negative affect personality trait from patterns of brain activation to threat stimuli.\nFlynn T, Fritz J, Whitman J, Wainner R, Magel J, Rendeiro D, Butler B, Garber M, Allison S (2002) A clinical prediction rule for classifying patients with low back pain who demonstrate short-term improvement with spinal manipulation.\nFreynhagen R, Baron R, Gockel U, Tlle TR (2006) painDETECT: a new screening questionnaire to identify neuropathic components in patients with back pain.\nGeorge SZ, Bialosky JE, Donald DA (2005) The centralization phenomenon and fear-avoidance beliefs as prognostic factors for acute low back pain: a preliminary investigation involving patients classified for specific exercise.\nGeorge SZ, Fritz JM, Childs JD (2008) Investigation of elevated fear-avoidance beliefs for patients with low back pain: a secondary analysis involving patients enrolled in physical therapy clinical trials.\nGlombiewski JA, Riecke J, Holzapfel S, Rief W, Knig S, Lachnit H, Seifart U (2015) Do patients with chronic pain show autonomic arousal when confronted with feared movements? An experimental investigation of the fear-avoidance model.\nGoubert L, Crombez G, van Damme S, Vlaeyen JWS, Bijttebier P, Roelofs J (2004) Confirmatory factor analysis of the Tampa Scale for Kinesiophobia: invariant two-factor model across low back pain patients and fibromyalgia patients.\nHahn A, Stein P, Windischberger C, Weissenbacher A, Spindelegger C, Moser E, Kasper S, Lanzenberger R (2011) Reduced restingstate functional connectivity between amygdala and orbitofrontal cortex in social anxiety disorder.\nHebart MN, Baker CI (2017) Deconstructing multivariate decoding for the study of brain function.\nIvanescu AE, Li P, George B, Brown AW, Keith SW, Raju D, Allison DB (2016) The importance of prediction model validation and assessment in obesity and nutrition research.\nJenkinson M, Bannister P, Brady M, Smith S (2002) Improved optimization for the robust and accurate linear registration and motion correction of brain images.\nKreddig N, Hasenbring MI (2017) Pain anxiety and fear of (re)injury in patients with chronic back pain: sex as a moderator.\nKreddig N, Rusu AC, Burkhardt K, Hasenbring MI (2015) The German PASS-20 in patients with low back pain: new aspects of convergent, divergent, and criterion-related validity.\nLara-Vsquez A, Espinosa N, Durn E, Stockle M, Fuentealba P (2016) Midline thalamic neurons are differentially engaged during hippocampus network oscillations.\nLeeuw M, Goossens MEJB, van Breukelen GJP, Boersma K, Vlaeyen JWS (2007a) Measuring perceived harmfulness of physical activities in patients with chronic low back pain: the Photograph Series of Daily Activitiesshort electronic version.\nLeeuw M, Peters ML, Wiers RW, Vlaeyen JWS (2007c) Measuring fear of movement/(re)injury in chronic low back pain using implicit measures.\nLundberg M, Grimby-Ekman A, Verbunt J, Simmonds MJ (2011) Pain-related fear: a critical review of the related measures.\nMarshall PWM, Schabrun S, Knox MF (2017) Physical activity and the mediating effect of fear, depression, anxiety, and catastrophizing on pain related disability in people with chronic low back pain.\nMcCracken LM, Gross RT, Aikens J, Carnrike CL (1996) The assessment of anxiety and fear in persons with chronic pain: a comparison of instruments.\nMeier ML, Matos Nmp d, Brgger M, Ettlin DA, Lukic N, Cheetham M, Jncke L, Lutz K (2014) Equal pain-unequal fear response: enhanced susceptibility of tooth pain to fear conditioning.\nMeier ML, Stmpfli P, Humphreys BK, Vrana A, Seifritz E, Schweinhardt P (2017) The impact of pain-related fear on neural pathways of pain modulation in chronic low back pain.\nMintken PE, Cleland JA, Whitman JM, George SZ (2010) Psychometric properties of the Fear-Avoidance Beliefs Questionnaire and Tampa Scale of Kinesiophobia in patients with shoulder pain.\nNeblett R, Hartzell MM, Mayer TG, Bradford EM, Gatchel RJ (2016) Establishing clinically meaningful severity levels for the Tampa Scale for Kinesiophobia (TSK-13).\nPenzo MA, Robert V, Tucciarone J, Bundel D, de Wang M, van Aelst L, Darvas M, Parada LF, Palmiter RD, He M, Huang ZJ, Li B (2015) The paraventricular thalamus controls a central amygdala fear circuit.\nPerkins AM, Kemp SE, Corr PJ (2007) Fear and anxiety as separable emotions: an investigation of the revised reinforcement sensitivity theory of personality.\nPfingsten M, Krner-Herwig B, Leibing E, Kronshage U, Hildebrandt J (2000) Validation of the German version of the Fear-Avoidance Beliefs Questionnaire (FABQ).\nPruim RHR, Mennes M, van Rooij D, Llera A, Buitelaar JK, Beckmann CF (2015) ICA-AROMA: a robust ICA-based strategy for removing motion artifacts from fMRI data.\nQi S, Hassabis D, Sun J, Guo F, Daw N, Mobbs D (2018) How cognitive and reactive fear circuits optimize escape decisions in humans.\nRoelofs J, McCracken L, Peters ML, Crombez G, van Breukelen G, Vlaeyen JW (2004b) Psychometric evaluation of the Pain Anxiety Symptoms Scale (PASS) in chronic pain patients.\nRoelofs J, Sluiter JK, Frings-Dresen MHW, Goossens M, Thibault P, Boersma K, Vlaeyen JWS (2007) Fear of movement and (re)injury in chronic musculoskeletal pain: evidence for an invariant two-factor model of the Tampa Scale for Kinesiophobia across pain diagnoses and Dutch, Swedish, and Canadian samples.\nRusu AC, Kreddig N, Hallner D, Hlsebusch J, Hasenbring MI (2014) Fear of movement/(Re)injury in low back pain: confirmatory validation of a German version of the Tampa Scale for Kinesiophobia.\nSchrouff J, Rosa MJ, Rondina JM, Marquand AF, Chu C, Ashburner J, Phillips C, Richiardi J, Mouro-Miranda J (2013) PRoNTo.\nSchrouff J, Monteiro JM, Portugal L, Rosa MJ, Phillips C, MouroMiranda J (2018) Embedding anatomical or functional knowledge in whole-brain multiple kernel learning models.\nShrout PE, Stadler G, Lane SP, McClure MJ, Jackson GL, Clavl FD, Iida M, Gleason MEJ, Xu JH, Bolger N (2018) Initial elevation bias in subjective reports.\nTkachuk GA, Harris CA (2012) Psychometric properties of the Tampa Scale for Kinesiophobia-11 (TSK-11).\nTovote P, Fadok JP, Lthi A (2015) Neuronal circuits for fear and anxiety.\nTrost Z, France CR, Thomas JS (2009) Examination of the photograph series of daily activities (PHODA) scale in chronic low back pain patients with high and low kinesiophobia.\nvan der Werf YD, Witter MP, Groenewegen HJ (2002) The intralaminar and midline nuclei of the thalamus: anatomical and functional evidence for participation in processes of arousal and awareness.\nVlaeyen JW, Kole-Snijders AM, Boeren RG, van Eek H (1995) Fear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nVlaeyen JWS, Crombez G, Linton SJ (2016) The fear-avoidance model of pain.\nWaddell G, Newton M, Henderson I, Somerville D, Main CJ (1993) A Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fearavoidance beliefs in chronic low back pain and disability.\nWertli MM, Rasmussen-Barr E, Held U, Weiser S, Bachmann LM, Brunner F (2014a) Fear-avoidance beliefs-a moderator of treatment efficacy in patients with low back pain: a systematic review.\nZheng J, Anderson KL, Leal SL, Shestyuk A, Gulsen G, Mnatsakanyan L, Vadera S, Hsu FPK, Yassa MA, Knight RT, Lin JJ (2017) Amygdala-hippocampal dynamics during salient information processing."}