{"title": "12.pdf", "contents": "here is no question that many people with low back pain  (LBP) move differently than do those without pain, but the  mechanism of and reason for these motor control changes are  poorly understood.\ninterpreting current literature, particularly regarding how to reconcile  the enormous interindividual variation in presentation.\nMotor control  is defined here as the way in which the nervous system controls posture.\ntained or a movement is achieved in  response to specific demands.\nTrunk  posture and movement are continuously  perturbed by neuromuscular noise (ie,  the imprecision in our control system),  concurrent motor tasks such as breathing,34 and external mechanical perturbations such as the impact forces at ground  contact in walking.\n46 These perturbations  are dealt with by modulating trunk stiffness through tonic muscle activity,8,33,121  anticipatory/feedforward control,39,118 and  feedback based on proprioceptive, visual,  tactile, and vestibular information.\n1,18,62,79  Since the early observations of differences  in muscle activation in individuals with  LBP, it has been generally considered that  many, if not all, of those with LBP present  with some change in motor control.\nControl Different Between Individuals  With and Without LBP?, we consider the  current state of the evidence regarding  changes in motor control in individuals  with LBP and conclude that findings on  motor control in LBP are largely inconsistent.\nThis illustrates the danger of basing  interpretations on a limited number of  studies.\nU USYNOPSIS: Compared to healthy individuals,  patients with low back pain demonstrate differences in all aspects of trunk motor control that are  most often studied as differences in muscle activity  and kinematics.\nHowever, differences in these  aspects of motor control are largely inconsistent.\nWe propose that this may reflect the existence of  2 phenotypes or possibly the ends of a spectrum,  with tight control over trunk movement at one  end and loose control at the other.\nBoth may  have beneficial effects, with tight control protecting  against large tissue strains from uncontrolled  movement and loose control protecting against  high muscle forces and resulting spinal compression.\nBoth may also have long-term negative  consequences.\nFor example, whereas tight control  may cause high compressive loading on the spine.\nand sustained muscle activity, loose control may  cause excessive tensile strains of tissues.\nMoreover,  both phenotypes could be the result of either an  adaptation process aimed at protecting the low  back or direct interference of low back pain and  related changes with trunk motor control.\nThe  existence of such phenotypes would suggest different motor control exercise interventions.\nAlthough  some promising data supporting these phenotypes have been reported, it remains to be shown  whether these phenotypes are valid, how treatment  can be targeted to these phenotypes, and whether  this targeting yields superior clinical outcomes.\nProfessional and scientific bodies have reimbursed him for travel costs related to presentation  of research on pain, motor control, and exercise therapy at scientific conferences/symposia.\nHe has received fees for teaching practical courses on motor control training.\nHe  is also supported by a Senior Principal Research Fellowship from the National Health and Medical Research Council of Australia (APP1102905).\nThe authors certify that they  have no affiliations with or financial involvement in any organization or entity with a direct financial interest in the subject matter or materials discussed in the article.\nvan Dien, Department of Human Movement Sciences, Vrije Universiteit Amsterdam, van der Boechorststraat 9, NL-1081 BT Amsterdam, the  Netherlands.\nand movement to perform a specific motor task, and includes consideration of  all the associated motor, sensory, and  integrative processes.\nnervous system has flexibility in how different muscles and joints are recruited to  achieve a motor task.\nThe quality of the control process is.\nJournal of Orthopaedic & Sports Physical Therapy.\nFor personal use only.\nCopyright  2019 Journal of Orthopaedic & Sports Physical Therapy.\ninterpretation of motor control changes  in those with LBP, but a similar number  of studies contradict this interpretation.\nControl Features in LBP, we propose  an interpretation of the large individual  variation in motor control changes in  those with LBP.\nWe suggest that it may  reflect the existence of 2 different phenotypes resulting from adaptations in motor  control to LBP and interference of LBP  with motor control.\nFurthermore, we  discuss the relevance that the existence  of such phenotypes would have for LBP.\nClinical Approaches to Address Motor  Control Adaptation, we present clinical implications and considerations for  future development in this field.\nThe  interpretation of the literature on motor  control in individuals with LBP proposed  here requires further validation and,  hence, cannot be translated directly into  guidelines for clinical practice; however,  if correct, this interpretation provides a  framework for further research and clinical reasoning.\nIs Motor Control Different Between  Individuals With and Without LBP? In relation to LBP, motor control has been  studied at the level of the neural structures and processes involved,47,107,108,132 but  more commonly at the level of patterns  of trunk muscle activity and trunk movements, which represent the outcomes of  these processes.\nEvaluation of the sensory elements of motor control has largely  been limited to conscious repositioning  tasks and responses to muscle vibration.\nThe following sections present a brief  overview of the evidence for motor control changes in individuals with LBP.\nfeedforward control), and control of trunk  posture and movement when challenged  by unpredictable perturbations (reactive/ feedback control).\nservations indicate that both excitatory  and inhibitory effects on muscle activity may result from injury and nociception,43 as well as from anticipation or fear  of pain.\n80,116 In line with this divergence of  effects, a review on differences in lumbar  extensor muscle activity during steadystate tasks between individuals with nonspecific LBP and pain-free participants  showed that findings are highly variable  when patients are considered as a single  homogeneous group.\nSome studies reported higher lumbar extensor muscle  activity in patients, other studies reported no differences, and still other studies  reported lower activity in patients.\ncles has commonly been investigated in  association with perturbations of trunk  posture caused by rapid movements of  the upper and lower limbs, which are  inherently predictable with respect to direction, timing, and amplitude of related  forces.\n5 Some studies have reported late  activation of the transversus abdominis  and multifidus muscles in participants  with recurrent LBP38,40,41,63,72 and in response to an experimental noxious stimulus to the low back.\n37 In contrast, another  study showed no difference in onset of  activation of the abdominal muscles between patients with LBP and controls,71  and 2 other studies showed earlier activation of the oblique abdominal muscles in  people with LBP.\nmotor control in response to mechanical  perturbations concluded that delayed onset or offset of muscle activity in patients  with LBP compared to healthy participants was found in all but 1 of the included studies, while amplitudes of these  responses were highly variable between  patients and studies.\na subsequent episode of LBP in varsity  athletes.\n9 This highlights the possible role  of motor control changes in the development or recurrence of pain.\nmotor control deficits, the ability of the  muscle to enact the commands from the  motor system will determine the ultimate efficacy of motor control, and there  is evidence of structural/morphological  changes in the trunk muscles with LBP.\nAnimal models, which allow a more  detailed analysis of structural changes,  indicate that the muscle not only shows  changes in adipose tissue content, but  also undergoes a process of fibrosis.\nidence for changes in muscle activation  and muscle morphology in individuals  with a history of LBP, but the observations vary.\nSeveral features may account  for this variation in findings.\nFirst, the  trunk system is highly redundant, with  many options available to achieve a similar objective, and different individuals  may adopt different solutions for the  same outcome.\n31 Second, changes may depend on the specific muscles investigated;  deeper muscles, such as the transversus  abdominis and multifidus, appear more  consistently inhibited,38,40,41,63,72 whereas  changes in the larger, more superficial  muscles are more variable, though activity is often increased.\n123 Third, differences in motor control may depend on  the tasks and contexts investigated.\nFor  instance, in anticipation of a perturbation, an individual in pain may be more  likely to adopt a strategy of trunk stiffening7,121; consequently, studies that include  threatening perturbations may yield different results from those of studies with a  less threatening paradigm.\nas the use of surface versus intramuscular  electromyography, may account for some  differences in results between studies.\nAre Trunk Alignment, Trunk Posture,  and Trunk Movement Different Between  Patients and Healthy Individuals? Spine  and pelvis alignment have often been  considered in relation to LBP.\nAlthough  many studies failed to find differences  between individuals with and without  LBP,53,127 differences such as greater lumbar flexion/posterior pelvic tilt, lumbar  extension, or flattening of the lumbar  spine have been identified when specific  subgroups within the heterogeneous LBP  population were studied.\ned to be associated with compromised  quality of control of trunk posture and  the contribution of the trunk to overall  whole-body postural control.\nQuality of  postural control has been studied in several ways, but most frequently as postural sway in standing.\n100 A limited number of studies focused more specifically on postural control of the trunk in tasks that reduce the  contribution of the lower limbs to balance control, such as seated balancing  and standing on a narrow beam.\nSome  studies showed worse balance performance in patients with LBP,76,89,114 but  others did not find a difference between  participants with and without LBP.\nmovements are usually performed more  slowly by participants with LBP than by  those without LBP.\n53 In addition, some  studies reported a stronger coupling of  pelvis and thorax movements and reduced variability of trunk movements in  gait56,57,115 and in repetitive trunk bend-.\n14 The opposite observation has also  been made, with higher variability of  trunk movements in individuals with  LBP than in pain-free individuals during gait,55,130 reaching movements,97 and  repetitive trunk bending.\ning variability of trunk movement requires  further reflection, and it is important to  distinguish intraindividual variation  (variation between repetitions) from interindividual variation (different strategies adopted by different individuals), as  well as between variability that negatively  affects movement outcomes and variability that does not, as its effect on movement  outcomes is compensated at other degrees  of freedom in the motor system.\n102 Ambiguity can be  avoided by using tasks that require participants to position or move their trunk  as precisely as possible.\nAlthough only  investigated in a limited number of studies, there are indications that patients with  LBP are less able to precisely control trunk  posture,135 trunk movement,12,133 and force  production by trunk muscles.\ntions of posture and movement to probe  trunk motor control, inconsistent results  were found, with smaller initial displacements after perturbations in patients, no  significant differences between patients  and healthy participants, and even larger  initial displacements in patients.\ncontrol has focused on the interaction  between adjacent body segments.\nThis  work has identified greater and earlier  motion of the pelvis and spine during  movement of the hip in patients with  LBP,17,95 but, again, this was specific to  some individuals.\nchanges in trunk alignment, posture,  and movement in LBP clearly indicates  that differences in trunk motor control  are present between participants with  and without a history of LBP.\nDivergence of Motor Control  Features in Individuals With LBP Overall, the literature regarding motor  control in patients with LBP shows inconsistent results.\nIn addition, many studies included only a  small number of participants.\nAs variance  in parameters used to characterize motor  control has generally been large, the differences between studies may simply be  due to chance, which could be addressed  by larger studies.\nAlthough the literature  confirms that motor control may differ  between individuals with and without  LBP, it also shows that motor control  changes are not observed in all patients  and not in the same manner.\nThis is no  surprise, as heterogeneity in the presentation of individuals with LBP, across  all domains from symptoms to response  to treatment, is well known.\nIn general,  where group means have indicated different control in patients, the variance  within groups (between-participant  variation) has been substantial, and the  range of observations in patient groups  has partially overlapped the range of observations in the group of healthy participants.\n56,58,117,133 Furthermore, between  various studies, patients have sometimes  differed from healthy participants in opposite directions.\nbetween studies, there are possible explanations for the variation between studies and the apparent variation between  participants with LBP that have clinical  relevance.\nularized the hypothesis that variation in  motor control changes is a consequence of  patient subgroups.\n10,94 The foundation for  this argument lies in a body of work that  has proposed and tested divergence in  mechanisms, presentation, and outcomes  in patients with LBP.\n125 According to this  suggestion, variation between study participants with LBP would directly reflect  the presence of subgroups within the heterogeneous LBP population, who present with different characteristic muscle  activation, alignment, and movement  changes.\nstudies might be explained by intentional  or unintentional biases in patient inclusion (ie, populations may have differed  with respect to severity of LBP, psychological factors, or presumed pathology).\nFor instance, individuals with high fear of pain are more likely  to stiffen their trunk in anticipation of a  perturbation.\n51 Consequently, differences  between patients with LBP and controls  may be more pronounced in patients  who are more afraid of pain, especially in  somewhat threatening paradigms.\nthe variation between individual patients,  it is important to consider that divergence in motor control presentation may  not be explained by a single factor.\nDifferences in presentation might be explained  by divergence of the underlying mechanisms for the response to injury/nociceptive input/pain; for instance, the changed  motor control may represent a purposeful  strategy for protection, or, alternatively,  it may be a consequence of interference  by pain/nociception and injury.\n30 From  another perspective, the divergence of  changes in motor control may be considered with respect to different mechanical  consequences of adaptations; for example, in some individuals/contexts, the net  outcome of the adaptation may be increased stiffness of the trunk, whereas in  others it may be decreased stiffness.\nproposed models of understanding the  divergence in motor control changes (ie,  based on underlying mechanisms versus  mechanical consequences) can help reconcile some observations and are worthy  of further discussion.\nDivergence of Mechanisms Underlying  Motor Control Changes in Individuals  With LBP The literature summarized  in the preceding sections is largely based  on cross-sectional studies, which do not  allow inferences on the direction of causality, if existent, between motor control  changes and LBP.\nStudies that introduced experimental nociceptive input  and lesions suggest that many of the differences between patients and healthy  individuals can be the direct or indirect  effects of pain and/or injury.\nOn the  other hand, while, for example, delayed  trunk muscle responses after mechanical  perturbations can be elicited by experimentally induced pain,4 similar changes  have been observed to precede LBP and  increase LBP risk.\n9 Thus, motor control  changes can likely be both a cause and  an effect of pain and injury, but we will  consider them as effects here.\nchanges as purposeful adaptations to  avoid pain, it was initially assumed that  reflex-like changes induced by nociception cause higher activation of antagonistic muscles and lower activation of  agonistic muscles, leading to higher stiffness and slower movement.\n119 Such learning processes could result in different responses to a seemingly  identical stimulus and in association with  anticipation or fear of pain and/or (re)injury in the absence of injury or nociceptive input, or in response to pain-related  distress.\ninterfere with motor control, as it can  change excitability of motor pathways  at different levels of the nervous system.\nImportantly, it can cause either an increase or decrease of excitability,32 which  may account for some of the changes and  variability in changes in muscle activation observed in patients with LBP.\nIn  addition, nociception may affect proprioceptive afference105 and, consequently, interfere with motor control.\nThis would be  in line with findings of impaired proprioception in patients with LBP,106 which appears to cause reduced precision in the  control of trunk movement.\n133 Changes  observed in LBP in the sensory cortex16  and in the motor cortex108 and reduced  corticomotor excitability104 may also interfere with motor control.\nFinally, structural changes, such as loss of segmental  stiffness,74,88,137 muscle atrophy,26-28 and  connective tissue changes,35 will change  the relation between motor commands  and motor output and may interfere with  motor control as a result.\nDivergence of Mechanical Consequences  of Motor Control Changes in Individuals  With LBP The literature on motor control changes with LBP suggests that patterns of change observed can be divided  based on their mechanical consequences.\nOne pattern of change, which involves increased excitability of trunk muscles, may  provide tight control over lumbar movements at the cost of higher tissue loading.\n117 This could be the result of increased  cocontraction, reflex gains, and/or attention to movement control.\nThe opposite  pattern, which involves reduced muscle  excitability, might avoid high tissue loading, at the cost of a loose control over  movement.\nreferred to as tight control and loose  control in the following discussion, may  be adaptations to LBP, as suggested by  their positive consequences (enhanced  control, reduced tissue loading), but may  also be caused by interference.\nA  single study by Reeves et al91 provides evidence for 2 identifiable subgroups in line  with this distinction.\nIn this study, participants with LBP fell into 1 of 2 groups:  those who showed preferential activation  of lumbar extensors over thoracic extensors, and those who showed the opposite  activation pattern.\nBiomechanical modeling predicts that preferential activation  of the lumbar extensor muscles enhances  control over lumbar movement, while  causing higher tissue loads, and vice versa for preferential recruitment of thoracic  extensors.\n117 This study117 thus provides an  indication of the existence of tight control and loose control subgroups with  high and low tissue loading, respectively.\nThese subgroups are likely part of a continuum, as a middle group with normal  trunk extensor activation was also present.\nThe long-term consequences of, and  clinical strategies to address, these responses are likely to be different for such  subgroups.\nIn  some cases, these changes may be beneficial to the health of the tissue (at least  in the short term); in others, the resultant  loading may be or become the source of  nociceptive input.\nTissue loading may not  be relevant in all individuals with LBP  and is likely to be most important for  those who continue to have a contribution of nociceptive input to their ongoing  pain.\nThe potential  consequences of tissue loading resulting  from motor control changes at the divergent ends of the spectrum require more  detailed consideration.\nConsequences of Tight Control Tight  control implies augmented constraint  of movement, presumably with the objective to avoid nociceptive excitation,  pain, or injury, or in anticipation of such  threats.\nIn the short term, tight control  would tend to increase the safety margin for control of movement and resulting tissue strains.\nFor example, increased  cocontraction and reflex gains would  increase trunk stiffness such that greater  force would be required to perturb the  spine from its position or trajectory.\nAn  advantage would be a reduction in the  need to intricately control the sequences  of muscle activation matched to the task  demands, thus reducing the potential for  error that may arise when sensory feedback is inaccurate or the force-generating  capacity of the muscle has been modified.\nThis strategy would also be expected to  reduce variation in movement and the  need for finely controlled anticipatory  actions and feedback responses to counteract perturbations.\nslight modifications of activation within  a region of a muscle,109 or more extreme,  such as bracing of the body region.\n29,117  Complete avoidance of a task/function  that is characteristic of some people with  LBP might also be considered as an extreme example of a tightly controlled  protection solution.\nData showing  an association between pain relief after  spinal manipulation and a reduction in  lumbar stiffness suggest that stiffening  of the trunk may even be directly linked  to pain.\ntighten control comes at the cost of increased spinal loading.\nPatients with LBP  have been shown to expose their spine to  higher forces than healthy participants.\n68-70 Because the most pronounced  differences in loading were found during  the least heavy tasks,69 the risk of acute  overloading of the spine is probably limited, but increased cumulative loading  may elevate the risk.\nFurther, low-level  cocontraction of trunk muscles has been  found in patients with LBP even at rest,123  implying that compression of the spine  is sustained during recovery periods.\nAnimal models implicate sustained lowlevel compression as a cause of intervertebral disc degeneration, allegedly due to  disrupted fluid flow into and out of the  disc.\n60,85 Recovery of body height during  rest after exercise, an indication of reuptake of water in intervertebral discs, was  reduced in patients with LBP, and the  lack of recovery was correlated to trunk  muscle activity during rest.\n23,24 This suggests that fluid inflow into the disc may  be impaired by sustained muscle contractions in patients with LBP, with possible  adverse effects on disc health.\nwas found in some patients,123 may also  have noxious effects in the muscles.\n129  Trunk extensor contractions at intensities as low as 2% of maximum activation  do cause fatigue manifestations within  half an hour.\n124 Patients who show sustained trunk muscle activity may thus  incur muscle fatigue and related discomfort,50,98,99 or even LBP of muscular  origin,129 especially if peripheral sensitization is present.\ndecreased motor variability that is associated with tight control.\n103 Although  too much variation may reflect uncontrolled motion, some variation is beneficial, as it allows sharing the load between  different structures across repetitions.\n22,103  In addition, motor variability appears  essential to provide an opportunity to  learn through exposure to alternative  ways of performing the same movement  task.\nJournal of Orthopaedic & Sports Physical Therapy.\nCopyright  2019 Journal of Orthopaedic & Sports Physical Therapy.\nfast arm movements during which pain  was experimentally induced also showed  a strong decrease in variability of muscle recruitment, and maintained these  changes over the course of 70 arm movements when pain stimuli were no longer  presented.\n78 This clearly suggests that decreased variability hampers relearning of  normal motor behavior, even after pain  has subsided.\ntients with LBP appears to be related  to a reduced use of trunk movement to  counteract anticipated perturbations,  which coincides with larger involuntary  trunk displacement due to the perturbation.\n75 Further, although enhanced trunk  stiffness may be an effective strategy to  counteract small disturbances, it may  compromise an individuals capacity to  maintain balance on unstable or restricted surfaces,76,92 or when encountering  larger disturbances.\nThis might be the result of  a protective adaptation to prevent pain  provocation and reduce tissue loading  related to large muscle forces or resulting compressive spine loading.\nspine is an unstable structure whose  configuration requires control by the  surrounding musculature.\nGiven the  large number of degrees of freedom in  the spine and given the fact that loads  imposed on this system can be high and  unpredictable, this poses a substantial  control problem.\nThis would be associated  with faster and larger amplitude movements, with more variability between repeated performances of the same task.\nIf  muscular control over the spine fails, midrange alignment of the lumbar vertebral  segments may be compromised, resulting in large tissue strains.\ncreep loading of spinal tissues, cause tissue responses and, potentially, pain.\n93 Cholewicki et al9 showed  that large displacements after trunk perturbations were predictively associated  with LBP, providing support for the notion that loose control can cause LBP.\nFrom  the perspective of tight control linked to  protection, in the early acute phase, the  response may seem reasonable; however,  if persistent, the negative consequences  (increased loading, reduced movement)  would likely become problematic for  spine health.\nThus, clinical strategies in  later stages could be reasonably targeted  to reduce excitability and cocontraction  and to increase movement and potentially  movement variation.\n44 The  notion that loose control has a negative  impact on clinical outcome in LBP forms  the foundation for many exercise approaches.\nThis has been targeted in some  trials of interventions tailored to specific  phenotypes of patients with LBP.\n15,52,64 In  support of this approach, 2 clinical trials  have shown greater clinical efficacy in patients identified to have deficient control  of deep trunk muscles at baseline, and  better clinical outcomes in those with  improved function of these muscles after motor control intervention.\n15,112 Complicating treatment choices, there is a  potential for overlap between effects of  adaptation to and interference by LBP  (eg, lower activation of the multifidus  muscle might occur due to reflex inhibition with a concurrent protective strategy.\nnificant challenges before validity of the  existence of the proposed subgroups or  phenotypes can be supported.\nIt is critical to have valid assessments that can  identify the pattern to change, therapeutic methods (eg, exercise approaches)  to enact the change, and evidence that  treatment targeted to the individual presentation leads to better outcomes than  treatment that is not targeted.\nSome data  are available,128 but are far from complete.\npatients with LBP have been tentatively  defined at the extremes of a spectrum,  based on changes in trunk motor control  observed from many studies.\nOne phenotype shows tight control over trunk  posture and movement due to increased  excitability, at the cost of increased tissue  loading secondary to increased muscle  contraction.\nThe other group shows  loose control due to reduced excitability,  with the potential cost of increased tissue loading from excessive spinal movements.\nBoth groups involve abnormal  loading of tissues in the low back, but  with different mechanisms.\nan adaptive value of changes in motor  control, at least in the short term: the  first group may avoid excessive movement, and the second group may avoid  high muscle forces.\nFor both, it remains  unclear whether the adaptive value outweighs the negative consequences, and  this may differ between individuals, depending on the motor tasks to be performed and the integrity of the tissues  in the low back.\nIt is, in this context,  important to note that nonspecific triggers, such as fear, can cause changes in  motor control similar to those identified with pain.\nEffects of support surface stability  on feedback control of trunk posture.\nattenuates movement control of the lumbar  spine in low back pain.\nMotor task variation induces structural learning.\nDifferences in sitting postures are associated with nonspecific chronic low back pain  disorders when patients are subclassified.\nproduction parameters in patients with low back  pain and healthy control study participants.\nsitioning accuracy and movement parameters  in low back pain subjects and healthy control  subjects.\nIncreased intramuscular fatty infiltration without differences in lumbar muscle cross-sectional area during remission  of unilateral recurrent low back pain.\nComparison of general exercise, motor control  exercise and spinal manipulative therapy for  chronic low back pain: a randomized trial.\nsive reorganization of primary somatosensory  cortex in chronic back pain patients.\nPatterns of lumbar region  movement during trunk lateral bending in 2  subgroups of people with low back pain.\nsensorimotor integration to spinal stabilization  in humans.\nof bilateral paraspinal excitation in subjects  with low back pain.\nSpine (Phila Pa 1976).\nsound tissue Doppler imaging reveals no delay  in abdominal muscle feed-forward activity  during rapid arm movements in patients with  chronic low back pain.\nThe effect of chronic low  back pain on trunk accuracy in a multidirectional  isometric tracking task.\nA dynamical systems approach to lower  extremity running injuries.\nThe influence of different unloading positions upon stature recovery and paraspinal  muscle activity.\nRaised paraspinal muscle activity reduces  rate of stature recovery after loaded exercise  in individuals with chronic low back pain.\nThe relationship of transversus abdominis and  lumbar multifidus activation and prognostic  factors for clinical success with a stabilization  exercise program: a cross-sectional study.\nHides J, Gilmore C, Stanton W, Bohlscheid E.\nMultifidus size and symmetry among chronic  LBP and healthy asymptomatic subjects.\nEvidence of lumbar multifidus muscle wasting ipsilateral to symptoms in patients with  acute/subacute low back pain.\natrophy of the lumbar multifidus follows experimental disc or nerve root injury.\nChanges in the mechanical properties  of the trunk in low back pain may be associated  with recurrence.\nMechanisms and Management of Pain for  the Physical Therapist.\nadaptation, as no additional protection  is required.\nDifferences between these  different phenotypes of motor control  changes in individuals with LBP and the  different consequences for mechanical  loading support the notion that targets  in motor control intervention should be  different, and possibly even opposite, for  these groups.\nThis supports the plausibility of phenotyping and treatment targeting based on motor control presentation  for the management of LBP.\nACKNOWLEDGMENTS: The authors would like  to thank Dr Peter OSullivan and Dr Julie  Fritz for reviewing a previous version of  this paper.\nThe forum on which this body  of research was based, State-of-the-Art in  Motor Control and Low Back Pain: International Clinical and Research Expert Forum, was supported by the National Health  and Medical Research Council of Australia,  in collaboration with the North American  Spine Society.\nThe forum was chaired by Dr  Paul Hodges.\nFor personal use only.\nNo other uses without permission.\nNew insight into motor  adaptation to pain revealed by a combination of modelling and empirical approaches.\nCorticomotor excitability of back muscles is affected by intervertebral disc lesion in pigs.\nabdominal pressure during postural and respiratory activation of the human diaphragm.\nContractions of specific abdominal muscles in  postural tasks are affected by respiratory maneuvers.\nMultifidus muscle changes after back injury  are characterized by structural remodeling  of muscle, adipose and connective tissue,  but not muscle atrophy: molecular and morphological evidence.\nproinflammatory cytokine gene expression  explain multifidus muscle fiber changes after an  intervertebral disc lesion? Spine (Phila Pa 1976).\nExperimental muscle pain changes feedforward postural responses of the trunk muscles.\nabdominal muscles associated with movement  of the lower limb.\ncontraction of transversus abdominis in low back  pain associated with movement of the lower  limb.\nstabilization of the lumbar spine associated with  low back pain.\nA motor control evaluation of  transversus abdominis.\npain: a new theory to explain the adaptation  to pain.\nIntegrated clinical approach to motor control interventions in low back  and pelvic pain.\nState of the Art and Science.\nDifferences in end-range lumbar flexion during  slumped sitting and forward bending between  low back pain subgroups and genders.\nthe lateral abdominal muscles during walking.\npain associates with altered activity of the  cerebral cortex prior to arm movements that  require postural adjustment.\nFear of movement is related to  trunk stiffness in low back pain.\nKim TH, Kim EH, Cho HY.\nThe effects of the CORE.\nEffects of  experimentally induced pain and fear of pain  on trunk coordination and back muscle activity  during walking.\nEffects of chronic low back pain on  trunk coordination and back muscle activity  during walking: changes in motor control.\nPelvis-thorax coordination  in the transverse plane during walking in persons  with nonspecific low back pain.\nEffects of attention on the control of locomotion in individuals with chronic low back pain.\nThe effect of sex and chronic low  back pain on back muscle reflex responses.\nLotz JC, Chin JR.\nis dependent on the magnitude and duration of spinal loading.\npain-adaptation model: a discussion of the relationship between chronic musculoskeletal pain  and motor activity.\ntions of touch feedback with muscle vibration  and galvanic vestibular stimulation in the control  of trunk posture.\ndo some patients keep hurting their back?  Evidence of ongoing back muscle dysfunction  during remission from recurrent back pain.\ndicting response to motor control exercises and  graded activity for patients with low back pain:  preplanned secondary analysis of a randomized  controlled trial.\nunexpected loading generates high forces  on the lumbar spine.\nMannion AF, Pulkovski N, Schenk P, et al.\nNo other uses without permission.\nFibre type characteristics of the lumbar  paraspinal muscles in normal healthy subjects  and in patients with low back pain.\nSpine loading characteristics of  patients with low back pain compared with  asymptomatic individuals.\nFunctional impairment as a predictor of spine  loading.\nSpine loading in patients with low  back pain during asymmetric lifting exertions.\nTask-specificity of bilateral anticipatory activation of the deep abdominal muscles in healthy  and chronic low back pain populations.\nMazaheri M, Coenen P, Parnianpour M, Kiers.\nDisc degeneration affects the multidirectional flexibility of the lumbar  spine.\nbalance control in quiet standing is reduced in  people with low back pain.\nspine is critical for maintenance of postural  recovery following support surface perturbation.\nof postural strategy prevents normalization  of motor changes induced by back pain:  a risk factor for chronic trouble? Behav  Neurosci.\nMoseley GL, Hodges PW, Gandevia SC.\nA hypothesis of chronic back pain:.\nFunction, dysfunction, adaptation, and  enhancement.\nNeutral zone and instability hypothesis.\nic and static overloading induce early degenerative processes in caprine lumbar intervertebral  discs.\nLumbar extensor muscle force control is associated with disability in people with chronic  low back pain.\nPrins MR, Griffioen M, Veeger TTJ, et al.\nImpaired postural control of the  lumbar spine is associated with delayed muscle  response times in patients with chronic idiopathic low back pain.\nThe effects of trunk stiffness on postural control during unstable seated balance.\nSpine stability: the six blind men and the  elephant.\nSt Louis, MO:  Mosby; 2001.\nences in lumbopelvic motion between people  with and people without low back pain during  two lower limb movement tests.\nTrunk control during standing reach: a  dynamical system analysis of movement strategies in patients with mechanical low back pain.\nmuscular pressure, EMG and blood flow during  low-level prolonged static contraction in man.\nof experimentally induced low back pain on  postural sway with breathing.\nMuscular dysfunction  elicited by creep of lumbar viscoelastic tissue.\nproblem: a proposal for the development  of coordinated movement by selection.\nCorticospinal excitability in  patients with chronic low back pain.\nEffects on the fusimotor-muscle  spindle system induced by intramuscular  injections of hypertonic saline.\nIs there a relationship between lumbar proprioception and low back pain?  A systematic review with meta-analysis.\nwinner: smudging the motor brain in young  adults with recurrent low back pain.\nSpine  (Phila Pa 1976).\nMotor unit recruitment strategies are  altered during deep-tissue pain.\nSimilar alteration of motor unit recruitment  strategies during the anticipation and experience  of pain.\nDifferences in balance  strategies between nonspecific chronic low  back pain patients and healthy control subjects  during unstable sitting.\nMechanical coupling between  transverse plane pelvis and thorax rotations  during gait is higher in people with low back  pain.\nRelationships between coping strategies and lumbar.\nmuscle recruitment patterns in patients with low  back pain enhance the stability of the lumbar  spine.\nanticipatory activation of trunk muscles in a lifting task depends on load knowledge.\npatients learn to adapt motor behavior with adverse secondary consequences.\nback pain: interactions of active and passive  structures.\nfor a role of antagonistic cocontraction in controlling trunk stiffness during lifting.\npain history and postural sway in unstable sitting.\nmuscle activation in low-back pain patients, an  analysis of the literature.\nLow-level activity of the  trunk extensor muscles causes electromyographic manifestations of fatigue in absence of  decreased oxygenation.\nThe effect of modifying patient-preferred spinal movement and  alignment during symptom testing in patients  with low back pain: a preliminary report.\nPostural orientation: age-related changes in  variability and time-to-boundary.\npatients with low back pain and healthy controls:  a pilot study.\nEfficacy of classification-based cognitive  functional therapy in patients with non-specific  chronic low back pain: a randomized controlled  trial.\nof nonspecific low back pain on three-dimensional  lumbar spine kinematics in locomotion.\nThe effect of chronic low back pain on size and  contraction of the lumbar multifidus muscle.\ncal changes in chronic low back pain: current  state of the art and implications for clinical  practice.\nPrecision control of trunk movement in low back pain patients.\nter of pressure trajectories, trunk kinematics  and trunk muscle activation during unstable  sitting in low back pain patients.\nsion control of an upright trunk posture in low  back pain patients.\nDo participants with low back pain who  respond to spinal manipulative therapy differ  biomechanically from nonresponders, untreated  controls or asymptomatic controls? Spine  (Phila Pa 1976).\nDiscogenic origins of spinal instability.\nSpine  (Phila Pa 1976).\nJournal of Orthopaedic & Sports Physical Therapy.\nNo other uses without permission.\nCopyright  2019 Journal of Orthopaedic & Sports Physical Therapy."}