{"title": "25.pdf", "contents": "Abstract Purpose The purpose of this systematic review was to assess whether LBP patients demonstrate signs of splinting by evaluating the reactions to unexpected mechanical perturbations in terms of (1) trunk muscle activity, (2) kinetic and (3) kinematic trunk responses and (4) estimated mechanical properties of the trunk.\nMethods The literature was systematically reviewed to identify studies that compared responses to mechanical trunk perturbations between LBP patients and healthy controls in terms of muscle activation, kinematics, kinetics, and/or mechanical properties.\nWe found evidence of a longer response time of muscle activation, which would be in line with splinting.\nNo signs of splinting behaviour were found in any of the other outcome measures.\nConclusions We conclude that there is currently no convincing evidence for the presence of splinting behaviour in LBP patients, because we found no indications for splinting in terms of kinetic and kinematic responses to perturbation and derived mechanical properties of the trunk.\nConsistent evidence on delayed onsets of muscle activation in response to perturbations was found, but this may have other causes than splinting behaviour.\nIt has been suggested that low back pain (LBP) patients splint or guard their lumbar spine through co-contraction of trunk muscles [1].\nThis could explain observed rigid movement patterns during activities of daily living [2], reduced active range of motion of the lumbar spine [3], the finding that the spinal muscles do not relax in full flexion [4] and increased coupling of pelvis and thorax movements during gait [5, 6].\nSplinting could protect the spine from large movement excursions as a result of mechanical perturbations at a cost of an increased axial spinal load, which could negatively affect spine health in the long term [7].\n, without delay, on trunk movement when an unexpected external mechanical perturbation is imposed [8].\nTitles, abstracts or keywords had to contain strings from both first two blocks and at least one from blocks three to five.\nThe purpose of this systematic review was to assess whether LBP patients demonstrate signs of splinting, by evaluating the reactions to unexpected mechanical perturbations in terms of (1) trunk muscle activity, (2) kinetic and (3) kinematic trunk responses and (4) estimated mechanical properties of the trunk.\nIf LBP patients splint their spine, we would expect to find increased trunk muscle activation prior to perturbations.\nThe resulting increased initial resistance to the perturbation should increase initial kinetic responses when perturbations are position-controlled or decrease the amplitude and rate of change of trunk kinematics when perturbations are force-controlled.\nBoth would be reflected in higher estimates of trunk stiffness.\nSlower trunk movements after force-controlled perturbations would most likely result in a later detection of movement by the sensory system and consequently to a later onset of reactive muscle activation.\nDifferent muscle recruitment patterns to stabilize the lumbar spine have been suggested to be present between subjects in the LBP population [10, 11], which would result in a higher between subject variance among LBP patients than among controls.\nSince this may mask group differences when summary statistics are presented, the between subject variance of outcomes was also evaluated.\nThe literature was systematically reviewed to identify studies that compared the response to mechanical trunk perturbations between LBP patients and healthy controls.\nThe search strategy contained five blocks: (1) low back pain, (2) perturbations, (3) muscular response, (4) kine(ma)tic response and (5) estimated mechanical trunk properties.\nTitles, abstracts or keywords had to contain strings from both first two blocks and at least one from blocks three to five.\nThe search is outlined in supplement 1.\nIn July 2015, the systematic search was performed in the following databases: Academic Search Premier, CINAHL, EMBASE, MEDLINE, and ScienceDirect.\nNo limits were set for study design or publication date.\nFirst, all titles were screened for relevance by the first (MP) and second (MG) author.\nBoth selections of possibly relevant studies were combined.\nDifferences in judgement were resolved during a consensus.\nStudies had to use experimental setups in which unexpected mechanical perturbations were imposed to subjects with LBP and to healthy controls.\nThe effect of the perturbations on the trunk had to be reported in at least one of the four following terms: (1) muscular response (2) kinetic response, (3) kinematic response (4) estimated mechanical trunk properties.\nA quantitative or statistical comparison between LBP patients and healthy controls had to be presented.\nIf subjects could anticipate some of the imposed perturbations a separate analysis of the reactions to unexpected perturbations had to be presented.\nThere were no restrictions on duration or diagnosis (non-specific or specific) of LBP.\nData extracted by the first author (MP) consisted of subject characteristics, experimental set-up, normalization procedures, and differences in reported outcomes between control subjects and LBP patients expressed as means, variances and levels of statistical significance.\nOutcomes were assigned to one of nine blocks: pre-perturbation muscle activity, timing and amplitude of muscle, kinetic and kinematic responses, and estimated trunk stiffness and damping.\nIf three or more studies reported the statistical significance of between group differences in a block, pooling of results within that block was performed.\nThe average percentage of significantly higher (or lower) values in the LBP group within that block was calculated for each study and then averaged over studies.\nFor each block we considered the evidence for splinting behaviour in LBP to merit further attention if the average percentage of outcomes that were significantly higher (or lower) in LBP patients was 40% or more.\nThe search yielded a total of 571 studies.\nAfter reviewing titles and abstracts, 36 studies remained that were subjected to a full-paper review.\nScreening of the reference lists yielded no extra studies.\nUltimately, 19 studies were.\nincluded in this review.\nA library (Endnote, Thomson Reuters, New York) containing the evaluated titles and abstracts of the selection procedure is presented in supplement 2.\nAn overview of subject characteristics is presented in Table 1.\nThe 19 included studies contain the results of 17 unique cohorts [1230], consisting of 286 LBP patients and 306 healthy controls.\nTwo cohorts were presented twice ([12, 25] and [15, 24]).\nThe mean age of participants was between 20 and 45 years.\nLBP patients generally had higher body mass (14 out of 18 studies) and Body Mass Indices than healthy controls (6 out of 7 studies), although none of the studies reported these between group differences to be significant.\nTwelve studies included LBP patients that had experienced pain for 3 months or more.\nLBP intensity was assessed using a Visual Analogue Score or a Numeric Rating Scale and the mean value in LBP subjects varied from 1.\nOne study measured patients with disc herniation that were selected for micro-discectomy because of prolonged LBP with sciatica [15, 24].\nThe other studies included patients with nonspecific LBP.\nAn overview of the experimental setups is presented in Table 2.\nIn all experiments, subjects held the trunk in an upright position before being perturbed.\nIn seven studies, the perturbations were imposed directly to the trunk [13, 1821, 23, 29].\nIn only one of these experiments the perturbation was position controlled [21], the other studies imposed [20, 23, 29] or released [13, 18, 19] a force.\nIn the other experiments the perturbations were imposed indirectly to the trunk, either via the arms [1416, 22, 24, 26, 28] or the legs [12, 17, 25, 27, 30] (Fig.\nIn 13 studies, the pelvis of participants was fixated during the experiment [1215, 1825, 29].\nSubjects were instructed to regain a balanced upright position [12, 25].\nIn the six studies in which the pelvis was not fixated, three imposed horizontal translations of the standing surface [17, 27, 30] and three perturbed the trunk via the arms, either by pulling one arm downward [16, 26] or by dropping a weight in a box held by the participant [28].\nMuscular activation was evaluated in 15 studies [1220, 2224, 27, 29, 30], the kinetic response in two studies [12, 30], and the kinematic response in five studies [12, 21, 25, 26, 28].\nMechanical trunk properties were estimated in two studies [21, 25].\n1 Flowchart of the selection process.\nTable 1 Subject characteristics.\nStudies Group n (m/f) Age Height in cm Weight in kg BMI in kg/ m2 Pain score type LBP pain score Definition LBP.\nControl 31 (16/15) 31.\nControl 10 (0/10) 39.\n[30] LBP 16 (8/8) 33.\nControl 16 (8/8) 33.\nControl 29 (15/14) m = 38 (10).\n[16] LBP 17 (0/17) 40.\n5) Minimum duration of 6 months.\n9) Recurrent acute exercise induced LBP for at least 6 months Control 8 (8/0) 20.\n9) Sick leave from usual occupation or treatment, which lasted for more than 18 months with at least one episode of LBP in the preceding 6 months or pain that was semi continuous with periods of greater and lesser pain.\n5) VAS level of pain just before testing 1.\n3) 175 (6) 71 (13) 23.\n[29] LBP 13 (7/6) 32.\n2) 175 (8) 81 (20) 26.\n7) Pain between L1 and gluteal folds for at least 6 months.\nControl 20 (9/11) 37 (9.\n5) 168 (4) 65 (9) 23.\n1) 168 (6) 57 (6) 20.\nControl 17 (12/5) m = 35.\n[13] LBP 16 (15/1) 38.\n6) 177 (9) 80 (18) NR NA.\n6) 174 (9) 73 (8) NR VAS back pain 2.\n4) Chronic or non-specific mechanical recurrent LBP having a pain history of 3 months, without radiation.\nNR NR NR Experienced back pain for at least 6 months.\n[14] LBP 24 (16/8) 24.\n7) 174 (11) 70 (8) NR VAS pain 3.\n1) 172 (10) 67 (8) NR NA.\n[20] LBP 21 (11/10) m = 28.\nControl 23 (15/8) m = 30.\nParenthesized values are standard deviations, unless stated otherwise.\nSubject instruction Reported outcomes.\n[26] Standing None Unilateral downward pull handheld grip Left arm/right arm 5 Stay erect, look straight ahead Kinematics.\n[16] Standing None Force controlled unilateral downward pull handheld grip of 150 N (built up in 100 ms), left hand.\n[21] Seated Pelvis Position controlled horizontal push 10 mm in *40 ms at T8 level Anterior push/posterior push 12 Sit upright, do not resist or intervene with perturbations Kinematics, kinetics, mechanical trunk properties.\n[28] Standing None Drop 1 kg weight from 30 cm height in container held in hands with 90 elbow flexion.\nStanding of flat surface or short base (block of 12 cm anteroposterior length).\nContinuous 100 N anterior pull at T6T7 level with force controlled pseudorandom perturbations of additional load.\nStudies Subject position Fixed segments Perturbation Conditions nPerturb.\nSubject instruction Reported outcomes.\n[18] Semiseated Pelvis, lower limbs.\n[13] Semiseated Pelvis, lower limbs.\nSudden load release at T9 level (1) Forward/backward.\n[22] Standing Pelvis Drop of 3 kg steel cylinders onto the outstretched hand (1) Expected/unexpected.\n3 Do not resist before the impact or let go along with the perturbation after the impact.\nReturn to previous position as quickly as possible.\n[19] Semiseated Pelvis, lower limbs.\nLoad release at T9 level of 40 N (females) or 65 N (males) Flexion/extension/lateral bending 3 Keep force output line steady at target and do not anticipate release EMG.\n[14] Standing Pelvis Drop of 3 kg weight into outstretched hand from 8 cm height Expected/unexpected (blindfolded) 3 Let go, do not resist the perturbation EMG.\n(1) Pull direction 0/45/ 90/135/180 to anterior direction.\n(2) Preload 15/30% of maximal effort.\n(3) Superimposed perturbation of 5/10% of max.\n3 Maintain the target effort until after the perturbation EMG.\nIn one study [23], a significantly higher pre-activation of several back muscles was reported in LBP patients, both after normalization to a reference contraction and to a maximal voluntary contraction (MVC).\nIn one study that normalized to the maximal amplitude of each muscle measured over the entire experiment, a significantly lower pre-activation of one abdominal muscle was reported [30].\nIn the other three studies, that either used no normalization [16, 27] or MVC normalized EMG [21], no significant between group differences were reported for pre-activation of abdominal or back muscles.\n, the time between the perturbation and the first muscular response.\n[1216, 18, 21, 23, 24, 27, 29].\nIn eight of these studies, the first muscular response was defined as the instant at which an EMG signal exceeded a predetermined number of standard deviations above baseline activity, varying from 1.\n4 to 3 standard deviations [1214, 16, 18, 21, 23, 29].\nSix of these studies reported significantly longer response times in multiple trunk muscles [13, 14, 16, 18, 21, 29].\nA significantly shorter response time in LBP trunk muscles was reported in the experiment in which a swing-chair was used [12].\nOne study, additionally used an approximated generalized likelihood-ratio (AGLR) method to estimate response times [23].\nNeither method showed a significant between group difference.\nTwo studies on one cohort found no between-group differences on visually detected response times [15, 24].\nOne study did not report how the response time was determined and found no significant between group differences [27].\nOne study found that the maximal amplitude of LBP patients trunk muscles was lower over a time window of 40120 ms after perturbation, but higher if this window was increased to 40250 ms after perturbation.\nOne study normalized by dividing the linear EMG envelope by the maximum value measured over all perturbations for that specific muscle, and found higher activation of both abdominal and back muscles in LBP patients [30].\nHigher amplitudes of back muscle activation were also found in another study using either no normalization or a normalization to a reference contraction [23].\n, lower back muscle EMG amplitudes normalized to a reference contraction in LBP patients [29].\nThese studies reported larger sagittal plane angular velocity of the hip in LBP patients, but not of the lumbar spine.\nIn patients, the sagittal range of motion (defined as the maximum minus the minimum angle measured from chair release until the time a balanced position was achieved) was significantly smaller for the lumbar spine but larger for the hip.\nIt took subjects between 4 and 5 s to regain balance with no significant group difference.\nOne study assessed the effect of a downward arm pull on trunk kinematics [26].\nPerturbations were imposed to subjects that were in a standing (a), semi-seated (b), or seated (c) position.\n3 Trunk Perturbation Types.\nTrunk perturbations were imposed directly to the trunk (a), or indirectly, either via the arms (b) or legs (c).\nThe images show e-Verne from wwrichard.\n[12]c1 Relative duration of co-contraction of all studied trunk muscles (%) 3 SD above baseline activity Chair releasebalance achieved 20 tilt RA, EO, IO, ES 35.\nResponse time (ms)  Chair releasemuscle contraction   Each muscle decreased$ Each muscle increased$ Each muscle.\n[30] Pre-activation amplitude (dimensionless) Maximal value of that muscle measured over all perturbation directions 25050 ms before perturbation NA REO Decreased$ Increased$ 0.\nResponse amplitude (dimensionless)*  100175 ms after perturbation All directions combined LEO Increased$ Decreased$ 0.\n25100 ms after perturbation LES3 Increased$ Decreased$ 0.\nL3 m 15 (IQR 1221).\nT10 m 25 (IQR 1833).\nMaximal voluntary contraction   L5 m 10 (IQR 621).\nL1 m 11 (IQR 419).\nT10 m 6 (IQR 412).\nResponse time (ms) 4 SD above baseline activity 0200 ms after perturbation Left hand downward pull RA.\nResponse amplitude (lVolt) None   RA.\n[21] Pre-activation amplitude (dimensionless) MVC 4000 ms prior to perturbation onset NA L3 NR NR NS.\nResponse time (ms) 2 SD above baseline activity Perturbation onsetmuscle on 10 mm anterior trunk push in *40 ms  Increased$ Decreased$ 0.\n[18] Mean number of antagonists on (n) 1.\n4 SD below baseline activity for at least 44 ms  Extension.\n4 SD above baseline activity for at least 25 ms  Extension.\n4 SD below baseline activity for at least 44 ms  Extension.\nMean antagonistic muscle reaction time (ms) 1.\n4 SD above baseline activity for at least 25 ms  Extension.\n4 SD above baseline activity for at least 25 ms 0-300 ms after perturbation onset Sudden release pull towards RA EO, IO, LD, T9, L3.\nAgonistic muscle response time OFF (ms) 1.\n4 SD below baseline activity for at least 44 ms  Extension.\n[19] Mean antagonistic muscle response time ON (ms) 1.\nMean antagonistic muscle response time OFF (ms) 1.\nMean difference preand post activation amplitudes (dimensionless) MEMGD method {Stokes, 2000 #1120} 25150 ms before and after perturbation onset   0.\nParenthesized values are standard deviations, unless stated otherwise.\nlatissimus dorsi, Ln lumbar erector spinae at level of nth vertebrae, m male, MEMGD mean EMG difference, MF m.\nobliquus externus, Tn thoracic erector spinae at level of nth vertebrae,  the same value/content as above.\n*Only significant results are reported $ No mean values reported  Statistical test was performed with results of expected and unexpected perturbations combined.\n[12] RMS angular velocity (rad/s) Chair release to balance achieved 20 tilt Hip 0.\nMaximumminimum angular velocity (rad/s)   Hip 1.\n[25] Maximumminimum angle (deg) Chair release to balance achieved 10 tilt Hip 26.\nSpine/hip angle ratio (dimensionless) At first peak angle chair 10 tilt Hip and lumbar spine 0.\nAt second peak angle chair 10 tilt  0.\nBalancing error (deg) At balanced position 10 tilt.\nTime to regain balance (s) Chair release to balance achieved 10 tilt.\nStudy Kinematic parameter Time window/instant Perturbation Joint LBP outcome Control outcome p value pain status.\nLumbar flexion onset (ms)  Flat surface  164.\nStatistical test was performed with results of flat surface and short base combined.\nTable 5 Kinetic response to perturbations.\n[12] Mean RMS moment (M/ (m 9 g 9 l)) Weight and leg length Chair release to balance achieved 20 tilt Sagittal Hip 0.\nMaximum moment (M/ (m 9 g 9 l))     Hip 0.\n[30] Peak torque (Nm) Height and weight 25250 ms after perturbation onset All directions with sagittal/coronal component Sagittal.\nRate of torque development (Nm/s) Height and weight Peak-to-peak (minimum to maximum torque)  Sagittal.\nPeak torque latency, initial trunk response (ms) Height and weight 25100 ms after perturbation onset  Sagittal.\nanterior position of the ipsilateral PSIS in reaction to the perturbation.\nA study that imposed an anterior push to the trunk reported no significant between group differences in kinematic outcomes [21].\nKinetic response to perturbation.\nIn the two studies that reported the kinetic response to perturbations, subject were perturbed by release of a swing chair [12], or by translation of the standing surface [21].\nIn the swing chair experiments, no significant between group differences were found in terms of hip and trunk moments and powers.\nIn the standing surface perturbation experiment, the first peak in trunk moment (within 25100 ms after perturbation) occurred earlier in LBP patients.\nNo differences in maximal trunk moment or the rate of moment development were reported (within 25250 ms after perturbation).\nAn overview of the two studies that assessed estimated mechanical trunk properties is presented in Table 6.\nIn the experiment in which a swing chair was released, no significant between group differences in trunk damping, and natural frequency of the trunk in the sagittal.\nIn an experiment in which the trunk of subjects was pushed in anterior and posterior directions with the pelvis fixed on a chair, no between group differences in sagittal trunk stiffness or effective trunk mass were reported [21].\nAfter recovery from this LBP the estimated sagittal plane trunk stiffness in this group was significantly higher than in the control group.\nWe found that only the evidence for splinting behaviour in LBP in terms of longer response times of trunk muscles merits further attention.\nNo indications for altered amplitudes of muscle activation, or kinematic responses were found.\nBetween-subject variance was pooled for two blocks of outcomes (muscle activation and kinematics).\nThe aim of this systematic review was to assess whether LBP patients demonstrate signs of splinting by evaluating the anticipation and reactions to unexpected mechanical perturbations in terms of trunk muscle activity, kinetic and kinematic trunk responses and estimated mechanical properties of the trunk.\n[25] Damping ratio (Nm/(rad/s)) Second order Chair release to balance achieved 10 tilt.\nNatural frequency (rad/ s).\n[21] Trunk stiffness (N/mm) Second order As long as the load cell measured a tensile force (while the trunk was being pushed).\nAbbreviated values are standard deviations.\nBold italic words are linked to presented mean values and levels of significance on the same horizontal level.\nmasked group differences within the LBP population, we evaluated within group variances as well.\nNo sign for increased variance within the LBP group was found.\nNo signs of splinting behaviour were found for any of the other outcome measures.\nLonger response time of trunk muscle activation may occur as a result of splinting in response to LBP, but they have also been identified as a risk factor for developing.\nParameter Studies In patients with LBP mean outcome is.\nLower/shorter NRNS or equal* Higher/longer.\n[27] 0 (0%)  5 (100%)  0 (0%).\nMuscle activity amplitude [12] 0 (0%)  0 (0%)  4 (100%).\n[27] 0 (0%)  10 (100%)  0 (0%).\n[20] 0 (0%) 1 (100%) 0 (0%) 0 (0%) 0 (0%).\n[21] 0 (0%)  0 (0%)  1 (100%).\n[29] 0 (0%) 0 (0%) 0 (0%) 0 (0%) 3 (100%).\n[27] 0 (0%)  5 (100%)  0 (0%).\nMean (%) 10 43 47.\nThe table displays the number of times reported outcomes were significantly higher, not significantly different or significantly lower in LBP subjects compared to healthy controls.\nIf outcomes were not significantly different and mean values were provided the table shows if the reported means in the LBP group were decreased/lower or increased/higher compared to the control group.\nIt was found that college athletes who showed longer response times of relaxation of trunk muscles in a sudden release experiment were at higher risk of developing LBP.\nIncreased latencies of trunk muscles may require higher reactive muscle forces in reaction to external perturbations [32], which could lead to injury and LBP.\nIt could be that the longer response times present before getting LBP (not explained by splinting behaviour) [31] remain present after LBP develops.\nIn addition, the interpretation of increased response times of muscle activation in LBP requires some caution.\nFirst of all, these response times should not be interpreted as reflex delays (a term used by many of the included papers in this review).\nResponse times are dependent on both reflex delays and the initial conditions of the trunk.\nIf the initial resistance of the trunk to a perturbation is increased by a higher trunk mass, trunk stiffness or damping, the acceleration of the trunk will be lower, which may well result in longer response times for a given reflex delay, due to later detection by the sensory system.\nSecond, it is possible that longer response times of trunk muscles in LBP patients are the result of a bias in data analysis.\nIn most studies in which response times of trunk muscles were evaluated, the first muscular response was defined as the instant at which an EMG signal exceeded a predetermined number of standard deviations above baseline activity.\nHence, the reported response time is influenced by both the mean and within-subject variance of baseline muscle activity.\nAlthough mean baseline activity was reported in most studies, none of the included studies reported the within-subject variability of this baseline activity.\nIncreased variability of trunk muscle activity has been reported in LBP during gait [33], but, to the best of our knowledge, has not been evaluated in this population during static tasks.\nIf mean baseline activity and the muscular response to a perturbation are identical between subjects, one would expect to find longer latencies of muscle activation in subjects with higher baseline variability of muscle activity.\n, pre-perturbation muscle activity, timing and amplitude of muscle activity and amplitude of kinematics, conflicting significant between group differences were reported by at least two studies per block.\nThe two most likely explanations for these differences are the usage of different experimental setups and the methods for data analyses.\nThe study that found a significantly decreased pre-perturbation muscle activity normalized EMG signals to the maximum value of that muscle measured over all trials [30] whereas the studies that reported increased amplitudes of back muscles both utilized maximally voluntary contractions and reference contractions to normalize the data.\nIt is likely that such a condition requires a different motor control strategy, because stiffening of the spine will not result in stabilization of the seat.\nIt is possible that signs of splinting were present in the investigated LBP cohorts, but overlooked for at least two reasons.\nFirst of all, the performed analyses of the muscle responses, kinematics and kinetics could be sub-optimal.\nNot only does this increase the chance of type I errors [34], it also has negative consequences on the comparability of results between studies.\nAll studies evaluated the reactions to perturbations over one or more arbitrarily chosen timewindow(s) and reported discrete outcomes within these windows.\nThe reaction to a perturbation within a time window can be quite complex.\n, monosynaptic and polysynaptic reflexes and voluntary responses.\nIn that case, discrete outcomes are difficult to interpret.\nFor the same reason, apparently conflicting results between studies could be the consequence of different adopted time-windows.\n, 40120 ms and 40250 ms after perturbation onset, reported a significant decrease in abdominal and back muscle amplitude in LBP patients over the first time window and a significant increase over the second [22], which underpins that the comparability of studies that applied different time-windows is limited.\nThe effect of perturbations on the kinematics of the trunk depends both on intrinsic and reflexive components [8].\n, comprising information on both the intrinsic and reflexive component) of each parameter was calculated.\nAs a result of the variation in experimental setups and analysis methods, evidence for splinting behaviour remains inconclusive.\nA later study reported a significant positive correlation between estimated spinal stiffness and fear of movement in LBP [36].\nSeveral recommendations for future research on postural control of LBP patients can be made.\nFirst of all, it is recommended to study the trunk in isolation, with a restrained pelvis and perturbations imposed directly to the trunk [37].\nSecond, instead of using a lumped model to predict mechanical properties of the trunk, it is recommended to estimate both intrinsic and reflexive components using system identification [38].\nThird, to statistically compare one-dimensional data, techniques should be used that are designed for time series analysis like wavelet-based functional ANOVAs [39] and one-dimensional statistical parametric mapping [40].\nFinally, when reporting EMG results, measurements that are used to normalize the signal, or to calculate a threshold, should be reported to give more insight in possible biases, e.\nFor example, the EMG-amplitude and generated torque during an MVC used for normalization should be reported and the mean and variability of baseline EMG-signal used to determine response time to a perturbation as well.\nWe conclude that there is currently no convincing evidence for the presence of splinting behaviour in LBP patients, because we found no indications for splinting in terms of kinetic and kinematic responses to perturbation or the derived mechanical properties of the trunk.\nThe indication of delayed onset of muscle activation in reaction to perturbations deserves further attention.\nStandardized experimental protocols and more advanced data analyses should be utilized in future research to provide conclusive evidence for the splinting hypothesis in low back pain.\nHodges PW, Tucker K (2011) Moving differently in pain: a new theory to explain the adaptation to pain.\nMoorhouse KM, Granata KP (2007) Role of reflex dynamics in spinal stability: intrinsic muscle stiffness alone is insufficient for stability.\nDideriksen JL, Negro F, Farina D (2015) The optimal neural strategy for a stable motor task requires a compromise between level of muscle cocontraction and synaptic gain of afferent feedback.\nHodges PW, Coppieters MW, Macdonald D, Cholewicki J (2013) New insight into motor adaptation to pain revealed by a combination of modelling and empirical approaches.\nvan Dieen JH, Cholewicki J, Radebold A (2003) Trunk muscle recruitment patterns in patients with low back pain enhance the stability of the Lumbar Spine.\nFreddolini M, Strike S, Lee RYW (2014) The role of trunk muscles in sitting balance control in people with low back pain.\nRadebold A, Cholewicki J, Polzhofer GK, Greene HS (2001) Impaired postural control of the lumbar spine is associated with delayed muscle response times in patients with chronic idiopathic low back pain.\nShenoy S, Balachander H, Sandhu JS (2013) Long latency reflex response of superficial trunk musculature in athletes with chronic low back pain.\nLeinonen V, Kankaanpaa M, Luukkonen M, Hanninen O, Airaksinen O, Taimela S (2001) Disc herniation-related back pain impairs feed-forward control of paraspinal muscles.\nLiebetrau A, Puta C, Anders C, de Lussanet MHE, Wagner H (2013) Influence of delayed muscle reflexes on spinal stability: model-based predictions allow alternative interpretations of experimental data.\nNewcomer KL, Jacobson TD, Gabriel DA, Larson DR, Brey RH, An K (2002) Muscle activation patterns in subjects with and without low back pain.\nRadebold A, Cholewicki J, Panjabi MM, Patel TC (2000) Muscle response pattern to sudden trunk loading in healthy individuals and in patients with chronic low back pain.\nReeves NP, Cholewicki J, Milner TE (2005) Muscle reflex classification of low-back pain.\nMiller EM, Bazrgari B, Nussbaum MA, Madigan ML (2013) Effects of exercise-induced low back pain on intrinsic trunk stiffness and paraspinal muscle reflexes.\nLariviere C, Forget R, Vadeboncoeur R, Bilodeau M, Mecheri H (2010) The effect of sex and chronic low back pain on back muscle reflex responses.\nLeinonen V, Kankaanpaa M, Luukkonen M, Kansanen M, Hanninen O, Airaksinen O et al (2003) Lumbar paraspinal muscle function, perception of lumbar position, and postural control in disc herniation-related back pain.\nFreddolini M, Strike S, Lee R (2014) Dynamic stability of the trunk during unstable sitting in people with low back pain.\nGotze M, Ernst M, Koch M, Blickhan R (2015) Influence of chronic back pain on kinematic reactions to unpredictable arm pulls.\nNotzel D, Puta C, Wagner H, Anders C, Petrovich A, Gabriel HHW (2011) Altered hip muscle activation in patients with chronic non-specific low back pain.\nMok NW, Brauer SG, Hodges PW (2011) Changes in lumbar movement in people with low back pain are related to compromised balance.\nNavalgund A, Buford JA, Briggs MS, Givens DL (2013) Trunk muscle reflex amplitudes increased in patients with subacute, recurrent LBP treated with a 10-week stabilization exercise program.\nJones SL, Hitt JR, DeSarno MJ, Henry SM (2012) Individuals with non-specific low back pain in an active episode demonstrate temporally altered torque responses and direction-specific enhanced muscle activity following unexpected balance perturbations.\nCholewicki J, Silfies SP, Shah RA, Greene HS, Reeves NP, Alvi K et al (2005) Delayed trunk muscle reflex responses increase the risk of low back injuries.\nReeves NP, Cholewicki J, Narendra KS (2009) Effects of reflex delays on postural control during unstable seated balance.\nLamoth CJ, Meijer OG, Daffertshofer A, Wuisman PI, Beek PJ (2006) Effects of chronic low back pain on trunk coordination and back muscle activity during walking: changes in motor control.\nPataky TC, Vanrenterghem J, Robinson MA (2016) The probability of false positives in zero-dimensional analyses of one-dimensional kinematic, force and EMG trajectories.\nHodges P, van den Hoorn W, Dawson A, Cholewicki J (2009) Changes in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nKarayannis NV, Smeets RJEM, van den Hoorn W, Hodges PW (2013) Fear of movement is related to trunk stiffness in low back pain.\nMaaswinkel E, Griffioen M, Perez RSGM, van Dieen JH (2016) Methods for assessment of trunk stabilization, a systematic review.\nGranata KP, Rogers E, Moorhouse K (2005) Effects of static flexion-relaxation on paraspinal reflex behavior.\nClin Biomech (Bristol, Avon) 20:1624.\nMcKay JL, Welch TD, Vidakovic B, Ting LH (2013) Statistically significant contrasts between EMG waveforms revealed using wavelet-based functional ANOVA.\nPataky TC, Robinson MA, Vanrenterghem J (2013) Vector field statistical analysis of kinematic and force trajectories.\nStaude GH (2001) Precise onset detecti on of human motor responses using a whitening filter and the log-likelihood-ratio test.\nIEEE Trans Biomed Eng 48:12921305."}