{"title": "28.pdf", "contents": "The hypothesis of reorganization of the primary somatosensory cortex in states of chronic pain was assessed in 10 low back pain patients and nine matched healthy controls.\nIntracutaneous electric stimuli were applied to the left back and index finger at a standard, a non-painful and a painful intensity.\nMagnetic fields were recorded by a 37-channel BTi biomagnetometer from the hemisphere contralateral to the site of stimulation.\nThe power of the early evoked magnetic field (100 ms) elicited by painful stimulation of the painful back in very chronic patients was elevated relative to that elicited by painful back stimulation of healthy controls and showed a linear increase with chronicity (r = 0.\nThe maximum activity elicited in primary somatosensory cortex was shifted more medially in the very chronic back pain subjects.\nThese data suggest that chronic pain is accompanied by cortical reorganization and may serve an important function in the persistence of the pain experience.\nResearch in animals [18,19] and humans [5,8,21] has shown that lesions of the afferent nerves may lead to extensive reorganization of the spinal and cortical zones that represent the deafferented body region.\nFor example, in upper extremity amputees the cortical representation of the face was shown to invade the representation of the hand and arm amputation zone [5,21] with the amount of reorganization observed being proportional to the magnitude of phantom limb pain [8].\nLikewise, animal and human research has shown that extensive tactile stimulation or training lead to an expansion of the respective cortical area [6,14].\nBased on these findings, we hypothesized that ongoing painful stimulation might result in cortical reorganization due to excessive nociceptive barrage entering the nervous system.\ntactile stimuli from the painful body region.\nThis increased cortical responding should not be present in response to tactile stimuli from another body region or to stimuli from another sensory modality, e.\nIn the present study magnetic source imaging was used to assess the cortical response to peripheral stimulation [1,11,12,15].\n40 years, range 2450 years, nine female) and nine ageand gender-matched healthy controls (mean age 34.\nNone of the subjects was under current medication at the time of testing.\nPrior to the experiment each subject was given a detailed demonstration of the experimental procedure and apparatus and signed informed consent.\nSubjects were paid DM 60 for participation.\nThe pain patients had all been suffering from continuous chronic low back pain of either muscular or degenerative origin for more than 1 year with an average duration of 12.\nPatients with inflammatory diseases, neurological complications, prior back-related surgery, or psychiatric problems were excluded.\nElectrical bipolar pulses with a duration of 10 ms and a pre-experimentally determined current intensity (maximum 5 mA) were applied via an intracutaneous gold electrode [2] at two different sites: over the left back in the region of the most intense pain, 3 cm lateral from the spine at L3, and at the tip of the left index finger.\nTactile perception and pain thresholds were measured in two ascending and descending series using the method of limits.\nA total of 60 stimuli at an average rate of 1/s with a mean interstimulus interval of 1 s were administered in one block.\nDuring each block one of six experimental conditions was presented in random order: sub-threshold (midway between perception and pain threshold), supra-threshold (50% above pain threshold), or a standard stimulus (i.\na stimulus with a standard intensity of 500 mA) at either the site of pain (back) or the control site (second digit).\nPain ratings were determined after each of the 24 blocks.\nA series of 240 simple tone bursts (80 dB, 1000 Hz, average ISI of 1 s) was delivered after the somatosensory stimulation sequence at the end of the experimental session.\nPrior to the experiments the patients completed three scales of part 1 of the West HavenYale Multidimensional Pain Inventory (MPI; [9,16]) which assess pain intensity, interference of pain with everyday activities and affective distress.\nAdditional medical and pain-related information was obtained from the medical records and a brief structured interview.\nSensory testing was performed using thermal and electric stimulation.\nNo significant differences in pain and perception thresholds were detected between the patients and the healthy controls (see also Table 1).\nMagnetic responses were averaged.\nfor every subject separately across the trials of the seven different experimental conditions.\nParameters of the evoked responses were extracted from the time course of the root mean square across all MEG channels (RMS) which served as a measure of signal strength.\nFrom this course the maximum RMS for the period between 40 and 100 ms was determined.\nWaveforms were digitally filtered using a low pass filter.\nThe center of the activated source was determined for all stimulation types using a single moving dipole model.\nA sphere was fit locally to the digitized head shape in the region proximal to the sensor array for each subject.\nThe location, orientation and amplitude of a best fitting equivalent current dipole were estimated for each point in time.\nThe anterior-posterior, medial-lateral, and inferior-superior coordinates of the dipole location with their confidence volumes were calculated in the head-frame based coordinate system.\n95 and a confidence volume of less than 1 cm3 were used.\nA first peak maximum was detected in the 40100 ms range.\nRepeated measures analyses of variance (ANOVAs) revealed that the stimulation at the back elicited a significantly lower magnetic response than stimuli applied to the finger (effect site F(1,18) = 33.\n48 Perception threshold back (mA) 0.\n21 Perception threshold finger (mA) 0.\nRoot mean square maximum of the somatosensory evoked magnetic field at 7075 ms for the chronic patients, the less chronic patients and the healthy controls.\ning the subjects higher perception and pain thresholds at the back as compared to the finger (F(1,18) = 7.\nThe RMS peak scores also differentiated between levels of stimulation: the non-painful stimulation elicited significantly less activation than the painful stimulation (F(3,54) = 10.\nThe RMS peak and duration of pain were significantly positively correlated (r(8) = 0.\n01) suggesting increased cortical responsivity with increasing chronicity.\nTo further analyze this relationship between cortical reactivity and chronicity, a priori contrasts which compared the highly chronic with the less chronic patients (median split) and the healthy control group were computed for both the finger and the back stimulation.\naccordance with previous findings of pain-related plastic changes at the spinal level and extend them to the supraspinal level [4].\nThe magnitude of the cortical response to tactile stimulation was positively related to the chronicity of pain.\nSubstantial and significant increases in cortical activity were only present in the subjects with longer pain duration although they were not significantly different from the group with shorter pain duration in any of the clinical variables including sensory testing.\nThe specificity of this increased cortical reactivity to stimulation from the painful body region (back versus finger) extends previous findings of our group, which suggested site-specificity of peripheral muscular responses, to cortical processing of pain [7,10].\nElectromagnetic source localization revealed that the source of the early peak at about 70 ms is located in primary somatosensory cortex.\nIn addition to the increased activity in primary somatosensory cortex, the cortical representation of the back had shifted towards a more medial position in the chronic back pain group.\nThis suggests not only enhanced reactivity but might indicate an expansion of the back representation into the neighboring (foot and leg) area.\nThis finding is in accordance with our previous report of a strong positive correlation between the shift of the cortical representation of an amputated body part and the magnitude of phantom limb pain in upper extremity amputees [8].\nAdditional research with other complementary imaging methods such as positron emission tomography or functional magnetic resonance imaging is needed to further investigate both the extent and the source of the reorganization observed in this study.\nThe enlarged cortical representation of chronic pain observed in this study might contribute to and maintain the continuing experience of pain in chronic pain patients.\nAverage location of the finger and back dipole in the 70 ms range for the chronic patients and the healthy controls are superimposed schematically on a magnetic resonance image (the locations of the subchronic group coincided with those of the healthy controls and are therefore not displayed).\ntion of central neuroplasticity to pathological pain: review of clinical and experimental evidence, Pain, 52 (1993) 259285.\n, Extensive reorganization of the somatosensory cortex in adult humans after nervous system injury, NeuroReport, 5 (1994) 2593 2597.\n, Increased cortical representation of the fingers of the left hand in string players, Science, 270 (1995) 305307.\n, Symptom-specific responding in chronic pain patients and healthy controls, Psychophysiology, 29 (1992) 452460.\n, Phantom limb pain as a perceptual correlate of massive cortical reorganization in upper extremity amputees, Nature, 357 (1995) 482484.\n, Zur Anwendbarkeit des West Haven-Yale Multi-dimensional Pain Inventory im deutschen Sprachraum: Daten zur Reliabilitat und Validitat des MPI-D (the applicability of the West HavenYale Multidimensional Pain Inventory in German-speaking countries: data on the reliability and validity of the MPI-D), Der Schmerz, 4 (1990) 82 87.\n, Assessment of stress-related psychophysiological reactions in chronic back pain patients, J.\n, The West HavenYale Multidimensional Pain Inventory (WHYMPI), Pain, 23 (1985) 345356.\n, Massive cortical reorganization after sensory deafferentation in adult macaques, Science, 252 (1991) 18571860.\n, Experimental referred pain and hyperalgesia from muscles in humans."}