{"title": "30.pdf", "contents": "Objective: To define the nomenclature and physiologic mechanisms responsible for functional joint stability.\nData Sources: Information was drawn from an extensive MEDLINE search of the scientific literature conducted in the areas of proprioception, neuromuscular control, and mechanisms of functional joint stability for the years 1970 through 1999.\nAn emphasis was placed on defining pertinent nomenclature based on the original references.\nData Synthesis: Afferent proprioceptive input is conveyed to all levels of the central nervous system.\ntal roles in optimal motor control and sensorimotor control over functional joint stability.\nConclusions/Applications: Sensorimotor control over the dynamic restraints is a complex process that involves components traditionally associated with motor control.\nRecognizing and understanding the complexities involved will facilitate the continued development and institution of management strategies based on scientific rationales.\nhe purpose of this 2-part series is to provide an overview of the current understanding surrounding peripheral afferent information acquisition and processing and levels of motor control as they relate to functional joint stability.\nWe recognize that these papers focus heavily upon basic science research that, in many circumstances, lacks immediate clinical application.\nOur premise is to present the athletic training community with an introduction concerning how the dynamic restraints are activated and controlled by the motor control system of the body.\nOur goal is that these papers may initiate common understanding regarding the terminology and underlying physiology associated with proprioception and neuromuscular control.\nUltimately, by establishing a baseline understanding about the sensorimotor system, clinical techniques can continue to be developed and applied with scientific rationale.\nFurthermore, through this understanding, clinicians can appreciate future developments and research directions focusing on the restoration of functional joint stability.\nThe purpose of this first paper is to introduce the sensorimotor motor system, the biological system that controls the contributions of the dynamic restraints for functional joint stability.\nA secondary purpose is to define the nomenclature pertaining to the mechanisms responsible for both the sensory and motor components of proprioception and neuromuscular control for the maintenance of functional joint stability.\nour discussion by defining some broad terms used in the medical and physiologic literature.\nHomeostasis is defined as the dynamic process by which an organism maintains and controls its internal environment despite perturbations from external forces.\n1 Because cells, tissues, and organs operating within the body can only function within narrow ranges of environmental conditions, maintaining homeostasis becomes the major driving force underlying many, if not all, physiologic functions of the body.\nThe body is composed of many systems that operate automatically and subconsciously to maintain the body in a homeostatic condition.\n2 A system is specifically defined as an organized grouping of related structures that perform certain common actions.\n3 Systems are organized hierarchically, beginning at the cellular level, and contribute to bodily homeostasis in specific domains.\nIn a healthy individual, the systems homeostasis is usually maintained by 2 different control systems.\nStimulation of a corrective response within the corresponding system after sensory detection is often considered feedback controls.\nIn contrast, feedforward controls have been described as anticipatory actions occurring before the sensory detection of a homeostatic disruption.\n4,5 Initiated feedback actions are largely shaped by previous experience with the detected stimulus.\nSomatosensory, visual, and vestibular input provides the information necessary for both forms of control during motor activities; however, the methods of information processing differ.\n5 Feedback control is characterized by a continual processing of afferent information, providing response control on a moment-to-moment basis.\nIn contrast, afferent information during feedforward control is used intermittently until feedback controls are initiated.\nThe sensorimotor system incorporates all the afferent, efferent, and central integration and processing components involved in maintaining functional joint stability.\nAlthough visual and vestibular input contributes, the peripheral mechanoreceptors are the most important from a clinical orthopaedic perspective.\nThe peripheral mechanoreceptors (pictured on the lower left) reside in the cutaneous, muscular, joint, and ligamentous tissues.\nAfferent pathways (dotted lines) convey input to the 3 levels of motor control and associated areas such as the cerebellum.\nActivation of motor neurons may occur in direct response to peripheral sensory input (reflexes) or from descending motor commands, both of which may be modulated or regulated by the associate areas (gray lines).\nEfferent pathways from each of the motor control levels (solid lines) converge upon the alpha and gamma motor neurons located in the ventral aspects of the spinal cord.\nThe contractions by the extrafusal and intrafusal muscle fibers cause new stimuli to be presented to the peripheral mechanoreceptors.\nUnfortunately, classifying an action as either feedback or feedforward is not as straightforward as their definitions suggest.\nIn some circumstances, a combination of both feedforward and feedback control exists, such as during the maintenance of postural control.\n6 Additionally, consider the situation in which a subject watches a tester trigger a device that induces a joint perturbation.\nMany subjects will naturally tense up when they see the tester beginning to push the trigger before the perturbation.\nWhether the muscle activation before the perturbation reaching the joint is the result of feedforward or feedback control remains controversial.\nFor this reason, the term feedforward control has been recommended to describe actions occurring upon the identification of the beginning, as well as the effects, of an impending event or stimulus.\n4,5,7 In contrast, feedback control should be used to describe actions occurring in response to the sensory detection of direct effects from the arrival of the event or stimulus to the system.\nThe actions occurring with both feedback and feedforward controls involve the hierarchic organization of a system, beginning at the cellular level and extending through both the tissue and organ levels.\nThe action patterns used to restore homeostasis are defined as mechanisms.\n3 For example, the reflexive response is the mechanism the body uses to maintain or restore joint stability after an imposed joint perturbation.\nWithin a given mechanism are multiple processes that ultimately lead to the achievement of the result.\nIn the case of joint perturbation, the processes include mechanoreceptor stimulation, neural transmission, integration of the signals by the central nervous system (CNS), transmission of an efferent signal, muscle activation, and force production.\nBy definition, for the purposes of this paper, assessing a mechanism refers to the cumulative outcome of the underlying processes.\nDuring many clinical and research evaluations, inferences about the integrity of mechanisms are made by measuring specific characteristics of the underlying processes.\nOnset latency of muscle activation, as measured through electromyography, is frequently assessed in joint perturbation.\nOne additional physiologic term requiring attention in a broad context before our specialized discussion is stability.\nStability is defined as the state of remaining unchanged, even in the presence of forces that would normally change the state or condition.\n3 It has been further described as the property of returning to an initial state upon disruption.\n4 With respect to joints, based on the above definitions, we define stability as the state of a joint remaining or promptly returning to proper alignment through an equalization of forces.\nThe sensorimotor system, a subcomponent of the comprehensive motor control system of the body, is extremely complex.\nThe term sensorimotor system was adopted by the participants of the 1997 Foundation of Sports Medicine Education and Research workshop to describe the sensory, motor, and central integration and processing components involved in maintaining joint homeostasis during bodily movements (functional joint stability) (Figure 1).\n9 The components giving rise to functional joint stability must be flexible and adaptable because the required levels vary among both persons and tasks.\nThe process of maintaining functional joint stability is accomplished through a complementary relationship between static and dynamic components.\nprise the static (passive) components.\n10,11 Dynamic contributions arise from feedforward and feedback neuromotor control over the skeletal muscles crossing the joint.\nUnderlying the effectiveness of the dynamic restraints are the biomechanical and physical characteristics of the joint.\nThese characteristics include range of motion and muscle strength and endurance.\nFrom these descriptions of static and dynamic stability components, it becomes apparent that the terms are not synonymous.\nIntegrity of static stabilizers is measured through clinical joint stress testing (ligamentous laxity testing) and arthrometry, giving rise to the frequently used term clinical stability.\nBecause of the complexity of the control over the dynamic restraints, measuring dynamic stability is more challenging.\nCurrently, as described in a companion paper,12 we are only able to quantitatively measure certain characteristics of the dynamic stability mechanism.\nProprioception predominates as the most misused term within the sensorimotor system.\nIt has been incorrectly used synonymously and interchangeably with kinesthesia, joint position sense, somatosensation, balance, and reflexive joint stability.\nIn Sherringtons13 original description of the proprioceptive system, proprioception was used to reference the afferent information arising from proprioceptors located in the proprioceptive field.\n13 In several of his writings, Sherrington13,14 declared proprioception as being used for the regulation of total posture (postural equilibrium) and segmental posture (joint stability), as well as initiating several conscious peripheral sensations (muscle senses).\nAlthough he considered vestibular information to be proprioceptive with respect to the head, Sherrington13 clearly delineated the functions of labyrinth from those receptors in the periphery.\nAccording to Matthews,15 Sherrington described 4 submodalities of muscle sense in Schafers Textbook of Physiology: (1) posture, (2) passive movement, (3) active movement, and (4) resistance to movement.\nThese submodality sensations correspond to the contemporary terms joint position sense (posture of segment), kinesthesia (active and passive), and the sense of resistance or heaviness.\nThus, proprioception correctly describes afferent information arising from internal peripheral areas of the body that contribute to postural control, joint stability, and several conscious sensations.\nIn contrast to proprioception, the term somatosensory (or somatosensation) is more global and encompasses all of the mechanoreceptive, thermoreceptive, and pain information arising from the periphery.\n2 Conscious appreciation of somatosensory information leads to the sensations of pain, temperature, tactile (ie, touch, pressure, etc), and the conscious submodality proprioception sensations.\nThus, as Figure 2 illustrates, conscious appreciation of proprioception is a subcomponent of somatosensation and, therefore, the terms should not be used interchangeably.\nAlthough Sherringtons definition of the proprioceptive field clearly excludes the receptors sensitive to the external environment (extero-ceptive field), he did not imply that the receptors in each region function in total exclusion of one another.\nRather, Sherrington recognized the interaction between receptors located in both regions of the body, referring to the relationship between the receptors in the exteroceptive and proprioceptive environments as allied.\nDepending upon the exact circumstances of a situation or task, sources contributing to conscious sensations of proprioception (ie, joint position sense) could potentially include the deeper receptors (ie, joint and muscle mechanoreceptors) typically associated with proprioception or the more superficial receptors that elicit tactile sensations, or both.\nTherefore, although the proprioception and tactile sensations are considered to be distinctly different sensory phenomena, similar sensory organs may contribute to each conscious sensation under particular conditions.\nA complete discussion of the sources contributing to conscious proprioception perception is presented in a later section of this paper.\nLastly, mechanoreceptors conveying proprioceptive information are often labeled as proprioceptors.\n13,14,16,17 However, in addition to mechanoreceptors located in Sherringtons proprioceptive field being referred to as proprioceptors, the term has also been used for the mechanoreceptors located at the surface of the body, and portions of the vestibular apparatus responsible for conveying information regarding the orientation of the head with respect to gravity.\nThus, to avoid potential confusion from this wide disparity of use, we recommend utilizing more specific references to the mechanoreceptors of interest.\nNeuromuscular control is a frequently used term in many disciplines related to motor control.\nIt can refer to any of the aspects surrounding nervous system control over muscle activation and the factors contributing to task performance.\nSpecifically, from a joint stability perspective, we define neuromuscular control as the unconscious activation of dynamic restraints occurring in preparation for and in response to joint motion and loading for the purpose of maintaining and restoring functional joint stability.\nAlthough neuromuscular control underlies all motor activities in some form, it is not easily separated from the neural commands controlling the overall motor program.\nFor example, in throwing a ball, particular muscle activation sequences occur in the rotator cuff muscles to ensure that the optimal glenohumeral alignment and compression required for joint stability are provided.\nThese muscle activations take place unconsciously and synonymously with the voluntary muscle activations directly associated with the particulars of the task (ie, aiming, speed, distance).\nProprioceptive information concerning the status of the joint and associated structures is essential for neuromuscular control.\nThe use of proprioception for motor control and neuromuscular control is the focus of part II of this article.\nSources of Proprioceptive Input.\nBased on Sherringtons definition of the proprioceptive field,13 the mechanoreceptors responsible for proprioceptive information are primarily found in muscle, tendon, ligament, and capsule,5,11,1828 with the mechanoreceptors located in the deep skin and fascial layers traditionally associated with tactile sensations being theorized supplementary sources.\n18,25,2830 In general, mechanoreceptors are specialized sensory receptors responsible for quantitatively transducing the mechanical events occurring in their host tissues into neural signals.\nThe final common input hypothesis.\n24 Peripheral receptors from cutaneous, muscle (Golgi tendon organs and muscle spindle afferents), and articular tissues, as well as descending commands from supraspinal areas, converge onto the static and dynamic  motor neurons.\nCollectively, all of these influences alter the sensitivity of muscle spindles; thus, the final afferent signals arising from the muscle spindles can be considered a function of both the preceding influential activity and muscle length.\nerally occurs in a similar manner across the various mechanoreceptors, each morphologic type possesses some degree of specificity for the sensory modality to which it responds (light touch versus tissue lengthening), as well as the range of stimuli within a sensory modality.\n31 As several detailed reviews have been published on the subject,11,2224,28,3234 we offer only a brief review of the characteristics and functions of joint and muscle mechanoreceptors.\n22 They are considered to behave as both static and dynamic receptors based on their low-threshold, slow-adapting characteristics.\n26 In contrast, the low-threshold, rapidly adapting characteristics of Pacinian corpuscles cause them to be exclusively classified as dynamic receptors.\n11,26,28,35 Mechanoreceptors located within musculotendinous tissue include the Golgi tendon organs (GTOs) spaced along the musculotendinous junction at varying intervals and the muscle spindles located in the muscle tissue.\nThrough each GTO passes a small bundle of muscle tendon fibers destined to attach to muscle fibers.\nThis series arrangement, coupled with the very low threshold and high dynamic sensitivity exhibited by the sensory endings, enables GTOs to provide the CNS with feedback concerning muscle tension.\n23 GTOs function primarily in signaling active muscle tension (tension developed during contraction) rather than passive tension (tension developed during inactive muscle stretching).\n23 As a whole, muscle spindles are responsible for conveying information regarding muscle length and rate of changes in length.\nMuscle spindles consist of specialized afferent nerve endings that are wrapped around modified muscle fibers (intrafusal fibers), several of which are enclosed in a connective tissue capsule.\n19,36 There are different types of intrafusal fibers: some are mainly sensitive to changes in muscle length, whereas others are more sensitive to the rate of change in muscle length.\n36 Although the central areas of the intrafusal muscle fibers lack contractile elements, the peripheral areas contain contractile elements, which are innervated independent of extrafusal (skeletal) muscle fibers via the gamma motor neurons ( MNs).\nActivation of the peripheral contractile elements stretches the central regions containing the sensory receptors from both ends.\nThis results in an increase in the firing rates of the sensory ending and an increase in the sensitivity of the muscle spindle to length changes.\n19 At the spinal level, various peripheral receptors, such as skin receptors, articular receptors, and chemoreceptors, strongly influence the activity of the MN system24,3741 and, therefore, the muscle spindle in providing afferent information.\nIntegration of sensory input received from all parts of the body is largely considered to begin at the level of the spinal cord.\nIntegration describes the summation, gating, and modulation mechanisms that occur as a result of various combinations of excitatory and inhibitory synapses with the afferent neurons.\nAfferent integration is an essential component of coordinated, fluid motor control and.\noccurs along all levels of the CNS.\nThis section offers only a brief overview of afferent integration at the spinal level, as a detailed review has previously been published.\n42 In contrast to the few tactile neurons that travel directly to the cortex without synapsing,43 many of the axons conveying proprioceptive information bifurcate once they enter the dorsal horn of the spinal cord to synapse with interneurons.\nThe essence of afferent integration at the spinal cord level lies with the interneurons and the neurons connecting with higher CNS levels.\nControl over these neurons via descending commands from the brain stem and cortex provides these centers with the ability to filter the sensory input that will be conveyed via the ascending tracts.\n7 In other words, the supraspinal CNS regions modulate the sensory information from the periphery that enters the ascending tracts.\nAn additional hypothesis, the final common input hypothesis proposed by Johannson et al,24 presents an additional and supplemental integrative mechanism.\nThis hypothesis resides on the strong influence that the muscle, skin, and joint afferents and descending pathways have over gamma neuron activation.\n24 As mentioned previously, the peripheral regions of intrafusal muscle fibers contain contractile elements innervated by  MNs, with the level of activation directly controlling muscle spindle sensitivity.\nAny of the signals barraging the MN pools alter their level of activation, and, therefore, influence the input arising from the muscle spindles.\nThus, the afferent signals from muscle spindles are hypothesized to be a function of muscle length changes superimposed on the integrated peripheral receptor and descending pathway information.\nIn this manner, the -MN system may be considered a premotor neuronal integrative system that conducts polymodal feedback to the CNS (Figure 3).\nTwo theories describe the methods by which specific proprioceptive messages from the various receptors are conveyed to the CNS.\nThe first theory, the labeled line theory, is based.\non the presumption that each unique stimulus triggers a certain receptor connected to a specific nerve fiber that terminates at a specific point or multiple points within the CNS.\nThe second theory, ensemble coding, suggests that proprioceptive information is transferred to the CNS through an encoding across a neural population of receptors rather than discrete units from the individual receptors.\nApplication of this theory to the sensorimotor system has been largely a result of the work by Johansson et al.\n11,24 Clinically, this theory may help explain the improved conscious proprioceptive acuity4446 and reduction in subjective instability complaints associated with elastic wraps and neoprene bracing.\nAscending Spinal Tracts Conveying Proprioceptive Information.\nMost proprioceptive information travels to higher CNS levels through either the dorsal lateral tracts or the spinocerebellar tracts.\nThe 2 dorsal lateral tracts are located in the posterior region of the spinal cord and ultimately convey the signals to the somatosensory cortex.\nAlthough the majority of the sensations traveling in this tract are touch, pressure, and vibration, various amounts of the conscious appreciation of position and kinesthetic sensations have also been attributed to this tract.\n2,43 The spinocerebellar tracts are characterized by the fastest transmission velocities in the CNS.\nAs their name suggests, the spinocerebellar tracts terminate in various areas of the cerebellum, where the signals may be processed and integrated with other afferent and descending information.\nIn contrast to the conscious sensory appreciation associated with the dorsal lateral tracts, the spinocerebellar tracts are believed to be responsible for nonconscious proprioception (ie, limb position, joint angles, and muscle tension and length) used for reflexive, automatic, and voluntary activities.\n25 In addition to relaying peripheral afferent information, parts of these tracts are associated with transmitting an efferent copy of motor neuron drive back to the higher CNS levels.\nConscious Perception of Proprioception.\nSherringtons early 1900s view attributing the sense of kinesthesia and joint position sense (muscular sense) to muscle receptors was accepted for most of the century,15 with a brief hiatus existing for a short time period (19501970) when several authors15,47 considered joint receptors to be the primary source.\n15 The premise shifted back to muscle receptors after the demonstration of joint receptors response voids through the midranges of motion48,49 and reports of movement illusions caused by tendon vibration.\n50 Our survey of the available literature on this topic up to present times reveals a plethora of conflicting evidence supporting each tissues receptors (joint, muscle, and cutaneous) as the predominant source.\ntional, full-range joint movements.\nThe first step in determining whether a group of tissue receptors could potentially contribute to conscious appreciation of kinesthesia and JPS is through documentation of response sensitivity through the full physiologic range of joint motion.\n53 Several authors35,47,54 have concluded, based on this evidence, that joint capsular afferents are unlikely to signal JPS and kinesthesia information through the midranges of motion and that their only proprioceptive function is signaling endranges of motion.\nIt is important to note, however, that the evidence upon which many of these conclusions are based was collected during passive movements.\nAs Pedersen et al41 stated, researchers55,56 have reported increases in joint receptor working ranges (angular range in which a receptor remains active) during active movements.\nSimilar to joint afferents, cutaneous afferents have been speculated to respond only at the extremes of motion.\n52 Unfortunately, this finding is not without controversy, as several authors57,58 have recently attributed cutaneous mechanoreceptors with a precise ability to convey joint movements through skin strain patterns.\nIn contrast to joint and cutaneous mechanoreceptors, muscle spindles have been almost universally described as able to respond unidirectionally across the entire physiologic range of movement.\n30,54 As mentioned previously, proprioception for conscious appreciation travels via the dorsal lateral tracts, with the contributions to these tracts from muscle and joint mechanoreceptors remaining largely unknown.\nThus, demonstrating the existence of projections to the cortical sensory areas and conscious perceptions after direct receptor stimulation is the second necessity in determining the predominant source of conscious proprioception (Figure 4).\nCortical projections have been reported from joint (both capsular and ligament) afferents,5964 muscle spindles,65 and GTOs.\n66,67 With respect to conscious appreciation of peripheral receptor stimulation, electric stimulation of both joint and cutaneous (slowly adapting type II) afferent fibers were reported to elicit sensations related to the relevant joint and evoke perceptions of joint movement, respectively.\n30 Edin and Johansson29 demonstrated that mechanical stimulation of cutaneous receptors elicited kinesthetic sensations.\nWhile direct stimulation of a single muscle spindle afferent failed to elicit movement perception,30 stimulation of several muscle spindles through vibration50,68 and isolated traction68, 69 has been reported to evoke conscious movement sensations.\nThe failure of joint and cutaneous afferents anesthesia to disrupt conscious kinesthesia and JPS provides further support for the importance of muscle receptors in conscious proprioception.\nThe role of the articular mechanoreceptors in sensorimotor control over dynamic joint stability and conscious appreciation of proprioception.\nIn summary, the predominant source or sources contributing to the conscious proprioception remains quite open to debate.\nWe theorize that part of the controversy may reside with the different methods used by researchers.\nFor example, results attained through electric afferent stimulation may not be related to the normal physiologic processes.\nIn addition, we suspect that the underlying processes contributing to the conscious proprioceptive perceptions may differ across anatomical locations.\nFor instance, the results demonstrating the importance of cutaneous receptors to kinesthesia in the finger joints may not be applicable to other areas of the body, especially those containing sparser populations of cutaneous receptors.\nIt is quite probable that the relative importance of each receptor varies according to each unique movement or task, or both.\nFurthermore, the strong evidence suggesting that the CNS determines proprioceptive input from populations of receptors (ensemble coding) cannot be ignored.\nThis would indicate that the absence of input from joint receptors during midranges of motion may be as important as the active input arising from muscle spindles, especially when coupled with the connections between joint receptors and -MN activation.\nThe motor components of the sensorimotor system contributing dynamic joint stability are synonymous with areas controlling whole-body motor control.\nThese components consist of a central axis and 2 associate areas.\nThe central axis corresponds to the 3 levels of motor control, spinal cord, brain stem, and cerebral cortex,43 whereas the 2 associate areas, cerebellum and basal ganglia, are responsible for modulating and regulating the motor commands.\n5 Sensory information underlies the planning of all motor output and, as described in previous sections, is conveyed to all 3 levels of motor control.\nActivation of motor neurons may occur in direct response to peripheral sensory input (reflexes) or from descending commands initiated in the brain stem or cerebral cortex, or both.\noccurs through signal convergence onto the motor neurons located in the spinal ventral horns.\n13,14 Both types of motor neurons, alpha motor neurons ( MNs) controlling extrafusal muscle fibers (skeletal) and  MNs controlling intrafusal muscle fibers (muscle spindles), exit the spinal ventral horns.\n5,72 The hierarchic organization allows the lower motor areas to automatically control the details of common motor activities, while the higher centers can devote resources to controlling the more precise and dexterous motor activities.\nIt should be apparent from our earlier discussion that the spinal cord plays an integral role in motor control, despite the gross anatomy suggesting it may only be a medley of conduction pathways.\nFrom the spinal cord arise direct motor responses to peripheral sensory information (reflexes) and elementary patterns of motor coordination (rhythmic and central pattern generators).\nAs discussed earlier, very little afferent input and few descending commands synapse directly on motor neurons.\nEven in the case of a simple monosynaptic reflex, such as the stretch reflex, birfurcations from the incoming afferent fiber arise.\nThe bifurcations and interneuronal networks provide the basis for the spinal cords efferent integrative functions.\nReflexes may be elicited from the stimulation of cutaneous, muscle, and joint mechanoreceptors and may involve excitation of  MNs,  MNs, or both.\nThese reflexes, as well as the other reflexes attributed to the spinal cord neuronal circuitry, are more complex than simple direct input-output connections.\nSuperimposed on even the simplest monosynaptic reflexes are influences from such sources as other afferent input, descending commands, or both.\nDespite being the most primitive part of the brain from a phylogenetic perspective,43 the brain stem contains major circuits that control postural equilibrium and many of the automatic and stereotyped movements of the body.\n5,36,43 In addition to being under direct cortical command and providing an indirect relay station from the cortex to the spinal cord, areas of the brain stem directly regulate and modulate motor activities based on the integration of sensory information from visual, vestibular, and somatosensory sources.\n5 Two main descending pathways, the medial and lateral pathways, extend from the brain stem to the spinal cord neural networks.\nrons innervating the axial and proximal muscles, while the lateral pathway controls the distal muscles of the extremities.\nIn addition to controlling postural control, some axons comprising the medial pathways make excitatory and inhibitory (including suppression of spinal reflexes) synapses with the interneurons and motor neurons involved with movement and postural control.\nThrough influences on the  MNs, parts of both the medial and lateral tracts assist in maintaining and modulating muscle tone.\nIn general, the motor cortex is responsible for initiating and controlling more complex and discrete voluntary movements.\nIt is divided into 3 specialized and somatotopically organized areas, each of which project directly and indirectly (via the brain stem) onto interneurons and motor neurons located in the spinal cord.\n74 The first area, the primary motor cortex, receives peripheral afferent information via several pathways and is responsible for encoding the muscles to be activated, the force the recruited muscles produce, and the direction of the movement.\n43,72 The second area, the premotor area, also receives considerable sensory input72; however, it is mainly involved with the organization and preparation of motor commands.\nThe supplemental motor area, the third specialized area of the motor cortex, also plays an important role in programming complex sequences of movement that involve groups of muscles.\n72,74 The major direct descending pathway from the motor cortex to the  MNs and  MNs is the corticospinal tract.\nIn addition to influencing motor functions directly, the corticospinal tract also affects motor activity indirectly through the descending brain stem pathways.\nAlthough the 2 associate areas, the cerebellum and basal ganglia, cannot independently initiate motor activity, they are essential for the execution of coordinated motor control.\nThe cerebellum, operating entirely at a subconscious level, plays a major role in both the planning and modification of motor activities though comparison of the intended movement with the outcome movement.\n75,76 This is accomplished through the continuous inflow of information from the motor control areas and the central and peripheral sensory areas.\nThe first division receives vestibular input, both directly and indirectly from the vestibular labyrinth (semicircular and otolith receptors) and, as might be surmised based on the input, is involved with postural equilibrium.\nThe second cerebellar division is mainly responsible for the planning and initiation of movements, especially those requiring precise and rapid dexterous limb movements.\nIn addition to the somatosensory input, this division of the cerebellum also receives input from the vestibular labyrinth and visual and auditory organs.\nThe output from the spinocerebellum serves to adjust ongoing movements through influential connections on the medial and lateral descending tracts in the brain stem and cortex via projections on the vestibular nucleus, reticular formation, red nucleus, and motor cortex.\n75 Lastly, the cerebellum also receives an efferent copy of the motor commands arriving at the ventral roots of the spinal cord.\n76 The cerebellum has also been implicated in motor learning.\n43,77 With respect to motor control, the basal ganglia are believed to be involved with more higher-order, cognitive aspects of motor control.\n77 An additional distinction from the cerebellum is that the basal ganglia receive input from the entire cerebral cortex, not just those associated with sensory and motor function.\nThe sensorimotor system encompasses all of the sensory, motor, and central integration and processing components involved with maintaining joint homeostasis during bodily movements (functional joint stability).\nWe have attempted to introduce the physiology of joint stability through an in-depth presentation of the sensorimotor system.\nAs evident from the sections concerning ascending proprioception pathways and levels of motor control, the sensorimotor system is much more complex than a simple input-output system that resides primarily in the lower levels of motor control.\nRather, activation of the dynamic restraints, and therefore, functional joint stability, arises from components synonymous with the entire motor control system of the body.\nIn the absence of mechanical stability, the fact that many individuals return to preinjury levels suggests that some degree of compensatory mechanisms can be developed to provide the supplemental stability required.\nThese compensatory mechanisms most likely arise from the dynamic restraints of the involved joint, as well as motor adaptations at proximal and distal segments.\nIn part II of this article, we will discuss the importance of proprioception in organizing muscle activation for both motor control and sensorimotor control of functional joint stability.\nNew York, NY: Random House; 1989.\nPhiladelphia, PA: WB Saunders; 1992.\nPhiladelphia, PA: FA Davis; 1993.\nThe control of movement.\nPrinciples of Neural Science.\nNew York, NY: Elsevier Science; 1991:533547.\nOpen-loop and closed-loop control of posture: a random-walk analysis of center-of-pressure trajectories.\nSt Louis, MO: Mosby-Year Book Inc; 1998.\nThe role of proprioception and neuromuscular control in the management of knee and shoulder conditions.\nFoundation of Sports Medicine Education and Research; August 2224, 1997; Pittsburgh, PA.\nStabilization by capsule, ligaments and labrum: stability at the extremes of motion.\nRosemont, IL: American Academy of Orthopaedic Surgeons; 1993:6989.\nThe neurophysiology of joints.\nSensorimotor system measurement techniques.\nWhere does Sherringtons muscular sense originate? Muscles, joints, corollary discharges? Annu Rev Neurosci.\nAnimal solutions to problems of movement control: the role of proprioceptors.\nArticular reflexes at the ankle joint: an electromyographic study of normal and abnormal influences of ankle joint mechanoreceptors upon reflex activity in the leg muscles.\nMuscle receptors and spinal reflexes: the stretch reflex.\nSpinal mechanism of motor coordination.\nNew York, NY: Elsevier Science; 1991:580595.\nContibution of peripheral somatosensory system to balance and postural equilibrium.\nGolgi tendon organs in mammalian skeletal muscle: functional properties and central actions.\nThe somatosensory system I: discriminative touch and position sense.\nThe neurology of joints.\nFreeman MAR, Wyke B.\nPeripheral neural mechanisms in proprioception.\nEdin BB, Johansson N.\nSkin strain patterns provide kinaesthetic information to the human central nervous system.\nPerceptual responses to microstimulation of single afferents innervating joints, muscles and skin of the human hand.\nmodalities: on the significance of the activity of individual sensory neurons.\nMechanoreceptors in human cruciate ligaments: a histological study.\nMotor system I: peripheral sensory, brainstem and spinal influence on ventral horn neurons.\nNew York, NY: Churchill Livingstone Inc; 1997:335346.\nActions on gamma motorneurones elicited by electrical stimulation of group I muscle afferent fibres in the hind limb of the cat.\nJohansson H, Sjolander P, Sojka P, Wadell I.\nReflex actions on the muscle spindle systems of muscles acting at the knee joint elicited by stretch of the posterior cruciate ligament.\nActions on gamma-motoneurones elicited by electrical stimulation of joint afferent fibres in the hind limb of the cat.\nLocalized muscle fatigue decreases the acuity of the movement sense in the human shoulder.\nProprioception following anterior cruciate ligament reconstruction.\nThe effect of elastic bandages on human knee proprioception in the uninjured population.\nKnee bracing: effects on proprioception.\nClark FJ, Burgess PR.\nSlowly adapting receptors in cat knee joint: can they signal joint angle? J Neurophysiol.\nCharacteristics of knee joint receptors in the cat.\nThe contribution of muscle afferents to kinaesthesia shown by vibration induced illusions of movment and by the effects of paralysing joint afferents.\nMechanical factors influencing response of joint afferent neurons from cat knee.\nResponses to passive movement of receptors in joint, skin and muscle of the human hand.\nThe contribution of articular receptors to proprioception with the fingers in humans.\nSignaling of kinesthetic information by peripheral sensory receptors.\nJoint receptors modulate short and long latency muscle responses in the awake cat.\nJoint afferent fibres responding to muscle stretch, vibration and contraction.\nQuantitative analysis of static strain sensitivity in human mechanoreceptors from hairy skin.\nFibre components and cortical projections of the elbow joint nerve in the cat.\nPathways to the cerebral cortex for afferent fibers from the hindleg of the cat.\nAnatomical and physiological studies of knee joint innervation in the cat.\nProjections to the cats cerebral cortex from low threshold joint afferents.\nModality and topographic propertices of single neurons of cats somatic sensory cortex.\nThe intraoperative evaluation of the neurosensory function of the anterior cruciate ligament in humans using somatosensory evoked potentials.\nSomatosensory evoked potentials following proprioceptive stimulation of finger in man.\nPathway to the cerebral cortex for impulses from tendon organs in the cats hind limb.\nCortical projection of afferent information from tendon organs in the cat.\nSensory effects of pulling or vibrating exposed tendons in man.\nMotor system II: corticofugal systems and the control of movement.\nThe functional anatomy of the cerebellum: an overview.\nIn: Lephart SM, Fu FH, eds.\nCote L, Crutcher MD.\nNew York, NY: Elsevier Science; 1991:647659."}