{"title": "50.pdf", "contents": "The subjective experience of emotion: a fearful view Joseph E LeDoux1 and Stefan G Hofmann2.\nWe argue that subjective emotional experience, the feeling, is the essence of an emotion, and that objective manifestations in behavior and in body or brain physiology are, at best, indirect indicators of these inner experiences.\nAs a result, the most direct way to assess conscious emotional feelings is through verbal self-report.\nWhile the behavioral and physiological responses are not emotions, they contribute to emotions indirectly, and sometimes profoundly.\nWhether non-verbal animals have emotional experiences is a difficult, maybe impossible, question to answer in the positive or negative.\nBut because behavioral and physiological responses are important contributors to emotions, and the circuits underlying these are highly conserved, studies of animals have an important role in understanding how emotions are expressed and regulated in the brain.\nConflation of circuits that directly give rise to conscious emotional feelings with circuits that indirectly influences these conscious feelings has hampered progress in efforts to understand emotions, and also to understand and to develop treatments for emotional disorders.\nRecognition of differences in these circuits will allow research in animals to have a lasting impact on understanding of human emotions as research goes forward.\nThe English word emotion is based on the Latin emovere, which means to move away from.\nWhen first applied to psychological events in the 17th century, it pointed to an excited state of mind that causes movement (behavior).\nIn this article, we argue that restriction of the use of the term emotion to subjective experiences, and use of other terminology to describe objective responses that are often correlated with emotional experiences would eliminate much of the conceptual confusion.\nMeasuring subjective experiences Before considering different approaches to subjective experiences, it is important to discuss how these unobservable private events are studied.\nVerbal self-report remains the gold standard in studies of consciousness.\nContemporary views of subjective emotional experiences in relation to brain circuits Four contemporary approaches to subjective emotional experiences in the brain, and the historical roots of each, are described below.\nIncluded are approaches in the traditions of Charles Darwin, William James, behaviorism, and cognitive psychology.\nThe Neuro-Darwinian Approach: Subjective Fear is an Innate State of Mind Inherited from Animal Ancestors.\nThis is consistent with the original 17th century use of the term emotion mentioned above.\nIt is still the commonsense view of emotion that most people have, and also underlie Ekmans widely cited basic emotions theory [23].\nA contemporary neuroscience proponent of the traditional Darwinian view is Jaak Panksepp, who views emotions as subjective feelings that emerge from a subcortical neural circuit that is highly conserved across mammals, including humans [24,25].\nThe circuit is centered on the amygdala and related subcortical areas [24].\nIn Panksepps formulation, the amygdala circuit, when activated by a threat to well being, both gives rise to fearful feelings (subjective feelings of fear) and controls innate behaviors and supporting physiological responses that help the organism defend against harm.\nCognitive elaboration of subcortical fear by higher-cortical prefrontal circuits makes possible introspection and verbal reports of fear in humans.\nBut the core of fear is the inherited mental state arising from the subcortical circuit.\nProblematic for this view is evidence suggesting that the experience of fear is not embodied in the amygdala.\nSpecifically, studies in humans show that the amygdala can respond to threats without the person knowing the threat is present and without feeling fear, and other studies show that fear can be experienced when the amygdala is damaged [26,27]; for review see [6,7].\nAlso, medications can change behavioral responses to threats without changing subjective feelings of fear [28,29].\nThus, while the amygdala controls behavioral responses to threats it does not seem to be directly responsible for the subjective experience of fear.\nOne could argue that perhaps other subcortical areas are responsible.\nBut the emphasis in the literature has been on the amygdala.\nMoreover, the other hypothetical subcortical circuits would need to be identified before the role can be evaluated.\nThe Neuro-Jamesian Approach: Subjective Fear is a Consequence of Feedback from Body Responses.\nWilliam James famously argued that fear and other emotional experiences result by way of feedback from the act of responding [30].\nview, fear does not cause the responses but instead results as a consequence of the responses.\nInitially, Damasio emphasized cortical body sensing circuits but more recently has emphasized brainstem circuits [32].\nAs in Panksepps theory, cognitive elaboration by highercortical circuits allows introspection and self-reporting about these states in Damasios theory.\nWhile these circuits clearly represent body states, convincing evidence that these representations are the main causes of emotional experiences is lacking [6].\nWe propose below that body feedback makes important contributions to emotional experiences, but as modulators rather than as direct causes.\nThe Neuro-Behaviorist Approach: Subjective Fear is a Folk Psychological Construct that Should be Replaced by a Scientific Explanation.\nIn the early 20th century, behaviorists eliminated mental states from the causal chain between external stimuli and behavioral responses.\nHowever, they retained mental state terms when describing the empirical relation between stimuli and responses.\nFor example, fear was used to characterize the relation between threats and defensive behaviors [35].\nWith the rise of physiological approaches to behavior in the middle of the 20th century, fear became a hypothetical physiological state (central state), that connects threats with defensive behaviors [36].\nThe intended purpose of this approach was to satisfy the behaviorist constraint against using subjective explanations of behavior.\nUltimately, the amygdala emerged as the locus of the central fear state [37,38].\nThe central state model has been popular in behavioral neuroscience [3942].\nMany who call upon the central state view today are ambivalent about the extent to which fear means subjective fear or a nonsubjective state.\nBut adherents of a strong version of the position argue that subjective, conscious fear is an inaccurate scientific construct that can be replaced with a more rigorous scientific notion of fear as a non-subjective state of the amygdala-centered circuits [42].\nThe wellknown lack of correlation between verbal reports and amygdala activity in humans [4345] is, in this view, due to the lack of access to amygdala activity by cognitivebased introspection, and hence verbal report.\nIn short, verbal report of subjective experience is viewed as a less desirable way of assessing fear than simply measuring amygdala-controlled responses.\nThe mechanistic reason a threat elicits defense responses is because it activates cells and synapses in circuits that control those responses.\nThe fear construct is superfluous in this context [6,7,28,46].\nIt adds conceptual baggage.\nThe way to avoid these problems is by using nonsubjective terminology to name the non-subjective central states.\nThe  neuro-cognitive  approach addresses this issue.\nThe Neuro-Cognitive Approach: Subjective Fear Emerges from Higher-Order Processing.\nCognitive approaches to emotion arose in the 1960s in an effort to address certain criticisms of the Jamesian approach, and to overcome the behaviorists restrictions on inner explanations.\nWhile there have been a number of cognitive approaches to emotion [5053], recent theorizing has emphasized that emotional experiences are cognitive constructions based on conceptualizations of situations [11,5456] or higher-order states that emerge as a result of the cognitive integration in working memory of diverse sources of information from within the brain and body [6,7,37,57,58].\nBoth of these positions reject the idea that emotional experiences arise from subcortical circuits (views of the Neuro-Darwinian and Neuro-Jamesian approaches) and also reject the idea that the subjective experience is a non-scientific construct (Neuro-Behaviorist approach).\n[7,5961]), arguing that a general network of cognitions underlies both cognitive and emotional states of consciousness.\nThe consequences of defensive survival circuit activation (brain arousal, body feedback, etc.\n) contribute indirectly to the experience of fear but do not determine it.\nFear is the cognitive assessment that you are in harms way, a view that allows fear to arise from activity in any survival circuits (fear of being harmed by starvation, dehydration, hypothermia, reproductive isolation, and so forth), or by existential concerns (such as fear of the eventuality of death or the meaninglessness of your life), in addition to predatory-related dangers that trigger the defensive survival circuit.\nimply that if through psychotherapy or pharmaceutical treatment you successfully reduce amygdala activity, as measured by amygdala-mediated behavioral and/or physiological responses, pathological fear should be ameliorated.\nIn the neuro-Darwinian approach, treatments that weaken defensive behavior should treat fear problems by altering amygdala activity underlying both behavior and feelings.\nIn the neuro-Jamesian approach, treatments that weaken defensive behavior by altering amygdala activity should treat fear problems because the behaviors, being weaker, should give rise to less body feedback and thus weaker subjective feelings.\nIn the neuro-behaviorist approach, altering amygdala activity through behavioral (CBT) or pharmaceutical treatments should treat pathological fear because the problems are due to the non-subjective amygdala state.\nOnce this changes, subjective fear might also change because it is an indirect cognitive readout of amygdala activity.\nHowever, whether self-reported feelings change is less important than whether defensive behavior changes since the latter is a direct readout of amygdala activity.\nConscious feelings in clinical assessment A major reason why people seek the help of mental health specialists is because they feel bad and want to feel better.\nA treatment that reduces behavior (freezing, behavioral timidity, avoidance) and physiology (hyperarousal) but does not diminish subjectively reported fearful feelings is not likely to be viewed as a satisfactory outcome by the afflicted person.\nIn the contemporary cognitive therapy literature, selfreports, and the subjective experiences that these reports reflect, have not been given much credence.\nThis reflects the influence of behaviorism in the development of both traditional behavioral therapy [63] and cognitive behavioral therapy (CBT) [64], as well as findings suggesting that behavioral physiological responses related to fear or anxiety in humans are poorly correlated [4345].\nThis reflects the dominance of the amygdala fear center view described above in clinical concepts.\nIf behavioral, physiological and subjective responses are all products of the same circuit, one response is as good as another as a way to judge clinical outcome.\nThis logic is also apparent in the NIHM RDoC initiative, which treats subjective reports as just another measure of fear.\nthe RDoC approach accords self-report data no special precedence among different measurement.\ncom  Current Opinion in Behavioral Sciences 2018, 19:6772.\nAn important advantage of the neuro-cognitive approach to fear is that it accounts for the two troubling observations mentioned above that are not easily handled by fear-center views: subjective fear does not require the amygdala, and medications that target the amygdala do not necessarily relieve subjective fear.\nToday, CBT therapists routinely use subjective patient report as part of treatment.\nSpecifically, more recent clinical trials examining the augmentation effect of D-cycloserine (DCS), a partial agonist at the glycine recognition site of the NMDA receptor complex, show the DCS enhances exposure therapy primarily in those people who report a clear reduction of reported fear during the exposures [70,71].\nWe argue that subjective reports of fear and anxiety are not unreliable proxy measures of fear and anxiety, as suggested by the neuro-behaviorist model.\nRather, they are the best direct, and, at least so far, the only measures easily accessible for clinicians to assess the efficacy of treatment.\nHowever, we suggest that this be done after other approaches, such as CBT or pharamceutical treatments, to first dampen the amygdala central state, which indirectly affects subjective experience.\nWe also recommend that future research re-examine the relationship between subjective report, behaviors, and physiological responses of fear and anxiety in order to explain the reasons for the dissociation between these measures.\nConflict of interest statement Nothing declared.\nScarantino A: Functional specialization does not require a oneto-one mapping between brain regions and emotions.\nNeuron 2012, 73: 653-676.\nLeDoux JE: Coming to terms with fear.\nProc Natl Acad Sci U S A 2014, 111:2871-2878.\nLeDoux JE: Anxious: Using the Brain to Understand and Treat Fear and Anxiety.\nLeDoux JE, Brown R: A higher-order theory of emotional consciousness.\nProc Natl Acad Sci U S A 2017, 114: E2016-E2025.\nKuppens P, Tuerlinckx F, Yik M, Koval P, Coosemans J, Zeng KJ, Russell JA: The relation between valence and arousal in subjective experience varies with personality and culture.\nBarrett LF: How Emotions are Made.\nOvergaard M, Sandberg K: Kinds of access: different methods for report reveal different kinds of metacognitive access.\nEriccson KA, Simon H: Protocol Analysis: Verbal Reports as Data.\nSeth AK: Post-decision wagering measures metacognitive content, not sensory consciousness.\nPersaud N, McLeod P, Cowey A: Post-decision wagering objectively measures awareness.\nLau HC, Passingham RE: Relative blindsight in normal observers and the neural correlate of visual consciousness.\nProc Natl Acad Sci U S A 2006, 103:18763-18768.\nManiscalco B, Lau H: The signal processing architecture underlying subjective reports of sensory awareness.\nWilson TD: The proper protocol: validity and completeness of verbal reports.\nFeinstein JS, Buzza C, Hurlemann R, Follmer RL, Dahdaleh NS, Coryell WH, Welsh MJ, Tranel D, Wemmie JA: Fear and panic in humans with bilateral amygdala damage.\nNat Neurosci 2013, 16:270-272.\nAnderson AK, Phelps EA: Is the human amygdala critical for the subjective experience of emotion? Evidence of intact dispositional affect in patients with amygdala lesions.\nJ Cogn Neurosci 2002, 14:709-720.\nLeDoux JE, Pine DS: Using neuroscience to help understand fear and anxiety: a two-system framework.\nAm J Psychiatry 2016, 173:1083-1093.\nGriebel G, Holmes A: 50 years of hurdles and hope in anxiolytic drug discovery.\nJames W: What is an emotion? Mind 1884, 9:188-205.\nDamasio A, Carvalho GB: The nature of feelings: evolutionary and neurobiological origins.\nCraig AD: How do you feel  now? The anterior insula and human awareness.\nStrigo IA, Craig AD: Interoception, homeostatic emotions and sympathovagal balance.\nBrown JS, Farber IE: Emotions conceptualized as intervening variables  with suggestions toward a theory of frustration.\nRescorla RA, Solomon RL: Two process learning theory: relationships between Pavlovian conditioning and instrumental learning.\nLeDoux JE: The Emotional Brain.\nDavis M: The role of the amygdala in conditioned fear.\nEdited by Aggleton JP.\nRosen JB, Schulkin J: From normal fear to pathological anxiety.\nPerusini JN, Fanselow MS: Neurobehavioral perspectives on the distinction between fear and anxiety.\nLang PJ: Fear reduction and fear behavior: problems in treating a construct.\nHodgson R, Rachman S: II.\nRachman S, Hodgson R: I.\nBehav Res Ther 1974, 12:311-318.\nLeDoux JE: Semantics, surplus meaning, and the science of fear.\nMarx MH: Intervening variable or hypothetical construct? Psychol Rev 1951, 58:235-247.\nSchachter S: Cognition and centralist-peripheralist controversies in motivation and emotion.\nSchachter S, Singer JE: Cognitive, social, and physiological determinants of emotional state.\nMandler G: Mind and Body: The Psychology of Emotion and Stress.\nFrijda NH, Scherer KR: Emotion definition (psychological perspectives).\nOrtony A, Clore GL: Emotions, moods, and conscious awareness.\nLewis MD: Self-organising cognitive appraisals.\nRussell JA: Core affect and the psychological construction of emotion.\nBarrett LF: Solving the emotion paradox: categorization and the experience of emotion.\nLeDoux JE: Synaptic Self: How Our Brains Become Who We Are.\nLeDoux JE: Emotional colouration of consciousness: how feelings come about.\nRosenthal DM: Consciousness and Mind.\nLau H, Rosenthal D: Empirical support for higher-order theories of conscious awareness.\nLevis DJ: The negative impact of the cognitive movement on the continued growth of the behavior therapy movement: a historical perspective.\nGenet Soc Gen Psychol Monogr 1999, 125:157-171.\nHofmann SG, Asmundson GJ, Beck AT: The science of cognitive therapy.\nBehav Ther 2013, 44:199-212.\n: Panic disorder with agoraphobia from a behavioral neuroscience perspective: applying the research principles formulated by the Research Domain Criteria (RDoC) initiative.\nKozak MJ, Cuthbert BN: The NIMH Research Domain Criteria Initiative: background, issues, and pragmatics.\nZoellner LA, Foa EB: Applying Research Domain Criteria (RDoC) to the study of fear and anxiety: a critical comment.\nSmits JA, Rosenfield D, Otto MW, Marques L, Davis ML, Meuret AE, Simon NM, Pollack MH, Hofmann SG: D-cycloserine enhancement of exposure therapy for social anxiety disorder.\nSmits JA, Rosenfield D, Otto MW, Powers MB, Hofmann SG, Telch MJ, Pollack MH, Tart CD: D-cycloserine enhancement of fear extinction is specific to successful exposure sessions: evidence from the treatment of height phobia.\nHofmann SG: D-cycloserine for treating anxiety disorders: making good exposures better and bad exposures worse.\nDepress Anxiety 2014, 31:175-177.\nKoizumi A, Amano K, Cortese A, Shibata K, Yoshida W, Seymour B, Kawato M, Lau H: Fear reduction without fear through reinforcement of neural activity that bypasses conscious exposure."}