{"title": "15.pdf", "contents": "Low back pain (LBP) is extremely common with a lifetime prevalence around 75% to 84% (Thiese and others  2014) and is globally among the health conditions with  the highest numbers of years lived with disability (Vos and  others 2017).\nAn acute episode of LBP spontaneously  resolves in one third of the patients within the first 3  months; however, about 65% of the patients still experience LBP 1 year after LBP onset (Itz and others 2013).\nConsequently, recurrent or chronic LBP (LBP persisting  for 12 weeks or more) is a common problem, with an  enormous individual, economic and societal burden (Hoy  and others 2014; van Tulder and others 2006).\nTherefore,  advancing the understanding of factors contributing to the  chronification of LBP is a research priority (Hartvigsen  and others 2018).\nAmong factors such as genetic, physical  and psychosocial features, adaptions of motor control  likely play a significant role in chronic or recurrent LBP.\n(Hodges and others 2013) because they are associated  with several important factors contributing to LBP chronification, including increased spinal tissue strains due to  potential loss of trunk control and enhanced trunk muscle  co-contraction, resulting in muscle fatigue (Madeleine  2010; van Dien and others 2018b).\nBoth factors, loss of  trunk control and enhanced muscle co-contraction, have  been linked with sustained mechanical loading on spinal  tissues, conceivably potentiating degeneration of intervertebral discs and other tissues (Lotz and Chin 2000; Paul  and others 2013; Urban and Roberts 2003; van Dien and  others 2018b).\nLow Back Pain: The Potential  Contribution of Supraspinal   Motor Control and Proprioception.\nMichael Lukas Meier1 , Andrea Vrana1,   and Petra Schweinhardt1,2.\nAbstract Motor control, which relies on constant communication between motor and sensory systems, is crucial for spine  posture, stability and movement.\nAdaptions of motor control occur in low back pain (LBP) while different motor  adaption strategies exist across individuals, probably to reduce LBP and risk of injury.\nHowever, in some individuals  with LBP, adapted motor control strategies might have long-term consequences, such as increased spinal loading  that has been linked with degeneration of intervertebral discs and other tissues, potentially maintaining recurrent or  chronic LBP.\nFactors contributing to motor control adaptations in LBP have been extensively studied on the motor  output side, but less attention has been paid to changes in sensory input, specifically proprioception.\nFurthermore,  motor cortex reorganization has been linked with chronic and recurrent LBP, but underlying factors are poorly  understood.\nHere, we review current research on behavioral and neural effects of motor control adaptions in LBP.\nWe conclude that back pain-induced disrupted or reduced proprioceptive signaling likely plays a pivotal role in driving  long-term changes in the top-down control of the motor system via motor and sensory cortical reorganization.\nIn the  outlook of this review, we explore whether motor control adaptations are also important for other (musculoskeletal)  pain conditions.\nThe overarching hypothesis of this review is that  motor control adaptions induced by acute LBP play an  important role in the chronification of LBP.\nFollowing a  short introduction to human motor control and proprioception, we summarize the findings on motor control  adaptions in LBP on the behavioral and neural level,  including (supra-)spinal and psychological contributions.\nWe integrate new research suggesting a powerful role of  reduced paraspinal proprioceptive input for the top-down  control of cortical sensorimotor circuits, probably associated with neuroplastic changes.\nThe resulting cortical  reorganization would potentially explain persistent and  dysfunctional motor control adaptions associated with  LBP chronification.\nAs a potential cause of low back pain, clinical  instability of the spine is defined as a failure of any of the  three subsystems leading to adaptions of the motor control system (Hodges and others; Panjabi 2003).\nMotor control adaptions are inevitably linked to adaptions  in somatosensory processing as we can only precisely  control what we can sense (Naito 2004).\nProprioception is  the key somatosensory feedback system (Gandevia and  others 2002; Sherrington 1908).\nThe importance of proprioception for motor control is exemplified by patients  with a lack of proprioception due to, for example, large  fiber neuropathy (Goble and others 2011) or loss of  PIEZO2 receptor function (Chesler and others 2016).\nWithout visual input, these patients show impaired motor  control, including deficits in coordinated movement, force  control, and limb position sense (Chesler and others 2016;  Lajoie and others 1996; Rothwell and others 1982;  Sainburg and others 1995).\nProprioception is subserved  by mechanoreceptors on deep and superficial tissues.\nMuscle spindles, located in the muscle belly parallel to the  extrafusal muscle fibers, act as the principal proprioceptors, in addition to mechanoreceptors located in joints,.\nligaments, tendons, fascia, and skin (Brumagne and others  2000; Proske and Gandevia 2012).\nThe important role of  muscle spindles in proprioception is illustrated by the  observation that vibration applied to a resting muscle can  produce illusions of limb movement and of displaced limb  position (mediated through primary [Ia] and secondary  [II] muscle afferents) (Burke and others 1976; Gilman  2002; Goodwin and others 1972; Proske and Gandevia  2012).\nA plethora of studies indicate strong support for motor  control adaptions in LBP on a behavioral and motor system level.\nExperimental LBP in healthy subjects provoked adaptions of motor control that were characterized  by altered balance control and trunk muscle activity, captured by changes of the center of pressure (using a foot  plate) and electromyography (EMG) (Hodges and others  2003; Sohn and others 2013).\nAdaptions in motor control  are also present in acute LBP patients, reflected by alterations in the timing, magnitude and kinematics of lumbopelvic coordination (Shojaei and others 2017a; Shojaei  and others 2017b; Sung and others 2015).\nIt has been suggested that these changes, if persistent, predispose individuals to recurrent and chronic LBP (van Dien and  others 2017).\nIndeed, compelling evidence indicates  altered motor control in chronic LBP patients based on,  for example, spine kinematics, EMG, and center of pressure analysis (reviewed in Knox and others 2018).\nChronic LBP patients demonstrate motor control deficits  during standing and sitting (Della Volpe and others 2006;  Lafond and others 2009), during challenging tasks such  as one-legged standing (da Silva and others 2018) or during gait and functional tasks (Christe and others 2017;  Hemming and others 2017).\nFurthermore, the systematic  review by Knox and colleagues identified a delayed onset  of muscle activity with anticipatory and compensatory  postural responses to perturbations in patients with  chronic LBP (Knox and others 2018).\nIn sum, there is  substantial evidence for behavioral motor control adaptations associated with LBP.\nNevertheless, the literature is relatively inconsistent  with respect to the nature of these motor control adaptions.\nFor example, in chronic LBP, spine kinematic patterns during movement indicated a more rigid spine  (Christe and others 2016), in line with clinical observations of a stronger coupling between thoracolumbar segments during movement and generally less variability of  trunk movement in chronic LBP (Elgueta-Cancino and  others 2014; Moseley and Hodges 2006).\ntrunk muscle activity that increased less over time compared to healthy subjects, suggesting fewer degrees of  freedom regarding trunk muscle recruitment configurations (Abboud and others 2014).\nHowever, the opposite  pattern of higher variability in trunk movements in  chronic LBP has also been observed (Silfies and others  2009; van Dien and others 2018b; Vogt and others 2001).\nA review on lumbar extensor muscle recruitment in acute,  subacute and chronic LBP patients highlighted high and  task-dependent variability in trunk muscle activation patterns between and probably within individuals (van Dien  and others 2003).\nSimilar to the observed variability in trunk movement  and related muscle activation patterns in individuals with  LBP, an analysis of the literature on motoneuron excitability at cortical and spinal sites during pain indicated  inconsistent findings across studies (Hodges and Tucker  2011).\nCortically and spinally mediated changes of  motoneuron excitability during pain and nociception has  been distinguished by simultaneous recording of, for  example, the Hoffman reflex (H-reflex) and motor  evoked potentials (MEPs) at, for example, biceps or  erector spinae muscles (Hodges and Tucker 2011; Le  Pera and others 2001; Strutton and others 2005) or by  combining transcranial magnetic stimulation (TMS) at  the cervicomedullary junction (to activate the axons of  primary motoneurons) and at the primary motor cortex  (M1).\nThe corticospinal neural drive has been reported to  be decreased in chronic LBP reflected by increased MEP  thresholds and lowered EMG activity of paraspinal muscles following TMS over the vertex (Chiou and others  2014; Strutton and others 2005).\nSimilar findings of temporally reduced MEPs of hand and arm muscles after  TMS of the primary motor cortex (M1) were reported in  a study of experimental pain in healthy subjects (Farina  and others 2001).\nInterestingly, in this study, the reduction in MEPs appeared to be caused exclusively by  supraspinal circuits because peripheral (M-wave) and  spinal cord (Fand H-waves) measures of excitability  were not affected.\nMEPs, induced by TMS over M1, at  hand and biceps muscles increased during painful stimulation (Del Santo and others 2007).\nFurthermore, following intervertebral disc lesion in pigs (damaging the  annulus fibrosis to provoke leakage of the nucleus pulposus), presumably painful, excitability of spinal circuits  was slightly decreased but cortical excitability increased  immediately after the lesion, revealed by recording  MEPs of the multifidus muscle (Hodges and others  2009).\nIt is possible that some of the inconsistencies in  the literature stem from response patterns that differ  across specific muscles, even across different paraspinal  muscles (Hodges and Tucker 2011).\nsuggested a potential mechanism for increases in M1  excitability with pain: in chronic LBP, enhanced cortical  excitability of M1 was linked to a maladaptive homeostatic mechanism (homeostatic plasticity), which is  reflected by a general disbalance of the ratio between  long-term potentials (synaptic strengthening) and longterm depression (synaptic weakening) (Thapa and others  2018).\nIn line with the evidence demonstrating enhanced  cortical motor excitability in chronic LBP, patients failed  to maintain homeostatic plasticity by showing an excessive synaptic strengthening, which was suggested as a  marker of cortical reorganization.\nToday, it is clear that cortical motor circuits play an  important role in controlling trunk muscle excitability.\nFor a long time, it was assumed that cortical motor control is more important for voluntary goal-directed movements compared to automatic processes such as  postural adjustments and gait that have been associated  with subcortical circuits (Deliagina and others 2008).\nHowever, evolving evidence indicates substantial cortical  motor involvement in automatic motor responses (Chiou  and others 2016; Chiou and others 2018; Gandolla and  others 2014; Petersen and others 2012).\nIn line with this,  TMS mapping of surface and (intra-muscular) fine-wire  EMG recordings of paraspinal muscles (multifidus and  erector spinae muscles) demonstrated a high degree of  functional specificity within M1, suggesting fine control  of segmental motion (Tsao and others 2011a).\nIn individuals with chronic LBP, M1 representations (center of  gravity) of the longissimus and deep multifidus muscles  were observed to overlap, indicating less fine-grained  (smudging) representations of paraspinal muscles  (Tsao and others 2011b).\nIn addition, it has been demonstrated that plastic changes of the trunk representation in  M1 were related to the severity of LBP (Schabrun and  others 2017; Tsao and others 2010) and shifts in the cortical representation of trunk muscles have been associated  with deficits in postural control (Tsao and others 2008).\nThese changes in M1 organization seem to occur very  early as sustained experimental pain induced M1 reorganization after 4 days, characterized by reduced intracortical inhibition and increased facilitation (Schabrun and  others 2016).\nHowever, similar to the reported variability  in behavioral findings and motoneuron excitability,  changes of the M1 representation in chronic LBP show  high between-subject variability (Elgueta-Cancino and  others 2018), indicating different LBP phenotypes of  motor adaption strategies.\n, increased and compensating activity of  superficial paraspinal muscles following an injury of deep  muscles), with the ultimate goal to protect tissues from  further pain and injury (Hodges 2011).\nIn contrast to previous models postulating stereotypical inhibition or excitation of muscles during pain (Lund and others 1991;  Roland 1986), the recent model accounts for the observed  differences in motor adaption strategies in pain by considering complementary, additive or competitive effects on  spinal and supraspinal levels (Hodges and Tucker 2011).\nMoreover, this model accounts for the redundancy of the  trunk motor control system that allows various muscle  recruitment configurations to achieve a certain goal  (Abboud and others 2018).\nFrom a learning perspective,  individual-specific redistribution of muscle activity can be  explained through a reinforcement learning model (van  Dien and others 2017).\n, movement-related pain, negative reinforcement) will lead to the acquisition of new muscle activation  patterns (van Dien and others 2017).\nTight control is associated with increased trunk muscle excitability, enhanced  muscle co-contraction and less trunk motor variability.\nIn  contrast, loose control over trunk movement is related to  reduced muscle excitability and increased trunk motor.\nLow back pain is associated with motor control adaptions that show high between-subject variability in  different domains of motor control (motor behavior, motor system, proprioception, psychological factors).\nDifferent motor control strategies (loose and tight control strategies as endpoints of a spectrum) might have positive effects by  avoiding further pain or injury.\nIn the long term, however, both strategies might lead to several negative consequences including  increased spinal tissue loading and degeneration of intervertebral discs and other tissues.\nFurthermore, a tight motor control  strategy has been linked with cortical reorganization that might prevent or slow down the return to normal motor control  patterns.\nvariability (van Dien and others 2018b).\nThe reinforcement learning model predicts that motor variability will  initially increase at the onset of LBP to allow for sufficient  degrees of freedom to adopt the least painful motor control strategy which might lead to a normal strategy when  pain disappears (Hodges and others 2013; Madeleine and  others 2008; Moseley and Hodges 2006).\nHowever, in the long-term, motor  variability is expected to decrease due to increased costs  associated with loss of trunk control and pain (van Dien  and others 2017).\nThis pattern of initially increased, followed by reduced motor variability, is supported by similar observations during the transition from acute to  chronic neck-shoulder pain (Madeleine 2010).\nThis is in  line with the dynamical systems theory of biological systems, which proposes that, under certain conditions,  behavioral states switch to a new and stable movement  pattern (with less variability) when the increase of variability reaches a critical point, reflected by a highly  unstable system (Stergiou and Decker 2011).\nIn the short term, motor control adaptions might have  beneficial effects by avoiding further pain or injury, either  through adopting a protective, stabilizing strategy to limit  movements (which might be painful, tight control) or  through applying a destabilizing strategy (loose control)  to limit muscle force exertion and related costs such as  metabolic costs, fatigue, and tissue loading (Ross and  others 2017; van Dien and others 2017) (Fig.\nFurthermore, a loose control strategy might allow exploring alternative and pain-free trunk motor control solutions.\nExcessive mechanical loading has been associated with  disruption of the intervertebral disc structure (Adams and  Roughley 2006; Urban and Roberts 2003), initiating a  cascade of cell-mediated responses, including cell  death (as shown in animal models; Lotz and Chin 2000),.\n, loose control), probably to prevent muscle fatigue and to allow  for exploration of new pain-free motor control solutions.\nAfter successfully adopting the least painful motor control strategy,  motor variability decreases and return to a normal motor strategy after pain is expected.\nDotted line:  Motor variability is reduced during acute LBP (e.\n, tight control due to pain catastrophizing).\nprobably leading to disc degeneration that maintains and  aggravates LBP (Lotz and others 1998; Paul and others  2013; van Dien and others 2018b).\nFurthermore, reduced  proprioceptive input (e.\n, due to decreased trunk motor  variability) has been suggested to contribute to cortical  neuroplastic changes that might affect the organizational  structure in sensorimotor cortices and top-down trunk  motor control (van Dien and others 2017).\nThis would  provide an explanation for the observed changes in M1  motor maps, however, a direct link between motor control strategies and M1 organization has not yet been  established (Elgueta-Cancino and others 2018; Goossens  and others 2018).\nFurthermore, it is currently unclear  when and to which extent such alterations in M1 motor  maps are caused by impairments on the input side, that  is, the processing of paraspinal somatosensory inputs.\nAs  described above, somatosensory input is an essential  component of the motor control system and particularly  proprioceptive impairment can contribute substantially to  motor control dysfunction (Borich and others 2015;  Riemann and Lephart 2002; Rosenkranz and others  2008).\nOn a behavioral level, LBP patients have been shown to  have impaired trunk proprioception.\nIndividuals with  chronic LBP showed lower acuity for detecting changes  in trunk position (Lee and others 2010) and demonstrated  significantly higher trunk repositioning errors during  flexion of the back compared with pain-free individuals  (Newcomer and others 2000).\nA recent  systematic review and meta-analysis on lumbar proprioception in LBP concluded that LBP patients indeed show  impairments in lumbar proprioception compared to painfree individuals for active joint repositioning sense (JRS)  and detection threshold of passive motion in sitting position (Tong and others 2017).\nNo effects were found for  active JRS in standing or passive JRS in sitting (Tong and  others 2017), probably because different proprioceptive  tests differ with regard to the required motor skills and  memory processes.\nIn addition, using a force plate to analyze postural sway on stable and unstable support surfaces, vibratory stimulation of the triceps surae, tibialis  anterior, and paraspinal muscles revealed an altered proprioceptive weighting in chronic LBP patients characterized by an increased weighting of ankle proprioception  relative to trunk muscle proprioception (Brumagne and.\nothers 2008; Claeys and others 2011).\nInterestingly, in a  prospective study, a more ankle-steered proprioceptive  weighting has been identified as a risk factor for the  development of mild LBP in young individuals (Claeys  and others 2015).\nHowever, the opposite result of no  association between proprioceptive deficits and the  development of LBP has also been reported in a study  involving almost 300 subjects (Silfies and others 2007),  emphasizing the need for more longitudinal research in  this area.\nProprioceptive information might be reduced or disrupted as a result of traumatic damage of tissues, muscle  fatigue (Taimela and others 1999) and/or the activation of  nociceptors, which consequently interferes with motor  control (Thunberg and others 2002; van Dien and others  2018b).\nPersistent nociception leads to an enhanced activation of the sympathetic nervous system (Nijs and others 2012), which directly innervates muscle spindles and  modulates their discharge (Radovanovic and others  2015).\nThis might represent a mechanism contributing to observed impairments  in trunk proprioception in LBP patients.\nYet, little is known about the cortical representation of  paraspinal somatosensory (in particular proprioceptive)  inputs to the primary somatosensory cortex (S1) which  play an essential role in accurate motor output (Borich  and others 2015; Riemann and Lephart 2002).\nIn  his pioneering work (Penfield 1947), Penfield identified  the hip and the shoulder on the convexity of the postcentral gyrus and drew the back between these two areas on  the sensory Homunculus.\nIn 2018, intracortical stimulation in humans of BA1 in S1 identified the representations of the thorax and abdomen to lie indeed between hip  and shoulder (Roux and others 2018) but the cortical  somatotopic representation of paraspinal proprioceptive  input along the thoracolumbar axis is still unclear and  needs further investigation.\n3) and the secondary somatosensory cortex.\nAnimal and human studies have  revealed that body parts are represented at distinct positions in these four subareas where BA 3a receives proprioceptive information from muscles and joints and BA  3b, 1, and 2 process signals from the skin (Iwamura and  others 1993; Martuzzi and others 2014; Naito 2004;  Yamada and others 2016).\nis still not entirely clear.\nWhat is clear is that S1 reorganization can lead to dysfunctions in motor output and motor  learning (Borich and others 2015) and, as detailed above,  that LBP is associated with impaired proprioception.\nTherefore, systematic cortical mapping  of paraspinal proprioceptive input will be essential for a  better understanding of its role in aberrant sensorimotor  integration and related potential maladaptive cortical  plasticity in chronic LBP (Makin and Bensmaia 2017;  Mass-Alarie and Schneider 2016).\nImpairments of Somatosensory Input  and Cortical Reorganization in LBP.\nIn line with the notion that somatosensory input might be  a powerful driver of motor adaption and cortical reorganization, sensory training using vibratory (i.\n, stimulation  of muscle spindle afferents using vibration frequencies  around 80 Hz) stimulation of the affected hand muscles in  people with musicians dystonia reshaped the cortical  sensorimotor organization toward a more differentiated  pattern that was associated with improved hand motor control (Rosenkranz and others 2009).\nA shifted sensory representation in S1 of  tactile input from the back was observed more than 20  years ago in a small group of chronic LBP patients by  magnetencephalography (Flor and others 1997).\nAs discussed above, S1 (re)organization of proprioceptive  input from paraspinal muscle spindles is likely to be  more important pathophysiologically for the chronification of LBP than that of tactile input (Beaudette and  others 2016).\nThe Sensorial Nature of M1: A  Model of Cortical Reorganization in  Chronic LBP?.\nBased on the optimal control model that uses internal  models based on sensory feedback, M1 has been traditionally thought to send descending and `pure motor commands (through forward connections) to peripheral  effectors to produce the desired movement (Genewein and  Braun 2012; Wolpert and Kawato 1998).\nHowever, it has  been hypothesized that the brain recruits an alternative  approach to handle more complex muscle recruitment patterns involved in complex and redundant systems such as  trunk motor control (Adams and others 2013; Borich and  others 2015).\nIn this active inference account of M1, M1  is suggested to model the proprioceptive consequences of  motorneuron activity rather than to simply issue motor  commands (Adams and others 2013).\nThe firing of alpha  motoneurons would be determined by the comparison at  the level of the spinal cord between descending proprioceptive predictions from M1 and the proprioceptive input  from muscle spindle afferents to produce the desired (predicted) movement trajectory.\nIf a prediction error is present, the discharge of alpha motoneurons is adapted until  the prediction error is zero (Adams and others 2013).\nSimultaneously, gamma motor neurons optimize the sensitivity of the muscle spindles.\nThe proprioceptive information resulting from muscle activity is transmitted to the  sensorimotor cortex (sensory reafference) for predictive  coding: backward projections from M1 to S1 subserve  proprioceptive predictions while forward projections from  S1 to M1 convey potential prediction errors that report the  difference between sensory information and prediction.\nPotential error signals received by M1 are then used to  correct its representations so that its predictions improve  (Adams and others 2013).\nM1 output and the neural communication between M1  and S1 were sensitive to artificially altered proprioceptive  input during constant movement patterns (Gandolla and  others 2014).\nMore specifically, during FES-induced  alterations of proprioceptive signaling, a facilitatory effect  on the intrinsic connectivity of M1 to S1 was observed  (that was absent without FES), which was suggested to  reflect the updating of sensory predictions sent to spinal  motoneurons.\nIn monkeys, M1 stimulation activated the  biceps or triceps muscles differentially dependent on the  degree of flexion of the monkeys arm, further supporting  a role of M1 efferents in conveying proprioceptive predictions (Graziano 2006).\nAn active inference role of M1 might have important  implications regarding motor control adaptions in the  presence of increased proprioceptive prediction errors that  might originate from reduced/disrupted proprioceptive  input, probably triggered by nociceptive input (Nijs and  others 2012; Thunberg and others 2002), enhanced activation of the sympathetic nervous system (Radovanovic and  others 2015), muscle fatigue (Taimela and others 1999),  or reduced trunk motor variability (van Dien and others  2017).\nIn principle, the central nervous system (CNS) can  minimize prediction errors in two ways: (1) It can attempt  to adapt the proprioceptive input by initiate/changing  movements or redistribute muscle activity, therefore fulfilling proprioceptive predictions by spinal circuits or (2)  it can match its proprioceptive predictions (from M1) to  the proprioceptive information inflow (Adams and others  2013).\nGenerally, the CNS aims to prevent passing the  prediction error to supraspinal circuits (and therefore  avoiding a correction) as the spinal circuity ought to  resolve any mismatch between descending predictions  and afferent feedback using local reflex arcs (Adams and  others 2013).\nHowever, this approach might be limited when motor  solutions become less variable, as shown during the transition from acute to recurrent or chronic LBP.\nConsequently, in this case, the  CNS might be forced to minimize proprioceptive prediction errors by matching the descending predictions from  M1 to the reduced or disrupted proprioceptive input, probably provoking neuroplastic adaptions in the long-term  (Fig.\nThis might provide an explanation for cortical  sensorimotor reorganization associated with a stable and  more rigid but unfavorable motor control pattern, potentially leading to sustained increases in spinal loading,  degeneration of spinal tissues, and muscle fatigue.\nProprioceptive prediction errors are generated at the level of the spinal cord by  comparing the descending proprioceptive predictions from M1 with proprioceptive input from muscle spindles.\nDependent on  the level of the proprioceptive prediction error, the rate of firing of alpha motoneurons provokes the desired (predicted) muscle  activation/movement, through innervation of extrafusal muscle fibers (classical reflex arc).\nSimultaneously, the rate of firing of  gamma motor neurons optimizes the sensitivity of muscle spindles, though innervation of intrafusal muscle fibers (alpha-gamma  coactivation), (Matthews 1959).\n, loose control strategy),  offering sufficient degrees of freedom of the motor system to explore new pain-free motor control strategies at the cost of  decreased trunk control.\nFinally, considering recent theories about motor adaption  from a learning perspective, the weighting of costs associated with LBP might not only be driven by nociceptive  input or pain but also by pain-related cognitions (van  Dien and others 2017).\nDeficits in motor control may be  amplified or even be induced/generated by cognitiveemotional factors such as anticipation or fear of pain  (Langevin and Sherman 2007; Tucker and others 2012).\nIn line with this, changes in motor unit discharge  (recorded with fine-wire electrodes in the quadriceps  muscle) during anticipation of pain were similar to  changes provoked by experimental activation of nociceptors (Tucker and others 2012).\nFurthermore, in chronic  LBP, fear of pain has been shown to alter mechanical  properties of the spine such as trunk stiffness (Karayannis  and others 2013).\nMoreover, it has been shown that individuals with high levels of pain catastrophizing tend to  adopt a tight motor control strategy when a painful stimulus is applied, whereas those with low levels demonstrated a loose motor control strategy (Ross and others  2017).\nIn line with this, in healthy subjects, it has further  been observed that negative pain cognitions are associated with a reduction in variability of postural strategies  and stiffening of the spine (similar to those observed in  chronic LBP) that outlasted the experimental pain  (Moseley and Hodges 2006; Moseley and others 2004).\nTherefore, sustained tightening of the trunk due to ongoing anticipation of pain constitutes an important factor  that might contribute to the persistence of altered (tight)  motor control, possibly leading to recurrent and chronic  LBP in the long term due to increased spinal tissue loading, reduced paraspinal proprioceptive input and cortical  reorganization.\ntissue loading, associated itself with degeneration of  intervertebral discs and other tissues.\nHowever, the  underlying biological and psychosocial interactions are  still poorly understood and seem to vary across individuals, reflected in the modest effect sizes of motor control  exercises, spurring a call for personalized interventional  therapies (van Dien and others 2018a).\nYet, to unleash  the full potential of personalized treatments, more basic  research on motor adaptions in LBP is mandatory, especially when considering the evolving evidence of cortical  circuits in driving motor control adaptions during the  course of LBP.\nBy integrating  novel research on the active inference account of M1, we  propose a potential mechanism how proprioceptive  impairments in LBP might ultimately force the CNS to  change its sensorimotor cortical organization.\nAlthough  the existence of different LBP phenotypes of motor control adaptions needs further validation, a tight motor control strategy (and probably maladaptive pain-related  cognitions) might be more prone to cortical reorganization (compared with loose control) because of the more  strongly reduced trunk motor flexibility limiting the ability of the CNS to increase motor variability and exploration of new motor control patterns.\nFurther research  efforts are necessary to clarify the functional relevance of  cortical reorganization in chronic LBP: Does it simply  represent an epiphenomenon of motor control adaption or  is it causally related to the occurrence of recurrent and  chronic LBP by reinforcing non-reversible motor control  patterns? Neuroimaging might help to reveal the potential  role of cortical markers (in particular, changes in cortical  mapping of altered paraspinal proprioceptive input) of  motor control adaptions at different stages of LBP by  incorporating biomechanical (e.\nmuscle spindle afferent signaling will be minimized by spinal circuits through changing movement/trunk muscle recruitment  patterns until the prediction error is zero.\nThe proprioceptive information resulting from muscle activity (sensory reafference)  is then transmitted to the sensorimotor cortex.\nBackward projections from M1 to S1 subserve the updating of proprioceptive  predictions which do not change as long as no error signals are present (green arrow).\nTrunk motor variability might be reduced  in the chronic LBP stage and/or by adopting a tight control strategy.\nTherefore, to minimize the prediction error, the M1 might be forced to match its  predictions to the inflow of proprioceptive information (red arrow).\nIn the long-term, this might provide a possible mechanism  for neuroplastic changes in sensorimotor cortices that have been observed in recurrent and chronic pain.\nof LBP discussed in this review might be important in  musculoskeletal pain in general.\nMoreover, motor control  adaptions might occur with pain irrespective of the tissue  type initially involved (Schilder and others 2012).\nIt is  then thinkable that, perhaps via similar mechanisms as  described here, pain that initially was not musculoskeletal  in nature leads to a secondary musculoskeletal pain problem.\nThis would of course aggravate and complicate the  clinical presentation of the patient, once more indicating  the importance of advancing our understanding of the  intricate interplay of pain and the motor system.\nThe author(s) declared no potential conflicts of interest with  respect to the research, authorship, and/or publication of this  article.\nThe author(s) disclosed receipt of the following financial support for the research, authorship, and/or publication of this article: Andrea Vrana is generously supported by ChiroSuisse and  the Foundation for the Education of Chiropractors in  Switzerland.\nMotor adaptations to trunk perturbation: effects of  experimental back pain and spinal tissue creep.\nAbboud J, Nougarou F, Pag I, Cantin V, Massicotte D,  Descarreaux M.\nTrunk motor variability in patients  with non-specific chronic low back pain.\nWhat is intervertebral disc  degeneration, and what causes it? Spine 31(18):215161.\nPredictions not commands: active inference in the motor system.\nBrain Struct  Funct 218(3):61143.\nLow  back skin sensitivity has minimal impact on active lumbar  spine proprioception and stability in healthy adults.\nThe cortical and cerebellar representation of the lumbar spine.\nUnderstanding the role of the primary somatosensory cortex:  opportunities for rehabilitation.\nfatigue on trunk sensorimotor control in low back pain  patients.\nThe role of paraspinal muscle spindles in lumbosacral position sense in individuals with and without low  back pain.\nPersons with recurrent low back pain exhibit a  rigid postural control strategy.\nThe  responses of human muscle spindle endings to vibration  during isometric contraction.\nThe role  of PIEZO2 in human mechanosensation.\nImpaired neural drive in patients with low back pain.\nCorticospinal excitability of trunk muscles during different  postural tasks.\nCortical contributions to anticipatory postural adjustments  in the trunk.\nChronic low back  pain patients walk with locally altered spinal kinematics.\nMulti-segment analysis of spinal kinematics during  sit-to-stand in patients with chronic low back pain.\nDecreased variability in postural control strategies in  young people with non-specific low back pain is associated with altered proprioceptive reweighting.\nYoung individuals with a more anklesteered proprioceptive control strategy may develop mild nonspecific low back pain.\nPeople with chronic low  back pain have poorer balance than controls in challenging  tasks.\nDeliagina TG, Beloozerova IN, Zelenin PV, Orlovsky GN.\nSpinal and supraspinal postural networks.\nChanges in coordination of postural  control during dynamic stance in chronic low back pain  patients.\nElgueta-Cancino E, Schabrun S, Danneels L, Hodges P.\nA clinical test of lumbopelvic control.\nElgueta-Cancino E, Schabrun S, Hodges P.\nIs the organization of the primary motor cortex in low back pain  related to pain, movement, and/or sensation? Clin J Pain  34(3):20716.\nTransient inhibition of the human  motor cortex by capsaicin-induced pain.\nA study with transcranial magnetic stimulation.\nNeurosci Lett 314(12):  97101.\nExtensive reorganization of primary somatosensory cortex in chronic  back pain patients.\nSensorimotor  control of movement and posture.\nA sensorimotor paradigm for  Bayesian model selection.\nJoint position sense and vibration sense: anatomical organisation and assessment.\nBrain activity during ankle  proprioceptive stimulation predicts balance performance in  young and older adults.\nThe neural basis of central proprioceptive processing in older versus younger adults: an  important sensory role for right putamen.\nThe contribution of muscle afferents to kinaesthesia shown by vibration induced illusions of movement and by the effects of  paralysing joint afferents.\nAssociation between sensorimotor  impairments and functional brain changes in patients with  low back pain: a critical review.\nThe organization of behavioral repertoire in  motor cortex.\nWhat low back pain is and  why we need to pay attention.\nPain and motor control: from the laboratory  to rehabilitation.\nJ Electromyogr Kinesiol 21(2):2208.\nExperimental muscle pain changes feedforward postural  responses of the trunk muscles.\nExp Brain Res 151(2):26271.\nMoving differently in pain: a  new theory to explain the adaptation to pain.\nThe global burden of low back pain: estimates from the Global Burden of Disease 2010 study.\nClinical  course of non-specific low back pain: a systematic review  of prospective cohort studies set in primary care.\nFear of movement is related to trunk stiffness in low  back pain.\nProprio-tactile integration for kinesthetic perception:  an fMRI study.\nMultimodal interactions between proprioceptive and cutaneous signals in primary somatosensory cortex.\nAnticipatory and compensatory postural  adjustments in people with low back pain: a systematic review and meta-analysis.\nLafond D, Champagne A, Descarreaux M, Dubois J-D, Prado  JM, Duarte M.\nPostural control during prolonged  standing in persons with chronic low back pain.\nGait of a deafferented subject without  large myelinated sensory fibers below the neck.\nLee AS, Cholewicki J, Reeves NP, Zazulak BT, Mysliwiec  LW.\nIntervertebral disc cell death is dependent on the magnitude and duration of spinal loading.\nCompression-induced degeneration of the intervertebral disc: an in vivo mouse model and finite-element study.\nThe painadaptation model: a discussion of the relationship between  chronic musculoskeletal pain and motor activity.\nOn functional motor adaptations: from the  quantification of motor strategies to the prevention of musculoskeletal disorders in the neck-shoulder region.\nMadeleine P, Mathiassen SE, Arendt-Nielsen L.\nChanges in the degree of motor variability associated  with experimental and chronic neck-shoulder pain during  a standardised repetitive arm movement.\nNon-specific  low back pain.\nHuman finger somatotopy in areas 3b, 1, and 2: a  7T fMRI study using a natural stimulus.\nRevisiting the corticomotor plasticity in low back pain: challenges and perspectives.\nNeural responses of posterior to  anterior movement on lumbar vertebrae: a functional magnetic resonance imaging study.\nEvidence for a  general stiffening motor control pattern in neck pain: a  cross sectional study.\nReduced variability of postural strategy prevents normalization of motor changes  induced by back pain: a risk factor for chronic trouble?  Behav Neurosci 120(2):4746.\nDoes anticipation of back pain predispose to back trouble? Brain 127(pt  10):233947.\nHuman limb-specific and non-limb-specific  brain representations during kinesthetic illusory movements of the upper and lower extremities.\nDifferences in repositioning error among patients  with low back pain compared with control subjects.\nsensory-motor interaction with focus on clinical implications.\nFunction, dysfunction, adaptation, and enhancement.\nClinical spinal instability and low back  pain.\nJ Electromyogr Kinesiol 13(4):3719.\nDynamic  and static overloading induce early degenerative processes in caprine lumbar intervertebral discs.\nProc R Soc Lond B Biol Sci 134(876):32947.\nThe motor cortex drives the muscles during walking  in human subjects.\nJ Physiol (Lond) 590(10):244352.\nThe cytoarchitecture of the  postcentral gyrus of the monkey Macaca mulatta.\nBull  Johns Hopkins Hosp 105:10831.\nThe proprioceptive senses: their  roles in signaling body shape, body position and movement, and muscle force.\nSympathetic innervation of human muscle spindles.\nJ Anat  226(6):5428.\nThe sensorimotor system, part  I: the physiologic basis of functional joint stability.\nJ Athl  Train 37(1):719.\nClin Biomech  (Bristol, Avon) 1(2):1029.\nSensorimotor reorganization by proprioceptive training in musicians dystonia and writers  cramp.\nRegaining motor control in musicians dystonia by restoring  sensorimotor organization.\nPain catastrophizing moderates changes  in spinal control in response to noxiously induced low back  pain.\nManual motor performance in a deafferented man.\nFunctional architecture  of the somatosensory homunculus detected by electrostimulation.\nControl  of limb dynamics in normal subjects and patients without  proprioception.\nMotor cortex reorganization and impaired  function in the transition to sustained muscle pain.\nSmudging of the motor cortex is related to the severity of  low back pain.\nThe integrative action of the nervous  system; with a new foreword by the author & a bibliography of his writings.\nTiming and magnitude of lumbar spine contribution  to trunk forward bending and backward return in patients  with acute low back pain.\nEffects of acute low back  pain on postural control.\nHuman movement variability,  nonlinear dynamics, and pathology: is there a connection?  Hum Mov Sci 30(5):86988.\nCorticospinal excitability in patients with chronic  low back pain.\nTrunk  motor control deficits in acute and subacute low back pain  are not associated with pain or fear of movement.\nThe effect of lumbar  fatigue on the ability to sense a change in lumbar position.\nGait variability and motor  control in patients with knee osteoarthritis as measured  by the uncontrolled manifold technique.\nDisruption of cortical synaptic homeostasis in individuals with chronic low back pain.\nPrevalence of low back  pain by anatomic location and intensity in an occupational  population.\nEffects on the fusimotor-muscle spindle system  induced by intramuscular injections of hypertonic saline.\nIs there a relationship between lumbar.\nIndividual fascicles  of the paraspinal muscles are activated by discrete cortical  networks in humans.\nISSLS prize winner:  smudging the motor brain in young adults with recurrent  low back pain.\nReorganization of the  motor cortex is associated with postural control deficits in  recurrent low back pain.\nDriving plasticity in  the motor cortex in recurrent low back pain.\nSimilar  alteration of motor unit recruitment strategies during the  anticipation and experience of pain.\nLow-back pain  patients learn to adapt motor behavior with adverse secondary consequences.\nExerc Sport Sci Rev 45(4):2239.\nvan Dien JH, Reeves NP, Kawchuk G, van Dillen L, Hodges  PW.\nAnalysis of motor control in low-back pain  patients: a key to personalized care? J Orthop Sports Phys  Ther.\nMotor control changes in low-back pain: divergence in presentations and mechanisms.\nTrunk muscle  activation in low-back pain patients, an analysis of the literature.\nEuropean  guidelines for the management of acute nonspecific low  back pain in primary care.\nInfluences  of nonspecific low back pain on three-dimensional lumbar  spine kinematics in locomotion.\nPrecision control of trunk movement in low back  pain patients.\nMultiple paired forward and  inverse models for motor control."}