{"title": "23.pdf", "contents": "Spine loading in patients with low back pain during asymmetric lifting exertions.\nAbstract BACKGROUND CONTEXT: Recurrent low back pain (LBP) is a common and costly problem that might be related to increased spine loads in those with LBP.\nHowever, we know little about how the spine is loaded when those with LBP perform lifting exertions.\nPURPOSE: Document spine loading patterns of patients with LBP performing symmetric and asymmetric lifting exertions compared with asymptomatic individuals performing the same tasks.\nSTUDY DESIGN: Spine loadings during lifting exertions that varied in asymmetric origin as well as horizontal and vertical distance from the spine were compared between asymptomatic subjects and patients with LBP.\nMETHODS: Sixty-two patients with LBP and 61 asymptomatic individuals performed a variety of lifting exertions that varied in lift origin horizontal and vertical position (region), lift asymmetry position and weight lifted.\nAn electromyography-assisted model was used to evaluate spine loading in each subject during the lifting exertions.\nDifferences in spine loading between the LBP and asymptomatic subjects were noted as a function of the experimental variables.\nRESULTS: Patients with LBP experienced greater spine compression and shear forces when performing lifting tasks compared with asymptomatic individuals.\nThe least taxing conditions resulted in some of the greatest differences between LBP and asymptomatic individuals.\nCONCLUSIONS: Greater levels of antagonistic muscle coactivation resulted in increases in spine loading for patients with LBP.\nThese findings may impact acceptable return-to-work conditions for those with LBP.\nA continuing dilemma for those treating low back pain (LBP) has been the treatment and prevention of recurrent LBP.\nIt has been well documented that one of the strongest predictors of future LBP is a previous history of LBP [1,2].\nof the studies reviewed concluded that previous history of LBP was associated with an increased risk of symptoms [3].\n[4] have estimated that those with a history of previous LBP have twice the rate of new LBP episodes compared with those without a history of LBP.\nIt has also been reported that the more frequently back pain occurs, the greater the risk of new back pain.\nOne might speculate that patients who do not fully recover from a LBP episode might be predisposed to further exacerbation of an LBP event.\nAlthough multiple injury pathways are believed to be potentially responsible for recurrent LBP [79], a biomechanical source of low back disorders has historically been accepted as one potential pathway [7].\nStudies [10 12] have suggested that excessive mechanical loading on already compromised spinal structures can progressively affect disc degeneration and might result in chronic LBP.\nSpine loads associated with work tasks may also increase the risk of LBP.\n[13] reported that injury costs increase dramatically as job difficulty increases.\nIn addition, industry surveillance studies found that the mechanical measures of spine moment, spine compression and spine shear on the job were closely related to LBP reporting [14,15].\nTherefore, it is important to understand the mechanical loading of an LBP patients spine during work tasks (such as lifting exertions) because this may represent a mechanism that further compromises the backs musculoskeletal system.\nIf one could understand, quantitatively, the characteristics of spine loading in those with LBP, then situations that might further exacerbate a low back disorder could be avoided.\nHowever, the mechanisms by which a history of LBP increases risk are poorly understood.\nSeveral biomechanical studies have attempted to determine whether a history of LBP results in greater spine loading and, potentially, an increase in LBP risk.\nMany studies have identified differences in muscle recruitment patterns between those with and those without LBP [1619].\nHowever, traditionally, it has been difficult to interpret these effects on spine loading [20].\n[20] suggested that, given the variability in muscle response in LBP, the use of electromyography (EMG)-assisted models might be necessary to appreciate these differences.\nUntil recently the use of EMG-assisted models with patients with LBP has been problematic because there were no means to properly calibrate the EMG signal in patients with LBP.\nCalibration of the EMG signal in patients with LBP has been difficult because patients with LBP are reluctant to exert the maximum exertions necessary to calibrate the EMG signal.\nRecently, an EMG normalization technique not requiring maximum exertions has been developed and validated that could be used with patients with LBP [21,22].\nThese advancements have permitted the first interpretation of spine loading for those with LBP [23].\nThis study has demonstrated that after adjusting for differences in body mass (moment normalization), when patients with LBP perform the same exact (kinematically controlled) lifting exertions as asymptomatic individuals, spine loading of patients with LBP was 26% greater in compression and 70% greater in anteriorposterior (A/P) shear.\nGreater spine loading was primarily the result of increases in muscle antagonistic coactivation presumably resulting from increased guarding.\nThe study also found that when subjects were permitted to adapt their own lifting exertion style (as opposed to kinematically controlled exertions), the patients with LBP changed their kinematic patterns in an attempt to minimize the external moments(andspineloads)towhichtheywereexposed.\nfindings suggest that subjects with LBP have developed proprioceptive tolerance limits above which they are unwilling to load the body and, thus, adapt alternative lifting strategies.\nHowever, the realistic lifting environment often yields situations that made it difficult to employ alternative lifting strategies.\nIn addition, because those with LBP are typically heavier than asymptomatic individuals, they experience additional spine loading resulting from their greater body mass.\nThis information suggests that lifting exertions performed by those with LBP represent a substantially different situation compared with asymptomatic individuals.\nOur previous investigation [23] of spine loading associated with patients with LBP investigated sagittally symmetric lifts, exclusively, and employed a relatively small population of subjects.\nHence, we do not have an understanding of how patients with LBP spine loadings would develop during more realistic lifting situations that would be encountered as patients return to the workplace.\nThe objective of this study was to determine how threedimensional spine loading compared in subjects experiencing low back pain compared with asymptomatic individuals among the variety of lifting conditions and situations that would be expected of patients with LBP as they return to the workplace.\nThis study employed a well-developed EMG-assisted model to assess spine loading as LBP, and asymptomatic subjects lifted a variety of loads from various lift origin regions and asymmetric positions reflective of work conditions.\nThe analyses examined the spine loading response of those with LBP compared with those without LBP as the horizontal, vertical and asymmetric location of the lift origin varied and as the weight of the object lifted changed.\nPatients were excluded from the study if physical examination showed signs of lower extremity deficit or hyperflexia.\nWithin the LBP group, 35% reported local back pain only, 52% reported a distribution of 75% back pain and 25% leg pain, and 13% reported an equal distribution of pain between back and leg.\nSixty-one age-matched asymptomatic (during the previous year) individuals (31 men and 30 women) were recruited to perform in the study.\nPain level (0 to 10 scale) 5.\n9 Duration (months) 10.\n3 SF 36 Bodily Pain 6.\n2 SF 36 General Health 17.\n1 SF 36 Vitality 12.\n1 SF 36 Social Functioning 7.\n2 SF 36 RoleEmotional 4.\n3 SF 36 Mental Health 20.\nThis phase employed a repeated-measures within-subject design.\nThe independent variables in this study were subject group membership (LBP vs.\nasymptomatic), weight lifted, lift origin region and lift asymmetry position.\nFour weights were lifted (4.\n4 kg) under freedynamic conditions starting from each of five lift origin regions varying in vertical height and horizontal distance from the spine (shoulder height at a moment arm distance of 30.\n5 cm from the spine, waist height at a moment arm distance of 30.\n5 cm from the spine, knee height at a moment arm distance of 30.\n5 cm from the spine, mid-shin height at a moment arm distance of 30.\n5 cm from the spine, far-waist.\nThe lifts ended with the body in an upright position with the weight located at elbow height (elbow angle about 90 degrees).\nThe combination of weight lifted, lift origin region and lift asymmetry were intended to represent the range of lift exertion variable combinations expected of a worker returning to the workplace [24,25].\nThe dependent variables consisted of the EMG activity of 10 trunk muscles, trunk and hip kinetic as well as kinematic information, and the resulting spinal loads.\nEMG activity was collected through the use of bipolar silver-silver chloride electrodes that have a 4 mm diameter and were spaced approximately 3 cm apart.\nElectrodes recorded activity at the 10 major trunk muscle sites consisting of right and left muscle pairs of erector spinae, latissimus dorsi, rectus abdominus, external oblique and internal oblique muscles.\nEMG preparations and electrode placements were previously described [26].\nThe raw EMG signals were preamplified, high-passed filtered at 30 Hz, low-passed filtered at 1,000 Hz, rectified and smoothed with a 20-ms sliding window filter.\nSkin impedances were maintained below 100 K.\nEMG calibration normalization was performed using an asymmetric reference frame [27] that isolated the exertions and postures of the torso.\nPelvic and leg positions were also controlled using a pelvic support structure [28].\nThe asymmetric reference frame provided static resistance against the upper body and monitored torque production about L5S1.\nThe pelvic support structure was mounted to a force plate (Bertec 4060A; Worthington, Ohio).\nThe forces and moments measured at the center of the force plate were mathematically translated and rotated to L5S1 [28].\nA computer displayed real-time moment about L5S1 to the subject and allowed them to control the exertion magnitude.\nTrunk kinematics were monitored with a triaxial goniometer (lumbar motion monitor).\nThe device acts as an instrumented exoskeleton of the spine that measured instantaneous three-dimensional position, velocity and acceleration of the trunk.\nThe device design, accuracy and application have been reported previously [29].\nDuring the spine loading study, ground reaction forces were monitored by means of a force plate and trunk muscle EMG activities recorded as described above.\nA set of electrogoniometers in conjunction with a force plate were used to document the moments and forces exerted about L5S1 [30] during these free dynamic lifts (Fig.\nThe set of goniometers measured the position of L5S1 as well as the pelvic orientation of the subject relative to the center of the force plate.\nthe force plate were mathematically translated and rotated up to L5S1.\nAll signals were collected simultaneously through customized Windows-based software developed in the Biodynamics Laboratory.\nThe processed signals were collected at 100 Hz and recorded on a computer by means of an analog-todigital converter.\nAn EMG calibration (normalization) procedure was recently reported that does not require a maximum exertion in.\nTypically, EMGs are normalized relative to a maximum voluntary contraction (MVC).\nThis new technique estimates the slope of the EMG-force relationship and predicts an expected maximum contraction in order to anchor the maximum value.\nThese test conditions produced a series of EMG-force relationship points from which a relationship slope was derived.\nA recent study [22] reported minor differences in EMGassisted model results when comparing this normalization method versus maximum exertions to calibrate the EMG signal.\nUpon arriving at the laboratory, the subjects were, first, informed about study procedures, their ability to refuse to complete a particular lift and their need to inform experimenters about any further discomfort.\nNext, subjects were prepared for the spine loading assessment testing.\nAnthropometric measurements were collected and surface electrodes then were applied using standard placement procedures described earlier for muscles of interest.\nThe subject was positioned in the experimental apparatus, and EMG calibration procedures were completed as described previously.\nAfter a rest period, the lifting exertions began.\n1) were completed at each weight level before increasing to the next weight.\nHence, lifts were performed in the least taxing positions (eg, lowest expected lift moment) first and then progressed to more demanding lifts (eg, higher expected lift moment) at each weight level.\nSubjects were required to keep the feet stationary on the force plate (for force monitoring purposes) but were free to move the rest of the body as they wished.\nOver the past 20 years, our laboratory has developed a three-dimensional dynamic biomechanical model that can determine how the vertebral joint at L5S1 is loaded during a dynamic motion [3345].\nThe model yields subjectand task-specific spine loading information.\nOur model assumes that we can pass one imaginary transverse plane through the thoraxandanotherimaginarytransverseplanethrough the pelvis.\nAccording to the laws of physics, only muscles that pass through both of these planes are capable of imposing loads on the lumbar spine.\nEMG is used to monitor every major muscle group that passes through both of these two planes.\nThe lumbar motion monitor tracks the positions of the two planes relative to one another and permits adjustment of muscle activity for muscle length and velocity.\nThis information is used to assess the muscle force associated with each muscle.\nThese forces are represented as vectors acting between these two imaginary planes.\nMagnetic resonance imaging data have been collected to ensure that origin and insertions of muscle vectors are anatomically realistic and adjusted for gender differences and muscle fiber orientation [46].\nSummation of muscle forces in each cardinal plane is used to compute spinal forces.\nComparison of modelpredicted external moment with measured external moment.\nis used as a validation measure.\nThe model has been validated for forward bending [36,40], lateral bending [42] and twisting [41] exertions.\nAdjustments to muscle location and size were also made relative to each subjects body mass index [47] because the LBP group was considerably heavier than the asymptomatic group yet similar in stature.\nAnalysis of kinematic status was performed using analysis of variance procedures to determine significant differences between the asymptomatic and patient groups for each of the dependent kinematic motion parameters.\nMultiple comparisons were made using Bonferoni adjustments.\nBefore statistical testing, log transformations were performed on spine loading data to ensure normality and variance equality between subject groups [48].\nStatistically significant differences in spine loading assessments were identified by means of a repeated measures analysis of covariance structure analysis implementing mixed modeling procedures using SAS software [49].\nThe procedure allowed for fixed effects as well as random effects.\nFixed effects were lift origin region, weight, asymmetric position and subject group.\nRandom effects were the result of the subjects.\nMixed modeling procedures were used to identify significant differences resulting from the main effect of subject group, lift origin region, weight, asymmetry position and all twoand three-way interactions as a function of spine loading measures, moments, trunk kinematics and pelvic kinematics.\nPost hoc contrasts were employed to identify the significant differences between asymptomatic and patient groups within each asymmetric condition, weight level, lift origin region and their interactions at the 0.\n01) greater in the LBP group compared with the asymptomatic group.\nOver all conditions, compression was about 11% greater and A/P shear about 18% greater in the patients with LBP.\nStatistically significant increases in spine loading were noted as a function of lift origin region, lift asymmetry position and the magnitude of the weight lifted for the LBP group compared with the asymptomatic group among most of the dimensions of spine loading.\nCompression and A/P shear values were of greater magnitude and greater relative difference than the lateral shear values.\nUnder all lift origin conditions LBP subjects exhibited greater compression and A/P shear.\nHowever, the relative difference varied as a function of the region.\nTable 3 Statistical analysis p values for differences between experimental group and the interaction of experimental conditions and group.\n9611 Subject group 0.\n9638 *region*weight Subject group 0.\n5137 *asymmetry Subject group*region 0.\n*asymmetry Subject group 0.\n05 adjusting for the number of comparisons.\nSimilarly, subjects with LBP always exhibited greater compression and A/P shear loading under all symmetric/ asymmetric conditions compared with the asymptomatic subjects.\n5 and 6 indicate that compression and A/P shear differences were greater between subject groups when lifting clockwise (CW) compared with lifting from counterclockwise (CCW) asymmetries (over twice as much compression difference between LBP and asymptomatic groups when lifting in CW positions compared with CCW positions).\nCompressive force as a function of lift origin and subject group (* indicates significant differences between groups, p0.\nA significant difference between LBP and asymptomatic individuals also was present for the unique combinations (interaction) of lift origin region and asymmetry.\nConsistent with the previous patterns, patients with LBP exhibited greater A/P shear loads under many of the condition combinations.\n7, A and B, many of the lift origin/asymmetry combinations were significantly greater (20% to 30%) in A/P load for the LBP group.\nLittle difference existed in the symmetric A/P loads between subject groups.\nHowever, far greater A/P loads (15% to 30%) occurred at the asymmetric lifting positions under the far-knee lift origin regions.\nThis condition was of particular concern because the loads approached or exceeded 1,000 N in shear, which is often considered the tolerance limit for A/P shear [42].\nSignificant differences in compression and lateral shear occurred as a function of the weight handled between the LBP and the asymptomatic group.\nHowever, the differences in loading between subject groups were greatest at the lower weights of lift.\nCompression differences were approximately 3% different, and lateral shear differences were about 5.\nAs the weight increased, this difference in spine loading decreased to the point where at 11.\nSignificant muscle usage differences were observed between subjects groups.\n8, statistically greater activity was observed in the LBP group for all muscle groups except for the erector spinae muscle group.\ncompared with the asymptomatic group were on the order of 32%.\nMany trunk kinematic measures were significantly different between the LBP and asymptomatic groups as a function of the various experimental conditions.\nTable 4 summarizes the statistically significant (p.\n01) differences in kinematic measures between the two groups during the lifting exertions.\nIn most cases the LBP group exhibited significantly lower values in kinematics compared with the asymptomatic participants.\nThis table indicates that, in particular, the asymmetry conditions resulted in a multitude of differences in lateral motion, twisting motion and pelvic rotation.\nIn all cases the end result of these changes was to minimize the moment for participants with LBP.\nThis effort represents a first step toward quantitatively matching a patients specific abilities to an acceptable level of spine loading experienced during a lifting exertion.\ndesigned to represent the load magnitudes commonly recommended in return-to-work programs.\nThe results demonstrate that in those with LBP, spine loading is increased relative to asymptomatic counterparts over a series of lifting exertions representative of those expected in a work environment.\nSome of the most surprising findings of this study involved the nature of the relationship between the LBP patients spine loadings and specific workplace conditions.\nThe general pattern of spine loadings in asymptomatic individuals behaved as expected [50,51], varying as a function of lift origin region, lift asymmetry position and weight lifted.\nHowever, the nature of the differences in spine loading patterns between the patients with LBP and asymptomatic subjects among the experimental conditions were not expected.\nThese findings provide several significant insights into the functioning of the trunks musculoskeletal system in response to the experience of LBP.\nSeveral unique findings are worthy of discussion.\nFirst, when the percent change in spine loading was considered as a function of lift origin region, larger differences between LBP and asymptomatic subject groups were observed in lift origin regions that would be expected to be.\n3 and 4 indicated that the largest difference in loading between patients with LBP and asymptomatic individuals occurred in the shoulder lift origin region followed by the waist lift origin region.\nHowever, the relative increase in loading among the subjects with LBP compared with the asymptomatic group is large (25% to 35%) in these two regions.\nThus, patients with LBP pay a greater relative biomechanical cost for lifting in these regions.\nHence, there appears to be a musculoskeletal trade-off occurring where LBP subjects employ greater hip movement in lieu of torso motion.\nExamination of the EMG data recorded during the lifting exertions revealed significantly increased activities (up to 60%) for the LBP subjects compared with the asymptomatic group in all muscles except the erector spinae group in the shoulder and waist lift origin regions.\nThese findings indicate that the musculoskeletal system increases antagonistic coactivation as a means to control or guard against this increased kinematic task demand.\nIt is interesting that less erector spinae activity is displayed compared with the asymptomatic group.\nThis indicates a very different coactivation strategy in the LBP group compared with the asymptomatic group.\nIt is this different coactivation pattern that results in increases in spine loading in the LBP group.\nSecond, perhaps the most unexpected pattern involving differences in loading between the LBP group and the asymptomatic group involved the asymmetric lift position variable.\nHowever, no previous spine loading studies involving patients with LBP have explored the effects of asymmetric lifting.\nOur results indicate little difference between CW and CCW compression values within the asymptomatic group, yet increases in compression in CW compared with CCW movements within the patients with LBP.\nTable 4 revealed that spine lateral kinematics as well as pelvic rotation kinematics changed significantly between subject groups as a function of asymmetry position, thus indicating the adoption of alternative lifting strategies in the LBP group.\nHowever, these adaptations occurred only as a function of CCW asymmetry.\nKinematic measures were essentially the same during lifting in the CW direction for both groups of subjects.\nYet, as was the case for differences observed as a function of lift origin region, the musculoskeletal system was taxed to a greater degree in the CW direction compared with the CCW direction.\ndid not choose to adopt alternative lifting strategies in the CW direction as they did in the CCW direction.\nInteresting differences in antagonistic coactivation also occurred as a function of the asymmetric lifting positions.\nUnder most conditions the LBP group coactivated the trunk muscles to a much greater extent than the asymptomatic group.\nExamination of the CW-CCW differences in EMG patterns indicated that subjects with LBP coactivated 8 of the 10 trunk muscles to a greater degree in the CW direction compared with the CCW direction.\nThis greater muscle activation in the CW direction was responsible for the greater loading.\nIt was also interesting to note that when the subject pain diagrams were reviewed, twice as many subjects reported right-side pain compared with left-side pain.\nThus, the majority of subjects might have increase guarding when rotating CW.\nIn general, larger differences between the LBP and asymptomatic subjects groups were observed at the lower weight levels, but these differences were rather minor compared with the asymmetry and lift origin differences.\nAs with the other significant spine loading differences, differences in loading could also be explained by differences in muscle coactivations.\nThese findings again suggest that the largest differences in spine loading between asymptomatic subjects and patients with LBP are found in the least taxing conditions.\nOne might question why the relative differences in loading were greater in the least taxing biomechanical conditions.\nIt would appear that these less biomechanically taxing positions provide the opportunity for patients with LBP to increase spine coactivity in an attempt to increase spine stability [5254].\nThere is no need for an intact (asymptomatic) individual to co-contract to the same degree as patients with LBP in these postures.\nHowever, under the more taxing external loading conditions, both groups of subjects sense the need to control trunk motion and stability to a greater degree and, therefore, coactivate the trunk muscles.\nIn addition, under greater external loading conditions system stability is inherent with greater magnitude loads.\nThus, the difference between the groups is diminished.\nHence, compared with asymptomatic workers, it appears that the least taxing activities would contribute relatively more to a cumulative trauma index compared with the more taxing tasks [5557].\nThus, exertion conditions that would be considered relatively low stress, and would be considered good candidates for return to work tasks, may be more costly from a biomechanical perspective than expected.\nThese findings are consistent with epidemiologic observations by Infante-Rivard and Lortie [58] who found that pain associated with carrying out simple daily movements were the best indicators of LBP relapse.\nHence, their findings may indicate that the patients were experiencing greater spine loading in these simple tasks than would be expected.\nFinally, these findings should be considered in perspective by recognizing potential study limitations.\nFirst, this study considered only the mechanical spine loading contribution to low back disorders.\npain is multidimensional and involves many factors [7,9].\nSpecifically,few subjectselectedto performthe 90 CW or 90 CCW exertions when lifting the 9.\nHence, the relationships observed in these extreme conditions might reflect only the less impaired subjects with LBP.\nThird, we elected not to normalize spine loading as a function of body weight in this study.\nA previous study [23] indicated that body mass normalization produces similar findings.\nHowever, the inclusion of such normalization would limit the applicability of the results.\nFinally, the relationships described in this study involve subjects with LBP of muscular origin.\nIt is unknown whether the relationship between kinematic status and LBP would be similar for LBP of structural origin.\nSpine loading is greater in patients with LBP compared with asymptomatic individuals when performing similar lifting exertions.\nThe difference in loading between LBP and asymptomatic individuals depends primarily on the lift origin location and to a lesser extent the weight of the object lifted.\nLift origin locations located at the least biomechanically taxing positions resulted in the greatest difference in loading between LBP and asymptomatic individuals.\nClockwise asymmetric lifts yielded much greater spine loading in subjects with LBP compared with counterclockwise lifts.\nThe differences in spine loadings between the LBP and asymptomatic groups appear to be linked to differences in trunk muscle coactivation and possibly perceived needs for system stability.\nThis study was funded by the Ohio Bureau of Workers Compensation.\nChristopher Hamrick in the execution of this study is gratefully acknowledged.\nDaryl Sybert in subject recruitment.\nProspective cohort study of predictors of incident low back pain in nurses.\nRisk factors for back pain incidence in industry: a prospective study.\nA literature review of low back disorder surveillance measures and risk factors.\nRisk factors for back pain incidence in industry: a prospective study.\nMusculoskeletal disorders and the workplace: low back and upper extremity.\nMechanical initiation of intervertebral disc degeneration.\nStress distributions inside intervertebral discs.\nThe effects of age and degeneration.\nJ Bone Joint Surg Br 1996;78:96572.\nSustained loading generates stress concentrations in lumbar intervertebral discs.\nDifferences in electromyographic activity in the multifidus muscle and the iliocostalis lumborum between healthy subjects and patients with sub-acute and chronic low back pain.\nDifferentiating temporal electromyographic waveforms between those with chronic low back pain and healthy controls.\nBack muscle contraction patterns of patients with low back pain before and after rehabilitation treatment: an electromyographic evaluation.\nEMG activity of trunk muscles and torque output during isometric axial rotation exertion: a comparison between back pain patients and matched controls.\nA biomechanical comparison of lifting techniques between subjects with and without chronic low back pain during freestyle lifting and lowering tasks.\nA non-MVC EMG normalization technique for the trunk musculature: Part 1.\nA non-MVC EMG normalization technique for the trunk musculature: Part 2.\nValidation and use to predict spinal loads.\n[23] Marras WS, Davis KG, Ferguson SA, Lucas BR, Gupta P.\nThe role of dynamic three-dimensional trunk motion in occupationally-related low back disorders.\nThe effects of workplace factors, trunk position, and trunk motion characteristics on risk of injury.\nBiomechanical risk factors for occupationally related low back disorders.\nElectromyographic studies of the lumbar trunk musculature during the generation of low-level trunk acceleration.\nA comprehensive evaluation of trunk response to asymmetric trunk motion.\nAccuracy of a three dimensional lumbar motion monitor for recording dynamic trunk motion characteristics.\nA method for measuring external spinal loads during unconstrained free-dynamic lifting.\nPart 3: Preliminary data on isokinetic torso rotation testing with myoelectric spectral analysis in normal and low-back pain subjects.\nPart 4: Isometric and isokinetic lifting simulation in normal subjects and low-back dysfunction patients.\nThe evaluation of spinal loads during lowering and lifting.\n[35] Granata KP, Marras WS.\nAn EMG-assisted model of trunk loading during free-dynamic lifting.\nNetworks of internal trunk-loading activities under controlled trunk-motion conditions.\nA three-dimensional motion model of loads on the lumbar spine: I.\nA three-dimensional motion model of loads on the lumbar spine: II.\n[41] Marras WS, Granata KP.\nSpine loading during trunk lateral bending motions.\nThe development of an EMG-assisted model to assess spine loading during whole-body free-dynamic lifting.\nA stochastic model of trunk muscle coactivation during trunk bending.\nSimulift: a simulation model of human trunk motion.\nFemale and male trunk geometry: size and prediction of the spine loading trunk muscles derived from MRI.\nTrunk muscle parameters determined from MRI for lean to obese males.\nApplied linear regression models.\nBoston, MA: Irwin, 1989:145.\nMechanical stability of the in vivo lumbar spine: implications of injury and chronic low back pain.\nRelative contribution of trunk muscles to the stability of the lumbar spine during isometric exertions.\nThe stabilizing system of the spine.\nFunction, dysfunction, adaptation, and enhancement.\nAn evaluation of predictive methods for estimating cumulative spinal loading.\nCumulative load as a risk factor for back pain.\nThe role of cumulative physical work load in lumbar spine disease: risk factors for lumbar osteochondrosis and spondylosis associated with chronic complaints.\nRalapse and short sickness absence for back pain in the six months after return to work."}