{"title": "32.pdf", "contents": "Introduction Chronic pain is a major health issue all over the world, and is caused by tissue or nerve injury under different disease conditions.\nTreatment of chronic pain is a clinical challenge because the mechanisms are less well known.\nIn addition to the spinal cord (Woolf and Salter, 2000), multiple brain areas, such as the primary somatosensory cortex (S1) and anterior cingulate cortex (ACC), are involved in acute pain processing (Price, 2000; Vogt, 2005; Zhuo, 2008).\nThese areas also contribute to chronic pain (Moisset and Bouhassira, 2007).\nThe S1 has a role in the sensory aspects of pain, such as the location and duration of pain (Bushnell et al.\nAlthough several brain imaging experiments show increase in the S1 activity under chronic pain conditions (Peyron et al.\n, 1998; Petrovic et al.\n, 1999; Endo et al.\n, 2008), little is known about the plastic change of neuronal activity in the S1.\nand its contribution to the pathological behavior under the chronic pain condition.\nHere, we found facilitation of the L2/3 excitatory neuronal activity in the S1 using in vivo two-photon Ca 2 imaging, which exaggerated pain behavior by facilitation of ACC activity.\nTo induce chronic inflammatory pain, 40 l of Complete Freunds adjuvant (CFA) (Sigma) was injected subcutaneously into the hindpaw 1 week before experiments.\nControl mice were injected with 40 l of saline only.\nThe skull was exposed and cleaned.\nThe exposed dura was covered with a glass coverslip and the space was filled with agarose (Wako Pure Chemical Industries, 2% in ACSF).\nOptical imaging of intrinsic signal.\nFor imaging of intrinsic signals, the cortical surface was illuminated by blue light-emitting diodes (490 nm).\nYin for comments on the manuscript.\nCorrespondence should be addressed to Dr.\nLabeling procedure and in vivo Ca2 imaging.\nFluorescence data acquisition and analysis.\n428 s per frame) was analyzed with Olympus Fluoview software.\nThe baseline intensity, F0, was obtained by averaging the intensity values during the prestimulus period (5 s).\nCells were considered responsive if the fluorescence intensity change was 10% of baseline value, because we can clearly distinguish responses from baseline.\nIn some experiments, we placed a bipolar electrode (Inter Medical) at the depth of 500550 m below the cortical surface.\nElectrical pulses were generated using a stimulator (SEN-7203, Nihon Kohden) attached to an isolator unit (SS-403J, Nihon Kohden).\nTen pulses of 200 s constant current (10100 A, interval of 1 min, 20 Hz) were applied in each trial.\nSlice preparation and whole-cell patch-clamp recording.\nBrain slices were made as previously reported (Eto et al.\nElectrical recordings were made using the conventional whole-cell patch-clamp recording technique at a holding potential of 60 mV (Axopatch 700B, Molecular Devices).\nPatch pipettes were filled with the internal solution, which contained (in mM:) 130 cesium methanesulfonate, 4 CsCl, 2 EGTA, 4 Mg-ATP, and 10 HEPES, 5 QX314, pH 7.\nEvoked EPSCs were recorded from the L2/3 pyramidal neurons in the S1 hindpaw area in the presence of 50 M.\nD-()-2-amino-5-phosphonopentanoic acid (AP-5), an NMDA receptor antagonist, and elicited by applying voltage pulses (100 s, 0.\nData were acquired using pCLAMP 10 software, filtered at 2 kHz, digitized at 10 kHz.\nA craniotomy was made in the region overlying the ACC and S1.\nField EPSPs (fEPSPs) in the ACC (1.\n4 mm from the surface) were recorded using a DiI-coated tungsten electrode.\nAfter amplification (ER-91, NeuroData) and bandpass filtering (101 kHz), the signal was sent to an analog-to-digital converter (PowerLab/4ST).\nThe drug [AMPA receptor antagonist 6-cyano-7-nitroquinoxaline-2,3-dione (CNQX), or SR95531 (2-(3-carboxyl)-3-amino-6-(4-methoxyphenyl)-pyridazinium bromide) with 0.\n1% fluorescein isothiocyanate (FITC)] was applied to the L2/3 region of the S1 hindpaw area, and drug expansion was assessed by the fluorescence from FITC.\nA small hole (1 mm) was made on the skull above the S1, and drugs (CNQX, vehicle containing 1% DMSO, SR95531) were injected using a glass pipette at the L2/3 region under brief anesthesia, using isoflurane (13% as needed) inhalation with 30% oxygen balanced with nitrogen.\nTherespondingcellratioandresponseprobabilityweredeterminedasthe numberofresponsivecellsdividedbytotalimagedcellsateachplane,andasthenumberofresponsivetrialsdividedbythetotal number of trials, respectively.\nCortical Activities Accelerate Pain Behavior.\nabove the bilateral ACC, and CNQX (1 mM, 0.\nAll values are expressed as mean  SEM.\nStatistical comparisons were performed using ANOVA followed by a Bonferroni test or unpaired Students t test.\nThe difference between cumulative distributions was assessed using the KolmogorovSmirnov test.\nResults CFA was injected into the hindpaw of a wild-type mouse or a VGAT-Venus mouse (see Material and Methods) to generate a chronic inflammatory pain model.\nThe frequency of spontaneous Ca 2 transients was increased in the CFA-injected mice (4.\n05) when compared with the control mice (3.\n8 transients/min, 130 cells, 2 animals).\nThe L2/3 neuronal activity of the CFA-injected mice increased in responding cell ratio (38.\n06%, 350 trials in 5 animals, p  0.\n078, 4660 responses in 5 animals, p  0.\n05) compared with the control mice, which displayed values of 19.\n099 (1420 responses in 4 animals), respectively (Fig.\n, 2005), this result suggests that spontaneous activity and excitability of L2/3 neurons in response to peripheral stimulation increased under chronic pain condition.\nThe L2/3 excitatory neuronal activity of the CFA-injected mice in response to sensory stimulation increased in responding cell ratio (22.\n01%, 400 trials in 4 animals, p  0.\n007, 450 cells in 4 animals, p  0.\n001, 1880 responses in 4 animals, p  0.\n05), compared with the control mice, which displayed values of 17.\n005 (610 cells in 3 animals), and 0.\n001 (1651 responses in 3 animals), respectively (Fig.\nThese results clearly demonstrate the hyperexcitability of L2/3 excitatory neurons in chronic pain conditions.\nIntracortical remodeling between the L2/3 and L4 in the S1 contributes to the hypersensitivity of L2/3 excitatory neuronstosensorystimulationunderchronicpainconditions.\nExcitabilityofL2/3excitatoryneuronsofS1evoked by electrical stimulation of the L4 region increased in the CFA-injected mice.\nEvoked Ca 2 transients increased with respect to the responding cell ratio, response probability per responding cell, and amplitude, compared with the respective values of control mice (control, 3 animals; CFA, 4 animals) (Fig.\n2gi), which may indicate intracortical remodeling between the L4 and L2/3 neurons under chronic pain conditions in vivo.\nThis intracortical remodeling was further confirmed by patch-clamp recording of EPSCs from L2/3 pyramidal neurons in brain slice preparations (Fig.\nThe obtained intensity response curves revealed that the amplitudes of EPSCs evoked by electrical stimulation of the L4 region were increased in the CFAinjected mice compared with the control mice (Fig.\nThis increased synaptic input from L4 to L2/3 pyramidal neurons also suggests that the intra-regional network from L4 to L2/3 excitatory neurons is remodeled in chronic pain conditions.\nInjection of CNQX increased the pawwithdrawal threshold (Fig.\nIn contrast, microinjection of CNQX at the same dose to the S1 did not affect the pawwithdrawal threshold in control mice (Fig.\nHowever, an injection of a GABAA receptor antagonist, SR95531, decreased the paw-withdrawal threshold in control mice (Fig.\nThus, this result suggests that S1 neuronal hyperactivity contributes to the facilitation of mechanical allodynia under chronic pain conditions.\nSince L2/3 excitatory neurons project to other cortical areas (Ferezou et al.\n, 2007; Kamatani et al.\n, 2007), the plastic change may modulate activity of other pain-related cortical areas, which may contribute to expression of mechanical allodynia.\nTo clarify the influence of increased outputs from the S1 on the ACC, one of the important areas for chronic pain (Zhuo, 2007; Xu et al.\n, 2008), we recorded fEPSPs in the ACC evoked by sensory stimulation with the suppression or disinhibition of the neuronal activity in the S1 (Fig.\nUnder normal conditions (control mice), local CNQX (1 mM, 1 l) injection into the S1 did not alter the slope of fEPSP of the ACC in response to electrical stimulation of the hindpaw (Fig.\ntion into the S1 decreased the slope of the fEPSP of the ACC in response to electrical stimulation of the hindpaw (Fig.\nIn contrast, disinhibition of S1 activity by local application of SR95531 (3 M, 1 l) into the S1 facilitated sensory-evoked fEPSP in the ACC in control mice (Fig.\nDiscussion Cortical plasticity of the S1 has been discussed in chronic pain as a maladaptive memory formation (Vartiainen et al.\nRecently, brain imaging studies revealed the involvement of the S1 in the processing of allodynia in both humans and animals (Peyron et al.\nIn the S1, neurons in the S1 code intensity and location of touch and pain stimulations (Kenshalo and Isensee, 1983).\nSince L2/3 neurons project to neurons in the same layer (Cheetham et al.\nIn addition, we observed plastic changes of local cortical circuits from L4 to L2/3 in the S1 (Fig.\nThe S1 reorganization occurs constantly in response to the inputs from peripheral afferent neurons to the L2/3 neurons, which exhibit activitydependent plasticity, such as long-term potentiation (Walcott and Langdon, 2002; Ismailov et al.\nSince hyperexcitability in peripheral neurons enhances nociceptive inputs to supraspinal sites in chronic pain conditions (Urban and Gebhart, 1999; Woolf and Salter, 2000), such increased inputs may have caused the observed activity-dependent plastic changes in the afferents to L2/3 neurons within the S1, as seen in spinal circuits (Woolf and Salter, 2000).\nIn pain models with exaggerated pain sensation, functional plastic change occurs within the ACC (Wei and Zhuo, 2001) and structural change of layer 5 neurons occurs in the S1 (Kim and Nabekura, 2011).\nThus, the functional and structural plastic change within the pain-related cortical areas may have a critical role in chronic pain syndrome.\nWe demonstrated that pharmacological inhibition of excitatory synaptic transmission in L2/3 of the S1 successfully attenuated the mechanical allodynia and hyperexcitable activity of the ACC, while disinhibition of the transmission facilitated the pain behavior (Fig.\nExcessive sensory information from the L2/3 excitatory neurons in the S1 to the ACC may increase the activity of the ACC.\nThe experience of pain is a result of both sensory and emotional aspects, which are independently processed via different pathways involving the S1 and ACC, respectively (Price, 2000; Moisset and Bouhassira, 2007), and both types of cortical areas have been expected to interact with each other (Rainville et al.\n4), plastic change of a sensory-related area could modulate the neuronal activity of a brain area related to emotional aspects of pain.\nThe S1 neuronal activity modulated mechanical allodynia.\nCortical Activities Accelerate Pain Behavior.\nexcitatory neurons may modulate the ACC neuronal activity via indirect pathways, and the possibility of the direct pathways still exists.\n, 2000; Xu et al.\nActually, in the present study, inhibition of ACC neuronal activity attenuated the chronic pain behavior (Fig.\na critical role in the expression of chronic pain behavior.\nHowever, it could not be excluded that the modulation of S1 activity directly manipulates pain behavior, which inturnmayaltertheACCactivityevokedby sensory stimulation, since neurons in the S1 code intensity and location of pain stimulations (Kenshalo and Isensee, 1983).\nThis study may shed light on the central mechanisms of chronic pain and provide a new efficienttherapeuticstrategyagainstchronic pain by focusing on the interaction between the S1 and ACC.\nReferences Allen CB, Celikel T, Feldman DE (2003) Longterm depression induced by sensory deprivation during cortical map plasticity in vivo.\nBushnell MC, Duncan GH, Hofbauer RK, Ha B, Chen JI, Carrier B (1999) Pain perception: is there a role for primary somatosensory cortex? Proc Natl Acad Sci U S A 96:77057709.\nCalejesanAA,KimSJ,ZhuoM (2000) Descending facilitatory modulation of a behavioral nociceptive response by stimulation in the adult rat anterior cingulate cortex.\nJ Neurosci Methods 53:5563.\nCheetham CE, Hammond MS, Edwards CE, Finnerty GT (2007) Sensory experience alters cortical connectivity and synaptic function site specifically.\nEndo T, Spenger C, Hao J, Tominaga T, Wiesenfeld-Hallin Z, Olson L, Xu XJ (2008) Functional MRI of the brain detects neuropathic pain in experimental spinal cord injury.\nFerezou I, Haiss F, Gentet LJ, Aronoff R, Weber B, Petersen CC (2007) Spatiotemporal dynamics of cortical sensorimotor integration in behaving mice.\nFriedman DP, Murray EA (1986) Thalamic connectivity of the second somatosensory area and neighboring somatosensory fields of the lateral sulcus of the macaque.\nIsmailov I, Kalikulov D, Inoue T, Friedlander MJ (2004) The kinetic profile of intracellular calcium predicts long-term potentiation and long-term depression.\nKamatani D, Hishida R, Kudoh M, Shibuki K (2007) Experience-dependent formation of activity propagation patterns at the somatosensory S1 and S2 boundary in rat cortical slices.\nKameyama K, Sohya K, Ebina T, Fukuda A, Yanagawa Y, Tsumoto T (2010) Difference in binocularity and ocular dominance plasticity between GABAergic and excitatory cortical neurons.\nKenshalo DR Jr, Isensee O (1983) Responses of primate SI cortical neurons to noxious stimuli.\nKerr JN, Greenberg D, Helmchen F (2005) Imaging input and output of neocortical networks in vivo.\nProc Natl Acad Sci U S A 102:1406314068.\nThe S1 neuronal activity modulated ACC activity.\nDiI-coatedrecordingelectrodewasplacedintheACC(red)andaglasspipettefilledwithadrugincludingFITC(green)inthe L2/3 region of the S1, respectively (left).\nCoronal sectional images of the S1 and ACC show an area of drug diffusion (green, FITC) (right top) and the location of the recording electrode (red, DiI) (right bottom).\nMicroinjection of SR95531 (3 M) to the S1 enhanced the electrical response to hindpaw stimulation in the ACC of control mice.\ne, Mean slopes of the fEPSPs with vehicle (4 animals) and SR95531 (4 animals) in the S1 in control mice.\nf,MicroinjectionofCNQXintotheACCattenuatedmechanicalallodyniainCFA-injectedmice(closedcircles, 4 animals), but injection of vehicle did not alter the thresholds (open square, 4 animals).\nsensory cortex following peripheral nerve injury and its association with neuropathic pain.\nMoisset X, Bouhassira D (2007) Brain imaging of neuropathic pain.\nPetrovic P, Ingvar M, Stone-Elander S, Petersson KM, Hansson P (1999) A PET activation study of dynamic mechanical allodynia in patients with mononeuropathy.\nPeyron R, Garca-Larrea L, Gregoire MC, Convers P, Lavenne F, Veyre L, Froment JC, Mauguie`re F, Michel D, Laurent B (1998) Allodynia after lateral-medullary (Wallenberg) infarct.\nRainville P, Duncan GH, Price DD, Carrier B, Bushnell MC (1997) Pain affect encoded in human anterior cingulate but not somatosensory cortex.\nUrban MO, Gebhart GF (1999) Supraspinal contributions to hyperalgesia.\nVartiainen N, Kirveskari E, Kallio-Laine K, Kalso E, Forss N (2009) Cortical reorganization in primary somatosensory cortex in patients with unilateral chronic pain.\nVogt BA (2005) Pain and emotion interactions in subregions of the cingulate gyrus.\nWalcott EC, Langdon RB (2002) Synaptically driven spikes and long-term potentiation in neocortical layer 2/3.\nWoolf CJ, Salter MW (2000) Neuronal plasticity: increasing the gain in pain.\nXu H, Wu LJ, Wang H, Zhang X, Vadakkan KI, Kim SS, Steenland HW, Zhuo M (2008) Presynaptic and postsynaptic amplifications of neuropathic pain in the anterior cingulate cortex.\nZhuo M (2007) A synaptic model for pain: long-term potentiation in the anterior cingulate cortex.\nZhuo M (2008) Cortical excitation and chronic pain.\nCortical Activities Accelerate Pain Behavior."}