{"title": "43.pdf", "contents": "Clinical Study Fear-avoidance beliefsa moderator of treatment efficacy in patients with low back pain: a systematic review.\nAbstract BACKGROUND CONTEXT: Psychological factors are believed to influence the development of chronic low back pain.\nTo date, it is not known how fear-avoidance beliefs (FABs) influence the treatment efficacy in low back pain.\nPURPOSE: To summarize the evidence examining the influence of FABs measured with the FearAvoidance Belief Questionnaire or the Tampa Scale of Kinesiophobia on treatment outcomes in patients with low back pain.\nSTUDY DESIGN/SETTING: This is a systematic review.\nOUTCOME MEASURES: Work-related outcomes and perceived measures including return to work, pain, and disability.\nStudy eligibility criteria, participants, and interventions: research studies that included patients with low back pain who participated in randomized controlled trials (RCTs) investigating nonoperative treatment efficacy.\nOut of 646 records, 78 articles were assessed in full text and 17 RCTs were included.\nStudy quality was high in five studies and moderate in 12 studies.\nRESULTS: In patients with low back pain of up to 6 months duration, high FABs were associated with more pain and/or disability (4 RCTs) and less return to work (3 RCTs) (GRADE high-quality evidence, 831 patients vs.\nA decrease in FAB values during treatment was associated with less pain and disability at follow-up (GRADE moderate evidence, 2 RCTs with moderate quality, 242 patients).\nInterventions that addressed FABs were more effective than control groups based on biomedical concepts (GRADE moderate evidence, 1,051 vs.\nIn chronic patients with LBP, the findings were less consistent.\nHeterogeneity of the studies impeded a pooling of the results.\nCONCLUSIONS: Evidence suggests that FABs are associated with poor treatment outcome in patients with LBP of less than 6 months, and thus early treatment, including interventions to reduce FABs, may avoid delayed recovery and chronicity.\nER-B: Nothing to disclose.\nUH: Nothing to disclose.\nSW: Nothing to disclose.\nLMB: Nothing to disclose.\nThis study was not funded, and the authors have no conflicts of interest to declare.\nimprove when FABs are addressed in treatments than when these beliefs are ignored, and treatment strategies should be modified if FABs are present.\nKeywords: Low back pain; Back pain; Fear avoidance; Fear-avoidance beliefs; Moderator; Prognosis.\nAlmostall adultsoncein their lifetime complain about LBP, but 10% to 15% develop chronic LBP [2].\nThere is a consensus in the literature in acute low back pain to avoid unnecessary investigation and overtreatment by treating symptomatically with encouragement to return to normal activity [4].\nPersisting pain for several weeks predictsthe developmentofchronic low backpain, a condition where complete recovery and return to 100% function are often difficult to achieve [5].\nTimely initiated and targeted multifaceted treatments in patients at risk for delayed recovery have shown health-care cost reductions and tend to facilitate recovery [6].\nPsychological factors are believed to influence the development of chronic low back pain.\nThe fear-avoidance model is commonly used to explain how psychological factors affect the experience of pain and the development of chronic pain and disability [7].\nIt is theorized that for some individuals with LBP, negative beliefs about pain and/or negative illness information lead to a catastrophizing response in which the worst possible outcome of activity is imagined.\nThis leads to fear of activity and avoidance that in turn causes disuse and resultant distress, reinforcing the original negative appraisal in a deleterious cycle [7].\nThe fear-avoidance model suggests that patients without fearavoidance beliefs (FABs) are more likely to confront pain problems and are more active in the coping process.\nCurrent treatment guidelines for low back pain recommend the timely identification and initiation of multidisciplinary treatment for other psychological factors (eg, depression, distress, job dissatisfaction) associated with increased risk for delayed recovery [4,8,9].\nThere are, however, no recommendations for the assessment of FABs.\nIn a recent systematic review [10], high FABs, identified by the most frequently used questionnaires, the Fear-Avoidance Belief Questionnaire (FABQ [11]) and the Tampa Scale of (Kinesiophobia Miller RP, Kori SH, Todd DD.\nunpublished data, 1991) (TSK [12]), were prognostic in patients with subacute low back pain for not returning to work in observational studies.\nhigh FABs identified by these two questionnaires specifically influence treatment efficacy in currently used treatment strategies is unknown [1317].\nTo date, the role of FABs in treatment outcomes and in moderating effects of treatment efficacy in LBP has not been reviewed systematically.\nThe aim of the current review is, therefore, to assess the influence of FABs on the outcome of various treatments in randomized controlled trials (RCTs) for patients with LBP.\nThe review was conducted following the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) statement on conducting systematic reviews of RCTs [18].\nTo allow for comparison among studies and to clarify the moderating role of FABs on treatment efficacy in patients with LBP, we restricted this review to studies that assessed FABs with the most often used questionnaires, the FABQ and the TSK.\nFor both questionnaires, a moderate overlap has been shown.\nWe identified all RCTs meeting our eligibility criteria (defined in detail subsequently) published between January 1990 and January 2013.\nThe following databases were searched in January 2013: BIOSIS, CINAHL, Cochrane Library, Embase, OTSeeker, PeDRO, PsycInfo, PubMed/Medline, Scopus, and Web of Science.\nThe search was conducted with the help of an experienced librarian.\nSearch terms included fear and avoidance as Medical Subject Headings and other subject headings and different combinations.\nTwo detailed search strategies are depicted in Supplementary data.\nTo ensure the completeness of the literature search, one reviewer (MMW) conducted an electronic hand search of the six most often retrieved journals and added all potentially eligible references not retrieved by the systematic search.\nIn addition, bibliographiesofincludedstudiesrelevant totheresearchquestionwere searched, and potentially eligible references were included in the full-text review (inclusion and exclusion criteria applied).\nAuthors of studies that were eligible but did not report sufficientinformationwerecontacted,and,whereavailable,thisinformation was included in the analysis.\nAll RCTs were considered eligible for inclusion in this investigation that met the following criteria: they.\nreported research concerning patients seeking care for LBP; they demonstrated at least moderate study quality; they investigated the effect of FABs assessed by the two most often used questionnaires, the FABQ and the TSK; and they were published between January 1990 and January 2012.\nWe focused on RCTs with at least 30 patients per group because of a concern about sample size.\nAssuming a 50% reduction in perceived disability that was one-third greater in the treatment group compared with the reference group, a sample size of 37 patients per group would be sufficient to detect the difference in allowing a drop-out rate of 15% (alpha 0.\n80, significance level 0.\nNo limits for the study setting or language of the publication were applied.\nExcluded were conference proceedings.\nStudy selection, data extraction, and synthesis.\nThe bibliographic details of all retrieved articles were stored in an EndNote file.\nTwo reviewers (MMW and ER-B) independently screened all 691 references by title and abstract.\nThe full text was reviewed by both the reviewers independently (MMW and ER-B) in all studies meeting the predefined eligibility criteria (n578).\nDisagreements were discussed and resolved by consensus or by the thirdparty arbitration (SW).\nResearchers with specific language proficiencies reviewed non-English references.\nIn the case of several publications for the same RCT without change in outcome or follow-up duration, the most recent publication was chosen and missing information from the previous publication added.\nThe quality of each study was assessed using the Scottish Intercollegiate Guidelines Network methodology checklist for RCTs [19].\nIn addition, all quality criteria not covered in this checklist but considered to be important according to a consensus study on methodological criteria for the assessment of moderators in the systematic reviews were added [20].\nMeta-analyses were only considered when all the following criteria were met: moderators were measured before randomization, adequate quality of measurement of baseline factors, and explicit test of interaction between moderator and treatment.\nAll information needed to describe the study population were extracted.\nTo assess the baseline characteristics of the study population, important prognostic factors for the course of low back pain were extracted and assigned to one of the 16 domains used in the previous research [21] and proposed by Hyden et al.\n[22]: general characteristics, social environment, overall health status, overall psychological health, previous LBP, workpsychosocial demands, work-physical demands, workhistory and attributes, disability related to LBP, time change of LBP, physical examination findings, change in physical examination, diagnosis of LBP, and compensation related.\nThe number of domains reported is given for each study.\nThis information was used to rate the overall bias risk and study quality according to the Scottish Intercollegiate Guidelines Network recommendations.\nThe ratings included high quality (, most criteria fulfilled, and if not fulfilled, the study conclusions are very unlikely to be altered), moderate quality (, some criteria fulfilled, and if not fulfilled, the study conclusions are unlikely to be altered), low quality (, few or no criteria fulfilled, conclusions likely to be altered).\nStudies rated as low quality by both the reviewers were excluded from further analysis.\nAll investigated outcomes were extracted and categorized into work-related (eg, sick days, return to work) and nonwork-related (eg, pain, perceived disability) outcomes.\nEach method of outcome was appraised and operationalized (eg, perceived disability measured by Oswestry disability index or by Roland-Morris disability questionnaire).\nFor patient-specific measures, only validated scales were further used in the analysis.\nOperationalization of FABs as predictor, mediator, and moderator.\nThe definitions for predictor, mediator, and moderator were adopted from Pincus et al.\nPredictor: baseline FABs affect outcome but do not interact with the allocated treatment intervention.\nMediator: change in FABs during treatment affects outcome, with or without interacting with allocated treatment.\nModerator: FABs at baseline interact with treatment.\nThe quality of the moderator analysis was assessed for each study by two reviewers (ER-B and MMW) and discussed with an experienced statistician (UH).\nPredictive or moderating means that FABs were significantly associated with outcome in an univariate analysis or in a stepwise procedure and, therefore, were included in the final multiple model.\nBased on this information, each treatment was categorized into treatment based on a biomedical approach (eg, physical therapy without cognitive behavioral therapy [CBT] approach, the Handy Hints Back Book) and treatments aimed to address FABs (eg, psychological informed physical therapy, CBT, active advice including information about psychological factors, graded activity).\nWhether a treatment addresses FABs was rated independently by two reviewers (MMW, ER-B), and disagreements were discussed.\nIf no consensus could be achieved, an independent third reviewer (SW) decided whether a treatment addressed FABs.\nThe FABQ [11] is a 16-item questionnaire, each item scored 0 to 6.\nHigh levels indicate increased levels of FABs.\nTwo subscales exist: a seven-item work subscale of FABQ (FABQ-W, range 042, My pain was caused by my work or by an accident at work) and a four-item physical activity subscale of FABQ (FABQ-P, range 0 24, Physical activity makes my pain worse).\nFearAvoidance Belief Questionnaire and the two subscales have been shown to be reliable and valid for the measurement of FAB.\nFor the FABQW, the Cronbach alpha was 0.\nThe TSK is a 17-item questionnaire (I am afraid that I might injure myself accidentally, Pain lets me know when to stop exercising so that I dont injure myself [23]).\nEach item is measured on a four-point Likert scale (15strongly disagree to 45strongly agree).\nThe scale ranges from 17 (no fear) to 68 (strong fear of reinjury).\nSeveral studies found support for the construct and predictive validity and reliability of the TSK (Kinesiophobia Miller RP, Kori SH, Todd DD.\nunpublished data, 1991) [24].\nFurther research found that a two-factor model based on 13 items to explain up to 70% of the variation, and its validity was confirmed [25].\nTwo-factor model consisted of a harm factor (items 3, 5, 6, 9, 11, 15 with a range of 624) and an activity-avoidance factor (items 1, 2, 7, 10, 13, 14, 17 with a range of 728) [23].\nThe harm factor reflects the beliefs that something is seriously wrong with the body, whereas the activity-avoidance factor indicates that avoiding exercise or activity might prevent an increase in pain.\nAlthough the two scales measure different concepts (ie, FABQ measures fear of pain caused by physical activity and TSK measures fear of movement and reinjury), a moderate overlap has been shown [23,26,27].\nThe correlation between TSK and FABQ ranged from 0.\n39 (FABQ-P) and 0.\n33 (FABQ-W) [23] to 0.\nDescriptive statistics (ranges) were used to summarize findings across all RCTs for baseline fear-avoidance mean values.\ngenerated using the R statistical software [28].\nForest plots were based on the values (odds ratio, hazard ratio, beta with corresponding 95% confidence interval) reported in the study reports.\nFor appraising the evidence of the results, the Grading of Recommendations Assessment, Development and Evaluation (GRADE) system [29] was used that was also adopted by the Cochrane Back Review Group [30]: high quality (75% of the RCTs with consistent findings, direct and precise data, no suspected publication biases, further research is very unlikely to change our confidence in the estimate of effect), moderate quality (several RCTs of moderate quality, further research is likely to have an important impact on our confidence in the estimate of effect and may change the estimate), low quality (only a few RCTs of moderate quality available, further research is very likely to have an important impact on the estimate of effect and is likely to change the estimate), and very low quality (effect is very uncertain).\nThe search and inclusion process is summarized in.\nOut of 2,331 records, 78 were reviewed in full text.\nThe full-text assessment utilizing the inclusion and exclusion criteria resulted in the exclusion of 60 studies.\nThe main reasons for exclusion were not investigating FABs as a predictor or moderator (n532), use of questionnaires other than FABQ and TSK (n56), duplicate publications (n510), and study protocol only (n58).\nIn total, 18 publications based on 17 RCTs were included in the analysis.\nOne study led to two publications reporting different interventions.\nTherefore, both publications were included.\nStudy quality was mostly moderate (n512, 70%) and good (n55, 30%).\nBaseline characteristics are summarized in Table 1.\nMost studies included patients with nonspecific low back pain (NSLBP, n515).\nOne study also included patients with SLBP [33].\nIn two studies, LBP was not further specified [34,35].\nTen studies included patients with LBP of up to 6 months (range of patients included 66314) and followed them for 4 weeks to 12 months.\nPatients with LBP of 6 months and longer were the scope in six studies (range of patients included 71598, disease duration 919 years) with a follow-up between 3 months [34] and 3 years [36].\nMost RCTs compared interventions addressing FABs to usual care or studies based on biomedical approaches (n514, 82%).\nTwo RCTs compared treatments based on the biomedical approaches [17,37] and one RCT on fearavoidance addressing strategies [38].\nOutcome measures were based in 14 studies (78%) on self-perceived measures.\nImportant comorbid condition Treatment n (f).\nHealth-care workers, recruited from occupational health-care providers, USA.\nWork-related NSLBP $3, requiring modification of employment duties; 18% symptoms distal to the knee.\n[39], ID 7 Two RCTs in general population and one RCT military personnel, recruited from outpatient physical therapy clinic communities, USA.\nAcute NSLBP (#30 d)in treatment arms.\n3) None Three RCT pooled Trial 1 (n 75): manipulation exercise; Trial 2 (n 59) stabilization exercise; Trial 3 (n 31): directionspecific exercise.\n[45], ID 12 Randomization on level of GP practice.\nParticipating GPs selected 10 consecutive patients, The Netherlands.\n6% radiating below the knee.\n9) UC 42 (12), MIC 43.\nMIC (n 143) 314 (149) NR 6 wk  8.\n[31], ID 9B Patient presenting in 40 GPs working in primary practice across Sydney, Australia.\nNSLBP, 12% rib to buttock crease with moderate pain and moderate disability (SF-36, item 7/8).\nUntil to recovery  6.\nTime to recovery  6.\nNSLBP ($4 wk duration), full or partial absence from work.\nbehaviorally oriented GA intervention (n 67).\n134 (8) NR 1 y  6.\nNSLBPSLBP Quebec Task Force on Spinal Disorders.\nTBC 47 (34), GA 41 (39), GX 69 (49) 37.\n108 (74) TBC 50%, GA 31%, GX 33% 1 and 6 mos  8.\nTotal population of about 150,000 people near Oslo, Norway.\nNSLBP, sick listed from a permanent job and receiving between 50% and 100% compensation.\n812 wk sick listed because of LBP, no previous sick listing for LBP for 12 wk.\n41 (10) None UC, PT, CBT as covariant: no influence on the predictor model.\n[42], ID 6 Patients referred by physicians to outpatient PT for evaluation and treatment, Rehab Center Florida, USA.\nLeg pain 62%, sudden onset 53%.\nfear avoidance treatment (n 34).\n66 (38) 32%47% 1 and 6 mo  7.\nNew episode of acute or recurrent NSLBP, with or without referred leg pain.\nAcute to subacute (!3 mo) Control 44.\nNone Control booklet (n 79) vs.\nexperimental booklet (n 83).\n162 (89) NR 3 mo  5.\n83 (29) NR 2 mo  6.\n187 (106) NR 1 y  5.\n250 (132) NR 3 mo  7.\nSubjects with LBP seeking care at a primary healthcare setting, a private physiotherapy clinic, primary health-care setting were included.\nNSLBP6referred pain (nonradicular), continual or recurrent, $3 mo, causing absence from work or solicitation of medical attention.\nNSLBP at least 3 mo Median 60 mo, UC 48 mo, range 559 d, MR 72 mo, range 380 d.\nMR (n 79) 163 (64) NR End of treatment and 4 mo.\nParticipants on disability pension O1 y, county of Hordaland, Norway; identified through the National Insurance Administration.\n(eg, pain, disability) and in four studies (22%) on return-towork (RTW) information.\nInfluence of baseline FABs on treatment outcome in patients with LBP of up to 6 months.\nSeven out of nine RCTs (77%) found baseline FABs to influence treatment outcome (Table 2) [17,33,39-43].\nPatients with high baseline scores had more pain and/or disability (four studies [33,39,42,43], Fig.\n2) and were less likely to return to work (three studies [17,40,41]).\nFearavoidance work scores (FABQ-W) were assessed in seven studies and predicted poor work-related outcomes in four studies [17,40,41] and disability in one study [39].\nHigh FABQ-W scores were not associated with RTW in one study [42] and did not predict pain in two studies [31,32].\nOf the seven studies that used FABQ-P, high FABQ-P scores were associated with less RTW in one study [40] and more disability in two studies [42,43].\nOne study found a combination of high FABs and catastrophizing to be associated with more pain and disability, whereas fear avoidance (FABQ-P) alone was not [33,44].\nThree studies found no influence of FABQ-P on RTW [17,41] and pain [45].\nMediating effect of change in FABs on treatment outcome in patients with LBP of up to 6 months.\nAll three RCTs that investigated mediating effects found an association of decrease in FABs during treatment with more RTW [40] (FABQ-P, FABQ-W, TSK), less pain [33,44] (FABQ-P, not FABQ-W), and disability [47] (FABQ-P) (Table 2, Fig.\nModerating effect of FABs on treatment efficacy in patients with LBP of up to 6 months.\nTen RCTs investigated moderating effects of FABs on specific treatments.\nSix studies found moderating effects on one or more treatments (Table 2, Fig.\nBaseline FABs were associated with more pain or disability and less RTW in treatment arms based on biomedical concepts and fearavoidance strategies (Table 3, Fig.\nHigher scores in FABs were associated with increased treatment efficacy of FABs addressing treatment strategies.\nInterventions providing information to reduce FABs (the Back Book, minimal intervention by general practitioners) led to less reported disability in patients with high FABs (FABQ-P) at short-term follow-up [45,47], Graded activity based on operant conditioning described by Vlaeyen et al.\n[48] was less effective in patients with high FABs in two studies [40,46].\nWoods and Asmundson [46] compared graded activity alone to additional CBT-based education and found an increased efficacy of combining the two in patients with.\nRandomized controlled trials that combined fear-avoidance addressing information, graded exposure, and physical treatments found an increased treatment efficacy in patients with high FABs with less disability [42,43].\nIn treatment arms based on the biomedical concepts, eight out of nine (89%) found that baseline FABs were associated with poor outcome for pain (n51), disability (n54), and RTW (n54) at shortand long-term followup (Table 3).\nCompared with the Back Book, a booklet based on biomedical concepts (Handy Hints Booklet) was associated with less clinical meaningful important change at follow-up compared with patients with the Back Book [47].\nOut of five RCTs, two found high baseline FABs to be associated with increased pain (TSK [34]) and RTW (FABQ-W [35]) (Table 4, Fig.\nNo association of FABs with disability at follow-up was found in three studies (FABQ-P [36], TSK [49], FABQ-P [38]).\nOne study investigated the influence of a change of FABs on treatment outcome [37].\nWhereas changes in FABQ-P and FABQ-W scores were nonpredictive for disability, a small effect was found for change in FABQ-W on pain reduction (Table 4).\nIn patients with chronic low back pain, only one study found multidisciplinary rehabilitation in patients with high FABs (TSK) to lead to less disability and an increased chance for RTW (Table 5, Fig.\n[38] compared active advice including the Back Book to active advice with additional group therapy session of CBT and found no influence of FABs on treatment efficacy.\nDifferences among studies with nonpredictive and predictive findings.\nThis may be a spurious finding as it is mainly because of one study that included more than 580 chronic LBP patients [37].\nThe reporting of previously identified prognostic factors for chronic LBP could be improved in all studies [21].\n/ The Spine Journal 14 (2014) 26582678.\nTable 2 Summary of the influence of FABs on treatment outcomes and efficacy in patients with LBP of less than 6 months.\nFritz and George [17], ID 5 FABQ-W (mean 27.\n5) FABQ-P (mean 16.\n83])  FABQ-W women NR for ODI.\n[45], ID 12 FABQ-P (mean 18.\n8)    High FABQ-P in MIS more likely to have a CMID in disability (RMQ, OR 1.\nIn high FABQ-P NSAID more effective than placebo: HR to have a day without pain (NRS) 1.\n118) and for 7 d HR 1.\n02), HR for 7 d without pain 0.\n018) Staal et al.\n8) Cutoffs: FABQ-P $16, FABQ-W $26.\nCompared with UC behavioraloriented GA increased the chance for RTW (O27 d full return to regular work).\nThe effect was decreased by FABs: low fearavoidance RTW HR 2.\n0 FABQ-P !16 (HR 3.\n5]), FABQ-W !26 (HR 2.\n6]) compared with high fear-avoidance HR for RTW 1.\n6 (FABQ-P $16, HR 1.\n7], FABQ-W $26, HR 1.\n[44], ID 8AB FABQ-P (mean 13.\n1) FABQ-W (mean 37.\n7) Cutoff FABQ-P O14.\nPatients with high FABQ-P and high catastrophizing experienced more pain (NRS) and disability (ODI) than patients with high FABQ-P alone or patients with low FABQ-P.\nFurthermore, they experienced more decrease in pain and disability at follow-up.\n5])  High FABQ-P predicted more disability (ODI) at 1 mo (beta 0.\n042) and 6 mo (beta 0.\nFAB treatment reduces FABQ-P baseline effect on disability (ODI) at 1 mo (beta 0.\n13) and 6 mo (beta 0.\nIn the FAB-PT subgroup, treatment showed more improvement in disability (ODI) than in the PT subgroup (Fig.\n[47], ID 2 FABQ-P (mean NR) Cutoff m/s O14   FABQ-P baseline O14 and reduction of FABQ-P of O4 points at 2 wk and 3 mo are more likely to improve in RMQ ($3 points) at 3 mo (RR to deteriorate at 0.\nTKS NR for pain-related disability (PDI) at 2 mo.\nThe effect increases over time (OR 6 mo 1.\nInfluence of fear-avoidance beliefs on treatment outcomes.\nreported between 5 and 12 and nonpredictive studies between 5 and 10.\nThus, reporting of prognostic factors did not differ between predictive and nonpredictive studies.\nMost often, FABQ-P was investigated (15 times) followed by FABQ-W (10 times) and TSK (4 times).\nThe most consistent predictor was the baseline FABQ-W value.\nAll nonpredictive studies had low baseline FABQ-W values (range of baseline mean values 14.\n5, Table 6) compared with the predictive studies (range of baseline mean values 15.\n8), indicating that nonpredictive studies included a low-risk population with little variability in FABQ-W.\nIn nonpredictive studies using FABQ-P, low baseline values could be responsible for nonpredictive findings in two studies with chronic LBP (mean baseline value 13.\nThe difference in the FABQ-P baseline values was not as pronounced as in the FABQ-W values.\nEight studies (45%) used cutoff values with mixed findings.\nMost often, the cutoff of 14 or more points for FABQ-P (n55, once median split) was used.\nOnly two studies used FABQ-W cutoff values ($26 [40] and median split of $35 [35]).\nIn this systematic review of 17 RCTs, we found convincing evidence that the presence of FABs assessed by the most frequently used questionnaires, the FABQ and the TSK, influences treatment effects in patients with low back pain (LBP) of less than 6 months duration (GRADE highquality evidence, 831 patients vs.\n322 in nonpredictive studies).\nThere was moderate evidence that a decrease in FAB values during treatment was associated with less pain and disability at follow-up (two RCTs with moderate quality, 242 patients).\nInterventions that addressed FABs (GRADE moderate evidence, 1,051 vs.\n227 patients in studies without moderating effects) were more effective.\nthan treatments based on the biomedical concepts.\nIn chronic patients with NSLBP, the findings were less consistent.\nTwo studies found baseline FABs to be associated with more pain and disability and less RTW (339 patients), whereas three others (832 patients) found none (GRADE low evidence).\nSeveral nonsystematic reviews highlighted the importance of the fear-avoidance model [15,50,51], whereas others questioned the impact [13,52,53].\nOther systematic reviews [54,55] addressed the efficacy of specific treatment interventions, but to date, none have systematically addressed the influence of baseline level of FABs on treatment efficacy.\nTherefore, it is unknown if treatments addressing FABs are suitable for all patients with LBP and further if treatments based on biomedical concepts are less effective in patients with high FABs.\nOur findings suggest that interventions addressing FABs in patients with high FAB score values at baseline are effective in patients with LBP of less than 6 months duration.\nIn patients without or with low FABs, such treatments are no more effective than other treatment strategies and likely unnecessary.\nTo verify this, future studies should include a large enough sample of patients to allow for subgroup analyses.\nA recent systematic review [10] of observational studies highlighted the importance of FABs for poor work-related outcomes in subacute LBP patients and therefore recommended systematic assessment of FABs in patients with persistent low back pain.\nThe present study further supports these findings and expands on the influence of FABs on treatment response and treatment outcome.\nModerating effect of fear-avoidance beliefs on treatment efficacy.\nTable 3 Influence of FABs on treatment arms addressing FABs or based on biomedical concepts.\nTreatment FAB predictor FAB moderator Outcome Standardized treatment Adherence controlled FU (mo) Patients Dropout (%).\nFear-avoidance addressing treatments The BB and GP care, ID 2 [47]  FABQ-P [: the BB efficacy [ CMID in disability (RMQ) Yes No 3 162 22 Minimal intervention (MIS) by GP and GP care, ID 12 [45].\nFABQ-P [: MIS efficacy [ CMID in disability (RMQ) Yes No 1.\nGA, operant conditioning (Vlaeyen et al.\nNo (TSK !39 not included) TSK O38 no pain reduction Pain (PDI) Yes Yes 2 83 46.\nFABQ-P [ more pain and disability  Pain (NRS) and disability (ODI) Yes Yes 6 108 44.\nTBC-PT [68]graded exposure (GivE, based on Vlaeyen et al.\nFear avoidance addressing PT (FAB-PT, Vlaeyen and Linton [68]) using graded (GA) exercise and the BB, ID 6 [42,43].\nFABQ-P [ more disability FABQ-P [: FAB-PT efficacy [ Disability (ODI) Yes Yes 6 66 NR.\nExercise with CBT approach (EG), ID 13 [43].\nFABQ-P [ less CMID FABQ-P [ EG efficacy [ with more CMID than UC CMID in disability (RMQ) Yes No 12 187 9.\nCBT and PT, ID 18 [41] FABQ-W [ less RTW  RTW Yes Yes 12 93 CBT based education (psychology student under supervision) on FAB (GivE, Vlaeyen et al.\nNo (TSK !39 not included) GivEGA: pain reduction [ than GA Pain-related disability (PDI) Yes Yes 6 83 46.\nFear avoidance addressing PT (FAB-PT, only in one of the three trials), ID 7 [39].\nFABQ-W [ less RTW  RTW Yes Yes 12 93 39.\nIt is reasonable to believe that a chronic population has already solidified their beliefs, and there may be less variation in beliefs about the effect of activity on pain in this group.\nIt therefore makes sense that these beliefs are more important in guiding the course of LBP in the subacute phase when individuals are at risk of becoming chronic, and beliefs may be more disparate as shown in a recent study [10].\nBecause there was an absence of assessment of additional psychological constructs with potential overlap in the studies reviewed here, this is a topic for future study.\nThe strengths of this systematic review are the assessment of FABs in light of disease duration and the comprehensive evaluation of the currently available literature.\nThe search was inclusive, no language limitations were applied, and a thorough bibliographic search was conducted to include all relevant studies.\nThe extraction process was done in accordance with current guidelines and with the help of an experienced statistician.\nPotential factors of influence were identified by a multidisciplinary team (a psychologist, internist, physical therapist, statistician, rheumatologist, and methodologist).\nSome studies did not meet the required sample size calculated for the primary outcome.\nNone of the studies provided a power analysis for moderator effect.\nFor reliable subgroup analysis, even more patients are needed.\nWe are aware of some limitations with regard to generalizability by limiting our search to studies that used FABQ or TSK only to assess FABs.\nOther available questionnaires include questions that address FABs but were not included into this analysis.\nThe strength of our approach is that FABQ and TSK are widely used questionnaires and assess FABs exclusively that allowed us to make comparisons among studies.\nTherefore, it is likely that our findings would apply to studies that use such questionnaires with regard to the importance of FABs.\nThe heterogeneity of studies and the methodological limitations impeded us from conducting a metaanalysis [20].\nWe have tried to balance these limitations by providing a comprehensive comparative description of all the studies included and the prognostic factors reported.\nAddressing FABs leads to the better outcome compared with treatments that are based on biomedical concepts in particular in patients at risk for chronic LBP.\nTBC-PT [68]HH educational pamphlet, ID 6 [42,44].\nFABQ-P [ more disability  Disability (ODI) Yes Yes 6 66 NR.\nHH Booklet and GP care, ID 2 [47]  FABQ-P [: HH less likely CMID CMID in disability (RMQ) Yes No 3 162 22.\nSpinal manipulation, ID 9B [31]   Pain (days without pain) Yes Yes To recovery 239 2.\nNo difference between optimized antidepressant therapy, pain self-management program, and UC.\nNo differences between the reference group (advice) and exercise group.\nNo difference between modern active PT, muscle conditioning on training devices, and low-impact aerobic.\nvan der Hulst et al.\nTendency to more decrease in SF-36D (beta 0.\nMR better than UC: higher TSK leads to less disability (more increase in SF-36D beta 0.\n762]) in MR after 4 wk  No influence on treatment efficacy for RMQ and SF-36M at end of treatment and 4-wk FU or SF-36D at end of treatment Underwood et al.\n4) cutoff high: $14  FABQ-P nonpredictive for RMQ, MVK pain and disability at 1 y.\nFABQ-W !35: three times more likely to have entered RTW process at 1 y (self-reported three-point scale: Have you succeeded in returning to work?: Yes, No, and Still in the process), but small sample size and wide CI (0.\nNo difference between control group and intervention with FAB reducing information.\nour review might suggest that distributing educational information will reduce FABs equally compared with more intensive interventions, there is some evidence from one study that interventions that expose the patient to the feared activities are more effective than education alone [58].\nFuture research should further investigate how treatment interventions designed to address FABs work.\nFurthermore, the mechanism by which FABs affect the outcome should be investigated.\naspects of injury, such as pain or likelihood of reinjury [14,59].\nHowever, these constructs are difficult to disentangle and need to be clarified for future study.\nBecause we used results from multivariate analyses where the main confounders including baseline pain are included in the model, our findings suggest that FABs have an effect regardless of the influence of baseline pain.\nIn addition, the process delineated in the fear-avoidance model has been questioned.\nIt has been suggested that one may show FABs with or without.\nFear avoidance addressing treatments Active management advice (primary care nurse)the BB, ID 14 [38].\nActive management advicethe BBsix group therapy sessions with CBT, ID 14 [38].\nIndividual guidance how to improve physical fitnesstwo group sessions with lectures aiming to reduce FAB and motivational interviewing, ID 15 [35].\nGraded stabilizing exercises (protocol by Jull and Richardson [69]), ID 3 [36].\nPain self-management program and antidepressant therapy, ID 1 [34].\nDisability (SF-36 function, RMQ) Yes Yes 4 163 13.\nInformation about daily walks, ID 3 [36].\nPain (VAS) and disability (ODI) Yes Yes 36 71 23.\nAdvice should seek care for depressive symptoms, ID 1 [34].\nIndividual guidance how to improve physical fitness, ID 15 [35].\nPT instruction for therapy, ID 16.\nMuscle reconditioning group, ID 16 [37].\nAerobics/stretching group, ID 16.\nTherefore, the interaction between FABs and the presence of catastrophizing or other coping strategies and their effects on outcome should be investigated further.\nOne way to approach this is to include tools that assess different aspects of coping such as FABs, catastrophizing, self-efficacy, and positive outcome expectations to test their relative utility.\nAnother approach proposed by researchers [15,59] is to further categorize patients in different types of avoiders (eg, misinformed avoiders, learned pain avoiders, affective avoiders).\nThose subjects who fall into these subgroups could then be assigned to different treatment strategies.\nIn future studies, a core set of information should be collected as proposed by the Multinational Musculoskeletal Inception Cohort Study Collaboration [62].\nThis will allow researchers to conduct subgroup analyses for specific prognostic risk factors and ultimately to pool study populations in future systematic reviews.\nThe current available literature does not support one scale over the other.\nTampa Scale of Kinesiophobia was used less often than the FABQ.\nIt seems that FABQ-W and FABQ-P are complementary, and, depending on the patient population, study participants express more fear of physical activity or fear of work.\nThe independents of these constructs argue for the use of both, regardless of how they are measured.\nThis information is particularly important for researchers that strive for including different coping strategies in one questionnaire by using single-item questions.\nWhether the proposed cutoff values are valid for identifying patients at risk for poor outcome has not been shown to date.\nIn the current review, few studies used cutoff values and the results were inconsistent.\nFor clinicians, it is important to know at what point treatments addressing FABs should be initiated.\nRecently, the use of the following cutoff values for high FABs has been proposed: FABQ-P of 16 and more points, FABQ-W of 25 and more points, and.\nTSK of 38 and more points [10].\nFor low fear avoidance, the following cutoff values have been proposed: FABQ-P 14 or less points, FABQ-W 20 or less [10].\nFuture research should aim at validating these proposed cutoff values in the randomized clinical trial setting and clarifying the role of cutoff values.\nTreatment recommendations for LBP vary widely and often reflect the personal beliefs of physicians and other health-care providers [6365] without taking patient preference or need into consideration.\nIn addition, the clinical judgment of therapists in the studies reviewed generally failed to correlate with patients self-reported FAB [66].\nIn clinical practice, a screening instrument can allow clinicians to accurately identify risk factors like FABs that have been shown to be modifiable [42,45].\nTherefore, standardized measurement methods are needed to improve outcomes.\nThis systematic review supports a proactive standardized assessment of psychological risk factors when LBP persists.\nFurthermore, it also supports the recommendation that patients with high FABs should be treated with interventions targeting FABs.\nThe distribution of information material addressing FABs has been shown to be effective in patients with high FABs.\nIt is an inexpensive and widely available intervention.\nFurther physical therapy addressing FABs also led to better outcome compared with physical therapy based on biomedical concepts.\nFear-avoidance beliefs should be taken into account in the treatment of patients with LBP.\nThe comparison of the efficacy of different treatment interventions was beyond the scope of this review.\nEvidence suggests that FABs are associated with poor treatment outcome in patients with LBP of less than 6.\nmonths, and thus early treatment, including interventions to reduce FABs, may avoid delayed recovery and chronicity.\nPatients with high FABs are more likely to improve when FABs are addressed in treatments than when these beliefs are ignored, and treatment strategies should be modified if FABs are present.\nWe thank the research team of the Occupational and Industrial Orthopaedic Center (OIOC), New York University (NYU) Langone Medical Center in New York for their very valuable discussions and input.\nThanks are extended to Reto Kofmehl from Horten Centre of patient oriented research, University of Zurich, Switzerland for compiling the figures.\nSupplementary data related to this article can be found at.\nNon-specific low back pain.\nChapter 3 European guidelines for the management of acute nonspecific low back pain in primary care.\nStrategies for prevention and management of musculoskeletal conditions.\nComparison of stratified primary care management for low back pain with current best practice (STarT Back): a randomised controlled trial.\nImpact of psychological factors in the experience of pain.\nAnn Intern Med 2007;147:492504.\nThe role of fear avoidance beliefs as a prognostic factor for outcome in patients with nonspecific low back pain: a systematic review.\nbeliefs in chronic low back pain and disability.\nFear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nFear avoidance and prognosis in back pain: a systematic review and synthesis of current evidence.\nFear-avoidance beliefs and pain avoidance in low back pain-translating research into clinical practice.\nFear-avoidance beliefs, catastrophizing, and distress a Longitudinal subgroup analysis on patients with musculoskeletal pain.\nIdentifying psychosocial variables in patients with acute work-related low back pain: the importance of fearavoidance beliefs.\nThe PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration.\nScottish Intercollegiate Guidelines Network: the first 15 years (1993-2008).\nMethodological criteria for the assessment of moderators in systematic reviews of randomised controlled trials: a consensus study.\nIncomplete reporting of baseline characteristics in clinical trials: an analysis of randomized controlled trials and systematic reviews involving patients with chronic low back pain.\nWhat is the prognosis of back pain? Best Pract Res Clin Rheumatol 2010;24: 16779.\nPsychometric properties of the Tampa Scale for kinesiophobia and the fear-avoidance beliefs questionnaire in acute low back pain.\nThe role of fear of movement/(re)injury in pain disability.\nThe Tampa Scale for Kinesiophobia: further examination of psychometric properties in patients with chronic low back pain and fibromyalgia.\nAssessing pain and pain-related fear in acute low back pain: what is the smallest detectable change? Int J Behav Med 2007;14:2428.\nPain-related fear is more disabling than pain itself: evidence on the role of pain-related fear in chronic back pain disability.\nGRADE: an emerging consensus on rating quality of evidence and strength of recommendations.\n2009 Updated method guidelines for systematic reviews in the Cochrane Back Review Group.\nSex differences in predictors of outcome in selected physical therapy interventions for acute low back pain.\nA randomized trial of behavioral physical therapy interventions for acute and sub-acute low back pain (NCT00373867).\nA randomized clinical trial of three active therapies for chronic low back pain.\nPredicting response to a cognitive-behavioral approach to treating low back pain: secondary analysis of the BeST data set.\nGraded activity for workers with low back pain: who benefits most and how does it work? Arthritis Rheum 2008;59:6429.\nPredictors of return to work in patients sick listed for sub-acute low back pain: a 12-month followup study.\nThe effect of a fearavoidance-based physical therapy intervention for patients with acute low back pain: results of a randomized clinical trial.\nHigh fear-avoiders of physical activity benefit from an exercise program for patients with back pain.\nLow back pain subgroups using fear-avoidance model measures: results of a cluster analysis.\nPredictors of outcome in patients with (sub)acute low back pain differ across treatment groups.\nEvaluating the efficacy of graded in vivo exposure for the treatment of fear in patients with chronic back pain: a randomized controlled clinical trial.\nInformation and advice to patients with back pain can have a positive effect.\nA randomized controlled trial of a novel educational booklet in primary care.\nFear-avoidance model of chronic musculoskeletal pain: 12 years on.\nEarly identification and management of psychological risk factors (Yellow Flags) in patients with low back pain: a reappraisal.\nFear avoidance beliefs and low back pain: practical reviews from expert panel discussions versus comprehensive systematic reviews.\nFear-avoidance and endurance-related responses to pain: new models of behavior and their consequences for clinical practice.\nSystematic review of back schools, brief education, and fear-avoidance training for chronic low back pain.\nPhysiotherapy-provided operant conditioning in the management of low back pain disability: a systematic review.\n[56] Hill JC, Fritz JM.\nPsychosocial influences on low back pain, disability, and response to treatment.\nClin J Pain 1998;14:20915.\nFear of movement/(re)injury in chronic low back pain: education or exposure in vivo as mediator to fear reduction? Clin J Pain 2005;21:917.\nThe fear avoidance model disentangled: improving the clinical utility of the fear avoidance model.\nPain demands attention: a cognitiveaffective model of the interruptive function of pain.\nClin J Pain 2012;28:47583.\nA review and proposal for a core set of factors for prospective cohorts in low back pain: a consensus statement.\nExploration of physicians recommendations for activities in chronic low back pain.\nDoctors with a special interest in back pain have poorer knowledge about how to treat back pain.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nMotor control problems in patients with spinal pain: a new direction for therapeutic exercise.\nGraded exposure in vivo for pain-related fear."}