{"title": "47.pdf", "contents": "Objectives: The purpose of this study was to examine the relationship between pain-related fear, lumbar flexion, and dynamic EMG activity among persons with chronic musculoskeletal low back pain.\nIt was hypothesized that pain-related fear would be significantly related to decreased lumbar flexion and specific patterns of EMG activity during flexion and extension.\nStudy Design: Data was obtained from subjects who, on a single day, completed self-report measures of pain and pain-related fear, and were interviewed to determine demographic and pain information.\nSubjects then underwent a dynamic EMG evaluation for which they were asked to stand, then bend forward as far as possible, stay fully flexed, and return to standing.\nA flexion-relaxation ratio (FRR) was computed by comparing maximal EMG while flexing to the average EMG in full flexion.\nSubjects: Seventy-six persons with chronic musculoskeletal low back pain.\nResults: Zero-order correlations indicated that pain-related fear was significantly related to reduced lumber flexion (r = 0.\n55), maximum EMG during flexion (r = 0.\n38) and extension (r = 0.\n51), and the FRR (r = 0.\nWhen controlling for pain and demographic factors, pain-related fear continued to be related to reduced lumbar flexion.\nUsing a path-analytic model to examine whether angle of flexion mediated the relationship between fear and EMG activity, the models examining maximal EMG during flexion and extension supported the notion that pain-related fear influences these measures indirectly through its association with decreased range of motion.\nConversely, pain-related fear was independently related to higher average EMG in full flexion, while angle of flexion was not significantly related.\nrelated fear was directly related to a smaller FRR, as well as indirectly through angle of flexion.\nConclusions: Pain-related fear is significantly associated with reduced lumbar flexion, greater EMG in full flexion, and a smaller FRR.\nThe relationship between pain-related fear and EMG during flexion and extension appears to be mediated by reduced lumbar flexion.\nThese results suggest that pain-related fear is directly associated with musculoskeletal abnormalities observed among persons with chronic low back pain, as well as indirectly through limited lumbar flexion.\nThese musculoskeletal abnormalities as well as limited movement may be involved in the development and maintenance of chronic low back pain.\nIn addition, changes in musculoskeletal functioning and flexion associated with pain-related fear may warrant greater attention as part of treatment.\nC hronic low back pain (CLBP), particularly of musculoskeletal origin, has become a major focus of concern for both employers and health care professionals.\nAlthough several factors have been proposed to be responsible for or to perpetuate CLBP, little is known about the disorder.\nSeveral theories have been advanced to explain the disorder, and research addressing the tenability of each one has been mixed.\nOne major theory, the biomechanical model, proposes that CLBP may be the result of muscle asymmetries or abnormally low levels of muscle activity.\n1 This theory suggests that abnormal electromyographic (EMG) activity is a result of poor posture and guarding that develops in response to an original injury.\n2 Several investigators proposed that this irregular muscle activity contributes to spinal instability, which in turn enhances the potential of infringement upon nerve endings and thereby produces pain.\n1,3,4 It has also been suggested that pain may also originate from muscle secondary to microcontractures as in myofascial pain,5 as well as other structures such as the disks, joints, and ligaments.\nAnother major theory of chronic back pain is the reflexspasm model.\ndevelopment of CLBP, one or both of these factors are believed to contribute to an ongoing cycle of reflex-spasm.\nThe model that emphasizes the contribution of psychosocial stress to reflex-spasm has been referred to as the diathesisstress12 or stress-hyperactivity model of chronic pain.\nStudies supporting the biomechanical model have found that persons with CLBP display lower EMG levels compared with controls while sitting and during movement,3,1315 as well as abnormal muscle patterns or asymmetries compared with controls.\nIn support of the reflex-spasm model, studies have found increased EMG in response to painful stimulation, and greater EMG in static postures.\n9,17,18 Research has also demonstrated that persons with CBP have elevated EMG during dynamic activity, greater EMG in response to stress, and higher leftright asymmetries.\nMany authors encourage the evaluation of dynamic EMG activity, as EMG in static positions may not be representative of what occurs during activities of daily living.\nOne found that paraspinal muscle activity did not differ between persons with CBP and controls, nor was it related to self-reported pain intensity.\n26 Geisser et al27 found a significant relationship between physical activity and pain among persons with CLBP, as well as an association between perceived stress and pain.\nOne pattern of abnormal muscle activity that has consistently been shown to be associated with CLBP is an absence of relaxation of the lumbar paraspinal muscles in full-flexion.\nIn healthy persons who are asked to stand quietly, the surface EMG signals from the paraspinal muscles are generally low.\nAs a person bends forward, EMG activity increases as the muscles support the trunk at a greater angle to gravity.\nNear full flexion, ligamentous support becomes more important and lumbar EMG activity drops, often to a level less than the activity recorded when standing upright.\nThis paraspinal relaxation on terminal flexion, first reported in the late 1940s by Allen,27 is known as the flexion-relaxation phenomenon (FRP).\nMany studies conducted among persons with CLBP indicate that the FRP is absent in this population.\n33 Studies indicate that the FRP has good test-retest reliability, even in clinical populations.\nLittle is known about the factors that contribute to the absence of the FRP in persons with CLBP.\nAhern et al suggested that the absence of the FRP in persons with CLBP may be a result of limited lumbar flexion.\n3 Most argue that limited flexion is not responsible for this finding, as persons with CLBP can generally reach 40 degrees of flexion, where the FRP is believed to begin.\nIn addition, due to altered body mechanics, persons with CLBP have been observed to display only 27 degrees of true lumbar flexion.\n3 Alternatively, it has been proposed that muscle EMG abnormalities may be a response to pain, as pain has been shown to have some influence on muscle firing.\n3,36 Finally, it has been suggested that changes in paraspinal activity may be a compensatory response to improve spinal stability and decrease pain during movement.\nSeveral authors have suggested that EMG abnormalities in persons with back pain may be due to pain-related fear or volitional guarding during movement.\n3,8 It has been demonstrated that persons with CLBP display abnormal muscle activity while watching a videotape of persons performing strenuous activity.\n37 The authors predicted that muscular reactivity would be greater for persons high in pain-related fear, and that this effect would be moderated by negative affect.\nVlaeyen and Linton38 propose that pain-related fear and resulting muscular reactivity may be related to the development and maintenance of CLBP.\n38 This assertion seems reasonable given that pain-related fear has been shown to be consistently related to disability among persons with CLBP, and has also been found to be a potent predictor of chronicity among persons with acute low back pain.\nWatson et al40 examined the relationship between painrelated fear and the flexion-relaxation ratio (FRR), defined as the ratio of maximal muscle activity in flexion to the average EMG activity in full flexion, among persons with CLBP.\nThe authors found a significant, inverse relationship between painrelated fear and the FRR, whereby persons with higher painrelated fear tended to display a lower ratio.\nIn addition, the authors found a significant increase in the FRR following a pain management program, which was significantly associated with decreased pain-related fear.\nThe authors concluded that pain-related fear promotes muscle guarding during flexion, which in turn contributes to the development and maintenance of chronic pain.\nHowever, the authors did not examine how fear was related to each component of the FRR, as previous studies have.\nsuggested that persons with CLBP demonstrate reduced EMG during flexion as well as higher EMG activity in full flexion.\nIn the present study, we wished to directly examine the relationship between pain-related fear, as measured by the Tampa Scale of Kinesiophobia-2 (TSK-2),41,42 and EMG activity and angle of flexion among persons with CLBP.\nExtending the findings of Watson et al,40 we wished to determine how pain-related fear influences the components of the FRR (maximum EMG in flexion and average EMG in full flexion) as well as the FRR itself.\nIn addition, we hypothesized that pain-related fear would be significantly associated with decreased flexion.\nLastly, we wished to examine whether angle of flexion might account for any observed relationship between pain-related fear and lumbar EMG by statistically examining the independent influence of painrelated fear and angle of flexion on EMG activity.\nAs painrelated fear has been shown to be associated with restricted movement,43 it is possible that fear may be related to abnormal EMG activity through limited movement or flexion.\nSubjects Participants were 76 persons with chronic (3 or more months) musculoskeletal low back pain (as diagnosed by their treating physiatrist) who presented to the University of Michigan Spine Program for evaluation and treatment.\nSubjects were recruited to participate in a larger study examining the impact of manual therapy and specific adjuvant exercise on CLBP.\nInformed consent was obtained from all subjects, and the study methods were approved by the Institutional Review Board.\nParticipants had a mean age of 40.\n6 years (SD = 11.\n9), and a mean duration of pain of 85.\n5 months (SD = 103.\nThirty-four were male, and 42 were female.\nThirteen persons had previous lumbar surgery (laminectomy or discectomy).\nForty persons were working full or part-time, while 29 were not working due to pain.\nTwo persons were full-time students, 1 was a homemaker, and 4 were retired for reasons other than their pain.\nSixty-six persons were Caucasian, 7 were African-American, 2 were AsianAmerican, and 1 was Hispanic.\nPain Subjects completed the McGill Pain Questionnaire (MPQ)44 on the first day of assessment.\nThe MPQ measures subjective pain experience in a quantitative form, and consists of 20 groups of single word pain descriptors with the words in each group increasing in rank order intensity.\nThe Total PRI was used in the present study as the measure of self-reported pain intensity.\nSelf-report of clinical pain intensity was also obtained from subjects by having patients rate the highest, lowest, and average or usual pain during the past week.\nParticipants were asked to rate the highest, lowest, and average level of pain on three separate 10 cm Visual Analog Scales (VASs) anchored by the statement no pain on the left and the most intense pain imaginable on the right.\nVAS pain ratings have demonstrated good reliability45,46 and concurrent validity when compared with other methods of pain measurement.\nA total score for the scale is obtained by summing the items.\nInternal consistency (Cronbachs alpha) for the scale has been reported to be high (0.\n42 Factor analysis of the scale suggests that items measure 2 constructs, reflecting activity avoidance and a pathologic somatic focus or fear regarding the meaning of pain.\nThe total score was used in the present study.\nClin J Pain  Volume 20, Number 2, March/April 2004 Fear, Chronic Back Pain, and Lumbar Function.\nion, a goniometer was placed on a Velcro strap that was wrapped around the torso just below the axillae.\nOnce the equipment was placed on the subjects, they were asked to go through a series of movements verbally led by the examiner.\nSubjects were asked to stand upright for 2 seconds (Phase 1), then bend as far forward as they could to the count of two (Phase 2).\nDuring Phase 3, subjects were asked to stay in full flexion for 2 seconds, then return to standing over a period of 2 seconds (Phase 4).\nSubjects performed 5 trials, and data from the first trial was discarded as it was treated as a practice trial.\nAdditional practice trials were performed as needed to obtain an adequate signal.\nThe gain was kept constant for remaining trials.\nThe data for each subject were then divided into the 4 phases described above.\nThe data was visually inspected for integrity, and interference (spikes) were removed.\nEMG signals from the left and right sides were averaged.\nEach phase was defined based on the goniometer reading.\nAny change or stabilization in the angle by two or more degrees constituted a change in the phase.\nTo control for differences in amplification, the influence of static EMG on dynamic values, and other individual differences such as obesity that might influence the surface EMG signal, the data were normalized by dividing the data for a phase by the average EMG during Phase 1.\n29 Maximum (MAX) EMG during flexion was calculated by dividing the MAX EMG in Phase 2 by the average EMG from Phase 1.\nThe average (AVE) EMG in full flexion was calculated by dividing the AVE EMG during Phase 3 by the AVE EMG in Phase 1.\nFinally, the MAX EMG in extension was calculated by dividing the MAX EMG in Phase 4 by the AVE EMG in Phase 1.\nThe FRR was computed by dividing the normalized maximum EMG during flexion by the normalized average EMG in full flexion.\nThis is the ratio typically reported in previous studies that, however, did not employ normalization of EMG values.\nProcedure Data for the current experiment were obtained on the first day of testing from the larger study.\nInformed consent was obtained from each subject, and each subject was then interviewed to obtain demographic and pain information.\nSubjects were told that the purpose of the testing was to examine changes in pain and other self-report measures, as well as changes in muscle function while bending as a function of treatment.\nQuestionnaires were checked for thoroughness of completion.\nRESULTS Prior to examining the relationships between the EMG, flexion data, and the variables of interest, these data were checked for normalcy.\nVisual inspection of the EMG data suggested that distribution of scores were positively skewed.\nA Kolmogorov-Smirnov Goodness of Fit Test was conducted on the normalized EMG Data.\nThe Kolmogorov-Smirnov Z statistics for the MAX EMG in flexion (Z = 2.\n001), AVE EMG in full flexion (Z = 2.\n001), MAX EMG in extension (Z = 1.\n05), and the FRR (Z = 2.\n01) were all statistically significant, suggesting the distributions were not normal.\nThe Z statistic for MAX angle of flexion suggested that this distribution was normal.\nThe normalized EMG data were then subjected to a logarithmic transformation to attempt to normalize the distributions, and repeat Kolmogorov-Smirnov Goodness of Fit Tests indicated that the data transformations were successful.\nThe sample means for the normalized, log transformed EMG data, and maximum angle of flexion are presented in Table 1.\nZero-order correlations between the pain and demographic information, TSK-2 scores, and EMG and flexion data are presented in Table 2.\nAs the associations between MPQ scores and VAS scores were similar, analysis of MPQ scores was dropped.\nWe were particularly interested in examining the relationship between fear and EMG and angle of flexion, in addition to pain and demographic variables that might be related to EMG activity, as these would need to be controlled for in later analyses.\nGender was also associated with.\n6 MAX angle of flexion 100.\n1 MAX EMG flexion 2.\n8 MAX EMG extension 2.\nEMG activity and flexion, as males tended to display greater flexion (r = 0.\n01) and greater MAX EMG during flexion (r = 0.\n01) and extension (r = 0.\nPersons with previous lumbar surgery displayed significantly lower MAX EMG during flexion (r = 0.\nAverage VAS ratings were significantly and negatively associated with maximum angle of flexion (r = 0.\nPersons receiving compensation were more likely to display lower angles of flexion while bending (r = 0.\n01), as were persons involved in litigation (r = 0.\nPersons in litigation were also significantly more likely to display lower MAX EMG in both flexion (r = 0.\n05) as well as extension (r = 0.\nThe TSK-2 total score was significantly and inversely related to MAX angle during flexion (r = 0.\n01), MAX EMG during flexion (r = 0.\n01), MAX EMG during extension (r = 0.\n01), and the FRR (r = 0.\nTo further explore the relationship between pain-related fear, angle of flexion, and EMG activity, a series of path models were constructed to examine whether pain-related fear influences EMG activity directly, or indirectly through its influence on range of motion.\nAs several demographic and pain variables displayed significant zero-order relationships to angle of flexion and the various EMG measures, they were treated as exogenous variables in the path models and were controlled for statistically.\nExogenous variables included age, sex, prior surgery, average VAS pain ratings, and compensation and litigation status.\n50 The path coefficient examining the direct influence of pain-related fear on EMG activity was calculated as the regression beta weight controlling for the variables listed above in addition to maximum angle of flexion.\nThe indirect pathway examining the mediating effect of angle of flexion was constructed by calculating the beta weight for the relationship between pain-related fear and angle of flexion controlling for the exogenous variables.\nIn addition, a beta weight was computed for the pathway between maximum angle of flexion and EMG activity controlling for TSK-2 scores and the exogenous variables.\nFour separate models were constructed with MAX EMG in extension, AVE EMG in full flexion, MAX EMG in flexion, and the FRR as dependent measures, as pain-related fear demonstrated significant zeroorder relationships with each EMG measure.\nThe significance of the path coefficients was based on the t test of the significance of the beta weight in the regression.\nThe path models are presented in Figure 1.\nThe models that examined maximum EMG during flexion and extension as the dependent variables suggested that the relationship between pain-related fear and EMG is mediated by angle of flexion.\nThese results suggest that pain-related fear influences EMG during flexion and extension through its association with decreased range of motion.\nCorrelations Between Demographic and Pain Variables, Pain-Related Fear, and Maximum Flexion, and EMG Activity.\nClin J Pain  Volume 20, Number 2, March/April 2004 Fear, Chronic Back Pain, and Lumbar Function.\n05) were significantly related to maximum EMG in extension while simultaneously controlling for all other variables in the model.\nIn the path model examining the relationship between pain-related fear and AVE EMG in full flexion, pain-related fear demonstrated a direct relationship to increased average EMG activity in full flexion ( = 0.\npain-related fear is significantly related to decreased angle of flexion ( = 0.\nDISCUSSION The findings of the present study indicate that painrelated fear is significantly associated with decreased lumbar flexion in persons with CLBP.\nWhen the FRR was examined as the dependent variable, pain-related fear displayed both a direct and indirect relationship to this variable.\nAs clinical pain was controlled for in the path analyses, the results suggest that pain-related fear is associated with range of motion and EMG independent of pain intensity.\nThere are limitations to the present study.\nFirst, we only examined muscle activity among persons with CLBP and not normal healthy persons.\nThus, it is difficult to determine whether the data reflect abnormal muscle activity.\nSecond, pain during actual bending was not assessed.\nThis may have been more highly associated with muscle activity compared with self-report of clinical pain intensity obtained before the dynamic EMG evaluation.\nDespite not assessing pain while bending, the findings are consistent with previous investigations that have not observed a significant relationship between pain and muscle ac-.\nPath analyses examining the relationships between pain-related fear, angle of flexion, and EMG activity.\n3,36 In one path model, average EMG in full flexion was inversely related to pain intensity, suggesting that clinical pain may inhibit muscle activity when in full flexion.\nIn addition, Watson et al40 found no relationship between present pain intensity just prior to bending and the FRR.\nRegardless, future studies should address whether relationships between painrelated fear, lumbar range of motion, and EMG are independent of pain experienced during the functional activity performed.\nIn addition, it would be beneficial to examine how perceptions of muscle activity and range of motion also influence the data.\nThe present findings replicate the findings of Watson et al40 in that a significant relationship was observed between pain-related fear and the FRR.\nExpanding on the findings of Watson et al,40 the present results suggest that pain-related fear influences the FRR both through its association with maximal muscle activity during flexion, as well as increased muscle activity in full flexion.\nThe relationship between maximal muscle activity and pain-related fear is mediated by decreased range of motion, while the relationship between fear and average EMG in full flexion was independent of range of motion.\nThus, pain-related fear has both a direct and indirect influence on the FRR, and the path analysis examining the FRR as the dependent variable supported this conclusion.\nconcluded that the relationship between pain-related fear and the FRR did not appear to be due to limited range of motion, as no significant changes in range of motion were observed before and after treatment in a pain management program despite significant increases in the FRR.\nThe data from the present study suggest that limited flexion among persons with CLBP may be responsible for some of the previous findings related to an abnormal FRP among persons with CLBP.\nFuture studies examining dynamic EMG among persons with CLBP should consider the potential influence of angle of flexion on muscle activity, particularly during flexion and extension.\nThe present findings are consistent with the biomechanical model of chronic pain as well as previous studies that have demonstrated decreased paraspinal muscle activity during flexion among persons with CLBP, as well as increased EMG in full flexion.\n3,8,2931 The results suggest that persons with CLBP who are highly fearful not only guard when in full flexion, but also significantly limit movement.\nThese data suggest that it may be important to address both EMG abnormalities and limited lumbar flexion as part of the treatment of CLBP.\nIt is possible that high levels of pain-related fear may lead to restricted range of motion and abnormal muscle utilization patterns that may increase the likelihood of developing CLBP.\nIndeed, it has been proposed that activity avoidance may lead to muscle atrophy, which in turn promotes pain.\n52 Vlaeyen et al37 found that muscles such as the anterior tibialis were overactive during exposure to stress among persons with CLBP.\nWhile this muscle is far removed from the paraspinals to compensate during flexion, it might be beneficial to examine other nearby muscles such as the iliosoas.\nIn addition, Haig et al suggested that decreased lumbar paraspinal activity during flexion might be due to co-contraction of the abdominal muscles.\n33 Monitoring of other muscles during movement might be beneficial in examining the types of muscle activity patterns that occur among persons with CLBP.\nIt appears that angle of flexion impacts maximal EMG during flexion and extension, but not EMG in full flexion.\nThe finding that maximal EMG during flexion and extension is dependent on angle of flexion is consistent with research indicating a positive, linear relationship between peak torque and angle of extension on a task of isometric lumbar extension.\n53 Angle of flexion may be unrelated to EMG in full flexion as most authors argue that myoelectric silence during flexion begins around 40 degrees of flexion, and most persons with CLBP are able to achieve this degree of flexion.\nThe discrepancy between the zero-order correlation and the path analysis suggests that one of the variables in the path model acted as a suppressor variable.\nWhile a relationship between fear and EMG activity in full flexion was not specifically examined in the Watson et al40 study, most studies examining the FRP in persons with CLBP and controls have consistently found elevated EMG in full flexion among persons with CLBP.\nMost prior studies examining the FRP in relation to CLBP have not normalized EMG data.\nWhether or not EMG data should be normalized is debatable, although normalizing EMG, or controlling for factors that may systematically influence surface EMG, should be considered.\nAs deconditioning and obesity have been reported to play a role in chronic pain and are known to influence surface EMG signals,54 group differences in these variables may contribute to observed differences in EMG activity.\nIn addition, within chronic pain populations, factors such as pain-related fear may systematically vary with variables that influence surface EMG.\nFor example, it has been proposed that pain-related fear and activity avoidance lead to greater deconditioning among persons with CBP.\nas examining EMG as a percentage of maximum voluntary contraction, may potentially be invalid in pain populations as pain and lack of effort may influence ability to give a maximum voluntary muscle contraction.\n8,56,57 We chose to normalize the data relative to baseline or standing EMG to avoid problems that might arise with assessment of maximum voluntary contraction among persons with CLBP.\nIn addition, this method potentially allows for control of any subtle or significant differences in static EMG activity on the dynamic EMG data.\nIt would be interesting to examine the impact of antispasm medications on muscle activity and movement among persons with CLBP in relation to pain-related fear.\nThere is much debate regarding the physiological basis of muscle spasm, and anti-spasm medications have not been shown to have a direct impact on muscle activity.\n58 It is possible that their clinical effectiveness may be related more to their psychoactive properties, particularly among patients high in painrelated fear.\nIn summary, pain-related fear appears to be highly associated with restricted movement and muscle activity among persons with CLBP.\nFuture studies should examine this relationship not only in persons with CLBP but also in normal, healthy controls.\nThe results of this study suggest that angle of flexion should be considered as a possible confound when examining EMG activity among clinical and normal populations.\nFuture studies might benefit from monitoring other muscles during flexion to examine how altered lumbar EMG impacts firing in other muscles.\nCause-effect relationships between pain-related fear, flexion, and muscle activity need to be established.\nAltering pain-related fear, restrictions in movement, and accompanying musculoskeletal changes may be beneficial in the treatment of CLBP.\nEMG feedback training during dynamic movement for low back pain patients.\nThe stress-hyperactivity-pain theory of myogenic pain.\nPhys Med Rehabil Clin North Amer.\nSurface electromyography in the identification of chronic low back pain patients: the development of the flexion relaxation ratio.\nCobb CR, deVries HA, Urban RT, et al.\nComparison of electromyographic activity in the lumbar paraspinal muscles of subjects with and without chronic low back pain.\nThe relationship between paraspinal EMG and chronic low back pain.\nThe psychobiology of chronic pain.\nCollins GA, Cohen MJ, Naliboff BD, et al.\nComparative analysis of paraspinal and frontalis EMG, heart rate, skin conductance in chronic low back pain patients and normals to various postures and stress.\nWolf SL, Nacht M, Kelly JL.\nElectromyographic assessment of chronic low-back pain syndrome.\nAn electromyographic investigation of postural fatigue in low back paina preliminary study.\nParalumbar muscle activity in chronic low back pain.\nParaspinal EMG and autonomic reactivity of patients with back pain and controls to personally relevant stress.\nFlor H, Birbaumer N, Schugens MM, et al.\nSymptom-specific psychophysiological responses in chronic pain patients.\nStress-related electromyographic responses in patients with chronic temporomandibular pain.\nComparison of electromyographic response patterns during posture and stress tasks in chronic low back pain patterns and control.\nElectromyographic recordings of 5 types of low back pain subjects and nonpatient controls in different positions.\nRelationships between strength of low back muscle contraction and reported intensity of chronic low back pain.\nA time series analysis of the relationship between ambulatory EMG, pain, and stress in chronic low back pain.\nFlexion-relaxation phenomenon in the back muscles: a comparative study between healthy subjects and patients with chronic low back pain.\nElectric behavior of low back muscles during lumbar pelvic rhythm in low back pain patients and healthy controls.\nTriano JJ, Schultz AB.\nCorrelation of objective measure of trunk motion and muscle function with low-back disability ratings.\nCorrelation of chronic lowback pain behavior and muscle function examination of the flexionrelaxation response.\nProspective evidence for change in paraspinal muscle activity after herniated nucleus pulposus.\nThe effect of musculoskeletal pain on motor activity and control.\nElectromyographic recordings of low back pain subjects and nonpatient controls in six different positions: effect of pain levels.\nFear of movement/(re)injury and muscular reactivity in chronic low back pain patients: an experimental investigation.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art.\nThe prediction of chronicity in patients with an acute attack of low back pain in a general practice setting.\nKori SH, Miller RP, Todd DD.\nKinesiophobia and chronic pain: psychometric characteristics and factor analysis of the Tampa Scale.\nFear of movement/reinjury and functional activity during physical therapy evaluation among persons with chronic low back pain.\nReliability and validity of the evaluation of pain in patients with total knee replacement.\nThe reliability of a linear analogue for evaluating pain.\nStudies with pain rating scales.\nThe subjective experience of acute pain: an assessment of the utility of 10 indices.\nBack and hip extensor activities during trunk flexion/extension: effects of low back pain and rehabilitation.\nPhys Med Rehabil Clin N Am.\nsubmaximal efforts in an isometric lumbar extension task.\nChronic low back pain assessment using surface electromyography.\nPain-related fear is more disabling than pain itself: evidence on the role of pain-related fear in chronic back pain disability.\nLumbar muscle fatigue and chronic lower back pain.\nLu WW, Luk KD, Cheung KMC, et al.\nBack muscle contraction patterns of patients with low back pain before and after rehabilitation treatment: an electromyographic evaluation.\nClin J Pain  Volume 20, Number 2, March/April 2004 Fear, Chronic Back Pain, and Lumbar Function."}