{"title": "48.pdf", "contents": "There is a long-held belief that physical activities such as lifting with a flexed spine is generally harmful for.\nthe back and can cause low back pain (LBP), potentially nurturing fear avoidance beliefs underlying pain-.\nIn chronic LBP patients, pain-related fear has been shown to be associated with reduced.\nlumbar range of motion during lifting, indicating distinct and probably protective psychomotor responses.\nHowever, despite short term beneficial effects for tissue health, recent evidence suggests that.\nmaintaining a protective trunk movement strategy may also pose a risk for (persistent) LBP due to possible.\npro-nociceptive consequences of altered spinal kinematics, reflected by increased loading on lumbar.\ntissues and persistent muscle tension.\nin pain-free individuals which would yield potential insights into how a person might react when they.\nTherefore, the aim of this study is to test the impact of pain-related fear on spinal.\nkinematics in a healthy cohort of pain-free adults without a history of chronic pain.\n(N=57) filled out several pain-related fear questionnaires and were asked to perform a lifting task (5kg-.\nHigh-resolution spinal kinematics were assessed using an optical motion capturing system.\nspine flexion angles during lifting, yielding important implications regarding unfavorable psychomotor.\ninteractions that might become relevant in a future LBP incident.\nEmotions and beliefs shape how humans move and vice versa [26,38].\nA prime example for this interplay.\nmovement can enhance pain [9,21].\nhealing process is long [11].\nand avoidance of daily activities, potentially aggravating disability and pain in the long term [12,59,63].\npain (LBP), include lifting with a flexed spine [6,17,50].\nevidence that the spine should not be flexed during lifting to prevent LBP [13,29,50,60,62,64].\nmechanical loading on spinal tissues, which might result in ongoing nociceptive input in the long term.\nYet, many health care professionals still promote lifting with a neutral spine as.\nthe safer lifting technique [42,50,62], potentially nurturing erroneous beliefs underlying pain-related fear.\nthat the back is in danger when flexed).\nbias towards lifting with a flexed spine is dangerous, compared to lifting with a neutral spine, in patients.\ndemonstrating distinct relationships between self-reports of pain-related fear and fear-related neural.\nactivity during observation of daily activities such as lifting with a flexed spine in LBP and pain-free subjects.\nmotion are largely unknown and need to be elucidated to disentangle possible clinically relevant.\nrelationships between pain-related fear, spinal motion and negative outcomes such as persistent LBP and.\nFirst insights came from a cross-sectional study demonstrating that elevated pain-related.\nfear of lifting is linked to reduced sagittal plane lumbar range of motion (ROM) in chronic non-specific LBP.\nThe results of this study indicate an unfavorable trunk stiffening.\nstrategy in fearful LBP patients [39,59].\nHowever, based on the reportedly pre-existing fear avoidance.\nbeliefs in pain-free individuals [5,36], it would be crucial to know whether pain-related fear also affects.\nspinal motion in pain-free subjects, yielding potential insights into how a person might react when they.\nlumbar motion during lifting in pain-free adults.\nstatistical parametric mapping to obtain time-sensitive information regarding  changes of spinal motion.\nSixty-one pain-free and healthy adults (males/females: 31/30; age: 29.\ncriteria: age between 18-60 years, no acute or recurrent LBP within the past 3 months, no history of.\nchronic pain, no prior spine surgery, no history of psychiatric or neurological disorders, not being.\npregnant, no consumption of alcohol or drugs within the past 24 hours and a BMI of lower or equal to 30.\nZrich, EK-01/2019/PB_2018_01001) and conformed to the Declaration of Helsinki.\nThey were invited for a single visit.\nat the local university hospital, where they completed several questionnaires and underwent a three-.\nParticipants completed the two following questionnaires assessing pain-related fear:.\n1) The modified 17-item German version of the Tampa Scale for Kinesiophobia (TSK) for the general.\nactivity and kinesiophobia using a 4-point Likert scale ranging from 1 = strongly disagree to 4 = strongly.\ntherefore measures more general aspects of pain-related fear.\nsufficient reliability (Cronbachs  = 0.\n2) The Photograph Series of Daily Activities Short electronic Version (PHODASeV) is a tool for measuring.\nPictures of different daily tasks are presented to the.\nparticipants who are then asked to imagine themselves in the shown situations and indicate how harmful.\nthey think these activities would be to their back on a scale from 0 to 100 (0 = not harmful at all; 100 =.\nThe internal consistency of the total score on the PHODA-SeV, as indicated by.\nCronbachs , was reported as 0.\n98 and the corrected item-total correlations ranged between 0.\nstudy, we chose a priori the overall score (PHODA-total) and the score of the item showing a person lifting.\nLifting a flowerpot best reflects a typical.\nlifting task and has demonstrated a specific relationship between harmfulness ratings and the lumbar.\nlifting ROM in chronic LBP patients  [34].\nTo investigate potential differences or shared variance between self-reports of pain-related fear and.\ngeneral anxiety, we used the State-Trait Anxiety Inventory (STAI), which includes two subscales [54].\nState Anxiety Scale (S-Anxiety) assesses current levels of anxiety, whereas the Trait Anxiety Scale (T-.\nParticipants were equipped with 58 retro-reflective skin markers placed by a physiotherapist or.\nmovement scientist with experience in palpation according to a previously described marker configuration.\nTo enable detailed tracking of spinal motion, this configuration included markers placed on the.\nParticipants were then asked to perform a series of activities of daily-living including upright standing and.\nsitting on a chair, bending forward and backward from an upright standing position without bending their.\nknees, standing up from a chair and sitting down on a chair with free hanging arms, lifting-up and putting-.\ndown a 5 kg-box that was placed 15 cm in front of the subjects feet, walking and running on a level ground.\nas well as climbing up and down a stair with four steps.\nNo further instructions were given to ensure.\nindividual and natural movements at self-selected speeds.\nApart from standing, sitting and bending.\n(performed once), all activities were repeated until five valid trials were collected.\nthe tasks the participants practiced the activities prior to the actual testing.\nparticipants violated the task instructions, resulting in non-valid trials.\nfrom bending and lifting activities were considered.\nThree-dimensional marker positions were tracked using a 20-camera optical motion capturing system.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\n20049999 doi:  medRxiv preprint.\n[51] including head, pelvis, thorax,.\nspine, shoulder, elbow, wrist, arms and lower extremities.\nMarkers placed on the spinous processes of C7,.\nT3, T5, T7, T9, T11, L1 to L5 and S1 were used for tracking of spinal motion.\nData reduction and outcome parameters.\nsetting of temporal events for the identification of the relevant data sections.\nIn a first step, marker data were cropped according to the temporal events set during pre-.\nup as well as starting point of the putting-down activities) [56].\nwere calculated based on the trajectories of the L1 to S1 and C7 to T11 markers, respectively, using a.\nFor the lifting activity, we additionally.\nC7 to S1) to derive.\nsegmental angles (angles between the normal lines passing through the individual marker positions) of.\nthe L1/L2, L2/L3, L3/L4, L4/L5 and L5/S1 spinal units [23,24].\nNo reuse allowed without permission.\nThe copyright holder for this preprint this version posted April 6, 2020.\nfrom the lifting activity were time-normalized on 101 points (time window: 0  100%) and averaged across.\nTo obtain ROM values for the analyzed tasks, continuous angles were reduced.\nangle difference between upright.\nThe continuous lumbar lordosis angles in the sagittal plane during lifting-up and putting-down a box were.\nthoracic kyphosis angles in the sagittal plane during lifting-up and putting-down a box.\nStatistical calculations were performed using SPSS (version 23, SPSS Inc.\nbased software package for one-dimensional Statistical Parametric Mapping (SPM: spm1d-package,.\nPrior to any inferential analyses, data were tested for normality using the.\nthe Shapiro-Wilk test and Q-Q plot inspection for measures of pain-related fear.\nTo investigate potential relationships between continuous spinal angles and measures of pain-.\nphases was performed and the output statistic SPM{t} was calculated at each of the 101 time points.\nthere are no relationships between continuous spinal angles.\nvalidated for 1D data [45,46], statistical significance was determined by a critical SPM{t}-threshold at.\nthreshold clusters that characterize significant time-specific positive or negative relationships between.\nspinal angles and pain-related fear.\nNo reuse allowed without permission.\nTo compare the actual data in pain-free adults with similar analyses recently performed in chronic LBP.\npatients [34], we conducted the following complementary analyses: (1) multiple regression analyses.\nincluding the TSK-G score (as a measure of general pain-related fear) as nuisance variable (in addition to.\nage, gender and bending ROM) to test if movement-specific pain-related fear (PHODA items) explains.\nadditional variance in spinal kinematics during lifting after accounting for linear effects of the TSK-G score.\n6) and (2) correlation analyses between the lumbar ROM during lifting and measures of pain-.\nrelated fear (TSK-G and PHODA items, section 3.\nFour subjects had to be excluded from the analysis, resulting in a final sample of 57 pain-free healthy.\nadults (males/females: 30/27; age: 29.\nThe reasons for the exclusions were technical issues that led to the loss of the kinematic.\nThe analysis of the PHODA harmfulness ratings indicated similar threat values for the a priori chosen item.\nPHODA-lift and the items shoveling soil (PHODA-shoveling) and falling backwards (PHODA-falling) (see.\nWe therefore added the latter two items post-hoc in the correlation analysis and performed.\nQ-Q plots inspection and the Shapiro-Wilk test indicated non-normality for the PHODA-lift (p = 0.\nPHODA-shoveling (p = 0.\n022) as well as for the T-Anxiety (p = 0.\nThe PHODA-total, PHODA-falling and TSK scores were normally distributed (p > 0.\ncorrelated with the PHODA-falling (Spearmans r = 0.\n034) and TSK-G (r = 0.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\n20049999 doi:  medRxiv preprint.\nsupra-threshold clusters reflecting significant time-specific negative relationships between lumbar angles.\nRelationships between PHODA-lift and continuous lumbar segmental angles during lifting.\nand L5/S1 as dependent variables revealed that the time-specific relationships between the lumbar angle.\nand the PHODA-lift score were driven by motion in the L4/L5 segment during the lifting-up (time window:.\n021) as well as the putting-down (time window: 29-100%, 0.\n012) phases (Figure 3A and 3B, Table 2).\n(left) and putting-down (right) phases.\nX-axis: time normalized on 101 points (time window: 0  100%).\nNo reuse allowed without permission.\nRelationships between PHODA-falling, PHODA-shoveling and continuous lumbar and thoracic.\nUsing the PHODA-falling score as regressor of interest, a significant negative relationship to continuous.\nlumbar angles was found during the lifting-up (time window: 0-77%, -0.\nputting-down phases (time window: 16-100%, -0.\nFurthermore, the PHODA-falling score showed a significant negative relationship to the motion in almost.\nall lumbar segments during both lifting phases (see Table 3).\nbetween thoracic angles and the PHODA-falling score, nor between the PHODA-shoveling score and.\ncontinuous lumbar and thoracic angles (pFDR > 0.\nEffects of movement-specific pain-related fear on continuous lumbar angles.\nrelationships between the PHODA-lift score and the continuous lumbar angles remained statistically.\nsignificant for both lifting phases (lifting-up: time window: 9-89%, -0.\n305, puncorr = 0.\n306, puncorr = 0.\nThe lumbar ROM during lifting did not show a relationship with the TSK-G score (r =  0.\nwith lumbar ROM (r = -0.\nThe results from the correlation analysis between lumbar ROM.\nHere, we investigated whether pain-related fear affects lumbar spine motion in pain-free individuals to.\nobtain information on potential pre-existing psychomotor interactions that might become relevant in a.\nfuture LBP episode (e.\nstiffening the spine to protect the back).\ncontinuous and discrete (ROM) sagittal plane spinal kinematics during a load lifting task, which is often.\nperceived as a dangerous activity for the back [5,6,11] and correlated these data with self-reports of pain-.\nNo reuse allowed without permission.\nThe impact of pain-related fear on spinal motion in pain-free adults.\nOur results support the evolving evidence that fear avoidance beliefs and associated pain-related fear.\nFurther, we demonstrate their impact on spinal motion by showing.\neffects of pain-related fear on thoracic motion were observed.\nsensitivities of pain-related fear questionnaires in explaining variance of lumbar motion during lifting.\nGeneral measures of pain-related fear, such as the TSK-G or the average PHODA score (PHODA-total), did.\nIn contrast, movement-specific pain-related.\nfear, reflected by subjective ratings of potentially harmful movements during daily activities (PHODA-lift,.\nPHODA-falling), demonstrated time-specific relationships with lumbar motion, even after accounting for.\nlinear effects of the TSK-G.\nThis partially agrees with a recently reported association of pain-related fear.\nIn line with the current study, that study.\nthe PHODA-lift item, and lumbar motion during a lifting task, supporting the construct validity of the.\nanalysis, but not when using discrete lumbar ROM values.\nsubtle association between the PHODA-lift score and lumbar spine motion in pain-free individuals.\na significant association with the lumbar ROM during lifting.\nhave a stronger sensitivity for changes of the lumbar ROM.\nonly item that correlated with trait anxiety, indicating that this item might represent a different, general.\nanalysis yielded segment-spanning relationships between the PHODA-falling scores and lumbar spine.\nNo reuse allowed without permission.\nThis change is most likely achieved.\nmuscle activation leading to increased spinal stability [7,15,39,48,65].\nobservations in patients with recurrent LBP [18].\nThese changes in the trunk movement strategy and their.\nA protective strategy might be beneficial.\nin the short term by avoiding further pain or injury but is suggested to predispose individuals to back.\nproblems in the long term through reductions in lumbar spine fine motor control, increased loading of.\nIn particular, there is a trade-off between the risk of LBP or injury associated with spinal tissue overload.\nand the risk of spinal instability [16].\nachieved through voluntary antagonistic muscle co-contraction [30] improving spinal stability during.\nIncreased spinal loading is known for initiating.\nor accelerating spinal tissue degeneration [32,47,58].\nInterestingly, the PHODA-lift score was specifically associated with altered motion in the L4/L5 region,.\nwhich is where the majority of lumbar disc herniations or degenerative changes such as degenerative.\nThe L4/L5 motion segment must bear heavy loads, making it more.\nsusceptible for developing injuryor degeneration-related pain as compared to other lumbar segments.\nIndividuals scoring high on the PHODA-lift item seem to particularly stiffen the L4/L5 motion.\nsegment during lifting, indicating a segment-specific protective movement strategy.\nthrough antagonistic co-contraction of spinal muscles, which then leads to increased intervertebral loads.\nat the L4/L5 level.\nHence, those individuals might be at risk for facilitation of degenerative processes.\nand/or for an LBP episode.\nFurthermore, the protective behavior for the L4/L5 segment seems to occur.\nhigh muscular responses during tasks involving large flexion angles.\nOur results indicate that protective movement strategies can be driven by beliefs about the harmfulness.\nof daily activities such as lifting with a flexed spine, in the absence of (experimental) pain.\noften held and communicated by health care professionals and manual handling advisors [42], likely.\noriginate from earlier in vitro studies investigating the effects of loads on cadaveric spines [1,4] and in vivo.\nstudies measuring intradiscal pressure [40,41], which led to the conclusion that lifting weights with a.\nHowever, more recent studies do not support this notion.\nDreischarf and colleagues (2016) reported only.\nA recent systematic review concluded that the current advice to avoid lumbar flexion.\nduring lifting to prevent LBP is not justified [50].\nangles using skin markers is strictly speaking a measurement of the external shape of the back in the.\nthe lumbar angles reported in the current study with other studies; however, it does not affect the results.\nof our regression analyses since all participants were measured identically.\nFurthermore, the accuracy of.\nHowever, previous research showed that such inaccuracies occur mainly in.\nlumbar extensions of more than 40 [52] and because most of the lumbar lordosis angles during the.\nimportant phases in the current study were below 40, we do not expect that the observed psychomotor.\nrelationships were due soft tissue-related inaccuracies.\nbeing distracted or fatigued) might indeed pose strong.\nrisks for triggering an acute LBP episode [55] and specific lifting techniques might be essential in certain.\nwork-related and everyday life situations.\nNonetheless, we argue that the importance of lifting with a.\nneutral spine in everyday activities has been greatly exaggerated and might even have detrimental effects.\nThe current study demonstrated that beliefs underlying pain-related fear of lifting with a flexed spine do.\naffect lumbar segmental motion in pain-free adults.\nindividuals with round-back danger beliefs might indicate a protective trunk movement strategy that can.\nbe dysfunctional in the long term by initiating potential pro-nociceptive mechanisms or amplifying pain in.\nCurrent results provide a basis for future kinematic and biomechanical analyses in LBP patients, focusing.\non time-specific psychomotor relationships that might be relevant for the maintenance of LBP and/or.\ndevelopment of chronic LBP.\nThe results also emphasize the need to raise more awareness of potential.\nnegative implications of erroneous beliefs regarding lifting techniques in the public and health sector.\nMovement analysis was performed with support of the Swiss Center for Clinical Movement Analysis,.\nthe SCMA for their support.\nFinally, we would like to thank Lukas Connolly for the valuable comments on.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\n20049999 doi:  medRxiv preprint.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\nReported are mean  SD and  median with interquartile range (IQR).\nMean (SD)  Median (IQR)  Correlation   p-value.\n1  Shoveling soil  51.\n5)  50 (29-80)  -0.\n3  Lifting pot, bent back  47.\n21  Taking box from shelf above head  30.\n31  Lifting toddler  29.\n11  Carrying bag, one hand  28.\n40  Drilling hole above head  27.\n32  Carrying child on hip  27.\n16  Vacuum cleaning  26.\n13  Carrying rubbish, one hand  24.\n39  Mowing lawn  22.\n17  Mopping floor  18.\n20  Back bending  18.\n22  Trampoline jumping  17.\n25  Making bed  17.\n9  Lifting basket, stairs  17.\n29  Cleaning windows above head  16.\n23  Rope skipping  16.\n19  Back twisting  15.\n1)  14 (5-24)  0.\n1)  11 (3-25)  0.\n5)  8 (3-20)  -0.\n8)  7 (2-18)  -0.\n8)  10 (0-20)  -0.\n1)  7 (1-15)  -0.\nNo reuse allowed without permission.\nNo reuse allowed without permission.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020.\n20049999 doi:  medRxiv preprint.\nThe mechanics of prolapsed intervertebral disc.\nEffect of age and sex on lumbar lordosis and the range of.\nA systematic review and meta-analysis.\nJournal of biomechanics 2019;82:119.\nControlling the false discovery rate in behavior.\nEvaluation of implicit associations between back posture and safety of bending and lifting  in people without pain.\nresponses in people with persistent low back pain and fear of bending.\nStabilizing function of trunk flexor-extensor muscles.\naround a neutral spine posture.\nThe biomechanical and clinical significance of the lumbar erector spinae.\nflexion-relaxation phenomenon: a review of literature.\n[9] Cote JN, Hoeger Bement MK.\nEasy to Harm, Hard to Heal: Patient.\nreplacement during different lifting techniques.\nA prospective and retrospective study.\nThe influence of trunk muscle coactivity on dynamic spinal loads.\nCost-benefit of muscle cocontraction in protecting against spinal instability.\nChanges in motor planning of feedforward postural responses of the trunk muscles in.\nPain and motor control: From the laboratory to rehabilitation.\nInteraction between pain, movement, and physical activity: short-term.\nMoving differently in pain: a new theory to explain the adaptation to pain.\nFear of movement/injury in the.\ngeneral population: factor structure and psychometric properties of an adapted version of the  Tampa Scale for Kinesiophobia.\nMulti-segmental thoracic spine kinematics measured dynamically.\nThoracolumbar spine loading associated with kinematics.\nof the young and the elderly during activities of daily living.\nmotion: a systematic review.\nand Hospital Anxiety and Depression Scale-Anxiety (HADS-A).\nEffects of abdominal drawing-in during prone hip extension on the muscle.\nactivities of the hamstring, gluteus maximus, and lumbar erector spinae in subjects with lumbar  hyperlordosis.\nactivity and low back pain.\nActive trunk stiffness increases with co-contraction.\nVariation of facet joint orientation and tropism in.\nlumbar degenerative spondylolisthesis and disc herniation at L4-L5: A systematic review and metaanalysis.\nIntervertebral disc cell death is dependent on the magnitude and duration of spinal.\nLumbar-pelvic range and coordination during lifting tasks.\nLumbar range of motion in chronic low back.\npain is predicted by task-specific, but not by general measures of pain-related fear.\nThe impact of pain-related.\nbeliefs in back pain-free subjects are reflected by amygdala-cingulate responses.\nLow Back Pain: The Potential Contribution of Supraspinal.\nComponents Contribute to the Recognition of Each Emotion.\nDoes anticipation of back pain predispose to back trouble?.\nBrain a journal of neurology 2004;127(Pt 10):233947.\nWhat do physiotherapists and manual.\nJournal of biomechanics 2019:109597.\nJournal of biomechanics 2010;43(10):197682.\nThe probability of false positives in zero-dimensional.\nJournal of biomechanics  2016;49(9):146876.\nDynamic and static overloading induce early degenerative  processes in caprine lumbar intervertebral discs.\nA new muscle co-activation.\nindex for biomechanical load evaluation in work activities.\n[49] Ross GB, Sheahan PJ, Mahoney B, Gurd BJ, Hodges PW, Graham RB.\n[50] Saraceni N, Kent P, Ng L, Campbell A, Straker L, O'Sullivan P.\nRelationship Between Lumbar Spine Flexion During Lifting and Low Back Pain? A Systematic Review  With Meta-Analysis.\nkinematics during gait in healthy individuals across different age groups.\nHuman movement science  2017;54:7381.\nSpinal Curvature Quantification in Main Thoracic Adolescent Idiopathic Scoliosis: An Explorative  Radiographic Study.\nSagittal spinopelvic alignment and body mass index in patients with.\nEuropean spine journal official publication of the European Spine  Society, the European Spinal Deformity Society, and the European Section of the Cervical Spine  Research Society 2011;20(5):7139.\nThe copyright holder for this preprint this version posted April 6, 2020.\n20049999 doi:  medRxiv preprint.\nPalo Alto, CA: Consulting Psychologists Press, Inc, 1983.\nduring functional activities using a portable strain gauge sensor-based system: A comparative  evaluation and reliability study.\nExposure in vivo Induced.\nChanges in Neural Circuitry for Pain-Related Fear: A Longitudinal fMRI Study in Chronic Low Back  Pain.\nLow-Back Pain Patients Learn to Adapt Motor Behavior With.\nStoop or squat: a review of biomechanical studies on.\nMotor Control Changes in Low Back.\nhandling advice and assistive devices for preventing and treating back pain in workers.\nFear-avoidance and its consequences in chronic musculoskeletal pain: a state.\nlow back pain: results of a systematic review.\nA biomechanical in vitro study.\nThe Effects of Physiological Biomechanical.\nLoading on Intradiscal Pressure and Annulus Stress in Lumbar Spine: A Finite Element Analysis.\nSoft tissue artefacts of the human.\nback: comparison of the sagittal curvature of the spine measured using skin markers and an open  upright MRI.\n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.\nThe copyright holder for this preprint this version posted April 6, 2020."}