{"title": "65.pdf", "contents": "Changes in sensorimotor function and increased trunk muscle fatigability have been identified in patients with chronic low back pain (cLBP).\nThis study assessed the control of trunk force production in conditions with and without local erector spinae muscle vibration and evaluated the influence of muscle fatigue on trunk sensorimotor control.\nTwenty non-specific cLBP patients and 20 healthy participants were asked to perform submaximal isometric trunk extension torque with and without local vibration stimulation, before and after a trunk extensor muscle fatigue protocol.\nConstant error (CE), variable error (VE) as well as absolute error (AE) in peak torque were computed and compared across conditions.\nTrunk extensor muscle activation during isometric contractions and during the fatigue protocol was measured using surface electromyography (sEMG).\n97 Nm) than in healthy participants (CE = 4.\nLocal erector spinae vibration induced a significant reduction in CE (4.\n14 Nm) and AE (13.\nHealthy participants conversely showed a significant increase in CE (8.\n10 Nm) and AE (16.\nThe fatigue protocol induced erector spinae muscle fatigue as illustrated by a significant decrease in sEMG median time-frequency slopes.\nCitation: Boucher J-A, Abboud J, Nougarou F, Normand MC, Descarreaux M (2015) The Effects of Vibration and Muscle Fatigue on Trunk Sensorimotor Control in Low Back Pain Patients.\nPatients with cLBP have a less accurate force reproduction sense than healthy participants.\nLocal muscle vibration led to significant trunk neuromuscular control improvements in the cLBP patients before and after a muscle fatigue protocol.\nMuscle vibration stimulation during motor control exercises is likely to influence motor adaptation and could be considered in the treatment of cLBP.\nChanges in sensory function have been identified in many painful conditions of the musculoskeletal system especially among patients with chronic low back pain (cLBP) [1].\nThese changes, described in patients with cLBP, usually affects several physiological functions such as reduced sensory acuity [2], altered muscle recruitment patterns [3, 4] and reorganisation of the somatosensory regions of the brain cortex [5].\nLocal muscle vibration is often used to evaluate muscle spindle contribution to movement control.\nDuring local vibration stimulation, a selective activation of the muscle spindles via the Ia afferent fibers is usually observed resulting in a neuromuscular response referred to the tonic vibration reflex (TVR) [9].\nSome studies have suggested beneficial effects of local vibration such as significant increases in muscle activity and average mechanical power recorded during arm flexion contractions [10, 11].\nIndeed, it has previously been suggested that vibration applied on the muscle belly may alter normal motor unit recruitment patterns, determining an increase in rate coding, synchronization and possibly facilitating the recruitment of faster motor units [11].\nKakigi & Shibasaki [12], in their study aiming to determine the effects of vibration on pain somatosensory evoked potentials and pain threshold, suggested that stimulation of muscle spindles under vibration influence can lead to increases in the inhibitory mechanisms of painful feeling and, therefore, be used for therapeutic purposes.\nTrunk proprioception has previously been studied in individuals with low back pain using various protocols such as position sense or pointing task (motor control).\nSeveral studies have shown proprioceptive impairments in the lumbar spine of individuals reporting cLBP [1, 13, 14], but few studies have examined the local vibration effects on the performances of a trunk repositioning task in this population.\n[15] suggested that when applied at segmental level L5-S1, a multifidus muscle vibration leads to a significant decrease in pelvis directional error in a sitting position as illustrated by a systematic undershooting of the target position in patients with cLBP.\nThe same authors [16] had also concluded, in a previous study, that further research on the effect of vibration in other postures and other muscle groups was required to clarify the complex mechanism of the lumbosacral neuromuscular function.\n[17] found that patients with cLBP had larger errors in a spiral tracking task requiring circular trunk movements compared to healthy controls.\nUnder stress conditions such as muscle fatigue or mechanical loading, lumbar proprioception may also be highly affected [14].\nIn a study evaluating the effect of paraspinal muscle fatigue on lumbar spine proprioception, Taimela et al.\n[14] found that patients with cLBP had significantly poorer ability to sense a change in lumbar position after a fatiguing protocol.\nIt has also been shown that excessive fatigability of lumbar paraspinal muscles is a predictor of a first episode of low back pain [18] and a predictor of long-term back-related disability [19].\nTo control spinal stability, the central nervous system (CNS) must orchestrate a fine-tuned coordination of trunk muscles involving feedback (reflex) and feedforward control mechanisms [21].\nTherefore, the use of vibration stimulation, known to increase spindle discharge and muscle activity, could potentially prevent decrease in muscle spindle firing rate generally observed during muscle fatigue [22] and possibly contribute to the active control of spinal stability.\nTherefore, the primary objective of this study was to determine whether or not local vibration stimulation on erector spinae muscles would spontaneously yield changes in control strategy, accuracy and variability of the performance in a trunk isometric force reproduction task in patients with cLBP and healthy participants.\nIt was hypothesized that local muscle vibration would improve trunk sensorimotor acuity in patients with cLBP and would decrease trunk sensorimotor acuity in healthy participants.\nThe second objective of the study was to determine if vibration stimulation applied over fatigued muscles could have short-term benefits on trunk force reproduction parameters.\nTo document the influence of muscle fatigue on trunk sensorimotor control in patients with cLBP is relevant, considering that muscle fatigue limits functionality and may hamper the involvement of cLBP patients in rehabilitation and pain management strategies [23].\nThe authors tested the hypothesis that muscle vibration would lead to improvements in sensorimotor control of the trunk in patients with cLBP during both the no fatigue and the post-fatigue conditions.\nTwenty healthy adult participants (7 women and 13 men) without any cLBP history and 20 participants (7 women and 13 men) with non-specific chronic or recurrent low back pain were therefore recruited.\nPatients with nonspecific cLBP were selected according to previously established criteria for chronic or recurrent low back pain (cLBP: present at least half the days over a 6-month period; recurrent low back pain: present for less than half the days over a 12-month period) [24].\nPatients presenting any non-mechanical spinal condition, neurologic deficits, and chronic pain syndrome were excluded.\nHealthy adult participants were recruited based on the following criteria: absence of musculoskeletal or neurological symptoms related to a spine condition.\nBefore testing, each participant was informed of all experimental procedures and provided their informed.\nAll procedures were approved by the institutional Research Ethics Committee Involving Human Participants (Comit d'thique de la recherche avec des tres humains).\nClinical outcomes included the French validated version of the modified Oswestry Low Back Pain Disability Questionnaire (ODQ) to assess low back pain related disability [25] and the Tampa Scale for Kinesiophobia [26].\nClinical pain intensity of the lower back was assessed using a visual analogue scale (VAS) one week prior to testing and at the moment of testing [27].\nParticipants were tested in a neutral standing posture, without trunk flexion nor extension (Fig 1).\nParticipants received personal encouragements from the experimenters as the maximal isometric extension torques of erector spinae muscle were first collected.\nThe reference value for maximal voluntary contraction (MVC) was set at the highest torque value obtained in two consecutive 4-second.\nAs a warm-up procedure, participants were then instructed to produce a sub-maximal trunk isometric force as quickly as possible.\nIn order to ensure that all participants understood and performed the isometric force reproduction task properly, a familiarization phase was completed before the testing began, in which they were asked to produce a single impulse (shoot and release), but without attempting to correct the force once the contraction was initiated.\nDuring this phase, participants received visual accuracy feedback from an oscilloscope located in front of them, which helped them evaluate their performance to correct it for the next trial, if necessary.\nParticipants were asked to produce peak torques set at 60% of their MVC within a 10% margin error of the target goal (ex: 100  10 Nm), while keeping their eyes open for the entire session.\nThe term peak torque, therefore, refers to the highest value of the submaximal extension torque for each trial.\nThis familiarization phase, completed without introducing any form of vibration, was ended after participants completed ten consecutive contractions successfully.\nFor every trial, torque data were recorded at a sampling frequency of 100 Hz.\nThey were digitally filtered with an eighth-order Butterworth filter (10 Hz low-pass cut-off frequency).\nThese vibrators, designed with a regulated DC power supply (Zurich Electric RPS-1012 MB, Taipei Hsien, Taiwan), which were held in place with a custom-made Velcro elastic lumbar belt, were placed in a standard position on all participants by the same examiner, to ensure that they were was secured with comparable tension in all tests.\nParticipants were asked to perform a set of five trials (force reproduction task at 60% of their MCV) following an auditory signal which was heard every thirty seconds, for each of the vibration conditions (no vibration, 80 Hz).\nThe order of appearance of vibration conditions (no vibration, 80 Hz vibration) differed between block 1 and block 2 (and between block 3 and block 4) to limit any vibration sequence effect.\nthirty seconds, for each of the vibration conditions (no vibration, 80 Hz).\nThat sequence represented one block of trials and four blocks were completed for a total of twenty trials for each vibration condition.\nParticipants were allowed to rest for 5 minutes between each block in order to limit any fatigue effects.\nThe order of appearance of vibration conditions (no vibration, 80 Hz vibration) differed between block 1 and block 2 (and between block 3 and block 4) to limit any vibration sequence effect.\nThe vibration stimulation (80 Hz) was applied thirty seconds before an auditory signal was activated, and lasted through the torque generation trials, without any rest or delay.\nBetween block 2 and 3, participants completed a trunk extensor muscle fatigue protocol corresponding to a modified version of the Biering-Sorensen test [29].\nThe test was completed when the participant could no longer maintain their trunk in a straight horizontal position visually assessed (below the criterion position) or when the participant terminated the test (total exhaustion).\nOnce the fatigue protocol completed, the participants were asked to score their perceived exertion on a 20-point Borg Scale [30].\nSurface electromyography (sEMG) was used to record erector spinae muscle activation during the isometric contractions and during the fatigue protocol.\nFour rigid bipolar electrodes recorded erector spinae muscle activation bilaterally at L4-L5 level and L1 lumbar segments.\nThe electrodes were aligned with the muscle fiber direction and placed on the muscle belly.\nPrior to application, electrical impedance of the skin at the site of electrode placement was minimized using standard skin preparation techniques.\nsEMG activity was recorded using a Delsys sEMG sensor sampled at 1000 Hz with a 12-bit A/D converter (PCI 6024E; National Instruments, Austin, TX).\nTime to peak torque (TPT), constant error (CE), variable error (VE) as well as absolute error (AE) in peak torque were calculated and compared between experimental conditions [31].\nThese variables have been successfully used in previous studies [28, 32] and they are described in more detail below.\nThe detection and marking of these two values were made through a visual inspection by the same experimenter [32].\nThe TPT is defined as the time required to reach the peak torque from the onset of torque generation.\nThe CE represents the positive or negative difference between the peak torque reached and the target torque corresponding to 60% of the MVC; it indicates the amount of direction of error relative to the target torque (measure of bias).\nA positive CE in trunk extension corresponds to undershooting the target torque, while a negative CE corresponds to overshooting the target torque.\nThe VE measures the inconsistency in movement outcome and represents the variability of the participants performances about the mean value; it is calculated by the participants peak torque score on each trial and his or her own average score.\nFinally, the AE in peak torque represents the average absolute deviation (without regard to torque direction) between the participants responses and the target torque, which accounts for both bias and variability.\nAll trials of each participant were analysed and used for the variable calculations.\nThe recorded signals for each participants trial were submitted to an intensive frequency domain analysis.\nRMS values during each trunk extension trial were calculated using time-windows corresponding to the onset and cessation of extension torque production.\nRMS values were normalized with respect to the trunk extension MVC value.\nTo determine if erector spinae muscle exhibited fatigue across the modified Biering-Sorensen test, sEMG median frequency (Fast-Fourier Transform) was calculated from adjacent non-overlapping signal epochs of 1 s.\nThe slope of the median frequency regression and its intercept were used to define the rate of change and median frequency initial values.\nNormalized slopes were defined as the slopes divided by the corresponding initial values and expressed in percentage per second.\nThe sEMG analyses were conducted by averaging normalized sEMGRMS values from both sides (left and right), as used in previous studies [35, 36].\nThe Shapiro-Wilk test was used to assess the distribution of the variables.\nAll mean error in peak torque measures (CE, VE and AE) and TPT variables were normally distributed (all P > 0.\nThis study was conducted with a counterbalanced measure design.\nSampling distribution for each participant was also assessed for outlying observations (standard deviation > 3).\nPeak torque data and normalized sEMGRMS were submitted to a 2 (groups: cLBP and control)  2 (vibration conditions: no vibration and 80 Hz vibration)  2 (fatigue conditions: no fatigue and post-fatigue) repeated measure analysis of variance (ANOVA), ran separately for each variable.\nIn order to assess a potential fatigue phenomenon, pre and postMVC values were submitted to a group  fatigue condition ANOVA with repeated measures on the last factor.\nSignificant interactions or main effects were further analyzed using a post hoc Tukey test.\nsEMG median time-frequency slopes for each segmental level were submitted to a one-tailed students t Test to determine if they were significantly different than zero.\nThe significance level was set at P < 0.\nThe statistical analysis was performed with Statistica 10 (Statsoft, OK, USA).\nDemographic and clinical profiles of the participants are presented in Table 1.\nNo significant interaction effect between groups, vibration conditions and fatigue conditions was found for the VE variable [F(1, 76) = 0.\nNo significant interaction effect between groups, vibration conditions and fatigue conditions was found for the sEMGRMS at the L1 level [F(1, 76) = 0.\n05] with the 80 Hz vibration when compared to the no vibration condition.\nHowever, a significant fatigue  vibration interaction effect [F(1, 76) = 9.\nconsidered a significant kinesiophobia).\nPLOS ONE | DOI:10.\nA significant vibration main effect was observed, revealing higher sEMGRMS activity at L4-5 [F(1, 76) = 5.\n001] was also detected for the sEMGRMS at the L4-5 level, showing that patients with cLBP had significantly higher sEMGRMS activity than healthy controls.\nPost hoc analyses revealed a significantly higher CE scores in patients with cLBP compared to the healthy group during the no vibration condition (P < 0.\n001) while the control group conversely showed a significant increase in CE mean scores (P < 0.\nPatients with cLBP showed a significant reduction in AE under vibration exposure as compared to the no vibration condition (P < 0.\nIn contrast, the healthy participants during the erector spinae muscle vibration showed significantly higher AE scores in comparison with the no vibration condition (P < 0.\nPost-hoc comparisons for the fatigue  vibration interaction effect revealed a significantly higher sEMGRMS activity at L4-5 level with the 80 Hz vibration when compared to the no vibration under the no fatigue condition (P < 0.\nComparison of mean absolute errors for both groups in each condition (mean  standard error).\nThe presence of back muscle fatigue led patients with cLBP to a significant decrease in sEMGRMS activity at L4-5 level as compared to the no fatigue condition (P < 0.\nStatistical analysis yielded a main effect of fatigue for pre and post-MVC values (P < 0.\nThe average MVC ( SD) in trunk extension for patients with cLBP was 137.\n24 Nm before the fatigue protocol and 123.\n44 Nm immediately after the fatigue protocol, indicating a 10.\n32% decrease in MVC (P < 0.\nThe average MVC in trunk extension for healthy participants was 130.\n68 Nm before the fatigue protocol and 109.\n44 Nm immediately after the fatigue protocol, indicating a 16.\n03% decrease in MVC (P < 0.\nImportant fatigue-related changes were observed during the Biering-Sorensen protocol.\nsEMG time-frequency analysis at the L1 and L4-5 paravertebral electrode sites for both groups indicated that linear regression slopes were all negatives (Table 2).\nStudents t Test revealed no significant difference between both groups for the total holding time, and for the L1 and L4-5 linear equation slopes (all P > 0.\nOne-tailed t Tests revealed significant muscle fatigue at each segmental level for both groups (all P < 0.\nVibration effects under the fatigue condition.\nFollowing the fatigue protocol, healthy participants showed a significant decrease in CE during muscle vibration when compared to the no vibration condition (P < 0.\nA decrease in CE scores during vibration was also observed in patients with cLBP (P < 0.\nThe presence of back muscle fatigue led patients with cLBP to a significant decrease in sEMGRMS activity as compared to the no fatigue condition.\nvibration exposure, a difference was observed between the noand the post-fatigue condition for the control group (P < 0.\nThere were significant differences for both the vibration and no vibration conditions where cLBP patients showed significantly higher AE scores as compared to the healthy participants (all P < 0.\nFollowing the fatigue protocol, AE scores in patients with cLBP were significantly higher than the no fatigue scores for the vibration (P < 0.\n01) and the no vibration conditions (P < 0.\nThe presence of back muscle fatigue led to a significant decrease in sEMGRMS activity at L45 level for the 80 Hz vibration condition, independently of the group considered (Fig 6).\nParticipants from both groups took more time, therefore, to reach the peak torque following the fatigue protocol.\nThe aim of the present study was to assess the performance accuracy and variability of trunk reproduction force in conditions with and without erector spinae muscle vibration, and to evaluate the influence of muscle fatigue on trunk sensorimotor control in patient with cLBP and healthy participants.\nThe present study included a group of cLBP patients with an average mild pain level score (2.\n8) at the moment of testing [37, 38].\nResults showed that patients with cLBP had significantly lower trunk isometric force reproduction accuracy than the healthy participants.\nHigher CE and AE mean scores found in patients with cLBP clearly support this observation.\n[15], who found that patients with cLBP had a less refined lumbosacral position sense than healthy individuals in a sitting position.\nThe results reported by Brumagne et al.\n[15] provide evidence for reduced trunk neuromuscular control during dynamic contractions in patients with cLBP, and the results of the present study provide evidence for reduced trunk neuromuscular control during isometric contractions in patients with cLBP.\nIt is worth mentioning that measures of error such as CE, AE and VE mean scores reported in the present study and the one conducted by Brumagne et al.\nSensorimotor disturbances of the spine could result from modifications in somatosensory afferent activity, which can be due to trauma or to the modulatory effect of pain and sympathetic activation on muscle spindle sensitivity [40].\nConsistent with this explanation, Myers et al.\n[41] suggested that increased afferent signals sent by pain receptors are believed to override and subsequently decrease proprioception afferents.\nMean (SD) level of perceived exertion during the fatigue protocol.\nThe Borg Scale 16.\nThe Borg Scale starts with no feeling of exertion, which rates a 6, and ends with very, very hard, which rates a 20.\nModerate activities register 11 to 14 on the Borg scale (fairly light to somewhat hard), while.\nvigorous activities usually rate a 15 or higher (hard to very, very hard).\nVibration and Trunk Sensorimotor Control in Low Back Pain Patients.\nIn the present study, it is therefore possible that patients with cLBP, having limited somatosensory information from back muscle, had to reweight sensory information from other segments or muscle groups.\nVibration of the erector spinae muscle induced a significant reduction of the CE and AE mean scores in patients with cLBP.\nThe accuracy with which patients with cLBP reproduced a trunk sub-maximal force was, therefore, improved during vibration stimulation when compared to the no vibration condition.\nThis acute effect of local muscle vibration in patients with cLBP has several possible explanations.\n[44], in their study on the ability of vibration to compromise detection of a nociceptive stimulus, found that vibrations ranging from 20 to 230 Hz were able to modulate nociception by reducing the noxious stimulus sensitivity.\nSome authors also suggested that muscle vibration could distort muscles primary afferent by introducing a bias signal in a parallel channel, because vibration can modestly active the Pacinian corpuscle and others cutaneous mechanoreceptors [7, 45, 46].\nAlthough the neurophysiological mechanism for such changes remains unclear, it is possible that vibration stimulation in this study may have improved the muscle spindle function in patients with cLBP therefore improving somatosensory information processing.\nBy stimulating Ia afferents and modulating the nociceptive pathways activation, vibration stimulation may lead to a transient sensory reweighting of the erector spinae muscle resulting in significant improvements in trunk neuromuscular control.\nIt is well known that mechanical vibration administered to tendons or muscles can induce a reflex response [9].\n[47] suggests that 80 Hz vibration during muscle contraction can lead to specific TVR increases observed with higher sEMGRMS activity of the biceps.\nIn the present study, local vibration application led to significant increase in erector spinae muscle activity at both L1 and L4-5 segmental levels.\nRegardless of the experimental conditions, patients with cLBP in this study also showed higher muscle activity than healthy controls at L4-5 level but not at L1 level.\nThis is consistent with the redistribution of activity within muscle theory that has been described in patients with cLBP [48].\nIt is difficult to explain the improvements in force reproduction accuracy of the trunk observed in patients with cLBP by the vibrationrelated increase in muscle activity, since healthy controls also showed significant increases in muscle activity during vibration but with higher CE and AE mean scores.\nConversely, vibration stimulation significantly decreased the healthy participants accuracy during the force reproduction task.\nThis finding is in accordance with a previous study conducted on healthy participants in which erector spinae muscle vibration interfered with torque generation sequence by distorting proprioceptive information resulting in muscle lengthening illusion [28].\nPrevious studies have shown that back muscle fatigue is usually accompanied by a diminished control of trunk movements [50] and an altered coordination of trunk muscle activities [51], as well as reductions in accuracy when trying to generate a given force [52].\nIt is also well established that patients with cLPB have excessive fatigability of the back muscles which is probably a consequence of pain, rather than a cause [53, 54].\nFrom a theoretical point of view, these deficits, in association with cLBP, may leave the lumbar spine more susceptible to reinjury.\nThe results of the present study suggest that the back extensors fatigue protocol clearly induced muscle fatigue for both groups.\nHowever, the level of muscle fatigue between cLBP and healthy participants did not differ.\nUnder the influence of vibration, patients with cLBP showed significant reduction of the CE values, which suggests accuracy improvements in the force reproduction task.\nAE values with and without vibration stimulation, however, were higher during the post-fatigue condition.\nBased on CE mean score, these findings suggest that acute erector spinae vibration may enhance sensorimotor acuity in patients with cLBP in conditions with and without back muscle fatigue, and could, therefore, be considered as an adjunct to actual rehabilitation strategies.\nInterestingly, healthy participants during the post-fatigue condition and under vibration stimulation showed significant decreases in CE when compared to the no fatigue condition.\nTheoretically, muscle spindle discharge decreases during fatiguing static contraction [22].\nConsistent with this change, motor units usually demonstrated a decrease in firing rate during muscle fatigue [55].\n[56], in their study on vibration and motor unit firing rate, found that application of periodic muscle vibration maintained the motor unit firing rate during submaximal fatiguing isometric contractions.\nThese authors also concluded that muscle vibration can enhance the excitatory input from Ia afferents to the motoneuron pool and transiently restore the motor unit discharge rate.\nIn the present study, the significant decrease in sEMG activity at L4-5 level observed following the fatigue protocol could not, however, be prevented by local vibration stimulation.\nAlthough the hypothesis that fatigue-related modulation of motor unit firing rate during submaximal contractions could be prevented by vibration in healthy controls received initial support [56], the present findings do not provide any evidence to confirm this assumption.\nEven though it is not of clinical importance, alternative theories are required to explain the improvement in sensorimotor control under vibration stimulation following a fatigue protocol in healthy controls.\nHigher TPT scores were found in all post-fatigue conditions for both groups, suggesting a modified control strategy developed under exposure to muscle fatigue.\nThis result may be closely related to the neuromuscular effects of fatigue on muscle activation, including reduction in the ability of muscle to produce force and power.\nA spectrum of clinical interventions has been proposed to retrain motor control in the presence of musculoskeletal pain and disability.\nThe present findings suggest that 80 Hz vibration stimulation in patients with cLBP is likely to influence motor adaptation of the sensorimotor system,.\nVibration and Trunk Sensorimotor Control in Low Back Pain Patients.\nleading to improved accuracy in isometric force production parameters.\nBosco, Cardinale [10], in their study on local vibration on mechanical power and sEMG activity, concluded that vibration stimulation was able to stimulate the neuromuscular system more than others treatments used to improve neuromuscular properties.\nErector spinae muscle vibration could, therefore, be used as an additional stimulation to the sensorimotor system during rehabilitation exercises.\nThe sensory integration process may increase the contribution on erector spinae sensory afferents during motor control exercises performed under vibration stimulation (sensory reweighting).\nThe results of the present study also showed that vibration effects on trunk sensorimotor control (increases in force production accuracy) may operate similarly with and without back extensors muscle fatigue.\nThese findings suggest that vibration may lead to beneficial effects at multiple stages of the rehabilitation process where patients with cLBP present different levels of muscle fatigue.\nEven if erector spinae vibration stimulation suggests short-term benefits on neuromuscular control, potential long-term benefits involving primary outcomes such as spine loading, movement and motor variability need to be further investigated.\nAlthough such adaptation is mainly driven by changes in muscle spindle discharge, changes in sensorimotor integration or motor planning remain to be determined.\nThe findings of this study suggest that patients with cLBP have a less accurate force generation sense than healthy individuals, presumably because of altered erector spinae muscle spindle afferents.\nLocal muscle vibration led to significant trunk neuromuscular control improvements in the cLBP patients, which suggests that the weighting of proprioceptive feedback from erector spinae muscle spindles differs between groups.\nThe significant increase in neuromuscular control observed for the patients in the non-fatigued condition supports the clinical evidence of improved trunk function during vibration application, and contributes to the efficacy of this approach in the management of patients with cLBP.\nLocal muscle vibration also led to significant trunk neuromuscular control improvements in the cLBP patients following a muscle fatigue protocol.\nDifferences in repositioning error among patients with low back pain compared with control subjects.\nSharma L, Pai YC.\nvan Dieen JH, Selen LP, Cholewicki J.\nTrunk muscle activation in low-back pain patients, an analysis of the literature.\nHodges PW, van den Hoorn W, Dawson A, Cholewicki J.\nChanges in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nExtensive reorganization of primary somatosensory cortex in chronic back pain patients.\nCordo P, Gurfinkel VS, Bevan L, Kerr GK.\nThe contribution of muscle afferents to kinaesthesia shown by vibration induced illusions of movement and by the effects of paralysing joint afferents.\nKinaesthetic role of muscle afferents in man, studied by tendon vibration and microneurography.\nThe responses of human muscle spindle endings to vibration during isometric contraction.\nInfluence of vibration on mechanical power and electromyogram activity in human arm flexor muscles.\nThe effects of a 28-Hz vibration on arm muscle activity during isometric exercise.\nMechanisms of pain relief by vibration and movement.\nJ Neurol Neurosurg Psychiatry.\nThe measurement of lumbar proprioception in individuals with and without low back pain.\nThe effect of lumbar fatigue on the ability to sense a change in lumbar position.\nThe role of paraspinal muscle spindles in lumbosacral position sense in individuals with and without low back pain.\nEffect of paraspinal muscle vibration on position sense of the lumbosacral spine.\nPrecision control of trunk movement in low back pain patients.\nPhysical measurements as risk indicators for low-back trouble over a one-year period.\nCourse of back pain in primary care: a prospective study of physical measures.\nFatigue influences the dynamic stability of the torso.\nThe stabilizing system of the spine.\nPrevalence of fatigue and associated factors in chronic low back pain patients.\nStudying the natural history of back pain.\nVibration and Trunk Sensorimotor Control in Low Back Pain Patients.\nKinesiophobia: a new view of chronic pain behavior.\nResponsiveness of visual analogue and McGill pain scale measures.\nBoucher JA, Normand MC, Descarreaux M.\nSpinal muscle evaluation using the Sorensen test: a critical appraisal of the literature.\nPsychophysical bases of perceived exertion.\nSensory contributions to motor control.\nMotor Control and Learning: A Behavioural Emphasis.\nSensorimotor control during peripheral muscle vibration: An experimental study.\nChanges in muscle activity and kinematics of highly trained cyclists during fatigue.\nEvaluation of measurement strategies to increase the reliability of EMG indices to assess back muscle fatigue and recovery.\nSpecificity of a back muscle roman chair exercise in healthy and back pain subjects.\nAspects of the reliability and validity of the visual analogue scale.\n010 Numeral Pain Rating Scale.\nPreparing for the learning experience.\nInfluence of sympathetic nervous system on sensorimotor function: whiplash associated disorders (WAD) as a model.\nSensorimotor contribution to shoulder stability: Effect of injury and rehabilitation.\nProprioceptive weighting changes in persons with low back pain and elderly persons during upright standing.\nPersons with recurrent low back pain exhibit a rigid postural control strategy.\nVibratory antinociception: Effects of vibration amplitude and frequency.\nThe response of human muscle spindle endings to vibration of non-contracting muscles.\nThe effect of muscle vibration on human position sense during movements controlled by lenthenig muscle contraction.\nPain and motor control: From the laboratory to rehabilitation.\nThe influence of acute back muscle fatigue and fatigue recovery on trunk sensorimotor control.\nVibration and Trunk Sensorimotor Control in Low Back Pain Patients.\nThe triaxial coupling of torque generation of trunk muscles during isometric exertions and the effect of fatiguing isoinertial movements on the motor output and movement patterns.\nNeuromuscular trunk performance and spinal loading during a fatiguing isometric trunk extension with varying torque requirements.\nFibre type characteristics and function of the human paraspinal muscles: normal values and changes in association with low back pain.\nThe effect of acute back muscle fatigue on postural control strategy in people with and without recurrent low back pain.\nNeural control in human muscle fatigue: changes is muscle afferents, moto neurones and moto cortical drive.\nMuscle vibration sustains motor unit firing rate during submaximal isometric fatigue in humans.\nVibration and Trunk Sensorimotor Control in Low Back Pain Patients."}