{"title": "40.pdf", "contents": "Clinical Study Catastrophization, fear of movement, anxiety, and depression are associated with persistent, severe low back pain and disability.\na Department of Epidemiology and Preventive Medicine, School of Public Health and Preventive Medicine, Monash University, Alfred Hospital, 553 St Kilda Rd, Melbourne, VIC 3004, Australia b Department of Research, Spine Centre of Southern Denmark, Hospital Lillebaelt, Middelfart, Denmark c Imaging Section, Diagnostic Centre, Regional Hospital Silkeborg, Silkeborg, Denmark d Institute of Clinical Medicine, Aarhus University, Aarhus, Denmark e Nordic Institute of Chiropractic and Clinical Biomechanics, Odense, Denmark Received 26 June 2019; revised 13 January 2020; accepted 3 February 2020.\nAbstract BACKGROUND CONTEXT: Psychological characteristics are important in the development and progression of low back pain (LBP); however, their role in persistent, severe LBP is unclear.\nPURPOSE: To investigate the relationship between catastrophization, depression, fear of movement, and anxiety and persistent, severe LBP, and disability.\nSTUDY DESIGN/ SETTING: One-year prospective cohort study.\nPATIENT SAMPLE: Participants were selected from the SpineData registry (Denmark), which enrolls individuals with LBP of 2 to 12 months duration without radiculopathy and without satisfactory response to primary intervention.\nOUTCOME MEASURES: Psychological characteristics, including catastrophization, depression, fear of movement, and anxiety, were examined at baseline using a validated screening questionnaire.\nCurrent, typical, and worst pain in the past 2 weeks were assessed by 11-point numeric rating scales and an average pain score was calculated.\nDisability was measured using the 23-item Roland-Morris Disability Questionnaire.\nMETHODS: Participants completed baseline questionnaires on initial presentation to the Spine Center (Middelfart, Denmark), and follow-up questionnaires were sent and returned electronically.\nStatistical analysis involved multivariable Poisson regression to investigate the association between psychological factors and the number of episodes of severe pain or disability.\n4%) provided data 1 year later.\nApproximately half of the participants reported severe LBP (n=299, 47.\n2%) or disability (n=315, 57.\n8%) at a minimum of one time point, and 14.\n1%) experienced severe LBP or disability at two time points, respectively.\nMultivariable Poisson regression showed a relationship between catastrophization, depression, fear of movement, and anxiety and a greater number of time points with severe LBP and disability, after adjusting for age, gender, body mass index, and duration of symptoms.\nHowever, when all psychological factors were added to the regression model, only catastrophization and depression remained significantly associated.\nCONCLUSIONS: This study showed that persistent, severe LBP, and disability is common in a secondary care population with LBP and is associated with a variety of psychological risk factors, in particular catastrophization and depression, highlighting the importance of considering these factors in the design and evaluation of outcomes studies for LBP.\nLow back pain (LBP) is the most common cause of disability globally [1] and is associated with a huge socioeconomic burden [2].\nAlthough cases of LBP tend to resolve within a few months, persistence and recurrence are common [2,3], and prior recurrence is a strong predictor of future episodes [4].\nThe severity of LBP and its associated disability also varies, with some people experiencing only mild discomfort and minimal limitation to their function, whereas others are highly disabled by severe pain, restricting their involvement in family, work, and social activities [2].\nMoreover, health and social problems associated with persistent LBP become complex and include addiction to prescribed medications, such as opioids [5,6], and psychosocial issues, including depression and social isolation [7].\nTo develop effective treatment and prevention strategies, modifiable risk factors for persistent, severe LBP, and disability need to be identified.\nLBP is conceptualized according to a biopsychosocial model [7] and it is widely accepted that psychological factors significantly contribute to an individuals experience of LBP.\nSystematic reviews have found catastrophizing and depression to be associated with worse outcomes from LBP and disability [811]; however, there is limited evidence to support a relationship between both anxiety and fear of movement and LBP [1214].\nThus, evidence for an association between psychological factors and LBP is broadly accepted, but there is mixed evidence for specific, individual factors [7].\nFurthermore, our understanding about the role of psychological factors in persistent cases of severe LBP and disability is limited.\nThis study aimed to determine whether the psychological factors of catastrophization, depression, fear of movement, and anxiety are associated with persistent, severe LBP, and disability.\nWe hypothesized that all of the psychological characteristics would show an association with persistent, severe LBP, but that some factors may play a greater role.\nWe conducted a nested cohort study within the Danish SpineData registry.\nPatients with LBP presenting for a new episode of care at the Spine Centre of Southern Denmark.\nwere enrolled in the registry unless they declined to participate.\nOf the 35,466 patients presenting to the center from January 2011 to July 2014, only 3,552 (10%) declined to be involved, resulting in 31,914 (90%) recruited to the registry.\nThe administration and recruitment processes for the registry have been described in detail previously [15].\nThe Spine Center is a tertiary care facility and to be eligible for referral patients must have nonspecific LBP of 2 to 12 months duration and not report radiculopathy or satisfactory response to primary interventions.\nSerious pathology such as fracture, cancer, or infection is ruled out before presentation at the Spine Center.\nPatients at the Spine Center receive a variety of treatments, including both surgical management and conservative interventions, such as massage, physiotherapy, and chiropractic treatment, with many patients receiving more than one treatment.\nThe current study included patients that presented between September 2013 and October 2014, completed the SpineData questionnaire at baseline and 1-year follow-up, and had a lumbar spine magnetic resonance image taken within 30 days of presentation.\nAccording to Danish law, the study did not require ethical approval from the Region of Southern Denmark Human Research Ethics Committee (HREC) (letter of exemption is available in Danish from the authors on request) and was exempt from ethical review by the Monash University HREC (Project number: CF15/3054 -2015001289).\nThe onset of low back symptoms was reported by patients at baseline, and the date of the initial presentation to the Spine Center was also recorded.\nParticipants responded to a brief seven-item, psychological screening questionnaire, with two items relating to each of catastrophization, fear of movement and depression, and one item to anxiety.\nThe screening index was developed for the Spine Data registry and has been validated in Danish and Australian cohorts [16].\nEach item consists of an 11point Numeric Rating Scale (NRS, 010) on which participants indicate the extent to which a particular statement or question applies to them (Table 1).\nAll psychological domain scores were dichotomized based on published, validated cut-off values (7/10 for catastrophization, fear of movement and depression, and 2/10 for anxiety) [16].\nParticipants were required to score above the cut-off values on both depression questions to have depression [16].\nThe two questions relating to catastrophization and fear-avoidance were each averaged to give a single score and these average scores were then dichotomized [16].\nCurrent, typical, and worst pain in the past 2 weeks were assessed by 11-point NRS (010) and the average score was calculated [17].\nAverage pain was dichotomized for each time point (ie, baseline and 1year follow-up), with a score of 7/10 being considered severe [18], and participants were grouped according to whether they had severe pain at neither, one or both time points.\nDisability from LBP was assessed by the 23-item Danish language Roland-Morris Disability Questionnaire [19].\nBaseline and follow-up scores were dichotomized with 14/23 being considered severe [20] and, similar to the pain scores, participants were grouped according to whether they had no severe disability, or severe disability at one time point or both time points (ie, persistent disability).\nParticipant characteristics were reported based on the number of time points at which participants reported.\nDemographic, psychological, pain and disability data were compared between those who did and did not return for follow-up.\nIn addition, the same statistical tests were used to compare demographic, psychological, pain and disability variables between pain and disability groups.\nUnivariate and multivariable Poisson regression models were used to determine whether psychological variables were associated with the number of time points at which severe LBP and disability were reported.\nTwo multivariable models were used, with the first adjusting for age, gender, BMI and symptom duration, and the second adjusting for age, gender, BMI, symptom duration and all other psychological variables.\nPost hoc analyses In addition to the primary analysis, we conducted subgroup analyses to explore whether the association between psychological factors and severe pain and disability differed between those with and without a history of spinal surgery for LBP, depression, and work dissatisfaction.\nHistory of spinal surgery was examined as a binary variable based on a simple yes/no response, depression was defined using the same method as in the primary analysis, and work satisfaction was dichotomized as low/high based on the median value for the cohort (2/10).\nCatastrophization 2 When I feel pain, I feel I cant stand it anymore.\nFear of movement Fear of movement 1 Physical activity might harm my back.\nFear of movement 2 I should not do physical activities which (might) make my pain worse.\nAnxiety Anxiety Do you feel anxious? Depression Depression 1 During the past month have you often been bothered by feeling down, depressed or hopeless? Depression 2 During the past month have you often been bothered by little interest or pleasure in doing things?.\nWhere psychological domains were formed from two items, the scores were averaged.\nAll psychological domain scores were dichotomized for analysis, with a cut-off value of 7/10 used for catastrophization, fear of movement, and depression, and a cut-off value of 2/10 used for anxiety [16].\nOf the 952 participants recruited at baseline, 633 (66.\n4%) provided data at 1-year follow-up.\n0 kg/m2, respectively, and 54% were female.\nParticipants who had complete baseline and follow-up data had a higher mean age (45.\n01), higher mean baseline disability score (13.\n01), shorter median (interquartile range [IQR]) symptom duration (0.\n05) than those that had incomplete data.\nHowever, there were no differences in the mean BMI (27.\n05), mean baseline pain score (5.\n05), or proportion with a history of surgery for LBP (10.\n05), or psychological characteristics (catastrophization 20.\n05, fear of movement 21.\nParticipant characteristics based on the number of time points with severe LBP.\n7%) did not have severe pain at either baseline or follow-up, 205 (32.\n2%) had severe pain at one time point, and 94 (14.\n9%) had severe pain at both time points (Table 2).\nage (no severe LBP 45.\n6 years, severe LBP at one time point 45.\n2, severe LBP at two time points 45.\n05), proportion of women (57.\nHowever, there were differences between the pain groups in mean (SD) BMI (26.\n05), as well as a greater percentage of individuals with a previous history of surgery for LBP in those with severe pain at one and two time points (14.\n5%) compared with those with no severe LBP (5.\nIn addition, there was an increasing percentage of individuals reporting catastrophization (6.\n8%), fear of movement (12.\n7%), and depression (10.\nRelationship between psychological characteristics and the number of time points with severe LBP.\nBoth univariate and multivariable analyses, with adjustment for age, gender, and BMI, symptom duration, showed that catastrophization, fear of movement, anxiety, and depression were positively associated with the number of time points with severe LBP (Table 3).\nThe effect size was largest for catastrophization (multivariable 1: risk ratio [RR] 2.\n01) and smallest for anxiety (RR 1.\nWhen adjustment was added for all other psychological factors, the association remained significant for catastrophization (multivariable 2: RR 1.\n01), fear of movement (RR 1.\n03), and depression (RR 1.\n8) Fear of movement, n (%) 42 (12.\n2) Anxiety, n (%) 231 (70.\n7) Depression, n (%) 33 (10.\nCurrent, typical, and worst pain in the past 2 weeks were scored on the visual analogue scale (VAS).\nAverage pain was calculated, with severe pain defined as an average score of 7/10 [18].\nPeople were defined as having a positive screening test if they scored above 7/10 for catastrophization, fear of movement or depression, or 2/10 for anxiety, according to published criteria [16].\nThe participant characteristics of those with and without a history of spinal surgery for LBP, depression, and work dissatisfaction are presented in Supplementary Tables 1 to 3.\nWhen examining individuals who had a history of spinal surgery for LBP, multivariable analyses showed that the association between psychological factors and severe pain may be similar to those with no history of spinal surgery (Supplementary Table 4).\nThis was with the exception of the results for anxiety, which suggested that those with a history of spinal surgery may have a higher risk of anxiety associated with severe pain (RR: 2.\nWe found a similar result when we investigated individuals that reported depression.\nAlthough multivariable analyses suggested that the association between psychological factors and severe pain was similar between those with and without depression (Supplementary Table 6), the results indicated that those with depression may have a higher risk of anxiety associated with severe pain (RR 2.\n36) than those without depression (RR 1.\nThese findings suggest that future studies should examine the role of anxiety either as a risk factor or outcome for severe pain in individuals with a history of surgery or depression.\n1%) reported two time points with severe disability (Table 4).\nThere was no difference across these groups in mean (SD) age (no severe disability 45.\n2 years, one time point with severe disability 45.\n05) or median (IQR) work satisfaction (2[3], 2[3], 2[5] p>.\nHowever, mean BMI was significantly lower in those without severe disability than those with severe disability at one or two time points (25.\n05), and median (IQR) symptom duration was shorter in those with severe low back disability at one time point than both other categories (0.\nIn addition, the percentage of individuals with a previous history of surgery for LBP was greater in those without severe disability at both time points (20.\nThe percentage of individuals with a positive screening test for each psychological factor across no, one or two time points of severe low back pain.\nRR, risk ratio; 95% CI, 95% confidence interval.\n* Multivariable model 1 adjusted for age, gender, body mass index, and symptom duration.\ny Multivariable model 2 adjusted for age, gender, body mass index, symptom duration and all other psychological factors.\nRelationship between psychological factors and the number of time points with severe low back disability.\nThere was an association between all psychological characteristics and the number of time points with severe disability in both univariate and multivariable analysis, after adjusting for age, gender, BMI, and symptom duration.\nSimilar to the results for severe LBP, the effect size was largest for catastrophization (multivariable 1: RR 2.\nIn the second multivariable analysis, which adjusted for all psychological factors as well as age, gender, BMI, and symptom duration, the association between both catastrophization and depression, and severe disability from LBP remained significant (catastrophization RR 1.\n01; depression RR 1.\nWhen examining individuals who had a history of spinal surgery for LBP, multivariable analyses showed that the association between psychological factors and severe disability is similar to those without a history of spinal surgery.\nNo severe disability Severe low back disability at either baseline or follow-up.\n3%) Age (y), mean (SD) 45.\n7) Females, n (%) 134 (57.\n6) BMI (kg/m2), mean (SD) 25.\n0) Symptom duration (y), median (IQR) 0.\n2) Previous history of surgery for LBP, n (%) 12 (5.\n2) Work satisfaction, median (IQR) 2 (3) 2 (3) 2 (5) Catastrophization, n (%) 8 (3.\n4) Fear of movement, n (%) 24 (10.\nLBP, low back pain; SD, standard deviation; BMI, body mass index; IQR, interquartile range.\nSevere disability was defined as a score of 14/23 [20].\nIndividuals were defined as having a positive screening test if they scored above 7/10 for catastrophization, fear of movement, or depression, or 2/10 for anxiety, according to published criteria [16].\nThis 1-year, prospective cohort study found that catastrophization, fear of movement, depression, and anxiety were associated with persistent, severe LBP, and disability, after adjusting for age, gender, BMI, and symptom duration.\nFurthermore, after adjusting for all of the psychological factors, only catastrophization and depression remained significantly associated with reporting persistent, severe LBP, and disability.\nThese findings suggest that a variety of psychological characteristics are risk factors for severe LBP and disability, but that catastrophization and depression are particularly important in high levels of persistent, severe pain, and disability, highlighting the need to consider these factors when examining outcome studies for LBP.\nThis study found almost half of the participants reported severe LBP (47.\n3%) or disability (57.\n3% experiencing persistent, severe LBP, or disability, respectively.\nThese data highlight that not only are high levels of pain and disability common in a secondary care population with LBP of at least 2 months duration, but that persistence of severe pain and disability is also a major problem.\nThis is consistent with previous data which indicate that 35% of people with varying levels of LBP report persistence of their pain [3], and that previous episodes of LBP have been found to be the most consistent predictor of future episodes [21].\nMoreover, it is recognized that persistent LBP is complex and can affect all aspects of an individuals life, including their family, social and work activities, which in turn can lead to psychosocial issues and reliance on addictive medications [57].\n2% experienced fear of movement, and 80.\n5% suffered from anxiety and depression, respectively.\nThe significant proportion of psychological comorbidities identified in this cohort highlights the need to consider a biopsychosocial approach to management of severe, persistent LBP in these individuals.\nA range of different psychological factors, including catastrophization, fear of movement, anxiety, and depression, were found to be important risk factors for persistent, severe LBP, and disability.\nHowever, only catastrophization and depression were found to be independently associated with both severe LBP and disability.\nPeople who catastrophize were found to have 1.\n7 times the average number of time points with severe LBP and disability respectively, and depressed individuals had 1.\n3 times the average number of time points with severe pain and disability.\nAlthough these findings are consistent with systematic reviews which have found both catastrophizing [11] and depression to be associated with LBP [810], the reviews did not specifically examine the severity of the pain, or the relationship of these factors with disability.\nMoreover, there is a lack of longitudinal studies in the field [9], and limited use of validated cut-off values to ensure that meaningful levels of these psychological factors are examined [11].\nThe current study was longitudinal, used validated screening questions and cut-off values for all psychological factors, and investigated both severe pain and disability.\nThe study findings show an association between psychological factors and the primary outcomes of LBP and disability and highlight the importance of considering these factors when designing and evaluating outcomes studies.\nThe current study did not find clear evidence for an association between fear of movement or anxiety and the number of time points with severe LBP and disability, when adjustment was included for other psychological variables.\nThis is consistent with systematic reviews which have found no evidence for an association between fear avoidance and measures of LBP and disability [13,14], and only an association with return to work outcomes in people with subacute LBP (defined as 412 weeks [13] and 612 weeks [14]), not chronic LBP (>12 weeks in both reviews).\nSimilarly, a systematic review found that anxiety is not prognostic for LBP [12] and while a subsequent longitudinal study did find a combined depression/anxiety variable to predict more severe LBP and disability, it also tested the two variables individually finding no effects for anxiety [22].\nTaken together, these results suggest that fear of movement and anxiety may play a key role in the early, subacute phases when beliefs guide the course of LBP and there is a risk of persistence, but may not be as important in.\nthe later stages when the condition has become persistent, beliefs about LBP have been solidified and there is an understanding about the effect of activity on pain.\nThere is growing evidence to indicate that interventions, such as behavioral treatment, targeted at psychological factors are effective in the management of chronic LBP.\nBehavioral treatment, also referred to as cognitive behavioral treatment, is based on a multidimensional model of pain that includes physical, affective, cognitive, and behavioral components, and involves education about pain, how to identify pain-aggravating situations, the influence of thoughts and behavior, and role of coping strategies and relaxation and breathing on pain [23].\nA recent systematic review for the American College of Physicians reaffirmed the results of an earlier Cochrane systematic review, which reported that behavioral treatments for LBP, including operant, respondent and cognitive behavioral therapy, are effective in reducing pain intensity, and respondent therapy is effective in reducing disability compared with usual care [23,24].\nHowever, although these treatments were found to be effective for chronic LBP and disability compared with usual care in the short term (<6 months post-treatment), this was not the case over the intermediate to longer term [23], resulting in recommendations for a greater understanding of the psychological factors that have the strongest influence on a patients experience of LBP.\nMoreover, the lack of evidence for behavioral treatments over the longer term may result from chronic, nonspecific LBP being considered a single entity, rather than a complex heterogeneous condition, in which only specific patient phenotypes with psychological comorbidities require behavioral treatment.\nWe found catastrophization and depression to be independently associated with persistent, severe LBP, and disability in individuals with LBP in secondary care.\nThese findings highlight the exciting potential for future studies to examine psychological outcomes throughout the treatment course to determine if early treatment of pain prevents the development of psychological problems, and conversely, if early treatment of psychological factors assists in resolving back pain in certain patient phenotypes.\nHowever, when baseline demographic characteristics were compared between those with and without outcome data at follow-up, there was no significant difference in patient characteristics, such as BMI, pain levels, history of spinal surgery for LBP, and psychological characteristics.\nA key strength of this study was its design: a large, prospective, cohort study with a 1-year follow-up of individuals with LBP.\nWe used validated, clinically relevant measures,.\nincluding the average of three NRS scales for pain intensity, the Roland-Morris Disability Questionnaire for low backrelated disability and a screening questionnaire to assess psychological factors.\nIn addition, we adjusted regression models for all psychological factors to determine the independent relationship of individual psychological factors with the number of episodes of severe LBP and disability.\nThis study showed that persistent, severe LBP, and disability are common in a secondary care population with LBP and are associated with a variety of psychological risk factors, in particular catastrophization and depression, highlighting the importance of considering these factors when designing and evaluating outcome studies for LBP.\n[4] Machado GC, Maher CG, Ferreira PH, Latimer J, Koes BW, Steffens D, et al.\nCan recurrence after an acute episode of low back pain be predicted? Phys Ther 2017;97:88995.\nPrevention and treatment of low back pain: evidence, challenges, and promising directions.\n[6] Chou R, Deyo R, Friedly J, Skelly A, Hashimoto R, Weimer M, et al.\nNoninvasive treatments for low back pain.\nWhat low back pain is and why we need to pay attention.\nA systematic review of psychological factors as predictors of chronicity/disability in prospective cohorts of low back pain.\nSymptoms of depression as a prognostic factor for low back pain: a systematic review.\nSymptoms of depression and risk of new episodes of Low back pain: a systematic review and meta-analysis.\nCatastrophizinga prognostic factor for outcome in patients with low back pain: a systematic review.\nPsychosocial risk factors for chronic low back pain in primary carea systematic review.\nThe role of fear avoidance beliefs as a prognostic factor for outcome in patients with nonspecific low back pain: a systematic review.\nSystematic review of prognostic factors for return to work in workers with subacute and chronic low back pain.\nThe concurrent validity of brief screening questions for anxiety, depression, social isolation, catastrophization, and fear of movement in people with low back pain.\nLow back pain rating scale: validation of a tool for assessment of low back pain.\nThe association between pain and disability.\nResponsiveness and minimal clinically important difference for pain and disability instruments in low back pain patients.\nA study of the natural history of low-back pain.\nPart II: development of guidelines for trials of treatment in primary care.\nRisk of recurrence of low back pain: a systematic review.\nJ Orthop Sport Phys Ther 2017;47:30513.\nLongitudinal associations between depression, anxiety, pain, and pain-related disability in chronic pain patients.\nBehavioural treatment for chronic low-back pain.\nNonpharmacologic therapies for low back pain: a systematic review for an American College of Physicians Clinical Practice guideline."}