{"title": "42.pdf", "contents": "Abstract: Within a biopsychosocial framework, psychological factors are thought to play an important role in the onset and progression of chronic pain.\nThe cognitive-behavioral fear-avoidance model of chronic pain suggests that pain-related fear contributes to the development and maintenance of pain-related disability.\nThe main goal of the current meta-analysis was to synthesize findings of studies investigating cross-sectional associations between pain-related fear and disability in order to estimate the magnitude of this relation.\nSearches in PubMed and PsycINFO yielded a total of 46 independent samples (N = 9,579) that reported correlations between pain-related fear and disability among persons experiencing acute or chronic pain.\nThe positive relation between pain-related fear and disability was observed to be moderate to large in magnitude, and stable across demographic and pain characteristics.\nPerspective: Results of this meta-analysis indicate a robust, positive association between pain-related fear and disability, which can be classified as moderate to large in magnitude.\nConsistent with the fear-avoidance model of chronic pain, these findings suggest that pain-related fear may be an important target for treatments intended to reduce pain-related disability.\nChronic pain has been associated with a variety of negative outcomes, including increased absence from work and unemployment,4 reduced participation in social and recreational activities,10 lower perceived social support,6 increased rates of psychiatric disorders and suicidality,32,84 and disability.\nPain-related disability encompasses a variety of domains including deficits in physical, occupational, recreational, and social.\nGiven the substantial impact that chronic pain has on individuals and health care systems, factors that may contribute to the development of pain-related disability have received considerable empirical attention.\nAccording to the biopsychosocial model of chronic pain, psychological factors (eg, pain-related fear) contribute to the onset and progression of both pain and disability.\n23 In accord with a cognitive-behavioral perspective, the fear-avoidance model of chronic pain posits that pain-related fear activates avoidance mechanisms, resulting in the avoidance of movement and activity.\nThis model was originally developed to explain the transition from acute to chronic low-back pain.\n41,81-83,86 Although avoidance behaviors may be adaptive in the context of acute pain (eg, by allowing an acute injury to heal), long-term avoidance of physical activity is thought to impair daily functioning and result in greater physical disability.\nby the National Institute on Drug Abuse.\nDitre, PhD, Department of Psychology, Syracuse University, Syracuse, NY 13244.\nThe Journal of Pain, Vol 14, No 10 (October), 2013: pp 1019-1030 Available online at www.\nA growing body of research supports the notion that pain-related fear may contribute to the development of chronic pain and pain-related disability.\nAn initial qualitative review of the fear-avoidance model revealed that pain-related fear was associated with reduced physical performance, expectancies for greater pain, and greater self-reported disability.\nFollowing an increase in primary studies, Leeuw et al completed a second qualitative review of the fear-avoidance model in chronic low-back pain.\n40 These authors concluded that fear-avoidance behaviors likely contribute to the maintenance of chronic pain and that there is evidence to suggest that pain-related fear may serve as a risk factor for the development of chronic low-back pain.\nThe variability observed across studies may suggest the presence of moderating factors, though little is known regarding the circumstances in which the strength of this relation may vary.\nTherefore, the main goal of the current study was to estimate the magnitude of the relation between pain-related fear and self-reported disability among persons reporting acute or chronic pain.\nFirst, we sought to estimate the average correlation after correcting for sampling error and artifacts (ie, reliability of predictor and criterion variables) across primary studies.\nWe then sought to test the influence of potential moderating factors, including measurement variability, participant demographics, and pain characteristics.\nFor example, subgroup analyses were conducted to estimate the average correlation between pain-related fear and disability within different pain conditions and for individual measures of painrelated fear and disability.\nSelection of Predictor Variables Pain-related fear is typically measured via self-report instruments that assess fear of experiencing pain, fear of activities that may elicit pain (eg, work and physical activity), fear of movement/(re)injury, and pain-related anxiety.\nAll studies that included at least 1 self-report measure of pain-related fear were eligible for inclusion in the current analyses.\nSelection of Criterion Variables Pain-related disability has been identified as a core outcome measure that should be assessed in all trials involving patients with chronic pain.\n18 Patient perceptions of disability can be reliably assessed via both general and condition-specific self-report measures that assess impaired functioning across a variety of domains, including self-care, physical activity, and social.\nRecords excluded for the following  reasons: not related to the topics of.\nRecords after duplicates removed (n = 787).\nAll studies included in this meta-analysis incorporated at least 1 self-report measure of disability (see Table 1).\nPrimary studies that tested associations between pain-related fear and disability have employed a variety of self-report measures to assess both constructs.\nWith regard to predictor measures, although some directly assess fear of experiencing pain,47,65 others assess beliefs that pain may be indicative of serious injury or that pain may be worsened by movement,49,75,87 and only a few assess specific avoidance behaviors.\nWith regard to criterion disability measures, a relatively small proportion assesses how pain may interfere with factors such as mood,8,59 sexual activity,19,29,56 and sleep,8,29,37,59,80 and researchers have expressed concern that some disability measures may be susceptible to floor and ceiling effects, possibly as a function of disability severity.\n58 Given the observed variability in predictor and criterion measures, we sought to test whether the association between pain-related fear and disability may be moderated by the type of measure used across primary studies.\nWe also sought to examine whether the magnitude of this association may vary across subscales within a single measure.\nAmong persons with chronic pain, age and gender differences have been observed with regard to pain reporting (eg, pain intensity), treatment outcomes, and health-related quality of life.\n20,60,61 Therefore, we sought to test whether average age or gender composition of the sample moderated the relation between pain-related fear and disability.\nFirst, although pain intensity has not traditionally been included in the fear-avoidance model, it has been positively associated with greater disability.\n25 Therefore, we tested average self-reported pain intensity (typically measured on a 010 scale) as a potential moderator of the relation between pain-related fear and disability.\nSecond, given that treatment-seeking chronic pain patients may report more severe/enduring pain, we also tested treatment status (treatment-seeking vs nontreatment-seeking) as a potential moderator.\nThird, the extent to which pain duration may moderate the relationship between pain-related fear and disability remains unclear.\nFor example, the fear avoidance model predicts that pain-related fear is a precursor to pain-related disability, so it may be that pain-related fear is more strongly related to disability at the onset of a chronic pain condition.\nTherefore, we tested chronic pain duration as a potential moderator.\npain-related fear and disability has since been tested among persons with a variety of chronic pain conditions, and there is reason to believe that the model may apply across types of pain.\nData Extraction Data were coded by 2 independent reviewers.\nFor each study, the sample size, demographic variables (ie, age, gender composition), and correlations (r) between pain-related fear and disability were recorded.\nWith regard to measures of pain-related fear and disability, coders documented which measures had been utilized and the reliability coefficient (a) for each measure.\nThe primary pain type was coded as low-back pain or other (eg, nonspecific pain, whiplash).\nAlthough no standard has been agreed upon, acute and chronic pain are typically distinguished by cut-offs within a range of 3 to 12 months.\nPain duration was coded only for primary studies that reported relevant inclusion criteria (ie, minimum pain duration).\nIn instances in which minimum pain duration was not reported, pain duration was coded based on the reported measure of central tendency (eg, mean duration).\nAverage pain intensity ratings (ie, numerical rating scale, 010 or 0100) were also coded.\nFinally, gender composition of the sample was coded as the percentage of the total sample that was female.\nData Analytic Approach Effect size estimates were derived using methods outlined by Hunter and Schmidt.\n31 Two sets of metaanalytic calculations were conducted in order to estimate the magnitude of the relation between pain-related fear and disability before and after correction for reliability artifacts.\nFirst, a random-effects model that corrects for sampling error in primary studies was used to generate the average sample sizeweighted correlation (r) and to determine the amount of variance attributable to sampling error.\nSecond, calculations were conducted using the artifact distribution method, which yields the average correlation (r) corrected for artifacts in the primary studies.\n31 These analyses employed corrections for reliability (a) of predictor (pain-related fear) and criterion (disability) measures reported across primary studies.\nTwo types of moderator analyses were conducted.\nSimilar to our estimate of the overall effect size, the average sample sizeweighted correlation was calculated using a random-effects model, and the artifact distribution method was used to generate an effect size estimate that also corrected for reliability of the predictor and criterion measures.\nRisk of availability bias was assessed using formulas for file drawer analyses provided by Hunter and Schmidt.\n31 Analyses calculated the number of studies with null findings that would be needed in order to reducethe averagecorrelation to practicalinsignificance.\nPredictor: Pain-related fear All measures.\n09 2,729 13 FABQ.\n09 113 2 FABQ-PA.\n08 2,433 12 PASS.\n96  296 1 Criterion: Disability All measures.\n04 1,911 5 QBPDS.\nReliability coefficients were not provided for the Pictorial Fear of Activity ScaleCervical, Functional Disability Index, Shoulder Pain and Disability Index, Disability Rating Index, Child Activities Limitations Interview, and Disability of the Arm, Shoulder, and Hand Questionnaire.\n1022 The Journal of Pain Pain-Related Fear and Disability.\nSpecifically, we calculated the number of studies required to reduce the correlation between pain-related fear and disability below that which could be considered a small effect size (ie, to a correlation of.\nStudy Coding The meta-analysis included 46 independent samples (N = 9,579) from 41 primary studies.\nWith regard to moderator analyses, pain intensity data were available for 37 samples.\nAdequate information that allowed for classification of pain duration was reported in a total of 40 samples.\nCoded variables from each sample are presented in Table 3.\nInitial agreement between the 2 independent raters was 85%, and consensus reached 100% via discussion and reference to the coding manual.\nEstimate of the Average Correlation Between Pain-Related Fear and Disability Results of all meta-analytic calculations are presented in Table 4.\n42, which can be classified as moderate to large in magnitude.\n11 Results indicated that approximately 35% of the variance observed in the sample correlations was accounted for by sampling error.\nAfter correcting for reliability in the criterion and predictor variables, the average corrected correlation (r) between pain-related fear and disability was.\n50, which can be classified as a large effect.\nApproximately 41% of the variance observed in the sample correlations was found to be attributable to sampling error and reliability artifacts of pain-related fear and disability measures.\nA total of 43 samples reported individual correlations between disability and the 2 subscales (ie, physical activity, work) of the Fear-Avoidance Beliefs Questionnaire (FABQ).\n87 Both the sample sizeweighted correlations and the average corrected correlations were greater when pain-related fear was measured with the Physical Activity subscale (r =.\nA greater percentage of the variance attributable to sampling error was also observed when pain-related fear was measured with the Physical Activity subscale relative to the Work subscale.\nAdditional analyses were conducted to test whether the magnitude of the relation between pain-related fear and disability varied between studies that used the FABQ or the Tampa Scale for Kinesiophobia.\nOverlapping confidence intervals were observed around both the average sample-size weighted correlation (r) and the average corrected correlation (r), which indicated that the relation between pain-related fear and disability remained stable when measured with either the FABQ or the Tampa Scale for Kinesiophobia.\nWhen meta-analytic calculations were performed separately for each type of disability measure, the average sample sizeweighted correlation ranged from.\n45, and the average corrected correlation ranged from.\nIn both cases, the lowest correlations were estimated from primary studies that utilized the Neck Disability Index,80 and the highest correlations were estimated from primary studies that utilized the Pain Disability Index.\n56 However, large, overlapping confidence intervals indicated that the type of disability measure may not moderate the relation between pain-related fear and disability.\nResults indicated that neither average age (r =.\n75) nor the gender composition of the sample (r =.\n96) moderated the association between pain-related fear and disability.\nPain intensity was tested as both a categorical and a continuous moderator.\nFirst, a median split was utilized to categorize samples as either high (k = 18) or low (k = 19) intensity, and meta-analytic calculations were conducted separately for each group.\nSimilar results were observed when pain intensity was tested as a continuous moderator (r =.\nThe estimated correlation between pain-related fear and disability did not differ as a function of pain location, pain duration, type of chronic pain condition, or whether samples were derived from treatmentseeking populations.\nTwo methods were used to estimate the magnitude of the relation between pain-related fear and disability among persons experiencing acute or chronic pain.\n45 Boersma and Linton (2006)2 141 TSK activity; TSK somatic RMDQ.\n50 Calley et al (2010)5 80 FABQ-W; FABQ-PA; TSK ODI.\nSample 1 147 FABQ-W; FABQ-PA QBPDS.\n10 Sample 2 70 FABQ-W; FABQ-PA QBPDS.\n50  LBP No No Yes 48.\n97 Other   Yes 72.\nSample 1 35 FABQ-W; FABW-PA; TSK-13 RMDQ.\nSample 2 31 TSK; PASS RMDQ.\nSample 1 210 TSK PDI.\n80 Sample 2 161 TSK PDI.\n00 French et al (2007)21 200 FABQ-W; FABQ-PA; TSK QBPDS.\n20 Fritz et al (2001)22 78 FABQ-W; FABQ-PA ODI.\n46 LBP Yes Yes Yes  Gauthier et al (2006)24 255 TSK PDI.\n67 Other   Yes  Gheldof et al (2006)25 890 TSK QBPDQ; PDI.\n28 LBP Yes Yes No 47.\n51 LBP No No Yes 59.\n93 Other Yes Yes Yes 46.\n94 Other No No Yes 70.\n89 LBP Yes Yes Yes 6.\n92 LBP No  Yes 5.\nMcCracken et al (1996)46 45 FABQ-W; FABQ-PA; FABQ PDI.\n67 LBP No No Yes 5.\nPedler and Sterling (2011)53 96 TSK-17; PFActS-C NDI.\n24 Other Yes Yes No 3.\nPeters et al (2005)54 100 PASS-20; TSK QBPDS.\n00 LBP No No Yes 69.\n00 Samwel et al (2007)63 181 TSK PDI.\n27 Other No Yes Yes 5.\n61 LBP Yes Yes Yes 40.\n65  LBP Yes Yes Yes 59.\n30  LBP Yes Yes Yes 59.\n00  LBP Yes Yes Yes  Thomas et al (2010)70 50 FABQ-W; FABQ-PA; TSK RMDQ.\n13 Other No No Yes 1.\n89 LBP No Yes Yes 4.\n87 LBP No No Yes  Verbunt et al (2003)78 37 TSK-17 RMDQ.\n73 LBP No No Yes  Vernon et al (2011)79 91 TSK-17 NDI.\n15 Other No Yes Yes 68.\n52 LBP No No Yes 51.\n19 Other   Yes 6.\n81 Other No Yes Yes 6.\nMeta-Analysis Results for the Correlation Between Pain-Related Fear and Disability.\n52 0 100   QBPDS 3,487 7.\n58 Pain intensity High 5,605 18.\n65 Pain duration = 3 mo <3 mo 4,958 10.\n63 >3 mo 3,380 29.\n59 Seeking pain treatment No 4,104 7.\nThus, it appears that the magnitude of the relationship can be classified as moderate to large.\nResults were stable across demographic and pain characteristics.\nThe average sample sizeweighted correlations and the average corrected correlations did not vary as a function of sample age, gender composition, average pain intensity, pain location, pain duration, or whether the sample was derived from a population that was seeking pain-treatment.\nResults from the current meta-analysis suggest that the relationship between pain-related fear and disability is relatively large and stable across demographic and pain characteristics.\nAssessment for risk of availability bias also indicated that a large number of missing studies would be required to reduce this association to practical insignificance.\nThe current findings are consistent with the fear-avoidance model of chronic pain, which posits that pain-related fear may contribute to greater disability among persons with chronic pain.\nImportantly, the fear-avoidance model also predicts that reductions in pain-related fear may improve pain-related disability outcomes, and pain-related fear has been identified as a target for pain treatment.\n40 Indeed, cognitivebehavioral therapy has been shown to reduce reported levels of pain-related fear,3 and there is some evidence to suggest that persons high in pain-related fear may benefit from behavioral interventions that increase physical activity.\nThis finding may reflect a multidimensional conceptualization of disability, which extends beyond occupational functioning to include social, recreational, and general physical (eg, sleep, self-care) functioning.\nAs such, it may suggest that fear of general physical activity (vs work-related activity) is a stronger predictor of global levels of pain-related disability.\nAdditional research is needed to determine the clinical significance of this finding.\nFor example, settings that aim to reduce patient burden may investigate whether administration of only the FABQ Physical Activity Subscale (4 items) is sufficient for predicting disability or guiding interventions that target pain-related fear in clinical populations.\nGiven the observed strength of association between pain-related fear and disability, it is notable that pain characteristics (eg, duration, intensity) did not moderate this relation.\nFor example, the current results demonstrated a robust relation between pain-related fear and disability, even among persons experiencing acute pain (ie, less than 3 months).\nthe fear-avoidance model of chronic pain, in that pain-related fear may predict disability following acute injury, and that pain-related fear may serve to maintain disability in the presence of recurring pain.\nFuture research may examine the extent to which reducing pain-related fear following acute injury may impede progression to chronic pain.\nFor example, there is some evidence to suggest that reductions in pain-related fear are associated with recovery following acute injury.\nAlthough pain intensity was not observed to moderate the relation between pain-related fear and disability in the current study, pain intensity has been associated with negative outcomes, including disability,22 depression,15 and suicidal ideation.\n66 Thus, these findings should not preclude future investigations of how pain characteristics may influence treatments that address pain-related fear, as such outcomes may vary as a function of pain duration and/or intensity.\nSimilarly, although these results indicated that average age and gender composition of the sample did not moderate the relation between pain-related fear and disability, both have been associated with paintreatment outcomes,20,28 and future research would benefit from examining how sociodemographic characteristics may influence the outcomes of treatments that target pain-related fear.\nFuture studies should also explore additional psychosocial variables (eg, attentional processes, negative affectivity, emotion regulation) that may moderate the relation between pain-related fear and disability.\nFor example, greater attention to pain has been associated with increased emotional distress and reduced psychosocial functioning among persons with chronic pain,45 and reductions in pain-related fear have been associated with decreased pain-related attentional bias following pain-treatment.\n16 Similarly, affect and emotion regulation have been associated with pain reactivity, and engagement of maladaptive emotion regulation strategies (eg, suppression) has been associated with negative paintreatment outcomes.\nTo our knowledge, the current investigation provides the first meta-analytic estimate of the magnitude of the relation between pain-related fear and disability.\nFirst, primary studies were cross-sectional investigations, which preclude inferences of causality.\nTherefore, our tests of pain duration as a moderator were likely limited by the extent to which samples could be categorized as acute or chronic in nature.\nwere unable to test relations between pain-related fear, disability, and other potentially relevant individual differences (eg, affect) because of the small number of primary studies that reported such data.\nIn summary, results of the current meta-analysis indicated a robust relation between pain-related fear and disability, which can be classified as moderate to large in magnitude.\nThe magnitude of this relation was observed to be stable across relevant demographic and pain characteristics.\nConsistent with these findings, pain-related fear has been identified as an important target for pain treatment, and evidence suggests that.\nreductions in pain-related fear may be associated with improved treatment outcomes.\n53 Future research should seek to identify potential pain-related, psychosocial, and sociodemographic factors that may influence the course and outcomes of treatments designed to target pain-related fear.\nAyre M, Tyson GA: The role of self-efficacy and fear-avoidance beliefs in the prediction of disability.\nBoersma K, Linton SJ: Expectancy, fear and pain in the prediction of chronic pain and disability: A prospective analysis.\nBailey KM, Carleton RN, Vlaeyen JW, Asmundson GJ: Treatments addressing pain-related fear and anxiety in patients with chronic musculoskeletal pain: A preliminary review.\nCogn Behav Ther 39:46-63, 2010.\nBraden JB, Zhang L, Zimmerman FJ, Sullivan MD: Employment outcomes of persons with a mental disorder and comorbid chronic pain.\nCalley DQ, Jackson S, Collins H, George SZ: Identifying patient fear-avoidance beliefs by physical therapists managing patients with low back pain.\nJ Orthop Sports Phys Ther 40:774-783, 2010.\nCarr JL, Moffett JA: The impact of social deprivation on chronic back pain outcomes.\nCleeland CS, Ryan KM: Pain assessment: Global use of the Brief Pain Inventory.\nCleland JA, Fritz JM, Childs JD: Psychometric properties of the Fear-Avoidance Beliefs Questionnaire and Tampa Scale of Kinesiophobia in patients with neck pain.\nCloss SJ: The impact of neuropathic pain on relationships.\nCohen J: Statistical Power Analysis for the Behavioral Sciences, 2nd ed.\nCook AJ, Brawer PA, Vowles KE: The fear-avoidance model of chronic pain: Validation and age analysis using structural equation modeling.\nCoudeyre E, Tubach F, Rannou F, Baron G, Coriat F, Brin S, Revel M, Poiraudeau S: Fear-avoidance beliefs about back pain in patients with acute LBP.\nCrombez G, Vlaeyen JWS, Heuts PHTG, Lysens R: Painrelated fear is more disabling than pain itself: Evidence on the role of pain-related fear in chronic back pain disability.\nCurrie SR, Wang J: Chronic back pain and major depression in the general population.\nDehghani M, Sharpe L, Nicholas MK: Modification of attentional biases in chronic pain patients: A preliminary study.\nDenison E, Asenlof P, Lindberg P: Self-efficacy, fear avoidance, and pain intensity as predictors of disability in subacute and chronic musculoskeletal pain patients in primary health care.\nDworkin RH, Turk DC, Farrar JT, Haythornthwaite JA, Jensen MP, Katz NP, Kerns RD, Stucki G, Allen RR, Bellamy N, Carr DB, Chandler J, Cowan P, Dionne R, Galer BS, Hertz S, Jadad AR, Kramer LD, Manning DC, Martin S, McCormick CG, McDermott MP, McGrath P, Quessy S, Rappaport BA, Robbins W, Robinson JP, Rothman M, Royal MA, Simon L, Stauffer JW, Stein W, Tollett J, Wernicke J, Witter J: Core outcome measures for chronic pain clinical trials: IMMPACT recommendations.\nFairbank JC, Couper J, Davies JB, OBrien JP: The Oswestry Low Back Pain Disability Questionnaire.\nFillingim RB, King CD, Ribeiro-Dasilva MC, RahimWilliamsB,RileyJL3rd:Sex,genderandpain:Areviewofrecent clinical and experimental findings.\nFritz JM, George SZ, Delitto A: The role of fear-avoidance beliefs in acute low back pain: Relationships with current and future disability and work status.\nGatchel RJ, Peng YB, Peters ML, Fuchs PN, Turk DC: The biopsychosocial approach to chronic pain: Scientific advancesandfuturedirections.\nGauthier N, Sullivan MJL, Adams H, Stanish WD, Thibault P: Investigating risk factors for chronicity: The importance of distinguishing between return-to-work status and self-report measures of disability.\nGheldof ELM, Vinck J, Van den Bussche E, Vlaeyen JWS, Hidding A, Crombez G: Pain and pain-related fear are associated with functional and social disability in an.\noccupational setting: Evidence of mediation by pain-related fear.\nGrotle M, Garratt AM, Krogstad Jenssen H, Stuge B: Reliability and construct validity of self-report questionnaires for patients with pelvic girdle pain.\nGrotle M, Vllestad NK, Veierd MB, Brox JI: Fear-avoidance beliefs and distress in relation to disability in acute and chronic low back pain.\nHill JC, Lewis M, Sim J, Hay EM, Dziedzic K: Predictors of poor outcome in patients with neck pain treated by physical therapy.\nHudak PL, Amadio PC, Bombardier C: Development of an upper extremity outcome measure: The DASH (Disabilities of the Arm Shoulder and Hand).\nAm J Ind Med 29: 602-608, 1996.\nHuis in t Veld RMHA, Vollenbroek-Hutten MMR, Groothuis-Oudshoorn KCGM, Hermens HJ: The role of the fear-avoidance model in female workers with neckshoulder pain related to computer work.\nIlgen MA, Zivin K, McCammon RJ, Valenstein M: Pain and suicidal thoughts, plans and attempts in the United States.\nKall LB: Psychological determinants of quality of life in patients with whiplash associated disorders: A prospective study.\nKeefe FJ, Lumley M, Anderson T, Lynch T, Carson K: Pain and emotion: New research directions.\nKlaber Moffett JA, Carr J, Howarth E: High fear-avoiders of physical activity benefit from an exercise program for patients with back pain.\nKoho P, Aho S, Watson P, Hurri H: Assessment of chronic pain behaviour: Reliability of the method and its relationship with perceived disability, physical impairment and function.\nKopec JA, Esdaile JM, Abrahamowicz M, Abenhaim L, Wood-Dauphinee S, Lamping DL, Williams JI: The Quebec Back Pain Disability Scale: Conceptualization and development.\nKovacs F, Abraira V, Cano A, Royuela A, Gil del Real MT, Gestoso M, Mufraggi N, Muriel A, Zamora J: Fear avoidance beliefs do not influence disability and quality of life in Spanish elderly subjects with low back pain.\nKovacs FM, Muriel A, Medina JM, Abraira V, Sanchez MD, Jauregui JO: Psychometric characteristics of the Spanish version of the FAB questionnaire.\nLeeuw M, Goossens ME, Linton SJ, Crombez G, Boersma K, Vlaeyen JW: The fear-avoidance model of musculoskeletal pain: Current state of scientific evidence.\nMartin AL, McGrath PA, Brown SC, Katz J: Anxiety sensitivity, fear of pain and pain-related disability in children and adolescents with chronic pain.\nMcCracken LM: Attention to pain in persons with chronic pain: A behavioral approach.\nBehav Ther 28: 271-284, 1997.\nMcCracken LM, Gross RT, Aikens J, Carnrike CLM Jr: The assessment of anxiety and fear in persons with chronic pain: A comparison of instruments.\nMcCracken LM, Zayfert C, Gross RT: The Pain Anxiety Symptoms Scale: Development and validation of a scale to measure fear of pain.\nMeyer K, Tschopp A, Sprott H, Mannion AF: Association between catastrophizing and self-rated pain and disability in patients with chronic low back pain.\nJ Rehabil Med 41: 620-625, 2009.\nMiller RP, Kori S, Todd D: The Tampa Scale: A measure of kinesiophobia.\nMintken PE, Cleland JA, Whitman JM, George SZ: Psychometric properties of the Fear-Avoidance Beliefs Questionnaire and Tampa Scale of Kinesiophobia in patients with shoulder pain.\nArch Phys Med Rehabil 91:1128-1136, 2010.\nPalermo TM, Witherspoon D, Valenzuela D, Drotar D: Development and validation of the Child Activity Limitations Interview: A measure of pain-related functional impairment in school-age children and adolescents.\nPedler A, Sterling M: Assessing fear-avoidance beliefs in patients with whiplash-associated disorders: A comparison of 2 measures.\nPeters ML, Vlaeyen JWS, Weber WEJ: The joint contribution of physical pathology, pain-related fear and catastrophizing to chronic back pain disability.\nPhilips CJ: The cost and burden of chronic pain.\nPollard CA: Preliminary validity study of the pain disability index.\nRoach KE, Budiman-Mak E, Songsiridej N, Lertratanakul Y: Development of a shoulder pain and disability index.\nRoland M, Fairbank J: The Roland-Morris Disability Questionnaire and the Oswestry Disability Questionnaire.\nRoland M, Morris R: A study of the natural history of back pain.\nSpine (Phila Pa 1976) 8:141-144, 1983.\nRustoen T, Wahl AK, Hanestad BR, Lerdal A, Paul S, Miaskowski C: Age and the experience of chronic pain: Differences in health and quality of life among younger, middle-aged, and older adults.\nSamwel HJA, Kraaimaat FW, Crul BJP, Evers AWM: The role of fear-avoidance and helplessness in explaining functional disability in chronic pain: A prospective study.\nSchutze R, Rees C, Preece M, Schutze M: Low mindfulness predicts pain catastrophizing in a fear-avoidance model of chronic pain.\nSimons LE, Sieberg CB, Carpino E, Logan D, Berde C: The Fear of Pain Questionnaire (FOPQ): Assessment of pain-related fear among children and adolescents with chronic pain.\nSmith MT, Perlis ML, Haythornthwaite JA: Suicidal ideation in outpatients with chronic musculoskeletal pain: An exploratory study of the role of sleep onset insomnia and pain intensity.\nSwinkels-Meewisse IE, Roelofs J, Oostendorp RA, Verbeek AL, Vlaeyen JW: Acute low back pain: Painrelated fear and pain catastrophizing influence physical performance and perceived disability.\nSwinkels-Meewisse IE, Roelofs J, Schouten EG, Verbeek AL, Oostendorp RA, Vlaeyen JW: Fear of movement/(re)injury predicting chronic disabling low back pain: A prospective inception cohort study.\nSwinkels-Meewisse IEJ, Roelofs J, Verbeek ALM, Oostendorp RAB, Vlaeyen JWS: Fear of movement/(re)injury, disability and participation in acute low back pain.\nThomas EN, Pers YM, Mercier G, Cambiere JP, Frasson N, Ster F, Herisson C, Blotman F: The importance of fear, beliefs, catastrophizing and kinesiophobia in chronic low back pain rehabilitation.\nThompson DP, Urmston M, Oldham JA, Woby SR: The association between cognitive factors, pain and disability in patients with idiopathic chronic neck pain.\nTurk DC, Robinson JP, Sherman JJ, Burwinkle T, Swansona K: Assessing fear in patients with cervical pain: Development and validation of the Pictorial Fear of Activity ScaleCervical (PFActS-C).\nPain Med 12:328-336, 2011.\nInt J Behav Med 8:134-148, 2001.\nArch Phys Med Rehabil 84:1227-1232, 2003.\nJ Manipulative Physiol Ther 34:506-513, 2011.\nJ Manipulative Physiol Ther 14: 409-415, 1991.\nVlaeyen JWS, Kole-Snijders AMJ, Rotteveel AM, Ruesink R: The role of fear of movement/(re)injury in pain disability.\nVlaeyen JW, Linton SJ: Fear-avoidance and its consequences in chronic musculoskeletal pain: A state of the art.\nWaddell G, Newton M, Henderson I, Somerville D, Main CJA: Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fear-avoidance beliefs in chronic low back pain and disability.\nJ Pediatr Psychol 16:39-58, 1991.\nWilson AC, Lewandowski AS, Palermo TM: Fearavoidance beliefs and parental responses to pain in adolescents with chronic pain.\nPain Res Manag 16: 178-182, 2011.\n1030 The Journal of Pain Pain-Related Fear and Disability."}