{"title": "44.pdf", "contents": "Cohort profile: why do people keep hurting  their back?.\nAbstract  Objective: Low back pain (LBP) is one of the most disabling and costly conditions worldwide.\nIt remains unclear why  many individuals experience persistent and recurrent symptoms after an acute episode whereas others do not.\nA  longitudinal cohort study was established to address this problem.\nWe aimed to; (1) evaluate whether promising and  potentially modifiable biological, psychological, social and behavioural factors, along with their possible interactions,  predict LBP outcome after an acute episode; (2) compare these factors between individuals with and without acute  LBP; and (3) evaluate the time-course of changes in these factors from LBP onset.\nThis paper outlines the methodology and compares baseline characteristics between acute LBP and control, and LBP participants with and without  follow-up.\nResults: 133 individuals with acute LBP and 74 pain-free individuals participated.\nPain and disability  were recorded fortnightly.\nBaseline characteristics were mostly similar between those who did and did not return  for follow-up.\nInitial analyses of this cohort have revealed important insights into the pathways involved in acute-tochronic LBP.\nThese and future findings will provide new targets for treatment and prevention of persistent and recurrent LBP.\n0 International License, which permits use, sharing,  adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and  the source, provide a link to the Creative Commons licence, and indicate if changes were made.\nIntroduction Low back pain (LBP) is the worlds leading cause of disability [1] and is associated with enormous and escalating  costs to society [2].\nMost of this burden is attributed to  the condition when LBP becomes persistent or recurrent.\nWhy some individuals with acute LBP recover, whereas  others do not [3, 4], is largely unknown.\nAlthough psychosocial factors have generally been  considered stronger predictors of long-term outcome  than diagnostic or injury-related factors [5, 6], they only  explain a small proportion of the variance in outcome  [6, 7].\nWith this incomplete understanding of factors  related to LBP outcome, it is not surprising that most  treatments have modest effects at best [10] and are generally unable to prevent recurrence/persistence of pain  [11].\nWe argue that three issues underlie a fresh approach  to this problem.\nplausibly contribute to LBP outcome have been identified  in cross-sectional studies, e.\n, systemic inflammation,  trunk muscle morphology/function, and processing of  pain.\nUp until now, these potentially modifiable factors  had not been tested longitudinally from the initial onset  of symptoms, and analyses of the early time-points from  the cohort presented in this paper are providing promising results [1214].\nSecond, although interaction between  biological, psychological and social factors is implied in  the biopsychosocial model of pain, this interaction has  received little attention in past longitudinal studies of  LBP outcome.\nAgain, early analyses from the present  cohort have revealed interaction between features such  as depression, cytokines and poor LBP outcome [1216].\nThird, there is growing evidence that behavioural factors such as sleep interact with the biopsychosocial  components of LBP, but their contribution to outcome is  unknown.\nThis too has been supported by early observations [12, 14].\nFurther, little is known of the time course  of changes in each of the biopsychosocial domains over  12 months following an acute LBP episode.\nThere is  strong foundation to evaluate whether candidate biological factors, along with their possible interaction with psychosocial factors, contribute to the transition from acute  LBP to that of persistent/recurrent symptoms.\nThe purpose of this paper is to provide a profile of  a cohort study that aims to; (1) evaluate whether outcome after an acute episode of LBP can be predicted by  the most promising bio-psycho-social factors and/or the  interactions between them; (2) compare these factors  between individuals with and without acute LBP; and (3)  evaluate the time course of changes in these factors following LBP onset.\nThis paper outlines the participants,  measures and data collection schedule, and compares  baseline characteristics between acute LBP and control,  and follow-up and non-follow-up LBP participants.\nMain text Methods Study design This longitudinal cohort study involved measures of  variables within the biological, psychological and social  domains (Table 1) at multiple time-points for 12 months  (Additional file 1: Table S1).\nMeasures of sleep, physical activity, alcohol consumption and smoking were  grouped separately in a behavioural domain as they  cross between classical domains.\nEligible participants  completed a series of detailed online questionnaires  related to their pain and disability level, health, demographics, behaviour, and psychosocial status within 24 h  of undertaking a laboratory-based session (~ 4 h) at the  University of Queensland to assess biological variables.\nonline questionnaires) were repeated at 3, 6 and 9 months  for LBP participants, and at 3 months for control participants.\nAt 12 months, questionnaires were completed by  all participants in the LBP group in addition to a separate  12-month recall questionnaire relating to the trajectory  of their LBP since initial assessment for the study.\nParticipants were also instructed (and reminded) via email  to report their pain and disability level every fortnight for  3 (controls) or 12 months (LBP) via an online survey.\nFor  some analyses that have been conducted to date, these  pain and disability data have been used to classify LBP  participants as either unrecovered, partially recovered  or recovered at follow-up (for details see Additional  file 1: Table S2).\nScreening was conducted using two different methods.\nInitially, eligibility was determined via email and/ or phone, and when this method was used the reason(s)  for exclusion at this initial screening were not recorded.\nThis was replaced with an automated online screening  questionnaire from April 2014, with reasons for exclusion  recorded.\nParticipants did not need to be experiencing their first  ever LBP episode.\nPrevious LBP was recorded for inclusion as a covariate.\nControl participants were included if  they had not experienced LBP within the last month in  addition to meeting the exclusion criteria in Additional  file 1: Table S3.\nAt the first laboratory testing session (after initial  screening), eligibility for inclusion were confirmed using  data from the baseline questionnaire (completed within  24 h of the first laboratory-based session), to ensure  that the participants average level of pain and LBPrelated disability in the past week exceeded the inclusion  threshold ( 1/10 for pain;  1/24 for disability).\nPotential control participants who reported a score > 0 on a  0 (no pain) to 10 (worst pain imaginable) numerical  rating scale (NRS) and/or the Roland Morris Disability Questionnaire (RMDQ [35], [for definition of measures see Table 1]), or provided no scores were excluded  from the study (N = 14).\nPotential LBP participants who  reported < 1 on the pain NRS and/or the RMDQ, or provided no scores in the past week were excluded from the  study (N = 8).\nDemographic, health & function.\nAge, height, weight, sex Self-reported age, height, weight and sex Years, cm, kg, male/female.\nBMI Weight (kg) divided by the squared height (cm) Numerical.\nCo-morbidities Self-selected disease(s)/condition(s) other than LBP from a list  (including other) Yes/no, type.\nPrevious LBP Self-reported previous incidence(s) of LBP not including the current (study entry) episode Yes/no.\nHealth care/medication usage Self-reported health care and medication frequency of use and  type for LBP Yes/no, frequency, type.\nLow-Back Outcome Scale (LBOS [17], measured in LBP only) Questionnaire: evaluates pain and physical function.\n, employment, domestic chores and sport activities), and  the frequency of use of medical treatments/consultations and  analgesics with respect to the respondents LBP.\nCentre for Epidemiological Studies of Depression Scale (CES-D  [18]) Questionnaire: evaluates depressive symptoms.\nRespondents rate how often over the past week they  experienced symptoms associated with depression using a  four-point Likert scale ranging from 0 (rarely or none of the  time) to 3 (most or all of the time).\nPain catastrophizing scale (PCS [19]) Questionnaire: evaluates thoughts and feelings related to pain  suggestive of catastrophic cognitions.\nConsists of 13 items.\nYields a total score as well  as three subscale scores of magnification (I become afraid  that the pain will get worse: 3 items), rumination (I worry all  the time whether the pain will end: 4 items) and helplessness  (I feel I cant go on: 6 items).\nFear-Avoidance Beliefs Questionnaire (FABQ [20], measured in  LBP only) Questionnaire: evaluates fearful and avoidant behaviours.\nConsists of 16 items in which participants rate their agreement  with each statement on a seven-point Likert scale ranging  from 0 (completely disagree) to 7 (completely agree).\nTwo  subscales measure the agreement of statements related to  physical activity (FABQ-PA: 4 items) and work (FABQ-W: 7 items).\nPain Self-Efficacy Questionnaire (PSEQ [21], measured in LBP only) Questionnaire: evaluates the confidence individuals have in  performing activities while in pain.\nRespondents rate how confidently they can perform a range  of activities using a seven-point Likert scale.\nEducation level Self-selected education level (e.\n, school certificate, bachelor/ postgraduate degree, etc.\nEmployment status Self-selected employment status (e.\n, full-time/full duties, parttime, unemployed, etc.\nType of work Self-selected primary occupation (e.\n, professional, technician,  clerk, etc.\n) in the last 12 months from a list Type.\nJob satisfaction Self-reported job satisfaction using a seven-point NRS ranging  from extremely dissatisfied to extremely satisfied 06: score = job satisfaction.\nResponses to each item are quantified on  a four-point Likert scale from 1 (totally disagree) to 4 (totally  agree).\n, caring for  family, studies/training, ill health, etc.\nImpending compensation Self-reported impending compensation associated with the  participants LBP Yes/no.\n14 pg/ml, TNF = 0.\nTNF (pg/ml), IL-6 (pg/ml), IL-1 (pg/ml), CRP (ng/ml).\nPain processing Laboratory measure: Pain thresholds to pressure (PPT), heat  (HPT) and cold (CPT) were assessed at the back (LBP  site  of most pain on palpation; control  fixed site ~ 5 cm rostral  [toward the head] and lateral to the center of the lumbo-sacral  junction divided randomly between the left and right side)  and either the thumb nail bed (PPT) or proximal volar aspect  of the forearm (HPT and CPT) [12, 15].\nTS and CS were applied to the lower back  or forearm.\nCPM was measured on three occasions (separated  by a 15-min break) using different anatomical locations and  stimuli (TS/CS) arrangements as reported previously [12, 15].\nThe CPM response was calculated as the difference between  the TS scores obtained before and during the CS.\nA higher TS  score during the CS than baseline indicated pain inhibition  (expressed as a positive value).\nA lower TS score during the CS  than baseline indicated pain facilitation (negative value).\nPPT (kPa, score = pain threshold), HPT (C, score = pain  threshold), CPT (C, score = pain threshold), CPM  (kPa, > 0 = pain inhibition, < 0 = pain facilitation).\nParticipants sat in a semi-sitting position  with their pelvis fixed and a cable attached either behind or in  front of their trunk via a harness.\nOn instruction, participants  pulled against the cable with a force of 12.\n5% of their body  weight using visual feedback (target on a computer screen).\nThe cable was released at an unpredictable time for 10 repetitions in each direction and the response of 12 abdominal and  back muscles were recorded with surface EMG electrodes  using placement described previously.\nTrunk mechanical properties Laboratory measure: Effective trunk stiffness, mass and damping  was estimated following trunk perturbation with the trunk  modeled as a linear second-order system [26].\nParticipants sat  in a frame with equal weights (7.\n5% body weight) attached  to the front and back of the trunk via pulleys such that the  masses were balanced and the trunk could move freely  with minimal muscle activity.\nThe trunk was perturbed by  the unexpected release of one of the weights.\nThe task was  repeated 10 times in each direction with the order of directions randomised.\nTrunk postural control Laboratory measure: Dynamic trunk control was assessed with  participants balancing on a seat with a curved base placed on  a force plate to record centre of pressure (CoP) [27].\nIn an additional trial, participants were  perturbed by release, at an unexpected time, of a weight  (3% body weight) attached behind the trunk.\nParticipants were instructed to  regain balance as fast as possible three times under four conditions: eyes open, eyes closed, feedback (as above), and feedback up until perturbation induced by release of the weight.\nCoordinates of CoP were recorded as well as trunk muscle  activity (as for trunk muscle coordination) and kinematics  using a motion capture system.\nStanding postural control Laboratory measure: Postural control was measured with participants standing barefoot and blindfolded on a force plate  for 75 s.\nTo test the effect of disruption of proprioception at  the calf and lower back, the task was repeated with vibrators  (~ 60 Hz, 1 mm amplitude) attached bilaterally over the Achilles tendon and lumbar paraspinal muscles [28], separately, in  random order.\nLumbopelvic motion Laboratory measure: Angular measures of limb movement  and lumbopelvic motion were calculated across time during  active/passive knee flexion and active/passive hip rotation  (both lateral and medial) in prone using a motion capture  system [29].\nLumbopelvic control during gait Laboratory measure: Lumbopelvic/trunk kinematics and trunk  muscle activity (EMG) was assessed during 3 min of treadmill  walking at 3 km/h and 5 km/h [30, 31].\nMuscle activity (EMG), kinematics (degrees).\nConsists of  19 items that cover seven dimensions, including subjective  sleep quality, sleep duration and latency (time it takes to fall  asleep), and the frequency and severity of specific sleeprelated complaints in the previous month.\nScores from each  dimension (range: 03) are individually reported as component scores and summed to derive a sleep quality maximum  score.\n021: score = sleep quality, > 5 = poor sleeper.\nComponent scores (all 03): duration of sleep, sleep disturbance,  sleep latency, day dysfunction due to sleepiness, sleep efficacy,  overall sleep quality, sleep medications.\nscore = physical activity (refer to scoring manual for calculating  and interpreting MET scores and activity categories).\nResponses to each item are quantified on a five-point Likert scale from 0 to 4.\n032: score = level of alcohol problem.\nPain Self-reported pain intensity over the last week using an 11-point  NRS ranging from none to worst imaginable 010: score = pain.\n, extended version of the standard 24-item RMDQ)  associated with physical functions likely to be affected by LBP.\nAn item receives a score of 1 if it is applicable to the respondent or a score of 0 if it is not.\n12-month LBP trajectory Questionnaire: evaluates the trajectory of LBP symptoms over  12 months from study commencement.\nConsists of a series of  questions (asked at 12 months) that address how the respondents current LBP compares with their LBP at the start of the  study, the frequency and duration at which the responder  experienced periods without pain, periods of recurrence/persistence, and/or periods of markedly worse symptoms, based  on their 12-month recall.\nIn addition, respondents are asked  to classify their LBP experience into one of seven trajectories  using visual and word descriptions.\nwere identified for two participants with LBP (multiple  sclerosis [N = 1], duration of LBP > 14 days [N = 1]) and  two control participants (no pain/disability data [N = 1],  pain/injury in another body region [N = 1]).\nThe final cohort  included 133 and 74 participants in the LBP and control  groups, respectively, for analyses.\nMeasurements Details of the measures and at what time-point(s) they  were implemented are presented in Table 1 and Additional file 1: Table S1.\nAll variables were measured in a  standardised order for each participant.\nBiological measures were those we considered to be the most promising  candidate factors for predicting LBP recurrence/persistence based on previous research and plausible rationales  founded on clinical, epidemiological and fundamental  research.\nFor psychological measures, we considered  three key domains of relevance in LBP: cognitive (expectations, beliefs, and perceptions concerning pain) [6, 36 38], emotional (distress, anxiety, and depression) [5], and  behavioural (coping, pain behaviour, and activity/activity avoidance) [6, 36, 37].\nnarrative reviews and expert consensus.\nAs it was not our  intention to withhold treatment over the study period,  we collected information regarding health care and medication use so that treatment variables can be included as  covariates.\n, 28 predictor variables, 5 a  priori selected interactions) and growth curve modelling methods, while allowing for loss to follow-up.\nAlthough  the achieved sample size (N = 133) limits the ability to examine numerous interactions simultaneously,  reduced model sizes and alternative methods (e.\n,  cluster analysis) have been applied successfully on data  from this cohort [1216].\nData analysis All questionnaire-based measures (that could be quantitatively analysed) at baseline were compared between: (1).\nLBP and control participants, and (2) LBP participants  who did and did not follow-up at 3, 6, 9 and 12 months.\nAs biological measures were not performed at 12 months, all participants  were invited to complete the standard 3-montly questionnaire in addition to a separate recall questionnaire at  12 months, irrespective of whether or not they had continued or dropped out earlier.\nOne or both of these were  fully/partly completed by all but 41 of the 133 LBP participants who started the study (follow-up at 12 months:  N = 92).\nFor participants that did follow-up, Additional  file 1: Table S5 shows the number of those that provided  valid data for each of the 3-monthly questionnaire-based  measures at each respective time-point.\nTen control  participants did not return for follow-up at 3 months.\n, up to 3 months).\nDiscussion This paper profiles the only acute LBP cohort in which  detailed biological, psychological, social and behavioural  factors have been longitudinally and frequently collected,  to date.\nThe cohort has great potential to provide unique  insight into the features that may predict and/or mediate  long-term outcome [40].\nThe findings of baseline (acute LBP) characteristics  presented here provide a foundation for future longitudinal analyses.\nWhether the findings can be generalised to  a larger or clinical sample of individuals with early-acute  LBP requires further and detailed studies of the condition during the early-acute phase.\nDespite the rate of loss  to follow-up, most occurred after the first session, and  baseline characteristics were generally similar between  those who did and not return for follow-up.\nInitial analyses of this cohort have revealed specific  immune and nervous system features associated with the  transition to persistent/recurrent LBP, and that various  psychological and behavioural factors shape these relationships [1216].\nOngoing analyses focus on elucidating  the role of trunk neuromuscular, kinematic, mechanical  and morphological properties, along with their possible  interactions with psychosocial/behavioural features, in  predicting LBP outcome.\nThe smaller than expected sample size limits the  types of analyses to investigate interactions, and  their interpretation; however, approaches such  as cluster analyses have so far provided valuable  insights.\nTo account for the diurnal  variations in cytokines [41], time of blood collection  was recorded for inclusion as a potential confounder  when interpreting cytokine levels.\nCharacteristic 3 months 6 months 9 months 12 months.\nDemographic, health & function.\nSex (% female) 48.\nPrevious LBP (yes,  %) 92.\nHealthcare utilization (yes, %) 18.\nPain (NRS) 5 (36) 6 (57) 0.\n019 5 (36) 6 (47) 0.\n078 5 (37) 5 (47) 0.\n293 6 (49) 6 (410) 0.\n613 6 (49) 7 (410) 0.\n003 10 (717) 16 (1022) 0.\n008 10 (718) 15 (1022) 0.\n004 10 (718) 15 (1123) 0.\n057 10 (616) 13 (726) 0.\n125 10 (616) 14 (726) 0.\n106 10 (616) 17 (926) 0.\n136 12 (217) 12 (324) 0.\n223 12 (317) 13 (423) 0.\n144 12 (417) 10 (023) 0.\nPain self-efficacy  (PSEQ) 48 (4053) 41 (3248) 0.\n008 48 (4052) 44 (3248) 0.\n021 48 (4053) 44 (3248) 0.\n009 47 (4053) 45 (3248) 0.\nPage 11 of 14 Klyne et al.\nstatus  (unemployed, %) 25.\nJob satisfaction  (NRS) 4.\nJob decisionmaking authority  (JCQ).\nJob demands  (JCQ) 32 (2736) 33 (3138) 0.\n096 32 (2736) 33 (3038) 0.\n068 32 (2736) 33 (2938) 0.\n214 32 (2936) 33 (2638) 0.\nJob decision latitude (JCQ) 76 (6686) 70 (5680) 0.\n152 76 (6786) 70 (6282) 0.\n172 77 (6886) 70 (6080) 0.\n058 76 (6686) 74 (6282) 0.\n001 12 (1214) 12 (1213) 0.\nSupervisor support  (JCQ) 12 (1215) 12 (1114) 0.\n341 12 (1215) 12 (1114) 0.\n411 12 (1216) 12 (1113) 0.\n156 5 (47) 6 (57) 0.\n088 5 (47) 6 (58) 0.\n618 2 (04) 2 (05) 0.\nSickness benefits  for LBP (yes, %) 1.\nPrevious/current  smoker (yes, %) 35.\nCurrent smoker  (yes, %) 6.\nactivity  days/week  (IPAQ)*.\n783 2 (03) 2 (04) 0.\n312 2 (03) 2 (03) 0.\n606 2 (03) 1 (02) 0.\nWalking time/day  (min, IPAQ)* 30 (1860) 30 (2090) 0.\n158 30 (2045) 35 (2075) 0.\n023 25 (2045) 48 (2060) 0.\nBaseline variable (characteristic) summary statistics (mean  [SD], median  [IQR] or percentage) compared between low back pain (LBP) participants who did (FU) and did not follow-up (NFU), separately at 3, 6, 9 (for  laboratory-based measures) and 12 (questionnaire measures) month time-points using t tests (continuous data, normally distributed), MannWhitney U tests (continuous data, not normally distributed) or Chi squared  tests (categorical data).\nParticipants who answered other to question 25 of the Job Content Questionnaire were removed prior to analysing the job insecurity scale.\nAuthors contribution Conceived and designed the study: DK, PH, WVDH, MB, JC, AK, LM, MN and  MS.\nRecruitment of participants: DK, LO, RP and GR.\nAnalysed the data: DK,  PH, WVDH and RM.\nWrote the manuscript: DK and PH.\nAll authors revised the  manuscript.\nAll authors read and approved the final manuscript.\nFunding This research was funded by the National Health and Medical Research  Council (NHMRC) of Australia (Project Grant: ID631369; Program Grant:  APP1091302).\nThe funders had no role in the study design, data collection  and analysis, decision to publish, or preparation of the manuscript.\nCurrently, only the research  team has access to the data.\nEthics approval and consent to participate The study was approved by The University of Queenslands Human Research  Ethics Committee (ID: 2010000045), Royal Brisbane & Womens Hospital  Human Research Ethics Committee (ID: HREC/13/QRBW/268), and the Uniting  Care Health Human Research Ethics Committee (ID: 1404).\nAll participants  provided written informed consent, were informed of their right to withdraw  from the study at any time without penalty, and were informed of the study  purpose.\nConsent for publication Not applicable.\nCompeting interests The authors declare that they have no competing interests.\nAuthor details 1 NHMRC Centre of Clinical Research Excellence in Spinal Pain, Injury  and Health, School of Health and Rehabilitation Sciences, The University  of Queensland, Brisbane, QLD 4072, Australia.\n2 Department of Anatomy  and Cell Biology, Lewis Katz School of Medicine, Temple University, Philadelphia, USA.\n3 MSU Center for Orthopedic Research, Department of Osteopathic  Surgical Specialties, Michigan State University, East Lansing, MI, USA.\n4 School  of Health and Rehabilitation Sciences, The University of Queensland, Brisbane,.\n5 Department of Physiotherapy, LUNEX International University  of Health, Exercise and Sports, Differdange, Luxembourg.\n6 IIMPACT, University  of South Australia, Adelaide, Australia.\n7 Pain Management Research Institute,  Royal North Shore Hospital, The University of Sydney, Sydney, Australia.\n8 NHMRC Centre of Research Excellence in Road Traffic Injury Recovery, The  University of Queensland, Brisbane, Australia.\nHoy D, March L, Brooks P, Blyth F, Woolf A, Bain C, et al.\nThe global burden  of low back pain: estimates from the Global Burden of Disease 2010  study.\nA systematic review of low back pain  cost of illness studies in the United States and internationally.\nAcute low back pain:  systematic review of its prognosis.\nPrognosis in patients with recent onset low back pain in Australian primary care: inception cohort study.\nA systematic review of psychological factors as predictors of chronicity/disability in prospective cohorts of  low back pain.\nA review of psychological risk factors in back and neck pain.\nFear avoidance and  prognosis in back pain: a systematic review and synthesis of current evidence.\nPhysical measurements as risk indicators for low-back  trouble over a one-year period.\nA systematic review of the relation between physical capacity and future low back and neck/shoulder pain.\nAiraksinen O, Brox JI, Cedraschi C, Hildebrandt J, Klaber-Moffett J, Kovacs  F, et al.\nLow back pain A primary care challenge.\nAre Signs of  central sensitization in acute low back pain a precursor to poor outcome?  J Pain.\nISSLS PRIZE IN CLINICAL SCIENCE 2018: longitudinal analysis of inflammatory, psychological,  and sleep-related factors following an acute low back pain episode-the  good, the bad, and the ugly.\nIndividual Variation in Pain Sensitivity and Conditioned Pain Modulation in Acute Low  Back Pain: Effect of Stimulus Type, Sleep, and Psychological and Lifestyle  Factors.\nSystemic inflammatory profiles and  their relationships with demographic, behavioural and clinical features  in acute low back pain.\nthorough peer review by experienced researchers in your field.\nrapid publication on acceptance.\nsupport for research data, including large and complex data types.\ngold Open Access which fosters wider collaboration and increased citations.\nAt BMC, research is always in progress.\nReady to submit your research ?  Choose BMC and benefit from:.\nAssessment of outcome in patients with lowback pain.\nThe CES-D Scale: a new self-report depression scale for  research in the general population.\nA Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fear-avoidance beliefs  in chronic low back pain and disability.\nThe pain self-efficacy questionnaire: taking pain into  account.\nThe Job  Content Questionnaire (JCQ): an instrument for internationally comparative assessments of psychosocial job characteristics.\nEffect of  types and anatomic arrangement of painful stimuli on conditioned pain  modulation.\nRehabilitative ultrasound  imaging of the posterior paraspinal muscles.\n25 Cholewicki J, Silfies SP, Shah RA, Greene HS, Reeves NP, Alvi K, et al.\nDelayed trunk muscle reflex responses increase the risk of low back  injuries.\nChanges in the  mechanical properties of the trunk in low back pain may be associated  with recurrence.\nLow back pain history and postural  sway in unstable sitting.\nThe role of  paraspinal muscle spindles in lumbosacral position sense in individuals  with and without low back pain.\nDifferences in lumbopelvic  motion between people with and people without low back pain during  two lower limb movement tests.\nCoordination of  leg swing, thorax rotations, and pelvis rotations during gait: the organisation of total body angular momentum.\npersons with nonspecific low back pain.\nThe Pittsburgh  Sleep Quality Index: a new instrument for psychiatric practice and  research.\nValidity of the International Physical Activity Questionnaire Short Form (IPAQ-SF): a  systematic review.\nGeneva: World Health Organization; 2001.\nA study of the natural history of back pain.\nPart I:  development of a reliable and sensitive measure of disability in low-back  pain.\nPrognostic factors for  musculoskeletal pain in primary care: a systematic review.\nPrognosis in patients with recent onset low back pain in Australian  primary care: inception cohort study.\nHow does persistent pain develop? An analysis  of the relationship between psychological variables, pain and function  across stages of chronicity.\nA review and proposal for a  core set of factors for prospective cohorts in low back pain: a consensus  statement.\nLetter to the editor concerning Multiple confounders influence the association between low-grade systemic inflammation and musculoskeletal pain.\nDiurnal rhythms of pro-inflammatory  cytokines: regulation by plasma cortisol and therapeutic implications.\nPublishers Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."}