{"title": "1.pdf", "contents": "Global low back pain prevalence and years lived with disability  from 1990 to 2017: estimates from the Global Burden of Disease  Study 2017.\nHospital of Wenzhou Medical University, Zhejiang Provincial Key Laboratory of Orthopaedics, Wenzhou 325027, China;.\nJoint Research, The University of Sydney & Department of Rheumatology, Royal North Shore Hospital, St Leonards, NSW, Australia;.\n4Department of Orthopaedics, Shanghai Ninth Peoples.\nHospital, Shanghai Jiao Tong University School of Medicine, Shanghai Key Laboratory of Orthopaedic Implants, Shanghai 200011, China;.\n6Pain Management Research Institute,.\nFaculty of Medicine and Health, The University of Sydney & Kolling Institute of Medical Research, Royal North Shore Hospital, St Leonards,.\n7Monash Department of Clinical Epidemiology, Cabrini Institute and Department of Epidemiology and Preventive Medicine,.\nSchool of Public Health & Preventive Medicine, Monash University, Melbourne, VIC, Australia.\nContributions: (I) Conception and design: A Wu, D Hoy, L March; (II) Administrative support: A Wu, D Hoy, L March; (III) Provision of study.\nmaterials or patients: AM, X Zheng, J Huang, X Wang, J Zhao; (IV) Collection and assembly of data: A Wu, D Hoy, L March, X Zheng, J Huang;.\n(V) Data analysis and interpretation: A Wu, D Hoy, L March, X Zheng, J Huang, FM Blyth, E Smith, R Buchbinder; (VI) Manuscript writing: All.\nauthors; (VII) Final approval of manuscript: All authors.\nCorrespondence to: Lyn March, MD, PhD.\nBackground: Low back pain (LBP) is a common musculoskeletal problem globally.\nUpdating the  prevalence and burden of LBP is important for researchers and policy makers.\nThis paper presents, compares  and contextualizes the global prevalence and years lived with disability (YLDs) of LBP by age, sex and  region, from 1990 to 2017.\nAge, sex and region-specific analyses were conducted to estimate the global prevalence  and YLDs of LBP, with the uncertainty intervals (UIs).\nAgestandardized prevalence of LBP was higher in females than males.\nLBP prevalence increased with age, and  peaked around the ages of 80 to 89 years, and then decreased slightly.\nGlobal YLDs were 42.\n5 million (95%  UI: 30.\n2 million) in 1990 and increased by 52.\n9 million (95% UI: 46.\nYLDs were also higher in females than males and increased initially with age; they peaked  at 3539 years of age in 1990, before decreasing, whereas in 2017, they peaked at 4549 years of age, before  decreasing.\nWestern Europe had the highest number of LBP YLDs.\nConclusions: Globally, LBP is the leading global cause of YLDs.\nLow back pain (LBP) is the most common musculoskeletal  problem globally (1-4).\nIt is the leading cause of activity  limitation and absenteeism from work (5-7), and results  in a huge medical burden and economic cost (2,8).\nThe Global Burden of Disease (GBD) Study is updated.\nevery one to two years (6,12-15).\nLBP is included as one  of the musculoskeletal conditions in GBD studythe last  article describing the global burden of LBP in detail was  based upon the GBD 2010 (10) analysis.\nHowever, since  then, there have been a number of methodological changes  made and updated data (6).\nThese include: an updated  DisMod-MR tool; construction of a Socio-Demographic  Index (SDI); further research to establish disability weights  (DWs); and adjustment for comorbidity (6).\nTherefore,  it is important to present these changes and highlight the  resulting update on the prevalence and global burden of  LBP.\nAll of the data analysed and presented in this article were  obtained from the updated GBD 2017 (the Global Burden  of Disease, Injuries, and Risk Factors Study) (http://www.\nThe GBD 2017 data were  derived from the GBD repository of population health  data, including World Health Surveys and National Health  Surveys, literature reviews, and claims data.\nLiterature  review for LBP was conducted in October 2017.\nThe  electronic databases of Ovid Medline, EMBase, and  CINAHL were searched and eight studies were included.\nIn  addition, USA claims data for 2000, 2010, 2012, and 2014  by state, and Taiwan claims data from 2016 were included.\nResults were stratified by five-year age  groups from birth up to 95+.\nLBP was defined as pain that lasts for at least one day.\n(with/without pain referred into one or both lower limbs) in  the area on the posterior aspect of the body from the lower  margin of the 12.\nth ribs to the lower gluteal folds (10,16,17).\nDWs represent the magnitude of health loss associated.\nDWs were measured on a scale from zero to  one, with zero representing a state of full health, and one  representing a state equivalent to death.\nThe DWs used in  GBD 2010 were based on face to face surveys conducted in  five countries as well as an internet survey (10).\nThe DWs  used in GBD 2017 have been described previously (18), and  also included data from the European Disability Weights  Measurement Study that took place in Hungary, Italy, the  Netherlands and Sweden.\n518); (II) most severe  BP without leg pain (DW: 0.\nThere is no mortality from LBP, therefore, the YLDs.\nand DALYs (Disability-adjusted life years) values are the  same.\nThe  unadjusted YLDs of each sequela were calculated using the  formula:.\ncomposite indicator of development status correlated with  health outcomes.\nA comorbidity correction involving a micro-simulation.\nperformed for each age-sex-location-year, was used to  calculate the comorbidity-adjusted YLDs at the final stage.\nA flow chart  describing the process for estimating the YLDs is shown in  Figure 1.\nUncertainty intervals (UIs) were calculated using a.\nBriefly, the distribution of every computed step was stored.\nin 1,000 draws; the final estimate is the mean estimate  across all 1,000 draws, and the 95% UI is the 25th and  975th ranked values.\nThe age-standardized point prevalence of LBP in the 21  world regions by gender at 1990 and 2017 is summarized in  Table 1.\nPrevalence was higher in females than males.\nFor females,  this was 8.\n82%) in 1990 and  8.\n84%) in 2017, whereas for males,  prevalence was 7.\n31%) in 1990 and  6.\n67%) in 2017 (Figure 2A).\nThe  estimated prevalent numbers of people with LBP was   377.\n5 million in 1990, and this increased to 577.\n0 million in  2017, due to the considerable increased population globally.\nfrom 1990 to 2017 (Figure 2B).\nLBP prevalence increased with age, peaking around the.\nages 80 to 89 years old, and then slightly decreased.\nYears lived with disability (YLDs).\nLBP was the leading cause of YLDs for both 1990 and 2017  out of the all conditions studied in GBD 2017.\nIn both time  points, LBP was the leading cause of YLDs in 13 out of the  21 world regions (Table 2).\nThe global YLDs for LBP were 42.\nMap SF-12 to GBD DW: the data were first collected from the short form-12 (SF-12),.\nthen, the individual SF-12 summary scores were mapped to an equivalent disability weight (DW); Nonfatal database: low back pain is one.\nage/sex represents the years 19902017.\n1 Prevalence by  location/year/.\nPrevalence of  moderate LBP.\nsevere LBP with/ without leg pain.\nsevere LBP with/ without leg pain.\nProportion  LBP cases  with leg pain.\nRegression to estimate DW by   cause in survey respondents.\nMap SF-12 to GBD DW.\nGlobal low back pain prevalence and burden.\nTable 1 The age-standardized point prevalence of low back pain in 1990 and 2017, by region and gender.\nAndean Latin   America.\nCentral Asia Male 9.\nCentral Europe Male 12.\nCentral Latin   America.\nCentral   Sub-Saharan Africa.\nEastern Europe Male 11.\nAnnals of Translational Medicine.\nNorth Africa and  Middle East.\nSouth Asia Male 5.\nSoutheast Asia Male 7.\nSouthern Latin  America.\nSouthern   Sub-Saharan Africa.\nTropical Latin   America.\nWestern Europe Male 12.\n*, rank: the rank of LBP prevalence among the above 21 regions.\n**, difference: calculated by subtracting the 1990 prevalence (%) from the  2017 prevalence (%).\nLUI, lower uncertainty interval; UUI, upper uncertainty interval.\nAnnals of Translational Medicine, Vol 8, No 6 March 2020 Page 7 of 14.\nAnnals of Translational Medicine.\nAnn Transl Med 2020;8(6):299 | http://dx.\nTable 2 Years lived with disability (YLDs), age-standardized YLD rate (per 100,000 persons) and rank (in all causes) of low back pain in 1990 and 2017, by region and sex.\nYLDs (1,000s) Age-standardized YLD rate (per 100,000 persons) Rank**.\nMean LUI UUI Mean LUI UUI Mean LUI UUI Mean LUI UUI.\nMale 123  88  165  262  186  165  140  844  607  1,140  904  644  1,215  60  1  1.\nAustralasia Male 127  90  172  202  145  172  75  1,170  830  1,580  1,198  863  1,628  29  1  1.\nCaribbean Male 90  64  123  138  99  123  48  584  415  793  576  414  776  8 1  2.\nCentral Asia Male 259  187  349  400  286  349  140  993  716  1,332  973  698  1,307  20 1  1.\nCentral Europe Male 864  616  1,170  966  694  1,170  101  1,311  939  1,762  1,306  934  1,755  5 2  1.\nMale 317  225  432  633  453  432  316  511  368  695  521  374  707  9  2  2.\nMale 165  118  227  391  279  227  226  961  691  1,293  977  696  1,310  16  3  1.\nEastern Europe Male 1,356  971  1,840  1,321  950  1,840  35 1,212  873  1,639  1,095  783  1,482  117 1  1.\nFemale 1,814  1,318  2,432  1,767  1,288  2,432  47 1,206  864  1,615  1,115  804  1,498  91 1  1.\nBoth 3,170  2,305  4,274  3,089  2,236  4,274  82 1,208  868  1,622  1,106  793  1,497  102 1  1.\nMale 499  356  678  1,125  801  678  626  894  645  1,202  934  674  1,265  40  3  1.\nFemale 396  284  535  892  635  535  496  707  511  946  731  526  988  23  5  4.\nBoth 895  642  1,215  2,017  1,437  1,215  1,122  799  577  1,070  830  599  1,120  31  3  2.\nMale 1,007  717  1,368  1,489  1,067  1,368  481  1,060  754  1,444  1,166  829  1,600  106  1  1.\nFemale 1,535  1,091  2,090  1,930  1,378  2,090  395  1,530 1,091 2,091  1,567  1,117  2,126  37  1  1.\nBoth 2,543  1,811  3,441  3,419  2,423  3,441  876  1,294  923  1,758  1,361  970  1,863  67  1  1.\nMale 1,581  1,131  2,124  2,171  1,554  2,124  589  1,054  756  1,424  988  709  1,313  66 1  1.\nFemale 2,105  1,510  2,820  2,801  2,027  2,820  695  1,270  910  1,707  1,191  858  1,572  79 1  1.\nFemale 1,442  1,030  1,934  3,062  2,197  1,934  1,620  1,162  833  1,546  1,155  825  1,555  6 2  2.\nOceania Male 16  11  22  35  25  22  19  649  461  883  678  488  910  29  2  2.\nSouth Asia Male 2,774  1,987  3,769  4,547  3,239  3,769  1,773  633  457  848  553  397  746  79 2  2.\nSoutheast Asia Male 1,448  1,033  1,964  2,758  1,983  1,964  1,310  816  588  1,101  843  605  1,125  27  1  1.\nFemale 1,554  1,112  2,102  2,911  2,096  2,102  1,357  832  592  1,116  849  611  1,131  17  2  1.\nBoth 3,002  2,146  4,061  5,669  4,078  4,061  2,668  825  589  1,109  847  610  1,128  22  1  1.\nMale 292  209  402  473  336  402  181  1,263  904  1,736  1,367  972  1,847  104  1  1.\nFemale 340  243  465  543  392  465  203  1,351  962  1,848  1,438  1,027  1,949  87  1  1.\nBoth 632  453  866  1,016  724  866  384  1,309  941  1,786  1,404  1,002  1,896  95  1  1.\nMale 158  113  214  256  183  214  98  885  635  1,197  791  565  1,060  93 1  2.\nFemale 127  90  170  214  154  170  87  648  468  872  593  428  795  56 5  5.\nBoth 285  204  385  470  336  385  186  762  549  1,026  688  498  919  74 1  3.\nMale 738  527  1,012  1,402  1,002  1,012  664  1,154  824  1,567  1,227  872  1,662  73  1  1.\nFemale 877  625  1,191  1,521  1,088  1,191  644  1,310  936  1,775  1,246  891  1,679  65 1  1.\nBoth 1,615  1,149  2,215  2,924  2,085  2,215  1,308  1,235  885  1,675  1,237  884  1,670  2  1  1.\nMale 642  464  867  1,459  1,039  867  817  971  704  1,307  1,024  733  1,384  53  2  2.\nFemale 530  379  709  1,363  972  709  834  838  605  1,120  906  641  1,210  68  4  3.\nBoth 1,172  839  1,575  2,822  2,015  1,575  1,650  906  653  1,207  962  684  1,292  57  3  2.\nGlobally Male 19,210 13,729 26,153  29,467 21,020 26,153  10,257  813  580  1,094  748  538  1,008  65 1  1.\nFemale 23,313 16,598 31,184  35,479 25,357 31,184  12,167  966  687  1,293  869  624  1,165  97 1  1.\nBoth 42,523 30,176 57,224  64,947 46,512 57,224  22,424  892  637  1,195  810  582  1,089  82 1  1.\nGlobal low back pain prevalence and burden.\n4 million) in 2017   (Table 2).\nYLDs were higher for females than males in both  1990 (23.\n2 million,   compared to 19.\n2 million, respectively) and 2017 (35.\n7 million, compared to 29.\n0 million, respectively) (Table 2).\nThe agestandardized YLD rate (per 100,000 population) decreased  slightly from 892 (95% UI: 6371,195) in 1990 to 810 (95%  UI: 5821,089) in 2017, although this was not statistically  significant at the 0.\nThe age-standardized YLD rate  was also higher in females than males (Table 2).\nthey peaked at 3539 years of age in 1990, before decreasing  (Figure 4A), whereas in 2017, they peaked at 4549 years of  age, before decreasing (Figure 4B).\nwas South Asia (10.\nThe region with the lowest number  of YLDs was Oceania (73,589, 95% UI: 52,501100,281),  followed by the Caribbean (303,867, 95% UI: 219,393 408,488).\nThe region with the highest age-standardized  YLD rate (per 100,000 persons) was Southern Latin  America [1,404], followed by high-income Asia Pacific  [1,361].\nThe region with the lowest age-standardized YLDs  rate was East Asia [419], followed by Central Latin America  [604].\nIn this article, data analysed in GBD 2017 are presented.\n(A) The age-specific number of low back pain years lived with disability (with.\n(B) The age-specific number of low back pain years lived with disability (with uncertainty.\nThe prevalence (in %) of LBP had decreased between 1990  and 2017, whereas the prevalent number of people with  LBP and the number of YLDs had increased substantially.\nLBP remains the leading global cause of YLDs in 2017.\nIt  should be noted that with each GBD study iteration, new  data are being added to the models that derive the estimates  over time.\nThis consequently alters and strengthens the  model outputsas a result, and for example, prevalence  estimates from GBD 2010 may differ from those from GBD  2017.\nOther factors that may influence prevalence changes  between iterations are changes to the DWs, the DisModMR tool, construction of the SDI, and adjustments for  comorbidity.\nin GBD 2017 compared to GBD 2010 (10).\nIn GBD  2010, prevalence was reportedly higher in males (10.\n1%); however, prevalence was  higher in females in GBD 2017.\nThis difference between  GBD 2010 and GBD 2017 is mainly attributed to the  improved data coverage and methods in GBD 2017 rather  than any real changes over this period.\nOther studies  have reported a similar gender trend (21-24).\nPossible  explanations for this are likely to be complex and may  include biological, psychological and sociocultural factors  (22,25,26).\nHowever, another interesting finding is that  males in Central, Eastern, Western and Southern SubSaharan Africa had a higher prevalence than females further research is needed to better understand this.\nwere similar to GBD 2010 (10).\nPrevalence was high in all  age groups from 18 years onwards, and peaked at around  8089 years old (Figure 3).\nThere are many factors that  may increase the prevalence of LBP with age.\nAging is  associated with pain, which may restrict social and physical  function (27); consequently, this restriction may result  in further deterioration of the musculoskeletal system  and further pain.\nDegeneration of the lumbar spine as a  potential contributor to LBP continues to be a subject of  debate (28-32).\nThere was a slight decrease in the point prevalence (%).\nThe number of prevalent cases of LBP  and number of YLDs has increased dramatically in this  period, although, again, this was not significant at the 0.\nfactors such as obesity, increased motorization (1,4), and  willingness to report pain.\nOf note, the point prevalence  and age-standardized YLDs rate (per 100,000 persons) in  Southern Latin America, high-income Asia Pacific, Andean  Latin America, Australasia and Western Sub-Saharan Africa  have all increased suggesting that factors beyond aging and  population increase may be at play.\nYLDs peaked in the middle-aged population,  and thus the working-age population is most greatly  affected by the burden of LBP.\nHowever,  consistent with the aging population and increasing global  life expectancy, this peak was delayed to 45 to 49 years old  in 2017 (19).\nMore up-to-date data were included from  World Health Surveys and National Health Surveys,  the European Disability Weights Measurement Study,  additional systematic reviews, and claims data from the  USA Taiwan.\nThese changes increase  confidence in the accuracy of results.\nWhile these models have been improved, it  should be noted that they are models rather than original  data.\nThis has made it difficult to compare  the data across countries and over time.\nAdditionally, it is  difficult to determine with confidence the impact of changes  to LBP policy and practice.\nHence, this is the key limitation  in estimating and understanding the global burden of LBP.\nStandardisation of data collection would be an important first  step.\nThe case definitions  are aligned to those of the GBD.\nThe intention for the  questionnaire is for it to be integrated within pre-existing and  planned surveys such as National Health Surveys, and not  being used as a stand-alone tool.\nThis will help to minimize  the burden from having to conduct multiple surveys in the  local communities, and, subsequently, will save the required  resources.\nIt also encourages LBP and other musculoskeletal  disorders to be viewed as being integrated within broader  health initiatives rather than being seen as a separate issue.\nIt is hoped this publicly-available module will be widely  adopted to increase the availability of comparable data on  LBP and other MSKs (24).\nFrom 1990 to 2017, LBP continued to be the leading  cause of YLDs globally.\nMany countries and health-related  organizations continue to prioritize communicate diseases  over non-communicable diseases such as LBP.\nThe Lancet  Low Back Pain Series recently made a call for action  on the management of LBP burden from governments,  policy makers and the broader society (8,9,33).\nHowever,  there continues to be a gap between evidence for effective  management of LBP and current practice and policy, as  outlined in the recent Lancet Series (8,9,33).\nGreater  attention is needed to bridge this gap.\nA biopsychosocial  framework could be used to guide the management  including education, self-management, resumption of usual  activities and exercise, and psychological measures for  those with persistent symptoms.\nManagement guidelines  for different stages of BP and for different contexts  should also be recommended.\nThe recent Lancet Series  documented high level of the inappropriate investigations  and treatments that are contributing to the LBP burden for  both individuals and society.\nKey recommended principles  for LBP would be to reduce unnecessary imaging and  treatment, support people to be active and stay at work, and  to only use medication, imaging, and surgery prudently (33).\nFor high-risk cases, prevention and early intervention could  be considered.\nreported a stepped, stratified,  and matched care approach might reduce wastage of clinical  time and resources (34).\nfrom LBP vary substantially between countries, and would  increase in the coming decades.\nMany of the risk factors  (such as obesity, increased motorization and work-related  issues) associated with LBP identified in those highincome countries are also present in developing countries  (1,4,35,36).\nHigh-income countries are likely to have better  developed health systems to manage this increasing burden.\nFor these low-income and middle-income countries,  health systems are most likely not as well developed, and,  therefore, will face greater challenges in managing the  impact of the growing LBP burden.\nGreater efforts are urgently needed to  expand the amount of comparable data on the prevalence  of LBP at national and sub-national levels.\nFuture  investigation should also include the effectiveness, costeffectiveness of preventive and therapeutic strategies.\nThe global prevalence and YLD rates from LBP decreased  slightly from the 1990 to 2017, but the number of LBP  sufferers and YLDs increased substantially.\nPrevalence  and YLDs were higher in females than males.\nPrevalence  increased with age, and YLDs peaked at around 35 to 49  years of age.\nGlobally, LBP remains the leading global cause  of YLDs, yet it continues to be inadequately recognized as  a disease burden in the population with the major disparity  continuing between the level of burden, and the policy,  research and health services response.\nWe would like to thank the Global Burden Disease 2017  Study for the data.\nAnnals of Translational Medicine.\nConflicts of Interest: The authors have no conflicts of interest  to declare.\nEthical Statement: The authors are accountable for all  aspects of the work in ensuring that questions related  to the accuracy or integrity of any part of the work are  appropriately investigated and resolved.\nNo identified  patient information was included in this study, therefore,  the ethical approval was not needed.\nOpen Access Statement: This is an Open Access article  distributed in accordance with the Creative Commons  Attribution-NonCommercial-NoDerivs 4.\n0), which permits the noncommercial replication and distribution of the article with  the strict proviso that no changes or edits are made and the  original work is properly cited (including links to both the  formal publication through the relevant DOI and the license).\nA systematic review of  the global prevalence of low back pain.\nDeyo RA, Cherkin D, Conrad D, et al.\nCost, controversy,  crisis: low back pain and the health of the public.\nNon-specific low  back pain.\nBest Pract Res Clin Rheumatol 2010;24:769-81.\nHow does pain  lead to disability? A systematic review and meta-analysis of  mediation studies in people with back and neck pain.\nGlobal, regional,  and national incidence, prevalence, and years lived with.\ndisability for 354 diseases and injuries for 195 countries  and territories, 1990-2017: a systematic analysis for  the Global Burden of Disease Study 2017.\nThe global burden  of occupationally related low back pain: estimates from  the Global Burden of Disease 2010 study.\nAnn Rheum Dis  2014;73:975-81.\nWhat low  back pain is and why we need to pay attention.\nLow back  pain: a call for action.\nof low back pain: estimates from the Global Burden of  Disease 2010 study.\nof non-surgical treatments, re-discectomy and minimally  invasive transforaminal lumbar interbody fusion in postdiscectomy pain syndrome.\nGlobal, regional, and national incidence,  prevalence, and years lived with disability for 328 diseases  and injuries for 195 countries, 1990-2016: a systematic  analysis for the Global Burden of Disease Study 2016.\nfrom 1990 to 2017 and projecting attainment to 2030  of the health-related Sustainable Development Goals  for 195 countries and territories: a systematic analysis  for the Global Burden of Disease Study 2017.\nBest Pract Res Clin Rheumatol  2010;24:155-65.\nlived with disability caused by low back pain in China,  1990 to 2016: findings from the global burden of disease.\nAnnals of Translational Medicine.\nnational age-sex-specific mortality and life expectancy,  1950-2017: a systematic analysis for the Global Burden of  Disease Study 2017.\nIncreased low back pain.\nprevalence in females than in males after menopause age:  evidences based on synthetic literature review.\nMenopause as a potential cause for higher.\nprevalence of low back pain in women than in age-matched  men.\nJ Orthop Translat 2016;8:1-4.\nAlliance for Musculoskeletal Health survey module for  estimating the population prevalence of musculoskeletal  pain: findings from the Solomon Islands.\nPsychological factors in chronic.\npain: evolution and revolution.\nprevalence really decrease with increasing age? A  systematic review.\nimaging as a screening tool.\nPrevalence and distribution of intervertebral disc  degeneration over the entire spine in a populationbased cohort: the Wakayama Spine Study.\nlongitudinal study of back pain and radiological changes in  the lumbar spines of middle aged women.\nMillecamps M, Tajerian M, Naso L, et al.\nintervertebral disc degeneration associated with axial and  radiating low back pain in ageing SPARC-null mice.\nLumbar vertebral endplate lesions: associations with disc  degeneration and back pain history.\ntreatment of low back pain: evidence, challenges, and  promising directions.\nhigh-risk cases of acute low back pain? A comparison  of stepped, stratified, and matched care.\nfor Low Back Pain: A Population-Based Longitudinal  Study.\nArthritis Care Res (Hoboken) 2019;71:290-9.\nVlaeyen JWS, Maher CG, Wiech K, et al.\nNat Rev Dis Primers 2018;4:52.\nHoy D, Geere JA, Davatchi F, et al.\nOpportunities for preventing the growing burden and  disability from musculoskeletal conditions in lowand  middle-income countries.\n1990 to 2017: estimates from the Global Burden of Disease.\nAnn Transl Med 2020;8(6):299."}