{"title": "2.pdf", "contents": "Non-specifi c low back pain aff ects people of all ages and is a leading contributor to disease burden worldwide.\nManagement  consists of education and reassurance, analgesic medicines, non-pharmacological therapies, and timely review.\nThe  clinical course of low back pain is often favourable, thus many patients require little if any formal medical care.\nIntroduction Low back pain is a symptom rather than a disease.\nThe most common form of low back  pain is non-specifi c low back pain.\nThis term is used  when the pathoanatomical cause of the pain cannot  be determined.\n1 Low back pain was more  common in female than male individuals and in those  aged 4069 years than in other age groups.\nThe study reported a positive correlation  between a countrys human development index and  overall mean prevalence of low back pain (r=0088;  p<0001).\nLow back pain is the leading cause of years lived with  disability in both developed and developing countries,  and sixth in terms of overall disease burden (disabilityadjusted life-years).\n2,3 Many people with low back pain do  not seek care; a review of ten population-based studies  (13 486 people) reported a pooled prevalence of careseeking of 58% (95% CI 3283).\n4 Care-seeking is more  common in women, and in individuals with previous low  back pain, poor general health, and with more disabling  or more painful episodes.\nThe long-held belief that childhood low back pain is  rare has been dispelled during the past decade.\nA study  of 402 406 adolescents from 28 countries found that  370% (95% CI 368371) reported low back pain  monthly or more frequently.\n5 Low back pain was slightly  more common in girls than boys (389% vs 350%).\nPrevalence increased with age, ranging from 274%  (95% CI 272277) in 11-year-olds, to 370% (367372)  in 13-year-olds, to 467% (465470) in 15-year-olds.\nLow back pain in childhood predicts low back  pain in adult life.\nA study of 10 000 Danish twins reported  that those who had low back pain in adolescence were  twice as likely to have it as adults (odds ratio [OR] 20  [95% CI 1724]).\nWe analysed data regarding risk factors for developing  low back pain that were derived from systematic reviews  of cohort studies.\nA review of lifting at work identifi ed  that both the weight of the load (OR 111 [95% CI  105118] per 10 kg lifted) and the number of lifts  (OR 109 [103115] per ten lifts per day) increased risk.\n7  In terms of lifestyle factors, smoking (OR 130  [116145]),8 obesity (OR 153 [122192]),9 and  depressive symptoms (OR 159 [126201])10 all  increased the risk of developing low back pain.\n11 Low back pain is a major contributor  to health-care costs; typically, indirect costs are much  higher than direct costs.\nLancet 2017; 389: 73647.\nCorrespondence to: Prof Chris Maher, Musculoskeletal  Division, The George Institute for  Global Health, Sydney Medical  School, University of Sydney,  PO Box M201, Missenden Road,  NSW 2050, Australia cmaher@georgeinstitute.\nAdditionally, we  identifi ed current clinical guidelines, searched our existing  records for relevant publications, and examined the reference  lists of studies retrieved by the searches.\nRadicular pain (sciatica) is not discussed in  this Seminar.\nAUS$1 billion of this amount accounted for by direct  health-care costs.\nFor the individual, low back pain can have profound  economic eff ects.\nPeople with the disorder accumulate  less wealth than those without the problem.\n13 This eff ect  increases with the addition of comorbidities.\n13 Low back  pain is the leading chronic health problem forcing older  workers to retire prematurely, and forcing more people  out of the workplace than heart disease, diabetes,  hypertension, neoplasm, respiratory disease, and asthma  combined.\nSeveral systematic syntheses of qualitative research  describe the experience of living with low back pain.\nFroud and colleagues16 (42 studies) suggest that patients  main concerns are the need to seek diagnosis, treatment,  and cure as well as reassurance of the absence of  pathological abnormality; concerns about regaining  previous levels of health, physical and emotional stability,  and engaging in meaningful activities; meeting social  expectations and obligations; and wanting to be believed  and have their experiences validated.\nMacNeela and coworkers17 (38 studies) identifi ed four themes: the  undermining infl uence of pain, its disempowering  impact, unsatisfying relationships with health-care  professionals, and learning to live with the pain.\nBunzli  and  colleagues18  (18  studies)  conceptualised  the  experience of low back pain as suspended wellness,  suspended self, and suspended future.\nSnelgrove  and colleagues19 (28 studies) identifi ed the eff ect on  oneself, relationships with others (family and friends,  health professionals, and organisation of care), and  coping strategies as important themes.\nClinical presentation, signs, and symptoms In a study of 1172 consecutive patients with acute low  back pain attending Australian primary care (family  doctor, physiotherapist, or chiropractor), most (76%)  reported having a previous episode.\n20 Most patients had  moderate to very severe pain intensity (80%) that caused  moderate to extreme interference with daily function  (76%).\nPatients reported problems being able to cope  with their pain and were worried about the risk of  persistence.\nA third (36%) were already taking medication  for the disorder.\nAlthough most patients were working  before the episode (76%), claims for compensation were  uncommon (14%).\nAcute low back pain can be triggered by physical factors  (eg, lifting awkwardly) or psychosocial factors (eg, being  fatigued or tired), or by a combination of the two (eg,  being distracted while lifting).\n22  New episodes are more likely to begin early in the  morning.\n24 Findings from a US  study of 182 million emergency department presentations for low back pain showed that 81% of episodes  began at home, with lifting the most commonly cited  cause.\nBy contrast, in  Scottish general practice, consultations are much more  common in middle age than early adulthood, with a  further slight increase in old age (75 years).\nOlder people have greater physical disability  as a consequence of their low back pain than have  younger people.\nDiff erential diagnosis Low back pain is a symptom that accompanies several  diseases.\nThe diagnosis of non-specifi c low back pain  implies no known pathoanatomical cause.\nTriage aims to  exclude those cases in which the pain arises from either  problems beyond the lumbar spine (eg, leaking aortic  aneurysm); specifi c disorders aff ecting the lumbar  spine (eg, epidural abscess, compression fracture,  spondyloarthropathy, malignancy, cauda equina syndrome); or radicular pain, radiculopathy, or spinal canal  stenosis.\nRemaining cases are non-specifi c low back  pain.\nMost low back pain is non-specifi c (commonly cited as  90%).\n29 Deyo and Weinstein30 estimated that of patients  with low back pain in primary care, about 4% would  have a compression fracture, 3% would have spinal  stenosis, 2% would have visceral disease, 07% a  tumour or metastasis, and 001% an infection.\nIn the  previously mentioned Australian study (1172 patients  with acute low back pain in primary care), fewer than  1% of patients had specifi c causes for their pain.\n31 Only  11 cases of serious disease were identifi ed: eight patients  with osteoporotic fractures, two with infl ammatory  arthritis, and one with cauda equina syndrome.\nA Dutch  primary care study of 669 people (aged >55 years) with  back pain identifi ed 33 cases of fracture and four cases  of spinal malignancy.\n32 Once osteoporotic fractures,  which largely aff ect older people, are excluded, specifi c  causes of low back pain are very uncommon in primary  care, but are more common in secondary and tertiary  settings.\nIn a Cochrane diagnostic review (14 studies),  the median prevalence of fracture in patients presenting  with low back pain was 36% in primary care and 65%  in secondary and tertiary care.\nfurther diagnostic work-up for serious disorders.\nThere  are many possible red fl ags.\nAlthough these are worthy of  elicitation as part of the clinical assessment, taken alone  few have useful diagnostic accuracy.\nA Cochrane review  concluded that only one of 24 red fl ags for malignancy  had acceptable diagnostic accuracy.\n34 The problems with  false positives are well illustrated in an Australian study,  in which 80% of patients with acute low back pain had at  least one red fl ag present, yet fewer than 1% had a  medically serious disease.\n31 Part of the problem is  considering a single clinical feature in isolation.\nA more  useful approach is to rely on a combination of clinical  features to identify individuals who require further  diagnostic work-up.\nDiagnostic investigations Diagnostic investigations have no role in the management  of non-specifi c low back pain.\nAlthough diagnoses based  on lumbar structures (discogenic low back pain, facet  joint pain, sacroiliac joint pain) remain popular in some  settings, the available clinical tests for these conditions  have insuffi  cient accuracy.\nDiagnostic investigations have a role when the clinician  suspects a specifi c disease process that would be  managed diff erently from non-specifi c low back pain.\nThe threshold for triggering investigations should refl ect  both the consequence of missing or delaying the  diagnosis and the clinicians assessment of the likelihood  of a more serious disease being present.\nfactors for cancer, risk factors for spinal infection or  cauda equina syndrome, or severe neurological defi cits.\n36  By contrast, these guidelines advise deferral of imaging  pending a trial of therapy when there are weaker risk  factors for cancer or risk factors for spondyloarthritis,  vertebral compression fracture, radiculopathy, or spinal  stenosis (table 1).\nFindings from a systematic review (12 studies) did not  show consistent associations between MRI fi ndings and  future episodes of low back pain.\n46 Although guidelines  discourage routine imaging for non-specifi c low back  pain,47 this approach remains common.\nIn Australian48  and US primary care,49 about a quarter of patients  presenting with a new episode of low back pain undergo  imaging.\nIn a US emergency department setting, a third  of patients received imaging,50 compared with more than  a half of patients in an Italian emergency department.\n51  Attempts to establish what proportion of imaging  procedures were not indicated range from 54% for a US  health insurer,52 to 47% at four Iranian radiology clinics,53  to 31% in the US Veterans Health Administration.\n54 Both  patients55,56 and clinicians57,58 erroneous beliefs that  imaging is essential in the management of low back pain  are potential drivers of unnecessary imaging.\nIndiscriminate imaging is costly (and time-consuming),  can cause unnecessary exposure to radiation, and might  be harmful.\nA systematic review39 of six randomised  controlled trials established that imaging does not  improve clinical outcomes.\nObservational studies have  linked liberal imaging with greater work absence, and  greater use of other health services including injections.\nCancer NICE guidance advises investigation for myeloma in people aged 60 years or older with persistent bone pain (particularly  back pain) or unexplained fracture and investigation for pancreatic cancer in people aged 60 years or older with back pain  and weight loss.\n41 The most common causes of bony metastases are breast, lung, and prostate cancer.\nTogether, these  cancers account for 68% of bony metastases,42 including spine.\nOther tumours, including renal and gastric cancer, can also  metastasise to the spine and spinal metastases can be the fi rst presentation of cancer.\nWe were unable to fi nd good  epidemiological data for the incidence of new-onset spinal metastases after apparently successful treatment for cancer.\nFor strong suspicion of cancer: FBC, ESR, CRP; MRI43.\nVertebral infection New onset of low back pain with fever and history of intravenous drug use or recent infection, immunosuppression,  recent spinal procedure or fever/chills in addition to pain with rest or at night.\nConsider spinal tuberculosis in endemic  areas or in migrants from these areas.\nUrgent referral for specialist care.\nCauda equina  syndrome New bowel or bladder dysfunction, saddle anaesthesia, persistent or increasing lower motor neuron weakness MRI and CT Urgent referral to spine surgeon.\nFor strong suspicion of axial spondyloarthritis refer to a  rheumatologist.\nIf unsure, defer work-up until a trial of  therapy has been completed.\nIf no response, and suspicion  remains, refer to a rheumatologist.\nBack pain with leg pain in an L4, L5, or S1 nerve root distribution, positive result on straight leg raise or crossed straight  leg raise test.\n44 Sensory loss, weakness, or reduced refl ex  (ie, evidence of radiculopathy).\nDefer work-up until a trial of therapy has been completed;  consider MRI in patients who are candidates for surgery.\nSpinal canal stenosis Bilateral buttock, thigh, or leg pain; older age; pseudoclaudication Defer work-up until a trial of therapy has been completed;  consider MRI in patients who are candidates for surgery.\n*At least four of (1) age at onset 40 years or younger; (2) insidious  onset; (3) improvement with exercise; (4) no improvement with rest; and (5) pain at night (with improvement upon getting up).\n59,60 Imaging can detect incidental fi ndings  that could be viewed by a clinician as targets for therapy  or a cause for concern by the patient.\nFor example, a  review of 33 studies (3310 patients) reported that the  prevalence of disc bulge in asymptomatic people was  30% in 20-year-olds, 60% in 50-year-olds, and increased  to 84% in 80-year-olds.\nPrevention There are popular interventions to prevent low back  pain that are based around limiting exposure to risk  factors.\nExamples of interventions that aim to reduce  excessive loading of the spine include use of lifting  devices in workplaces, braces to support the spine, and  ergonomic offi  ce furniture.\nA 2016 review (21 studies, 30 850 patients) concluded  that exercise alone or in combination with education is  eff ective for preventing low back pain, whereas other  interventions, including education alone, back belts, and  shoe insoles, do not seem to prevent low back pain.\n62  Although some caution is required because the trials are  typically quite small, the size of the protective eff ect for  interventions found eff ective was large.\nFor example,  exercise and education reduced the risk of an episode of  low back pain in the next year by 45%, whereas exercise  alone reduced the risk by 35%.\nThe programmes did not  just focus on back-specifi c exercises, but also included  exercises for the upper and lower limbs plus exercises to  improve aerobic fi tness, strength, fl exibility, and skill or  coordination.\nFor  example, the exercise programme investigated by Soukup  and colleagues63 required participants to complete  20 group sessions of exercises and education over  13 weeks.\nClinical course The clinical courses of acute and persistent low back pain  are typically presented as being completely diff erent.\nA  common view is that most cases of acute low back pain  recover completely within 46 weeks but persistent low  back pain has a very poor prognosis with recovery  unlikely.\nThis simple portrayal of the course of low back  pain needs reconsideration.\nA systematic review (24 studies, 4994 patients)  summarised the clinical course of low back pain with  pooled mean pain scores expressed on a 0 (no pain)  to 100 (worst possible pain) scale.\n64 For 15 cohorts with  acute pain, the pooled mean pain score was 52 (95% CI  4857) at baseline, 23 (2125) at 6 weeks, 12 (915) at  26 weeks, and six (310) at 52 weeks, whereas for six  cohorts with persistent pain the pooled mean pain score  was 51 (4459), 33 (2938), 26 (2033), and 23 (1630) at  the same timepoints.\n72% of patients with acute low back pain had completely  recovered by 12 months,65 whereas 42% of those with  persistent low back pain66 recovered within 12 months.\nOf  those presenting with acute pain who recovered, 33%  (95% CI 2838) had a recurrence within the next  12 months.\nAnother view of the course of low back pain comes  from studies that characterised the prognoses of  individual patients by studying their trajectories of pain  over time.\nA secondary analysis of the PACE trial34  (1585 patients) identifi ed fi ve clusters of pain trajectories  during a 12-week period for patients receiving fi rst-line  care for acute low back pain; 36% had rapid recovery,  34% improved more slowly but recovered by 12 weeks,  14% had incomplete recovery by 12 weeks, 11% had  fl uctuating pain, and 5% had persistent high pain during  the 12-week period.\nA range of biological, psychological, societal, and work  factors are linked to poor outcomes.\nA review of  17 systematic reviews of the prognosis of low back pain  (162 primary studies) reported that the following factors  were consistently associated with poor outcome: higher  disability, presence of sciatica, older age, poor general  health, increased psychological or psychosocial distress,  negative cognitive characteristics, poor relationships  with colleagues, heavy physical work demands, and  presence of compensation.\nAcute management Table 2 summarises the evidence from systematic reviews  about the eff ects of treatments for acute low back pain on  short-term pain outcomes.\nBy defi nition, non-specifi c low back  pain does not have a known pathoanatomical cause.\nThere  are, therefore, no specifi c treatments that can be provided  for non-specifi c low back pain.\nInstead, management  focuses on reducing pain and its consequences, including  any associated disability.\nAlthough there are some slight  diff erences between clinical practice guidelines from  various countries,47 the advice for management is quite  similar.\nThe main components of management consist of  education  and  reassurance,  analgesic  medicines,  non-pharmacological therapies, and timely review based  on individual patient needs, likely prognosis, treatment  prescribed, and remaining concerns about serious  pathological abnormality.\nFollowing clinical assessment, the clinician should  explain to the patient that a medically serious cause for his  or her low back pain is highly unlikely, and there is no  current need for any tests or imaging.\nThis discussion is  important because many patients expect imaging to be  done and some also worry that their low back pain is a  sign of something serious.\nidentifying the cause of non-specifi c low back pain  (ie, degenerative changes are commonly present and  increase with age irrespective of the presence of low back  pain), and advised that it is unlikely to alter the immediate  management of their problem.\nThe next step is to educate  the patient about the problem, its cause(s), and likely  outcome, explain that little or no medical treatment is  required for most patients, and outline what the patient  can do to promote recovery.\nIdentifying and addressing  any misconceptions the patient might have,79,80 either by  providing the patient with the opportunity to ask questions  or by probing questions, is important, because  misconceptions about low back pain are quite common55,81  and could adversely aff ect outcome.\nPatient education can be eff ective for outcomes such as  return to work and global impression of recovery.\n84  Although education might seem simple, many patients  do not receive any education for their low back pain from  their family doctor.\n48 A systematic review (14 trials,  4872 participants) concluded that patient education in  primary care does provide long-term reassuranceie,  reduces the fears and concerns of the patient and reduces  subsequent primary care visits for low back pain.\nNotably, education was more eff ective when provided by  a medical doctor than by a nurse or physiotherapist.\nTraditionally, bed rest was advised for low back pain.\nThe contemporary view is that in most cases it should be  avoided.\nThe patient should remain as active as possible  and either continue or gradually resume their normal  activity levels, and if possible remain at work.\nThe patient  should also be encouraged to use simple self-care options  to relieve pain such as use of a hot pack.\nClinical practice guidelines traditionally endorsed the  WHO analgesic ladder,47 beginning with simpler options  before moving to more powerful analgesics.\nHowever,  paracetamol is ineff ective for acute low back pain71 and  no trials have assessed the effi  cacy of opioids for acute  pain.\n74,86 Although there is evidence of eff ectiveness of  non-steroidal anti-infl ammatory drugs (NSAIDs)87 and  muscle relaxants,73,87 any potential benefi ts should be  weighed against the risk of harm.\nA 2015 trial  (323 patients) reported similar outcomes in patients  receiving naproxen plus placebo, naproxen plus  cyclobenzaprine (a muscle relaxant), or naproxen plus  oxycodone and paracetamol.\n88 Because of the paucity of  evidence on opioid eff ectiveness, and concerns that the  use of opioids for low back pain generates serious  avoidable harms,89 their use is questionable.\nHowever,  surveys show that the use of opioids is higheg, they  are prescribed to 45% of patients presenting with low  back pain at emergency departments in the USA.\n90 The  2016 UK National Institute for Health and Care  Excellence (NICE) draft guideline for management of  low back pain91 moves away from the traditional analgesic  ladder and advises only two options: oral NSAIDs at the  lowest eff ective dose for the shortest time possible and  the use of a weak opioid (with or without paracetamol) if  the patient does not tolerate or respond to an NSAID.\nNon-pharmacological therapies for acute low back pain  include treatments such as manual therapy, exercise,  massage, and acupuncture.\nGuidelines vary in their  recommendations for these therapies.\nOne approach is  to only consider these therapies for patients who do not  respond to fi rst-line care (education, reassurance, and  analgesic medicines).\nThe rationale for this approach is  that the clinical course of acute pain when patients  receive good-quality fi rst-line care is favourable: about  50% of patients recover completely in 23 weeks.\n92  Although not associated with substantial harms,  providing non-pharmacological therapies to all patients  is unnecessary and wasteful of health-care resources.\nA recent development of this approach is to use brief  risk prediction methods such as the short-form rebro  Musculoskeletal Pain Screening Questionnaire93 and the  Keele STarT Back Screening Tool94,95 to identify patients  with an increased likelihood of delayed recovery and to  intervene with these patients from day one, rather than  waiting for failure of fi rst-line care.\nBed rest vs staying active69 04 (32 to 40) Low.\nHeat vs sham70 322 (387 to 252) Very low*.\nParacetamol71 05 (29 to 19) High.\nNSAIDs72 84 (127 to 41) High*.\nMuscle relaxants73 213 (290 to 135) High.\nOpioids74 No trials Very low.\nManual therapy vs inert interventions75 120 (200 to 40) Low.\nManual therapy vs all other  treatments75 15 (49 to 18) Low.\nMassage vs inactive control76 205 (370 to 128) Very low.\nExercise vs no treatment, sham, or  placebo77 06 (115 to 127) High*.\nExercise vs other conservative  treatment77 03 (51 to 42 High*.\nAcupuncture vs placebo78 106 (253 to 41) Moderate.\nNegative eff ects represent greater pain reduction.\nEff ects in  standardised mean diff erences were transformed presuming an SD of 20.\n*Our GRADE rating because  none originally provided.\nFor example, the short-form  rebro questionnaire includes ten items to assess pain,  function, recovery expectations, psychological distress,  and fear of pain or movement.\nLong-term management No treatments can cure persistent low back pain, but  interventions are available that reduce pain and disability,  and address the consequences of long-term pain (table 3).\nMany patients and clinicians fi nd this position hard to  accept, which provides a fertile ground for people with  vested interests to market non-evidence-based treatments  that purport to cure persistent back pain.\nPart of the  challenge of managing persistent low back pain is to  guide patients away from the wide array of centres and  therapists making false promises.\nThe eff ects of chronic pain on patients varies  substantially, from those who experience minimal  disruption to their life through to people who are severely  disabled and for whom participation in work, social, and  family roles is severely restricted.\nFor some patients,  dependence on prescribed medication, alcohol, or other  drugs, and psychological distress complicate their  presentation.\nWhen the eff ect of the pain becomes  broader, and the health and social problems to be  managed more complex, team-based care is usually  required.\nBy comparison with management of acute low  back pain, the management of persistent low back pain  has greater emphasis on non-pharmacological therapies  and greater consideration of management of comorbidities such as depression.\nThe messages for education and reassurance are much  the same as for acute low back painie, provide advice  and information to explain the nature and likely course  of low back pain, promote self-management, and  encourage the patient to be as physically active as possible  and remain at work.\nThe  guideline explicitly advises against opioids for chronic  low back pain, arguing that their eff ect on pain and  function is too small to be clinically important.\nHowever,  this advice seems inconsistent with the endorsement of  other therapies with similarly small eff ect sizes, such as  exercise and manual therapy.\npersistent low back pain: (1) discuss harms and benefi ts  with the patient; (2) keep the dose as low as possible and  consider intermittent prescription; (3) begin with a short  trial and discontinue if treatment goals are not met; and  (4) use a pain contract to establish expectations.\nThe 2016  US Centers for Disease Control and Prevention (CDC)  guideline for prescribing opioids for chronic pain advises  that  non-pharmacologic  therapy  and  non-opioid  pharmacologic therapy are preferred for chronic pain  and that if opioids are used, they should be combined  with  non-pharmacologic  therapy  and  non-opioid  pharmacologic therapy.\nLeading authorities in the low back pain specialty have  warned that opioids have been prescribed too freely for  low back pain and with insuffi  cient care.\nExercise vs no treatment, sham, or placebo77 858 (1846 to 129) High*.\nExercise vs other conservative treatment77 447 (741 to 153) High*.\nAcupuncture vs placebo78 111 (233 to 11) Moderate.\nAcupuncture vs no treatment78 119 (217 to 021) Moderate.\nUltrasound vs placebo99 71 (180 to 38) Low.\nCognitive behavioural therapy vs waiting list control101 120 (194 to 44) Moderate*.\nBehavioural treatment vs other treatments (exercise)101 231 (633 to 170) Moderate*.\nMultidisciplinary treatment vs usual care102 110 (74 to 08) Moderate.\nMultidisciplinary treatment vs physical treatments102 60 (108 to 12) Moderate.\nRadiofrequency denervation facet joint vs placebo103 147 (228 to67) Low.\nRadiofrequency denervation disc vs placebo103 41 (154 to 72) Low.\nRadiofrequency denervation SIJ vs placebo103 212 (545 to 121) Low.\nTreatment eff ects are weighted mean diff erences  with 95% CI for 0100 point pain scale at short-term follow-up; negative eff ects represent greater pain reduction.\nEff ects in standardised mean diff erences were transformed presuming an SD of 20.\nQuality of evidence is the GRADE  rating on a scale from very low to high.\nNSAIDs=non-steroidal anti-infl ammatory drugs.\nTENS=transcutaneous  electrical nerve stimulation.\n*Our GRADE rating because none originally provided.\n76 Although the Cochrane review of  radiofrequency denervation reported a short-term eff ect for facet joint pain, the investigators emphasised the lack of  high-quality evidence.\ncom   Vol 389   February 18, 2017.\n107,110 This  discrepancy is an important evidence gap because about  half the people taking opioids long term have persistent  low back pain.\n89 Contrary to popular opinion, opioids  have only modest eff ects on pain in patients with chronic  low back pain and no benefi t on function; furthermore,  about 50% of patients do not tolerate the medicine.\nNon-pharmacological treatments are emphasised over  pharmacological interventions in the management of  persistent non-specifi c low back pain.\nFor example, the guideline from  the American College of Physicians and the American Pain  Society40 endorses manual therapy, exercise therapy,  massage, acupuncture, yoga, cognitive behavioural therapy,  and intensive interdisciplinary treatment, whereas the 2016.\nManual therapy includes high velocity thrust techniques  (manipulation, adjustment) and lower velocity oscillatory  techniques (mobilisation).\nMassage has mixed support.\nReturn to work programmes are endorsed in the 2016 NICE  draft guideline.\nExercise includes approaches that follow exercise physiology  principles, traditional mind-body exercises (eg, Tai Chi,  yoga112), styles that emphasise precise control of movement  and bodily awareness (eg, pilates,113 motor control exercise,114  Alexander technique115,116), and approaches that incorporate  psychological principles (eg, graded exposure, graded  activity117).\nA 2005 Cochrane review supports eff ectiveness.\n77  The 2016 NICE draft guideline recommends group exercise,91  but there is evidence that this format is less eff ective than  individually supervised programmes.\nAcupuncture has mixed support.\nCognitive behavioural therapy has evidence from a Cochrane  review that it is eff ective in the short term.\n101 The extended  follow-up of the BEST trial121 showed a long-term benefi t.\nThe 2016 NICE draft guideline advises that psychological  therapies should only be used as part of multimodal  treatment packages.\nMultidisciplinary treatment is endorsed in the ACP/APS  guideline40 and the 2016 NICE draft guideline91 (where it is  called combined physical and psychological therapy).\nA 2014  Cochrane review102 showed that the treatment is eff ective for  reducing pain, disability, and improving work status.\nInjections are not a recommended treatment in either the  ACP/APS guideline or the 2016 NICE draft guideline.\nRadiofrequency neurotomy is endorsed for low back pain  thought to arise from the facet joints in the 2016 NICE draft  guideline,91 but a 2015 Cochrane review103 does not support  this procedure for pain thought to arise from facet joint, disc,  or sacroiliac joint on the grounds that high-quality evidence  is absent (four very low quality trials, 160 patients).\nA 2016  Dutch trial122 (251 patients) showed that the addition of  radiofrequency neurotomy to an exercise programme was  not eff ective or cost-eff ective for patients with low back pain  thought to arise from the facet joints.\nEpidural steroid injections have a small short-term eff ect in  people with radicular pain and no benefi t for spinal  stenosis,123 but are not indicated for non-specifi c low back  pain as indicated in the recommendations of the 2016 NICE  draft guideline.\nProlotherapy (injection of irritating solutions into ligaments)  has not proved eff ective.\nAntibiotic prescription for low back pain accompanied by  modic changes is controversial.\nThis strategy has support  from one trial,125 but the trial and its rationale have been  challenged.\n126 The 2016 NICE draft guideline did not off er a  recommendation for or against use of antibiotics in patients  with low back pain.\nReferral for an opinion about surgery is often considered  for those who do not respond to conservative care, but the  logic of this approach is questionable because most  surgical interventions used for chronic low back pain are  either known to be ineff ective or have not been clinically  assessed.\nSpinal fusion is commonly used in patients with  persistent low back pain but does not provide better  outcomes than conservative care.\n127 The 2016 NICE draft  guideline advises against disc replacement and  recommends spinal fusion only be done within a  randomised controlled trial.\nNICE draft guideline91 endorses self-management, exercise,  manual therapy, psychological therapies, combined  physical and psychological programmes, return-to-work  programmes, and radiofrequency denervation.\nSeveral  non-pharmacological therapies are not endorsed in the  2016 NICE draft guideline,91 such as electrotherapies (eg,  ultrasound and electrical stimulation), traction, belts or  corsets, foot orthotics, and rocker sole shoes.\nA brief  summary of the evidence for non-pharmacological  interventions for persistent low back pain is provided in the  panel and table 3.\nControversies and uncertainties Although low back pain occurs in both children and  older people, we have a limited understanding of how to  manage the problem in these groups because they are  usually  excluded  from  studies  of  interventions.\nA systematic review of the management of low back pain  in children and adolescents identifi ed only 15 trials,128 but  a search of CENTRAL on March 18, 2016, across all age  groups, identifi ed 5354 trials.\nMany trials exclude  workers, people with comorbidities, individuals on  compensation, or immigrants who do not speak the  language of the country; this evidence gap is important  because these patient groups tend to have a worse  prognosis when they have low back pain.\nA belief that individualised treatment will yield better  outcomes is widespread in the clinical back pain  community.\n129 Most of the studies that have claimed to  provide evidence of treatment eff ect modifi cation are  fl awed,130132 and the small number of robust studies  either await replication or have not had their results  replicated.\n133 One of the challenges in this area is that  claims of a subgroup eff ect are more credible if they have  a biological rationale,134 which is challenging for nonspecifi c low back pain.\nThe use of injection and ablation techniques that target  putative structural causes of non-specifi c low back pain  polarises the clinical community and this controversy is  well illustrated by the confl ict between the Cochrane  review103 and the 2016 NICE draft guideline.\n91 The  detractors dismiss the validity of the tests used to identify  the anatomical structure that is the pain generator, and  point to the disappointing trial results.\n38,103,135 The  proponents counter that the negative studies should be  ignored because they result from poor clinical care and  argue that the positive studies show the potential of the  treatments when applied to the right patients by skilled  treatment providers.\nOutstanding research questions A major issue is how best to close the large gaps between  evidence and practice that persist in the management of  low back pain.\nThe many attempts worldwide to infl uence  clinical practice and improve uptake of evidence into  routine management have yielded disappointing results.\nbarriers to clinician adherence to low back pain  guidelines reported that clinicians believe that guidelines  constrain professional practice, popular clinical practices  supersede the guidelines, and imaging can be used to  manage  consultations.\n58  Patient  expectations,  reimbursement schedules, and access to care might also  contribute to gaps between evidence and practice.\nFew implementation trials  have been done,138 and the published trials have shown  disappointing results.\n139 Another strategy that has yielded  mixed results is use of public health approaches such as  mass media campaigns that aim to shift low back pain  beliefs of the whole population.\nProbably the greatest outstanding research priority  draws from the question that clinicians face every day  from their patients: what is causing my low back pain? A  key limitation of existing management of non-specifi c  low back pain is that it is only possible to use generic  treatments to address the pain and its consequences.\nAlthough this approach works to some degree, the eff ect  sizes for treatments are at best modest.\nThe identifi cation  of low back pain phenotypes with either an identifi ed  pathoanatomical basis, or defi ned through clinical  reasoning, will probably open up new approaches to  management that directly target the cause of the low  back  pain  and  its  consequent  disability.\nThis  understanding has the potential to help the many people  with disabling low back pain worldwide.\nHe is chief investigator or co-investigator on multiple previous  and current research grants from the UK National Institute for Health  Research.\nHe has completed trials of manual therapy, group exercise, and  a cognitive behavioural approach as treatments for low back pain.\nCurrent  grants include HTA Project 11/31/01, which is testing the feasibility of  running a trial comparing intra-articular facet joint injections with best  usual care.\nHe is an editor of the NIHR journal series for which he  receives a fee.\ncom   Vol 389   February 18, 2017.\nShe chaired the back pain expert group for the 2010  Global Burden of Diseases, Injuries, and Risk Factors (GBD) Study.\nShe was appointed to the Australian Medical Services Advisory Committee  in May, 2016.\nArthritis Rheum 2012; 64: 202837.\n2  Hoy D, March L, Brooks P, et al.\nThe global burden of low back  pain: estimates from the Global Burden of Disease 2010 study.\n3  Global Burden of Disease Study 2013 Collaborators.\nGlobal, regional, and national incidence, prevalence, and years lived  with disability for 301 acute and chronic diseases and injuries in  188 countries, 19902013: a systematic analysis for the Global  Burden of Disease Study 2013.\n4  Ferreira ML, Machado G, Latimer J, Maher C, Ferreira PH,  Smeets RJ.\nFactors defi ning care-seeking in low back paina  meta-analysis of population based surveys.\nEur J Pain 2010;  14: 747.\nAn international survey of pain in adolescents.\nIs comorbidity in  adolescence a predictor for adult low back pain? A prospective study  of a young population.\nThe eff ect of  lifting during work on low back pain: a health impact assessment  based on a meta-analysis.\nThe association between smoking and low back pain:  a meta-analysis.\nThe association between obesity and low back pain: a meta-analysis.\nSymptoms of  depression and risk of new episodes of low back pain: a systematic  review and meta-analysis.\nA systematic review of low back  pain cost of illness studies in the United States and internationally.\nLow back pain in Australian adults:  the economic burden.\nBack problems, comorbidities, and their association with  wealth.\nChronic disease and labour force participation among older  Australians.\nEarly retirement and the fi nancial assets of individuals  with back problems.\nA systematic review and  meta-synthesis of the impact of low back pain on peoples lives.\nExperiences of chronic low back pain: a meta-ethnography of  qualitative research.\nLives on  hold: a qualitative synthesis exploring the experience of chronic  low-back pain.\nLiving with chronic low back pain:  a metasynthesis of qualitative research.\nCharacteristics of  patients with acute low back pain presenting to primary care in  Australia.\nWhat triggers  an episode of acute low back pain? A case-crossover study.\nCan patients identify  what triggers their back pain? Secondary analysis of a case-crossover  study.\nEff ect of weather on back pain:  results from a case-crossover study.\nDoes weather  aff ect daily pain intensity levels in patients with acute low back  pain? A prospective cohort study.\nLow back pain in the  United States: incidence and risk factors for presentation in the  emergency setting.\nBack pain in seniors:  the Back pain Outcomes using Longitudinal Data (BOLD) cohort  baseline data.\nDiagnosis and treatment of  low back pain.\nN Engl J Med 2001;  344: 36370.\nPrevalence of and  screening for serious spinal pathology in patients presenting to  primary care settings with acute low back pain.\nPrevalence and red fl ags  regarding specifi ed causes of back pain in older adults presenting  in general practice.\nRed fl ags to screen for  malignancy and fracture in patients with low back pain: systematic  review.\nTrajectories of acute low back pain: a latent class growth  analysis.\nRed fl ags for back pain.\nDiagnostic  imaging for low back pain: advice for high-value health care from  the American College of Physicians.\nPrimary care management of low back pain.\nAnn Intern Med 2014;  160: ICT6-1.\nImaging strategies for  low-back pain: systematic review and meta-analysis.\nLancet 2009;  373: 46372.\n41  National Institute for Health and Clinical Excellence.\nAcute low back pain.\nPhysical examination  for lumbar radiculopathy due to disc herniation in patients with  low-back pain.\nDevelopment of an ASAS-endorsed  recommendation for the early referral of patients with a  suspicion of axial spondyloarthritis.\nAnn Rheum Dis 2015;  74: 148387.\nDoes magnetic resonance imaging predict future low  back pain? A systematic review.\nAn updated overview of clinical guidelines for the management of  non-specifi c low back pain in primary care.\nLow back pain and  best practice care: a survey of general practice physicians.\nVariation among primary care  physicians in the use of imaging for older patients with acute low  back pain.\nImaging during low back pain ED visits: a claims-based descriptive  analysis.\nLow-back pain at the emergency department:  still not being managed? Ther Clin Risk Manag 2016; 12: 18387.\nearly trends among seven  recommendations from the choosing wisely campaign.\nJAMA Intern Med 2015; 175: 191320.\nThe extent of inappropriate use of magnetic resonance imaging in  low back pain and its contributory factors.\nPatients expectations  of acute low back pain management: implications for evidence  uptake.\nDoctors with a special interest in  back pain have poorer knowledge about how to treat back pain.\nBarriers to  primary care clinician adherence to clinical guidelines for the  management of low back pain: a systematic review and  meta-synthesis of qualitative studies.\nIatrogenic consequences of early magnetic resonance imaging in  acute, work-related, disabling low back pain.\nSpine (Phila Pa 1976)  2013; 38: 193946.\nThe cascade of medical services and associated longitudinal costs  due to nonadherent magnetic resonance imaging for low back pain.\nPrevention of low back  pain: a systematic review and meta-analysis.\nThe eff ect  of a Mensendieck exercise program as secondary prophylaxis for  recurrent low back pain.\nThe prognosis of acute and persistent  low-back pain: a meta-analysis.\nPrognosis in patients  with recent onset low back pain in Australian primary care:  inception cohort study.\n66  Costa Lda C, Maher CG, McAuley JH, et al.\nAfter an episode of acute low back pain, recurrence is  unpredictable and not as common as previously thought.\nSystematic reviews of low back pain prognosis had variable  methods and results: guidance for future prognosis reviews.\nAdvice to rest in  bed versus advice to stay active for acute low-back pain and sciatica.\nSuperfi cial heat or cold for low back pain.\nEffi  cacy and safety of  paracetamol for spinal pain and osteoarthritis: systematic review  and meta-analysis of randomised placebo controlled trials.\nNon-steroidal anti-infl ammatory drugs for low back pain.\nEffi  cacy and tolerability of muscle relaxants for low back pain:  systematic review and meta-analysis.\n74  Chaparro LE, Furlan AD, Deshpande A, Mailis-Gagnon A, Atlas S,  Turk DC.\nSpinal manipulative therapy for acute low-back  pain.\nMassage for  low-back pain.\nExercise therapy for treatment of non-specifi c low back pain.\nA systematic review and  meta-analysis of effi  cacy, cost-eff ectiveness, and safety of selected  complementary and alternative medicine for neck and low-back  pain.\n79  Main CJ, Buchbinder R, Porcheret M, Foster N.\nAddressing patient  beliefs and expectations in the consultation.\nHow important are back pain  beliefs and expectations for satisfactory recovery from back pain?  Best Pract Res Clin Rheumatol 2010; 24: 20517.\nAssociation between beliefs and  care-seeking behavior for low back pain.\nExpectation of  recovery from low back pain: a longitudinal cohort study  investigating patient characteristics related to expectations and the  association between expectations and 3-month outcome.\nIndividual patient education for low back pain.\nCochrane Database Syst Rev 2008; 1: CD004057.\nEff ect of primary care-based education on reassurance  in patients with acute low back pain: systematic review and  meta-analysis.\nJAMA Intern Med 2015; 175: 73343.\nEffi  cacy, tolerability and dose dependent eff ects of opioid analgesics  for low back pain: systematic review and meta-analysis.\nMedications for acute and chronic low back pain:  a review of the evidence for an American Pain Society/American  College of Physicians clinical practice guideline.\nNaproxen with  cyclobenzaprine, oxycodone/acetaminophen, or placebo for treating  acute low back pain: a randomized clinical trial.\nOpioids for low back pain.\nInterpreting the National Hospital  Ambulatory Medical Care Survey: United States emergency  department opioid prescribing, 20062010.\nNon-specifi c low  back pain and sciatica: management.\n92 Williams CM, Maher CG, Latimer J, et al.\nEffi  cacy of paracetamol  for acute low-back pain: a double-blind, randomised controlled trial.\nComparison of stratifi ed  primary care management for low back pain with current best practice  (STarT Back): a randomised controlled trial.\nNon-steroidal anti-infl ammatory drugs for chronic low back pain.\nAntidepressants for non-specifi c low back pain.\nSpinal manipulative therapy for chronic low-back  pain.\nTherapeutic ultrasound for chronic low-back pain.\nBehavioural treatment for chronic low-back pain.\nMultidisciplinary biopsychosocial rehabilitation for chronic low  back pain.\nRadiofrequency denervation for  chronic low back pain.\nLow back and radicular pain: a pathway for care developed by the  British Pain Society.\n106 Airaksinen O, Brox JI, Cedraschi C, et al.\nEuropean guidelines for the management of chronic nonspecifi c  low back pain.\nOpioids compared with placebo or other treatments for  chronic low back pain: an update of the Cochrane review.\nA randomized  controlled trial of gabapentin for chronic low back pain with and  without a radiating component.\nCDC Guideline for prescribing  opioids for chronic pain-United States, 2016.\nThe eff ectiveness and risks of  long-term opioid therapy for chronic pain: a systematic review for a  National Institutes of Health Pathways to Prevention Workshop.\nThe comparative safety of  opioids for nonmalignant pain in older adults.\nArch Intern Med  2010; 170: 197986.\n113 Yamato TP, Maher CG, Saragiotto BT, et al.\nRandomised controlled  trial of Alexander technique lessons, exercise, and massage  (ATEAM) for chronic and recurrent back pain: economic evaluation.\nRandomised controlled trial of  Alexander technique lessons, exercise, and massage (ATEAM) for  chronic and recurrent back pain.\nGraded activity and graded exposure for persistent nonspecifi c low  back pain: a systematic review.\nSystematic review:  strategies for using exercise therapy to improve outcomes in  chronic low back pain.\nCochrane Database Syst Rev 2005;  1: CD001351.\nAcupuncture for low back pain: an overview of systematic reviews.\nGroup cognitive behavioural  interventions for low back pain in primary care: extended follow-up  of the Back Skills Training Trial (ISRCTN54717854).\nEpidural corticosteroid  injections for radiculopathy and spinal stenosis: a systematic review  and meta-analysis.\nProlotherapy injections for chronic low-back pain.\nCochrane Database Syst Rev 2007; 2: CD004059.\nAntibiotic treatment in patients with chronic low back pain and  vertebral bone edema (Modic type 1 changes): a double-blind  randomized clinical controlled trial of effi  cacy.\nConsensus at last! Long-term  results of all randomized controlled trials show that fusion is no  better than non-operative care in improving pain and disability in  chronic low back pain.\nLow back pain in children and adolescents:  a systematic review and meta-analysis evaluating the eff ectiveness  of conservative interventions.\nLovely pie in the sky plans:  a qualitative study of clinicians perspectives on guidelines for  managing low back pain in primary care in England.\nCritical appraisal of  clinical prediction rules that aim to optimize treatment selection for  musculoskeletal conditions.\nInterpretation of  subgroup eff ects in published trials.\nEvaluating the quality of subgroup analyses in randomized  controlled trials of therapist-delivered interventions for nonspecifi c  low back pain: a systematic review.\nSpine (Phila Pa 1976) 2014;  39: 61829.\nIndependent evaluation of a clinical prediction rule for spinal  manipulative therapy: a randomised controlled trial.\nIs a subgroup eff ect  believable? Updating criteria to evaluate the credibility of subgroup  analyses.\nIntra-articular facet joint injections for low back pain:  a systematic review.\nEur Spine J 2016; 25: 126681.\nInterventional therapies, surgery, and interdisciplinary  rehabilitation for low back pain: an evidence-based clinical practice  guideline from the American Pain Society.\nSpine 2009; 34: 106677.\nSpine (Phila Pa 1976) 2010; 35: 182627.\nMisinterpretation of evidence  synthesis and ASIPP guidelines by Chou.\nPain Med 2009;  10: 42224.\nSetting the research agenda for  improving health care in musculoskeletal disorders.\nEvaluation of a  theory-informed implementation intervention for the management  of acute low back pain in general medical practice:  the IMPLEMENT cluster randomised trial.\nPopulation based intervention to change  back pain beliefs: three year follow up population survey.\nPopulation based intervention to  change back pain beliefs and disability: three part evaluation."}