{"title": "3.pdf", "contents": "Chronic pain is one of the most costly and prevalent  sources of human suffering, especially in, but not lim ited to, modern industrialized societies.\nLow back pain is  normally considered as pain, muscle tension or stiffness  localized below the costal margin and above the inferior  gluteal folds, with or without sciatica (pain travelling  down the leg from the lower back).\nAlmost everyone  has a brief, acute episode of low back pain during their  lifetime.\nWhen back pain persists for >3 months, it is   (by consensus) no longer considered as a symptom but  as a disorder in itself that is maintained by factors that  might be different from the initiating causes.\nChronic  back pain can be associated with functional disability  and work incapacity, and can affect quality of life.\nA higher number of painful body regions is  associated with higher functional disability, more work  absences, more severe feelings of depression and anxi ety and reduced quality of life2,3.\nThe large majority of  patients with back pain have nonspecific pain, whereby  an underlying pathology or a nociceptive contributor  has not been identified4.\nThe societal and economic costs of back pain are  high, and indirect costs are usually higher than direct  medical costs.\nSimilar proportions have been observed   in the Netherlands and the United Kingdom79.\n6% of the gross national product in 2007.\nIn all   these estimates, the majority of costs were attributed to   productivity losses.\nTraditionally, back pain was considered as a result  of injury (the so called injury model).\nThis model is  overly simplistic; the association is modest between  physical loads with structural degenerative changes and  pathology of the vertebral column or supporting struc tures, and pathological findings have been observed in  asymptomatic individuals.\nA biopsychosocial model  of back pain has been developed in which biological  factors with modest effect sizes interacting with other  risk factors are likely to contribute to the development  of chronic back pain.\nThe non biological risk factors  include negative beliefs and expectations about pain,  emotional responses, pain behaviours, perceptions about  the relationship between pain, health and work and   societal obstacles.\nIn the International Classification of Diseases 10th  revision (ICD10), diagnostic codes for pain conditions,  including low back pain, are included but do not account  for the heterogeneity of chronic back pain in particu lar.\nAbstract | Low back pain affects individuals of all ages and is a leading contributor to disease  burden worldwide.\nDespite advancements in assessment and treatment methods, the  management of low back pain remains a challenge for researchers and clinicians alike.\nOne  reason for the limited success in identifying effective treatments is the large variation in the  manifestations, possible causes, precipitating and maintaining factors, course, prognosis and  consequences in terms of activity interference and quality of life.\nHowever, despite these  challenges, steady progress has been achieved in the understanding of back pain, and important  steps in the understanding of the psychological and social risk factors, genetics and brain  mechanisms of low back pain have been made.\nChronic primary pain is defined as pain in at least one  anatomical region that persists or recurs for >3 months  and that is associated with substantial emotional dis tress or functional disability and that cannot be bet ter explained by another chronic pain condition11.\nThis Primer presents the current state of the art of  the epidemiology, diagnostic triage, risk factors, preven tion and management of low back pain.\nThis Primer also  reviews the current knowledge on the mechanisms of  back pain, including genetic risk factors, neurobiology  and cognitive, behavioural and emotional mechanisms.\nIndeed, in the 2016 Global Burden of  Disease Study, low back pain was the leading cause  of years lived with disability (YLDs) and was in the top 10  causes of YLDs in all 188 assessed countries13.\nIn one systematic review of 165 studies from  54 countries, the mean point prevalence of low back pain  in the general population was ~18% and 1month preva lence was ~30%.\nLifetime prevalence was ~40% and was  particularly high in individuals 4080 years of age and in.\nwomen, the latter of which have a 20% increased risk of  low back pain compared with men14.\nSocio economically  disadvantaged groups are much more likely to report  persistent pain and substantial interference with daily  functioning than socio economically advantaged coun terparts15,16.\nThe risk of developing recurrent low back  pain within a year after the resolution of an episode of  acute low back pain is estimated to be ~25%17.\nMost of the epidemiological data on low back pain  concern western countries in Europe, the United States  and Australia, although the prevalence in other regions  has been assessed in some studies.\nThe highest point  prevalence of low back pain has been reported in high  income countries (32.\n9%), with lower rates in middle  income countries (25.\n4%) and low income countries  (16.\nIn one systematic review, the  mean point prevalence of chronic low back pain in Latin  America was estimated as 31.\nAnother systematic  review demonstrated a point prevalence of 32% in adults  and 12% in adolescents in Africa; the mean lifetime  prevalence, on the basis of six studies, was 62% in adults  and 35% in adolescents19.\nThe authors conclude that the  prevalence of low back pain in Africa is comparable to  the prevalence figures in western jurisdictions19.\nStudies  evaluating the epidemiology of low back pain in Asia are  scarce but have suggested that low back pain is a health  problem among economically productive age groups and  is associated with functional limitations in daily life activ ities20,21.\nIn general, studies used different definitions of  back pain, differences in duration, its onset and whether  or not people sought health care for their back problems,  which may have influenced the reported prevalence rates.\nChildren, adolescents and elderly individuals Low back pain has been suggested to start early in child hood, continue into adulthood and persist in elderly  individuals, at least in a part of the general population22,  although valid cohort data to confirm or refute this  hypothesis are not yet available.\nStudying the prevalence  of low back pain in children and adolescents might allow  intervention at an earlier stage in the development of  low back pain in the future.\nOn the basis of 10 studies,  a meta analysis estimated the mean point prevalence  of low back pain as 12% in children and adolescents   <19 years of age, with a mean lifetime prevalence, based  on 30 studies, of 39.\nThe prevalence of low back  pain in children increases with increasing age; for exam ple, a prevalence of 1% and 6% has been reported in  children 7 years and 10 years of age, respectively, with a  prevalence of 18% in adolescents 14 years and 16 years  of age24.\nOn the basis of a review of 56 studies, lifetime  prevalence reaches adult levels by 18 years of age25.\nRegarding the elderly, one review showed that the  peak prevalence of low back pain occurred in individuals  between 40 and 69 years of age, after which the preva lence declines14.\nSimilar results were obtained in another  study if all types of low back pain were considered;  however, if only more severe forms are included, the  prevalence steadily increased in individuals 65 years   of age26.\nWhether the proportion of individuals with  nonspecific low back pain differs between young and  elderly individuals is unclear.\nof individuals with comorbidities is most likely higher  in elderly individuals.\nRisk factors Back pain is a complex and multifactorial condition  that likely develops as result of the interaction between  several risk factors27.\nGiven the high incidence of back  pain, many individuals will experience an episode  of acute low back pain at least once in their lifetime.\nHowever, some risk factors are associated with a higher  occurrence of low back pain.\nSystematic reviews of risk  factors for low back pain28 and sciatica29 have suggested  that physical risk factors (such as prolonged standing  and lifting heavy weights), an unhealthy lifestyle (such   as smoking and obesity) and psychological factors (such as   distress and the expectations that pain indicates bodily  harm or injury) increase the risk of a back pain episode.\nIn addition, manual tasks involving, for example, heavy  loads, awkward postures and lifting objects not close to  the body, as well as being distracted during an activity  or task, were identified by patients as triggers of a new  episode of sudden onset acute low back pain30.\nThe heritability of back pain has been  estimated as 3244% from twin studies3133.\nFamilial  genetic mutations with a high penetrance that have a  Mendelian mode of inheritance and that co segregate  with Modic changes (pathological changes to the verte bral endplate, which can be observed using MRI) have  been identified in two families with a history of sciat ica34.\nOn the basis of these studies, the herita bility of back pain  based on common genetic variants has been estimated  as ~7%37.\nHowever, only one back painrelated GWAS  meta analysis on lumbar disc generation has been pub lished to date, in which none of the cohorts had been  studied in a previous meta analysis38,39.\nAll other studies  used a candidate gene approach in which pre specified  variants were studied on the basis of evidence based  assumptions of their involvement in the disease patho physiology.\nOne review of genetic association studies on back  pain revealed 47 studies that reported an association  between 120 unique genetic variants (across 43 loci) and  back painrelated phenotypes (Box 1).\nOf these genetic  variants, 64 have been tested for association with vari ous pain phenotypes (including low back pain) that  were present for at least 3 months in a separate study,  and 11 were replicated, reinforcing the role of some of  these genes in the pathophysiology of chronic pain con ditions, including back pain40.\n1 | Years lived with disability for low back pain.\n41) and COMT42,43 to  several pain states, not exclusively back pain, have   been investigated.\nCOMT encodes catecholamine Omethyltransferase  (COMT), which methylates and consequently deacti vates catechol containing substrates, such as adrena line, noradrenaline and dopamine, and COMT variants  that convey low enzyme activity contribute to increased  pain via 2adrenergic and 3adrenergic receptors4244.\nImportantly, the majority of genetic associations with  back pain have not been replicated, and the use of these  variants to improve diagnosis and treatment of back pain  remains to be ascertained and requires further study.\nIn  addition, as pain conditions share genetic pathways of  vulnerability, variants that contribute to the diagnosis  and treatment of back pain are most likely not spe cific and may, in fact, contribute to the diagnosis and   treatment of other pain conditions40.\nMechanisms/pathophysiology The pathology underlying low back pain remains  unknown in most cases, including individuals seek ing medical care for acute or recurrent pain or chronic  symptoms.\nindividuals has been an elusive goal.\nAn individ uals specific and variable response to a musculoskeletal  insult might be a key determining factor for back pain.\nThe simplistic injury model of back pain Despite the absence of a discernible illness or pathology  in most individuals with low back pain, an injury model  has long been used to explain this type of pain, par ticularly when pain occurs in the workplace.\nFor many  years, low back pain was considered a consequence of  over exertion or trauma from physically demanding  activities, such as handling of heavy materials leading  to damage or degeneration of the vertebrae, interverte bral discs or spinal muscles.\nSeveral other lines of research have forced  a re evaluation of this injury approach to low back  pain.\nIn addition, exposure  to non painful bodily triggers (such as being fatigued)  or cognitive triggers (such as being distracted) was as  hazardous as exposure to physical triggers (such as lift ing weights), and exposure to both physical and non  physical triggers was associated with a higher risk of  back pain than exposure to only one factor47.\nSecond,  in cohort studies assessing the exposure to long term  suspected risk factors for back pain, job dissatisfaction  and emotional distress were predictive of new back pain  claims but not the physical aspects of work (such as spi nal load) or the physical capacities of the worker (such  as back muscle strength)48.\nThese data do not support a  physical injury model of back pain.\nPotential local contributors to low back pain Although most patients with back pain lack a clear,  identifiable pathology responsible for their symptoms,  a fairly small portion of patients (<5%) have traumatic or  osteoporotic fractures that may contribute to back pain   development or persistence.\nAlthough rare (~1% of  cases), back pain can also result from conditions such  as neoplasia, infection and inflammatory arthritis that  directly affect the spinal structures.\nPain also can be  referred to the low back from many visceral conditions,  including diseases of pelvic organs, such as prostatitis,   endometriosis, renal disease (such as kidney stones),  gastro intestinal disease and aortic aneurism, among other   conditions, which have been estimated to account for ~2%   of patients seeking primary care for low back pain.\nHowever, the main focus of this section is on lumbar  spine contributors to low back pain.\nMost structures of the lumbar region can contribute to  low back pain if they are biochemically altered (for exam ple, through inflammation) or damaged through degen eration or trauma (fig.\nMany spinal structures have  sensory innervation, such as muscles, tendons, ligaments,  fascia, facet joints, vertebrae, the outer annulus of the  intervertebral disc, vascular tissue, the dura, nerve roots  and dorsal root ganglia; however, the specific structures  involved in common low back pain remain speculative.\nIndeed, the  detection of disc degeneration by neuroimaging, often  defined as a loss of signal intensity on T2weighted  MRI and disc narrowing, protrusion and extrusion,  is modestly associated with back pain49,50.\nDefects or  lesions of the endplate beyond Schmorls nodes (that is,  protrusions of the nucleus pulposus of the interverte bral disc through the endplate into the vertebral body),  such as erosion lesions, corner defects or calcification,  have also received increasing attention.\nAlthough the  aetiology of these endplate defects or lesions is poorly  understood, variation in their character, distribution  and prevalence suggests different aetiologies (for exam ple, developmental, degenerative or traumatic) and that  they represent different pathological processes51 with   different implications for pain52.\nThree  types of Modic changes can be detected via signal vari ations with different MRI sequences.\nrepresent fatty degeneration of the bone marrow and  type 3 changes represent endplate sclerosis.\nType 1  Modic changes have been attributed to physical trauma  of the endplate, the localized action of inflammatory  mediators, such as IL1, and low grade bacterial infec tion, with particular interest in Cutibacterium acnes (also  known as Propionibacterium acnes) infection54.\nEndplate  disruption might be key for the development of Modic  changes55,56.\nRecently, the molecular and cellular features  of bone marrow affected by Modic changes (type 1 and 2)   and adjacent discs were compared with unaffected spi nal levels in individuals undergoing multi level spinal  fusion for degenerative conditions.\nThe results provided  evidence of fibrogenic and pro inflammatory crosstalk  between bone marrow and adjacent discs at spinal levels  affected by Modic changes, which may relate to patho genesis and have implications for low back pain57.\nIn  particular, large endplate lesions or defects and type 1   Modic changes have been found more frequently in  individuals reporting back pain and seeking health care  than Modic changes of any type (including type 2)49,52.\nHowever, endplate defects and Modic changes are also  present in individuals without back pain and, therefore,  are of little use in differentiating those with or without  back pain.\nSuch findings by themselves might not be suf ficient to cause back pain of such severity as to warrant  reporting or seeking health care.\nMoreover, degenerative  changes of spinal structures, including bone, endplates,  discs, paraspinal muscle and vessels, develop together58,  making it challenging to identify specific findings or  combinations of findings that might be more important  contributors to back pain.\nThe facet joints are articulations of  the posterior arch of the vertebrae and are innervated  by the medial branches of the dorsal rami of the spi nal nerve59.\nIn terms of spinal muscles, low back pain.\nAlthough most patients with low back pain lack a discernible pathology that accounts for the  pain, in extremely rare cases, damage to several structures within the vertebral column, including the facet joint,  intervertebral disc, endplate or spinal nerves, can lead to back pain.\nhas been associated with smaller multifidus muscles,  but the association with other paraspinal muscles is less  clear, as is the association with muscle composition (for  example, fatty infiltration).\nIn an investigation specifi cally of dynamic trunk exercise to fatigue, there was no  association found between resultant back pain intensity  and spinal muscle damage, as indicated by increased  intensity on T2weighted MRI.\nIn some individuals, pain typically  radiates into the leg below the knee (such as in sciatica);  in these individuals, the radiation pattern provides an  indication of the involved segmental level.\nThe patho physiology of radicular pain is not fully understood but  might be related to lesions that affect dorsal root gan glia or indirectly affect spinal nerves and nerve roots  by ischaemia or inflammation of the axons within the  nerve62.\nGenerally, most structures  in the lumbar spine can be a potential source of pain,  but reliable tests to identify the specific structure impli cated for a given patient are lacking, as well as effective  treatments specific for each structure.\nHowever, stronger associations have  been observed in large, highly controlled studies of dis cordant knee pain and osteoarthritis within individuals,  suggesting that substantial confounding and diluting  of associations between relevant degenerative changes  and pain reporting might be occurring.\nThese findings  challenge researchers to devise studies that more ade quately adjust for confounding factors and to examine  modifiers of the relationship between structural changes  and other findings of interest and pain.\nIdentifying ana tomical and pathophysiological differences between  individuals with and those without back pain who have  similar extents of disc degeneration or other findings  of interest on imaging might identify key factors of  the pathology, modifiers and mechanisms of low back  pain63.\nIn particular, inflammatory and immunological  responses may be informative.\nIt should also be kept in  mind that disc, endplate, vertebral and other structural  changes observed from imaging might contribute to low  back pain, or alternatively might be markers of other   conditions that lead to back pain.\nBrain mechanisms Brain imaging studies have begun to examine changes  in brain structure and function that are related to back  pain64.\nStructural changes in grey matter have, for  instance, been reported in the dorsolateral prefrontal  cortex6567, thalamus, temporal lobes, insula and the pri mary somatosensory cortex in individuals with chronic  back pain compared with healthy controls.\nAlterations  in brain function have been investigated at rest and fol lowing peripheral stimulation.\nChanges in resting state  activity and functional connectivity in patients with  back pain compared with healthy controls have been  observed in several brain regions, including the medial  prefrontal cortex (mPFC), cingulate cortex, amygdala  and insula68,69.\nThe transition from an acute back pain state to  chronic back pain might involve changes in the func tional connectivity between the PFC and regions of the  limbic system.\nIndeed, this was suggested in one longi tudinal study that monitored individuals with subacute  back pain for 1 year, after which back pain was persistent  in some participants68.\nIn this study, partici pants with  persistent pain showed an increased functional connec tivity between the mPFC and the nucleus accumbens  (NAc) at the initial assessment, compared with indivi duals who did not develop chronic pain68, and structural  and functional connectivity between the mPFC, amyg dala and NAc was still different between groups after   3 years72.\nThe consistent finding of smaller amygdala  and hippocampus volumes over a period of several years  in those who progressed to chronic pain suggests that  these structural alterations might have existed before  pain onset and, therefore, potentially predisposed.\nType 1 Modic changes  (arrows) correspond to bone oedema or inflammation and  fibrovascular granulation tissue and can be observed in  some patients with low back pain.\nHowever, these changes  can be observed in asymptomatic individuals and, therefore,  have been of little use to date in differentiating those with  or without back pain.\nOther studies on back pain have demonstrated alter ations in similar brain structures involved in cognitive  affective processing (such as the hippocampus and  striatum)7376, and when compared with meta analytic  brain maps, the brain signature of chronic back pain  more closely resembles that of emotion processing than  that of acute pain77.\nAdditional functional changes in  individuals with chronic back pain include reduced  network efficiency78 and whole brain reorganization  of functional connectivity79,80, compared with healthy  controls.\nTogether, these findings advocate a perspec tive on chronic back pain that comprises structural and  functional alterations in a dynamic network of interact ing brain regions and that acknowledges the pivotal role  of regions involved in pain related processes beyond   nociception in driving the development of chronic pain.\nCognition, emotion and behaviour Pain is a motivational state that initiates early defensive  and late recuperative behaviours, which primarily func tion to promote recovery from injury81.\nPredictions or   expectations of the occurrence, magnitude and con sequences of pain are generated on the basis of prior  information about the state of the body (such as this  activity is likely to harm my back).\nThese predictions  are influenced by a generative model of an individuals  own body (such as my back is vulnerable) and other  metacognitions about health and illness (such as there  is nothing I can do to change my pain and pain is always  a sign of harm).\nPredictions or expectations of pain can  also be generated by an individuals own experiences, in  addition to verbal information and observations of what  happens to other people in similar contexts82.\nFrom a  Bayesian perspective, expectations of pain are compared  with the actual sensation, which can confirm the predic tion and the beliefs (a match) or, alternatively, lead to a  prediction error that urges the individual to update these  beliefs (a mismatch)83,84.\nIf  the sensory input is less precise, the perception will be  more in line with the prior expectations and vice versa.\nGiven the ambiguity and imprecise nature of low back  pain, expectations can strongly influence the perception  of pain, such that the expectation of back pain might be  enough to increase its intensity or perceive inoccuous  sensations as painful87,88.\nIn patients with back pain, misinterpretations of  pain as a sign of physical harm89 usually lead to pain  related fear and avoidance behaviours that further fuel  the disability, depression and anxiety9093.\nIndeed, one  meta analysis demonstrated a moderate to large aver age sample size weighted correlation coefficient of 0.\n42  (with a range of 0.\n45) for pain related fear and  disability in individuals with acute or chronic pain94.\nIndividuals reporting fear avoidance beliefs had poorer  work related outcomes with subacute low back pain (that  is, individuals with low back pain for between 4 weeks  and 3 months), with odds ratios ranging from 1.\n64 in four cohort studies95.\nBy contrast, fearful beliefs  in more acute low back pain (with duration of <2 weeks)  and chronic low back pain (duration of >3 months) did  not predict return to work95.\nThese results suggest that  modifying negative expectations regarding return to  work might avoid delayed recovery and the development  of chronic pain in individuals with low back pain during  the subacute phase.\nIn addition, one systematic review  and meta analysis demonstrated self efficacy, psycholog ical distress and pain related fear as significant mediators  of the effect of pain on disability96.\nThe prediction of pain can be influenced by classi cal (Pavlovian) conditioning, which is the association  of pain with neutral cues that precede the occurrence of   pain.\nThese cues can be non painful tactile, visceral or  proprioceptive sensations that activate the pain mem ory.\nAs a result, these conditioned stimuli elicit defen sive avoidance behaviour, which is adaptive in the.\nHowever, excessive reliance on defensive  behaviours can paradoxically maintain or increase pain  related fear98 and, therefore, compromise daily activities,  interfere with work and social participation and lead to  negative affect99.\nIn addition, generalization can occur, during which per ceptual or conceptual variations of the original stimulus  also elicit avoidance behaviour.\nThat is, patients may  insufficiently discriminate between stimuli or situations  that are safe from those that are painful.\nIn addition, pre liminary evidence suggests that hyperalgesia (the same  stimulus eliciting a higher pain response than usual)  and allodynia (a non nociceptive stimulus eliciting a  pain response) can be considered learned (conditioned)  responses88,104, explaining why the cortical representation  of non nociceptive stimuli is disrupted in people with  chronic pain.\nFor example, people with chronic back pain  may have lower proprioceptive acuity, with disruptions in  the perceived size and alignment of body parts105.\nFor example, when individuals do something to avoid  or reduce their pain, which has a beneficial effect on  pain, they keep repeating it.\nPsychological treatments,  and cognitivebehavioural therapy in particular, aim to  challenge patients beliefs and pain outcome expectan cies and encourage them to sample their interoceptive   environment differently (see Management)108.\nDiagnosis, screening and prevention Classification of low back pain Clinical practice guidelines recommend a diagnostic  triage approach in which patients with low back pain  are classified into one of four broad categories: those  with a visceral disorder (for example, patients with  kidney stones), a specific spinal disease (such as axial  spondyloarthritis), radicular syndromes or nonspe cific low back pain109.\nIn primary care, the majority of  patients have nonspecific low back pain (typically 90%  of patients)110,111 and, when pain persists for >3 months,  many of these patients will fit the ICD11 criteria for  chronic primary pain11.\nTypically, <1% of back pain pres entations to primary care are caused by visceral or spinal  diseases112,113.\nIdentifying these disorders is important as  they are managed differently from nonspecific low back  pain or radicular syndromes.\nDiagnostic workup A clinical assessment is used to identify patients with  suspected specific spinal disease or visceral disorders  who require further diagnostic work up.\nBoth non specific low back pain and radicular syndromes do not  require further initial diagnostic work up, as their initial  management is the same as for both disorders.\nHowever,  if a patient does not respond to a therapy trial and is  a candidate for surgery, imaging (for example, using  MRI) is indicated to identify an abnormality that could  be addressed by surgery.\nDiagnostic work up during the initial clinical assess ment is warranted only in individuals with suspected  spinal pathology or visceral disease.\nRed flags, such as  unexplained weight loss, have traditionally been used  to identify patients with a higher probability of these  conditions (TaBle 1); however, few red flags have high  diagnostic accuracy110.\nFor example, some guidelines  for the management of back pain endorse the use of the  thoracic pain red flag to screen for cancer, but the pres ence of thoracic pain has both a positive and a negative  likelihood ratio of 1.\n0, which is not informative (the sign  is equally common in those with and those without can cer)114.\nThe most common problem with red flags is false  positives; 80% of patients presenting to primary care  have at least one red flag, although <1% of patients have a   specific spinal pathology111.\nGiven this discrepancy,   a more useful approach when deciding which patients  require further diagnostic work up is to rely upon the  smaller subset of red flags with promising diagnostic  accuracy and consider a combination of red flags in the  context of a full clinical assessment115.\nIn addition to  the red flags, other flags have been assigned to different  kinds of prognostic factors, including orange (psychiat ric symptoms), yellow (cognitive, emotional and behav ioural), blue (work related) and black (system related)  flags116 (TaBle 1).\nTo identify patients who require further diagnostic  work up, some guidelines take into account the con sequences of a missed diagnosis and the certainty of   the diag nosis; for example, the imaging guidelines for the   American College of Physicians recommend deferring  diagnostic work up pending a trial of therapy in patients  with a low suspicion of cancer but suggest immediate.\nExpectations (such as this event will cause  pain) are derived from an idiosyncratic and generative model of the body in pain with  hierarchically structured beliefs.\nMetacognitions are highlevel beliefs that include the  possibility of control (such as there is nothing I can do to relieve pain), whereas a prior is  a lowerlevel belief about a state of the body (such as lifting objects increases the pain).\nExpectations about upcoming sensations are compared with incoming sensory  information (not restricted to nociception), and the difference between the expectation  and the sensory input is called the prediction error.\nThe individuals homeostatic goal is  to minimize prediction errors through at least two updating possibilities: confirming the  expectation (the person feels what she/he expects; match) or learning (mismatch).\nIn the latter, updating the prediction is challenged and replaced by an adapted one   (the person learns that it is different than expected).\nScreening for risk of chronic pain Although many patients who seek care for an episode  of acute low back pain improve, ~1015% of patients  develop chronic pain and disability115,118,119.\nOwing to the  considerable suffering and cost associated with chronic  pain, preventing its development is essential120122.\nHowever, identifying these patients at early stages   is challenging.\nScreening tools have been developed to help clini cians assess the risk of a patient seeking care for acute  pain developing chronic pain and its related disability,  such as the rebro Musculoskeletal Pain Screening  Questionnaire (MPSQ)123 and the STarTBack tool124.\nThese tools assess psychological and social factors and  include questions about duration of pain, emotional  distress, fear avoidance beliefs, self perceived func tioning and expected return to work, which are associ ated with the development of chronic painassociated.\nBoth tools have been validated in the  clinic, and the MPSQ can predict the risk of future  work absenteeism due to pain126 but can less accurately  predict pain outcomes, whereas STarTBack predicts  future function but is less accurate in predicting work  disability and pain outcomes.\nThe short version of these  screening tools requires little time to undertake and can  reliably stratify individuals into low, medium and high  risk of pain related disability126.\nAlthough these screening  tools are not perfect, and research is focusing on improv ing them, they are nevertheless adequate for classifying  patients in clinical settings127.\nPreferably, the patient  completes the screening tool during their first clinical  visit to estimate their risk.\nIn addition, these screening  tools might also be useful in isolating the most potent  risk factors for chronic painassociated disability.\nIndeed,  the MPSQ has been successfully used to identify high  risk cases and then to provide an intervention aimed at  the eleva ted risk factors for these workers127,128.\nPatients  with a higher risk of chronic painassociated disabil ity will likely need a more thorough assessment before  starting treatment to ensure that the proper targets have  been identified.\nPrimary prevention Many popular prevention interventions for low back  pain are still based on the view that low back pain is a  physical injury129.\nAccordingly, ergonomic approaches  are used to control excessive strain, protect the spine  and prevent injury, including safe lifting guidelines,  workplace redesign and ergonomic furniture.\nExpectations of poor treatment outcome  Delayed return to work.\nPain behaviour (including pain  coping strategies).\nAvoidance of activities due to expectations of pain and possible reinjury  Overreliance on passive treatments, such as hot packs, cold packs and  analgesics.\nBlue Perceptions about the  relationship between work   and health.\nBelief that work is too onerous and likely to cause further injury  Belief that workplace supervisor and workmates are unsupportive.\nBlack System or contextual obstacles  Legislation restricting options for return to work  Conflict with insurance staff over injury claim  Overly solicitous family and healthcare providers  Heavy work , with little opportunity to modify duties.\nFlags refer to potential risk factors for the development of persistent pain and associated disability: these are suspicion of serious  biological pathology (red flags); psychiatric symptoms that probably require specialist mental health referral (orange flags);  psychological risk factors, such as fears and unhelpful beliefs (yellow flags); workers perceptions that their workplace is stressful,  unsupportive and excessively demanding (blue flags); and observable characteristics of the workplace and nature of the work as  well the insurance and compensation system under which workplace injuries are managed (black flags).\nsome are mandatory workplace regulations, few trials  have investigated the efficacy of these strategies.\nOne of  the most well known is a randomized controlled trial  (RCT) involving 2,534 US postal workers that demon strated no reduction in the incidence of work related low  back pain with education in safe work practices and ergo nomic redesign of the workplace130.\nAlthough this result  was surprising at the time of publication of this study, the  current understanding of the diverse risk factors for low  back pain suggest that the one dimensional prevention  approach used in this trial could be insufficient130.\nA systematic review of prevention interventions com posed of 21 RCTs and 30,850 individuals demonstrated  that common strategies such as back supports, shoe  insoles and education for avoiding back injuries lacked  evidence that they do prevent low back pain131.\nThe only  effective intervention in this study was exercise, or exer cise in combination with education, the latter of which  reduced the risk of an episode of low back pain by 45%.\nThese exercises were not confined to the spine but aimed  to improve aerobic fitness, strength, flexibility and skill  or coordination.\nAlthough physical exercise can have a  large preventive effect on low back pain, it requires con siderable commitment from participants131,132.\nIndeed,  one trial that demonstrated a 50% reduction in work  absenteeism due to back pain required participants  to attend 20 exercise sessions over 3 months (which.\nis consistent with recog nized guidelines for exercise   prescription)133.\nWhether the effects of exercise on back  pain prevention are a result of the improved physical  capacity to tolerate stress on the spine or the improved  relationships with co workers and employer and job   satisfaction is unknown.\nManagement Clinical practice guidelines encourage clinicians to adopt  a biopsychosocial perspective for the management of low  back pain109.\nPatients are taught to self manage their con dition, and clinicians are encouraged to adopt a stepped  approach to care to avoid unnecessary or overcompli cated treatment (fig.\nTo this end, back pain manage ment should be started in a primary care setting rather  than in a specialist setting.\nNonspecific low back pain is  not a medical emergency; thus, it should not be managed  in the hospital emergency department134.\nA treatment  option for individuals with low back pain is a risk strati fication approach, which aims to limit progression to  chronic back pain.\nThis approach involves a risk targeted  treatment strategy, whereby individuals of high risk  receive targeted treatments to prevent the development  of chronic pain and individuals at low risk receive less  intensive therapies.\nIn individuals with chronic back pain  and interference with daily life (>3 months), management  preferably takes place in a multidisciplinary setting.\nChronic (>12 weeks)  Structured exercises  Spinal manipulation  Psychological   therapies  (such as CBT).\nConsider pharmacological therapies if non-pharmacological options are unsuccessful  NSAIDs  Skeletal muscle relaxants (for acute pain only)  Opioids Only use when other medicines are contradicted, not tolerated or are ineffective Their use requires careful riskbenefit assessment and is discouraged for chronic low back pain.\nLow risk: simpler  and less-intensive support  Manual therapy   (spinal   manipulation   or massage)  Group exercises.\nMedium or high risk: more  complex and intensive support  Structured exercises  CBT, graded activity or   exposure therapy  Multidisciplinary treatment   (combining physical and   psychological therapies).\nFirst-line care Advice, reassurance, self-management, return to work and encouraging physical activity should be provided for all patients.\nStepped approach Stratify by symptom duration: acute, subacute or chronic.\nThe traditional steppedcare approach entails stratifying patients according to the duration of symptoms, followed by  initially simple care with progression to more complex care if initial treatments are ineffective.\nA more recent approach is  to use validated risk stratification tools, such as the STarTBack Screening Tool or the rebro Musculoskeletal Pain  Screening Questionnaire (MPSQ), to stratify patients on the basis of their risk of chronicpain-related disability into  different care pathways.\nFollowing stratification, treatment is then matched to the patients risk level.\nPharmacological  therapies are considered only if nonpharmacological options are unsuccessful.\nPrimary care management of non specific low back pain: key messages from recent clinical guidelines.\n2018; 208 (6): 272275.\nRisk stratification approach Secondary prevention aims to prevent the development  of chronic painassociated disability in individuals at  high risk.\nAs previously mentioned, patients seeking  care for an acute episode of back pain can be stratified  according to their level of risk of chronic painassociated  disability (see Screening for risk of chronic pain, above),  and subsequent interventions are guided by the risk  assessment.\nConsequently, individuals with a low risk are   treated with simple, conservative methods such as  education, the advice to resume daily activities and  re activation (that is, a programme to regain physical  function), which promote healing.\nIndividuals at higher  risk receive more complex interventions to address risk  factors and prevent further development of the pain and  its associated disability problem121,135138.\nUnderstanding the current treat ment recommendations for low back pain is enhanced  by examining historical approaches.\nUntil the 1990s,  treatment for acute episodes of low back pain often  included medical procedures, such as epidural steroid  injections, opioid administration, surgery or bed rest;  however, these interventions were not more effective  than natural recovery, were expensive and were asso ciated with adverse effects139142.\nBecause of increasing  injury claims, another previous treatment approach  was to provide all individuals seeking care for back pain  with an early intervention often consisting of education,  physical therapy and exercise, but this did not prevent  the development of chronic pain143,144.\nIn addition, as  psychological factors are prominent risk factors for  back pain, several studies have provided psychological  counselling to all patients seeking care, although this  treatment did not improve outcomes compared with  usual care145.\nAnalyses of these difficulties suggested  two ways forward: targeting interventions on the basis  of risk factors to identify individuals with a high risk of  developing further pain associated disability and pro viding adequate interventions that specifically address  the relevant issues, including psychological and social  risk factors that have been identified116,146,147.\nTargeting treatments for low back  pain to the risk profile of a patient is speculated to lead to  better outcomes, although the research on individualized  treatments is complicated and robust studies are rare.\nIn  one trial, targeting therapeutic interventions on the basis  of patients' risk was superior to treatment as usual in pri mary care with regard to function and costs, although  the effect size at 1 year was small (0.\nThe selection  of a preventive intervention has varied, but the need to  address psychological and social factors is evident125,149,150.\nIn individuals with low risk who have no specific spi nal pathology, clinical guidelines for the management of  nonspecific low back pain in primary care recommend  advising the patient to return to normal activities as soon  as possible, in addition to self managed methods of pain  relief and education about the causes and possible self  management of the pain109,151.\nIndividuals at medium  risk should be monitored to enable rapid response to  recurrences or lack of improvement.\nIndividuals at high risk require special attention.\nIndividuals  at high risk should not delay intervention in the hope of  full recovery as it greatly increases the risk of chronic  painassociated disability; if targets for intervention  are not clear in these patients, further psychosocial  assessment is warranted before proceeding.\nAs part of the management of high risk patients, one  approach has been to offer a psychologically informed  prevention programme as an adjunct to medical care  that includes reassurance that the condition is not  harmful and education about the importance of being  active155.\nAt high risk, patients are offered a cognitive behavioural therapy prevention programme that aims to  eliminate barriers to activity and work.\nThis programme  typically includes techniques to empower the patient,  through, for example, re activation (that is, regaining  physical function), learning how to reduce the bother someness of pain and stress through self management  and solving problems as they arise (for example, apply ing these techniques to new situations and dealing with  flare ups)116,121,156.\nA series of studies have demonstrated  a reduction in work disability and health care utilization  for between 1 and 5 years in high risk patients stratified  using the MPSQ and then treated with a standardized  cognitivebehavioural therapy programme156160.\nOther  psychologically informed treatments based on cogni tivebehavioural therapy principles161 in primary care  have also shown encouraging, albeit smaller, effects116,162.\nTo increase the accessibility of psychologically informed  interventions, these programmes have been delivered by  other trained health care professionals, such as physical  therapists135,163.\nAdministering this treatment only to  patients at higher risk of chronic pain is more efficient  as trials that delivered psychologically informed treat ment to patients at any risk yielded disappointing results  compared with usual treatment116,163165.\nFor example,  in one study, workers at high risk were randomized to  usual care or a programme providing both the worker  and her/his supervisor skills training in communica tion and problem solving128; the programme reduced  work absences and health care utilization whereas  improving overall health compared with usual care.\nSimilarly, a programme to enhance communication  between patients and their work supervisors was evalu ated among high risk patients seeking primary care and   significantly increased work ability171.\nSteppedcare approach Nonpharmacological treatments.\nCompared with pre vious guidelines for the management of patients with  nonspecific back pain, more recent guidelines from  the United Kingdom172, United States173, Belgium174  and Denmark175 recommend self management, exer cise and physical therapies, before pharmacologi cal treatment, for the treatment of back pain.\nSupervised exercise programmes are  effective for the prevention of low back pain131 and  for managing chronic, but not acute, low back pain178.\nThe form of exercise programme does not seem to be  particularly important, as many forms of exercise are  beneficial, including yoga, tai chi, motor control exer cise, graded activity and pilates, although for both pre vention and management the exercise programmes  were usually not confined to local spine exercises but  focused on the whole body and included strengthening,  stretching, cardio vascular and coordination exercises.\nExercise is normally contraindicated only in patients  with low back pain that arises from a serious pathology,   such as a fracture or infection; however, caution or  adaptation of the exercise programme might be neces sary if patients have a  comorbidity, such as respiratory  or  cardiovascular disease178.\nAcross these guidelines, the recommendations for  non pharmacological care of chronic low back pain  are fairly consistent.\nFor all patients with pain, initial  care should comprise education about the causes and  self management of pain, reassurance, encouragement  to remain active and advice on self care options (such  as relaxation or yoga).\nPatients who fail to respond to  this approach or patients who require more complex  or intensive care (based on risk assessment) can receive  additional treatments such as structured exercises, spi nal manipulation or cognitivebehavioural treatment.\nThe types of effective treatments for acute low back  pain are different from those for chronic low back pain.\nAcute (<3 months dura tion) and chronic (>3 months duration) nonspecific low  back pain and radicular syndromes have different phar macological treatment approaches, although a stepped  approach is recommended for both.\nAlthough tradi tionally failure to respond to initial, simple approaches  was the indication to try a more complex treatment (an  approach analogous to the WHO analgesic ladder),  more recent research has challenged this approach, as  some medicines are ineffective for low back pain (such  as paracetamol)179 and other therapies have unknown  efficacy (such as opioids for acute low back pain)180.\nA small range of pain medications are recommended for  nonspecific low back pain in guidelines from the United  States173.\nNSAIDs or muscle relaxants can be consid ered in individuals with acute low back pain who did  not respond to non pharmacological treatments, with.\nan NSAID at the lowest possible dose for the shortest   duration possible as the first option.\nIn chronic low back pain, headtohead trials of  NSAIDs have not shown a difference in pain relief;  there are no data on cyclooxygenase2 (COX2)selective  NSAIDs.\nNSAID use should be accompanied by moni toring of the patients risk factors for gastrointestinal dis orders, and gastrointestinal protective treatments should  be commenced if warranted.\nTramadol or duloxetine are  second line pharmacological options for chronic pain,  although opioids are recommended only if the potential  benefits outweigh the risks for individual patients and  after a discussion of known risks and realistic benefits  with patients.\nStrong opioids are associated with a small  short term improvement, although there is no difference  in pain reduction when long acting or short acting opi oids are used.\nWeak opioids, such as tramadol, used in  combination with paracetamol (acetaminophen) can be  used for acute back pain and when NSAIDs are contrain dicated, not tolerated or have no effect.\nBy contrast, the  UK guidelines do not recommend the use of paraceta mol as monotherapy, opioids, tricyclic antidepressants  or sero tonin and noradrenaline reuptake inhibitors for  acute and chronic low back pain172.\nSelective sero tonin  reuptake inhibitors and muscle relaxants are contra dicted for acute and chronic back pain.\nAnticonvulsants  are not recommended for low back pain181.\nManagement of specific pain causes Radiofrequency facet denervation.\nFor low back pain  originating from the lumbar facet joints, the target for  interventional treatment is the medial branch of the  dorsal ramus, which innervates the facet joints.\nA facet  joint nerve block using a local anaesthetic is performed  to determine whether pain is partly caused by facet joint  involvement59,182; if confirmed, patients can be offered  a radiofrequency denervation of the medial branch  of the dorsal ramus to try and achieve long term pain  relief.\nNational Institute for Health and Care Excellence  (NICE) guidelines from the United Kingdom183 recom mend considering radiofrequency denervation only  when the main source of pain originates from the facet  joints, when pain is moderate to severe, and only when  evidence based multidisciplinary treatment has failed.\nThe latter study elicited a scientific debate  regarding the methods and interpretation used185187.\nAt present, this uncertainty is not resolved.\nWhether common oral  pain medications should be used for radicular syndromes  is uncertain188.\nThe use of gabapentinoids for this indi cation has increased, although one trial demonstrated  no benefit of pregabalin over placebo189.\nFor acute or  subacute radicular pain lasting for >23 weeks, epidural  corticosteroid combined with local anaesthetic admin istration can be considered62.\nEpidural injection of local anaesthetic and corticoster oids can reduce radicular pain and might also reduce  the number of surgical candidates191.\nConsidering the  high risk of intravascular injection when attempting to  reach the epidural space, the use of imaging guidance is  obligatory during this procedure.\nIn addition, this treat ment is an off label use of corticosteroids; thus, written  informed consent from the patient is mandatory.\nNo guidelines recommend surgery for the treat ment of nonspecific low back pain as in the absence of  a clear anatomical basis of low back pain, there is no  surgical target.\nUK guidelines172 recommend spinal  decompression for patients with radicular low back pain  that is potentially caused by degenerative disc disease  when non surgical treatment has not improved pain or  function.\nUK guidelines specifically advise against disc  replacement surgery for patients with disc degeneration   and advocate that spinal fusion for disc degenera tion and/or facet joint related pain should be used only   in RCTs.\nMultidisciplinary interventions for chronic pain A multidisciplinary approach is recommended for indi viduals with chronic low back pain.\nThese programmes  usually adopt a biopsychosocial approach; involve a  combination of educational, physical, cognitive, behav ioural, social and/or work related components; and are  often delivered by a team of health care providers with  expertise in different fields.\nMost programmes include a  graded activity approach192, whereby patients are encour aged to gradually increase their activity levels towards  individualized life goals and to reduce the amounts of  rest and drug intake.\nSuch multidisciplinary interven tions were more effective than usual care and physi cal treatments at decreasing pain and disability in one  Cochrane systematic review and meta analysis and were  more effective in terms of work outcomes than physical  treatment193.\nGiven the multi component nature of these  interventions, there is a need for identifying the precise  mechanisms of action.\nOne novel and more specific multidisciplinary treat ment for non specific low back pain is aimed at directly  challenging the catastrophic misinterpretations of pain  and various expectations about the relationship between  physical activities and pain and/or back injury.\nThe treat ment is designed to create harm expectation violations  (or prediction errors) by exposing patients to movements  or activities that they consider harmful or that they pre dicted to increase pain196.\nDuring treatment, these indi viduals' predictions are challenged and brought in line  with the incoming sensory and safety information, which  provides an opportunity for learning new and more  accurate predictions.\nSuch treatments can considerably  reduce levels of pain related fear197 and the perceived  harmfulness of physical activities198 and are cost  effective199.\nHowever, the effects of these treatments on  disability levels were no different than a graded activity.\napproach197, except when the intervention was studied in  replicated single case experiments200202.\nA possible rea son for this difference is that the latter included person alized measures of disability and goals whereas the RCTs  used standard or global outcome measures108.\nSocietal interventions Treating individual patients with low back pain might  not be sufficient to address the most disabling health  condition globally203,204.\nAs previously mentioned, low  back pain is highly prevalent and is strongly influenced  by patient beliefs and expectations, in addition to soci etal contingencies such as compensation and disability  policies.\nQuality of life Back pain has considerable negative effects on the  quality of life of affected individuals.\nIndividuals with  new onset back pain have an increased risk of lower  quality of life scores211, and the negative effect on qual ity of life increases with persistent pain211.\nPatients with  chronic back pain report a quality of life that is lower  than individuals without pain and that is comparable to  those of individuals with life threatening diagnoses212,213.\nIn addition, back pain is associated with worry and fears,  particularly about the (sense of) self and social relation ships and especially when pain persists longer than  expected214,215.\nPopulation and patient   cohort studies have demonstrated associations between  back pain and other problems, such as functional dis ability, anxiety, depression, fearful beliefs about the mean ing of pain, (work related) avoidance behaviour, stress,  increased health care utilization, insomnia, reporting of  more somatic comorbidity and unemployment211,217.\nGiven the effect of back pain on quality of life, the  multidimensional assessment of health related quality  of life is increasingly acknowledged as indispensable for  the study of back pain212,218.\nOwing to previous data, and the acceptance of the  biopsychosocial approach to back pain, persistent back  pain is considered a health condition that is affected by a  combination of physical, psychological, environmental,  cultural and social factors218.\nIn fact, these factors might  affect the perceived quality of life more than the pain  itself 217.\nmisinterpretations of pain and expectancies about the  inability to predict and to control pain are strong corre lates of quality of life in individuals with back pain99,212,217.\nLeaving these factors unchallenged can result in a risk of  a higher disease burden220.\nOutlook Despite an exponential increase in research on the epi demiology, mechanisms and treatment of low back pain,  and increased consensus among international guide lines, serious challenges remain.\nThe large vari ability  in clinical presentation, a wide range of course and  prognosis, insufficient understanding of the underlying  mechanisms and limited success in identifying effective  treatments make low back pain a challenge for clinicians  and researchers.\nFor example, the current data might be mis leading as most epidemiological studies have included a  selected group of individuals in which those from low  income and middle income countries, young individuals  and elderly individuals are under represented221.\nAlso,  the focus of studies has mainly been on the level of the  individual beliefs, emotions and behaviour of the per son with back pain, and extending these towards both  extremes of the biopsychosocial realm might increase  their effectiveness  modifiable biological risk factors  (for example, epigenetic mechanisms in the acute  tochronic pain transitioning) and societal risk factors  (for example, workplace and family responses, and  health care providers' beliefs and attitudes).\nOn the other end of the spectrum, understanding the  role of the negative expectations and social context  factors that surround the individual with low back  pain may be as important understanding those of the  patient.\nHealth care providers recommendations for  activity and return to work vary widely and reflect their  personal expectancies towards back pain and not nec essarily the patients clinical and work conditions223,224.\nAccordingly, future research should test whether these  potentially iatrogenic expectancies, which could perhaps  be introduced as novel white flags, directly or indirectly  influence patients outcomes.\nPositive resilience factors that might protect against  the development of chronic low back pain and disability  have been identified and are under study.\nStudying how  resilience buffers against the influence of risk factors  might increase the precision of our prediction models  in low back pain.\nNeurobiology Several aspects of the role of the brain in back pain  require further investigation.\nFor example, the specific ity of previous findings must be established to differen tiate changes specific to back pain from those reflecting  chronic pain more generally or from processes asso ciated with (chronic) back pain.\nIn addition,  further longitudinal studies are needed to identify which  alterations in brain structure and function underlie the  transition to chronic back pain and which are the result  or a correlate of an already established chronification.\nMoreover, most studies have focused on pain intensity  ratings as the most relevant behavioural parameter in  back pain; however, this disorder is also characterized by  profound alterations in behaviour (such as avoidance of  painful movement), which might be induced and main tained by independent brain networks; these factors also  require further study.\nFinally, psychological processes  underlying alterations in corticolimbic structures need  to be differentiated and characterized in more detail to  enable stratification in the prevention and treatment of  chronic back pain.\nOne  is personalizing treatments by testing in whom what  treatment works and how the treatment works228230;  the treatment can then be offered to the patient who is  expected to benefit from that particular treatment.\nAn SCED is an interrupted time series design in which  one patient is observed repeatedly during a certain  time frame under different levels (for example, baseline  versus treatment) of at least one outcome.\nSCEDs are  flexible, are fairly easy to implement in the practice of  health care, elegantly bridge the gap between research  and practice, and have available methodological   quality standards234,235.\nUsing similar methodology, evidence based messages  supporting self management could be disseminated  using social media and smartphone technology238.\nThis technology is still largely uncharted territory  but is likely to be promising.\nmanagement approaches are needed that also reach  socio economically vulnerable groups, such as eth nic minorities and individuals with low literacy, low   educational attainment and low income239.\nWhat have we learned from ten years   of trajectory research in low back pain?   BMC Musculoskelet.\nDoes the number of musculoskeletal  pain sites predict work disability? A 14-year  prospective study.\nChronic spinal pain and physical mental comorbidity in the United States: results from  the national comorbidity survey replication.\nWhat low back pain is and why   we need to pay attention.\nLow back pain  in Australian adults: the economic burden.\nThe economic burden of low back  pain: a review of studies published between 1996 and  2001.\nThe economic burden of  back pain in the UK.\nA cost of-illness study of back pain in The Netherlands.\nChronic pain as a symptom or a  disease: the IASP classification of chronic pain for the  International Classification of Diseases ICD-11.\nThe IASP classification of chronic   pain for ICD-11: chronic primary pain.\nChronic pain,  psychopathology, and DSM-5 somatic symptom  disorder.\nGlobal, regional, and national incidence, prevalence,  and years lived with disability for 301 acute and  chronic diseases and injuries in 188 countries,   1990-2013: a systematic analysis for the Global  Burden of Disease Study 2013.\nA systematic review of the global  prevalence of low back pain.\nPain 18, 14591467  (2017).\nAfter an episode of acute low back  pain, recurrence is unpredictable and not as common  as previously thought.\nPrevalence of low back pain in Latin  America: a systematic literature review.\nThe prevalence of low back pain in Africa: a systematic  review.\nLow back pain and  limitations of daily living in Asia: longitudinal findings  in the Thai cohort study.\nPain 30, 346352 (2014).\nLow back  pain across the life course.\nThe prevalence of low back pain among children and  adolescents.\nEpidemiology of adolescent spinal pain: a systematic  overview of the research literature.\nDoes back  pain prevalence really decrease with increasing   age? A systematic review.\nIncidence and risk factors for firsttime incident low  back pain: a systematic review and metaanalysis.\nRisk factors for first time incidence  sciatica: a systematic review.\nGenetic and environmental  influences on nonspecific low back pain in children:   a twin study.\nHeredity of low back pain in a young  population: a classical twin study.\nHeritability and lifestyle factors  in chronic low back pain: results of the Australian twin  low back pain study (The AUTBACK study).\nPain  18, 14101418 (2014).\nWhole exome study identifies  novel candidate genes for vertebral bone marrow  signal changes (Modic changes).\nSpine 42,   12011206 (2017).\nPrivate rare deletions in SEC16A  and MAMDC4 may represent novel pathogenic  variants in familial axial spondyloarthritis.\nPathogenesis of ankylosing spondylitis  recent advances and future directions.\nCorrection: phenomewide heritability  analysis of the UK Biobank.\nHuman pain genetics database:   a resource dedicated to human pain genetics research.\nNovel genetic variants associated  with lumbar disc degeneration in northern Europeans:  a metaanalysis of 4600 subjects.\nIdiopathic pain  disorderspathways of vulnerability.\nGenetic basis for individual  variations in pain perception and the development   of a chronic pain condition.\nLumbar spinal stenosis is a   highly genetic condition partly mediated by disc  degeneration.\nWhat triggers an episode of acute  low back pain? A casecrossover study.\nA prospective evaluation of  preemployment screening methods for acute industrial  back pain.\nMRI findings of disc degeneration  are more prevalent in adults with low back pain than  in asymptomatic controls: a systematic review and  metaanalysis.\nPotential of  magnetic resonance imaging findings to refine case  definition for mechanical low back pain in  epidemiological studies: a systematic review.\nLumbar  vertebral endplate lesions: prevalence, classification,  and association with age.\nISSLS prize  winner: lumbar vertebral endplate lesions:  associations with disc degeneration and back pain  history.\nWhat is the role of  the bacterium propionibacterium acnes in type 1  Modic changes? A review of the literature.\nModic type 1 vertebral endplate  changes: injury, inflammation, or infection?   Am.\nLumbar vertebral endplate defects on magnetic  resonance images: classification, distribution patterns,  and associations with Modic changes and disc  degeneration.\nSpine 43, 919927 (2017).\nIssls prize in basic science 2017:  intervertebral disc/bone marrow crosstalk with   Modic changes.\nPain originating from the  lumbar facet joints.\nExercise-induced pain intensity predicted by  pre-exercise fear of pain and pain sensitivity.\nMagnitude of spinal muscle damage   is not statistically associated with exerciseinduced  low back pain intensity.\nPulsed radiofrequency: a review   of the basic science as applied to the pathophysiology of   radicular pain: a call for clinical translation.\nStructural and functional brain  abnormalities in chronic low back pain: a systematic  review.\nAffective components and  intensity of pain correlate with structural differences in  gray matter in chronic back pain patients.\nEffective treatment of chronic  low back pain in humans reverses abnormal brain  anatomy and function.\nChronic back pain is associated  with decreased prefrontal and thalamic gray matter  density.\nCorticostriatal functional  connectivity predicts transition to chronic back pain.\nBrain resting state is disrupted in  chronic back pain patients.\nCorticolimbic anatomical  characteristics predetermine risk for chronic pain.\nChronic back pain is  associated with alterations in dopamine  neurotransmission in the ventral striatum.\nSmoking increases risk of pain  chronification through shared corticostriatal circuitry.\nShape shifting pain: chronification  of back pain shifts brain representation from  nociceptive to emotional circuits.\nThis is a longitidinal brain imaging study following  patients with subacute back pain over a 1-year  period showing large-scale shifts in brain activity  with the transition to chronic pain, with increased  activity in emotion-related circuitry in nonrecovered  patients.\nStructural brain connectivity  and the sitto-standto-sit performance in individuals  with nonspecific low back pain: a diffusion magnetic  resonance imagingbased network analysis.\nClassification and characterisation   of brain network changes in chronic back pain:   a multicenter study.\nGlobal disruption of degree rank  order: a hallmark of chronic pain.\nOn the relation of injury to pain.\nThis review addresses the critical role of  expectations on pain perception and their  modification through learning.\nSymptoms and the body: taking the  inferential leap.\nBeyond nociception:  the imprecision hypothesis of chronic pain.\nTheoretical perspectives on the relation  between catastrophizing and pain.\nFearavoidance and its  consequences in chronic musculoskeletal pain: a state  of the art.\nFearavoidance model of  chronic musculoskeletal pain: 12 years on.\nThis is an updated narrative review on the  fear-avoidance model of chronic musculoskeletal  pain.\nOutline of a fearavoidance model of exaggerated  pain perceptionI.\nFearavoidance beliefsa moderator  of treatment efficacy in patients with low back pain:   a systematic review.\nLearning to predict and control  harmful events: chronic pain and conditioning.\nAvoidance behavior can paradoxically increase fear.\nThe experimental analysis of the interruptive,  interfering, and identitydistorting effects of chronic  pain.\nPavlovian  conditioning of muscular responses in chronic pain  patients: central and peripheral correlates.\nThe acquisition of fear of movementrelated pain and  associative learning: a novel painrelevant human fear  conditioning paradigm.\nPain 152, 24602469  (2011).\nAlteration in the response  properties of primary somatosensory cortex related to  differential aversive Pavlovian conditioning.\nDifferences in  painrelated fear acquisition and generalization:  an experimental study comparing patients with  fibromyalgia and healthy controls.\nPain by association?   Experimental modulation of human pain thresholds  using classical conditioning.\nCortical changes in chronic low back  pain: current state of the art and implications for  clinical practice.\nOperant learning theory in pain and  chronic pain rehabilitation.\nconditioning in chronic pain: an experimental  investigation.\nEfficacy and effectiveness of cognitive  behaviour therapy for chronic pain: progress and some  challenges.\nAn updated overview of clinical  guidelines for the management of nonspecific low  back pain in primary care.\nPrevalence of and screening for  serious spinal pathology in patients presenting to  primary care settings with acute low back pain.\nPrevalence of and screening for  serious spinal pathology in patients presenting to  primary care with acute low back pain.\nRed flags presented in current low back  pain guidelines: a review.\nEarly identification and management   of psychological risk factors (yellow flags) in patients  with low back pain: a reappraisal.\nThis paper addresses the influence of the yellow  flags on outcome in people with acute or subacute  low back pain and whether yellow flags be targeted  in interventions to improve outcomes.\nThe prognosis of acute  and persistent lowback pain: a metaanalysis.\nClinical  course of nonspecific low back pain: a systematic  review of prospective cohort studies set in primary  care.\nThe global burden of low back pain:  estimates from the Global Burden of Disease 2010  study.\nUnderstanding the  etiology of chronic pain from a psychological  perspective.\nThe impact of ergonomic intervention on  individual health and corporate prosperity in a  telecommunications environment.\nEarly identification of  patients at risk of developing a persistent back  problem: the predictive validity of the rebro  Musculoskeletal Pain Questionnaire.\nPain 19,  8086 (2003).\nThis systematic review and metaanalysis shows  that exercise alone or in combination with  education is effective for preventing low back pain.\nManaging  nonserious low back pain in the emergency  department: time for a change? Emerg.\nPsychologically informed  practice for management of low back pain: future  directions in practice and research.\nWhy wait to  address highrisk cases of acute low back pain?   A comparison of stepped, stratified, and matched  care.\nThis RCT reveals that in patients with acute low  back pain, continuing ordinary activities leads  to more rapid recovery than either bed rest or  back-mobilizing exercises.\nUnited Kingdom back pain  exercise and manipulation (UK BEAM) randomised  trial: effectiveness of physical treatments for back pain  in primary care.\nShould treatment of (sub) acute low  back pain be aimed at psychosocial prognostic  factors? Cluster randomised clinical trial in general  practice.\nBMJ 331, 84 (2005).\nWhy is a treatment aimed at  psychosocial factors not effective in patients with (sub)  acute low back pain? Pain 118, 350359 (2005).\nPsychosocial interventions for low back pain in  primary care: lessons learned from recent trials.\nComparison of stratified primary care  management for low back pain with current best  practice (STarT Back): a randomised controlled trial.\nThis RCT reveals that a stratified approach using  prognostic screening with matched pathways is  more (cost)effective than nonstratified current  best practice.\nPrognostic factors for musculosketal pain in  primary care: a systematic review.\nEffect of Primary CareBased  Education on Reassurance in Patients With Acute Low  Back Pain: Systematic Review and Metaanalysis.\nPreventing disabling chronic pain by  engaging psychologists in the acute phase.\nEffect of stratified care for low back  pain in family practice (IMPaCT Back): a prospective  populationbased sequential comparison.\nEffect of primary carebased  education on reassurance in patients with acute low  back pain: systematic review and metaanalysis.\nSecondary prevention of  work-related disability in nonspecific low back pain:  does problem-solving therapy help? A randomized  clinical trial.\nEarly psychologically informed interventions for  workers at risk for painrelated disability: does  matching treatment to profile improve outcome?   J.\nCan chronic disability be  prevented? A randomized trial of a cognitivebehavior  intervention and two forms of information for patients  with spinal pain.\nThe effects of cognitivebehavioral and  physical therapy preventive interventions on  pain-related sick leave: a randomized controlled trial.\nPain 21, 109119 (2005).\nA cognitivebehavioral  group intervention as prevention for persistent   neck and back pain in a nonpatient population:   a randomized controlled trial.\nThis multicentre RCT reveals that a group cognitive  behavioral intervention had a sustained effect on  troublesome subacute and chronic lowback pain at  a low cost to the healthcare provider.\nCognitive functional therapy:   an integrated behavioral approach for the targeted  management of disabling low back pain.\nA randomized trial of behavioral  physical therapy interventions for acute and subacute  low back pain.\nEffects of workplace, family and  cultural influences on low back pain: what  opportunities exist to address social factors in  general consultations? Best Pract.\nWorkplacebased returnto-work  interventions: a systematic review of the quantitative  literature.\nWorkplace involvement improves return to work rates  among employees with back pain on longterm sick  leave: a systematic review of the effectiveness and   costeffectiveness of interventions.\nSystem influences on work disability due to low back  pain: an international evidence synthesis.\nEarly workplace dialogue in  physiotherapy practice improved work ability at   oneyear followup: a randomized controlled trial in  primary care.\nPain 159, 14561464 (2018).\nBMJ 356, i6748 (2017).\nLow back pain and radicular  pain: assessment and management  summary.\nNational Clinical Guidelines  for nonsurgical treatment of patients with recent  onset low back pain or lumbar radiculopathy.\nCDC Guideline  for prescribing opioids for chronic pain  United  States, 2016.\nJAMA 315, 16241645 (2016).\nPrescribing exercise  interventions for patients with chronic conditions.\nCMAJ 188, 510518 (2016).\nEfficacy of paracetamol for acute  lowback pain: a doubleblind, randomised controlled  trial.\nLancet 384, 15861596 (2014).\nEfficacy, tolerability, and dose dependent effects of opioid analgesics for low   back pain: a systematic review and metaanalysis.\nThis metaanalysis reveals that for people with  chronic low back pain who tolerate the medicine,  opioid analgesics provide modest and clinically not  important immediate effects, and that evidence on  longterm efficacy is lacking and efficacy in acute  low back pain is unknown.\nAnticonvulsants in the treatment of low  back pain and lumbar radicular pain: a systematic  review and meta-analysis.\nRandomized trial of radiofrequency  lumbar facet denervation for chronic low back pain.\nLow back pain and sciatica: summary of NICE  guidance.\nEffect of radiofrequency  denervation on pain intensity among patients with  chronic low back pain: the mint randomized clinical  trials.\nGuidelines for composing and  assessing a paper on the treatment of pain: a practical  application of evidencebased medicine principles to  the mint randomized clinical trials.\nInterpreting the MINT randomized trials evaluating  radiofrequency ablation for lumbar facet and sacroiliac  joint pain: a call from ASRA for better education,  study design, and performance.\nFlawed study design and  incorrect presentation of data negatively impact  potentially useful interventional treatments for  patients with low back pain: a critical review of   JAMAs MinT Study.\nWhich  pain medications are effective for sciatica (radicular  leg pain)? BMJ 359, j4248 (2017).\nEpidural steroids: a comprehensive,  evidencebased review.\nLow back pain and radicular  pain: assessment and management (Belgian Health  Care Knowledge Centre (KCE), Brussels, 2017).\nThe effect of graded activity on  patients with subacute low back pain: a randomized  prospective clinical study with an operantconditioning  behavioral approach.\nMultidisciplinary biopsychosocial  rehabilitation for chronic low back pain: Cochrane  systematic review and metaanalysis.\nDose or content? Effectiveness  of pain rehabilitation programs for patients with  chronic low back pain: a systematic review.\nCognitivebehavioral  treatments for chronic pain: what works for whom?  Clin.\nPainRelated Fear: ExposureBased  Treatment for Chronic Pain (IASP Press, 2012).\nA systematic  review and metaanalysis on the effectiveness of  graded activity and graded exposure for chronic  nonspecific low back pain.\nTreatments addressing painrelated  fear and anxiety in patients with chronic musculoskeletal  pain: a preliminary review.\nIs exposure in vivo cost effective for chronic low back pain? A trialbased  economic evaluation.\nPersonalized medicine: time for   oneperson trials.\nFear of movement/(re)injury in  chronic low back pain: education or exposure in vivo  as mediator to fear reduction? Clin.\nPain 21, 917  discussion 6972 (2005).\nGraded exposure in vivo in the  treatment of painrelated fear: a replicated singlecase  experimental design in four patients with chronic low  back pain.\nGlobal burden of  pain and global pain policycreating a purposeful  body of evidence.\nLow back pain and best practice  care.\nEvaluation of a Canadian back  pain mass media campaign.\n2001 Volvo  award winner in clinical studies: effects of a   media campaign on back pain beliefs and its   potential influence on management of low back   pain in general practice.\nGeneral practitioners fear-avoidance  beliefs influence their management of patients with low  back pain.\nHealth care  practitioners attitudes and beliefs about low back  pain: a systematic search and critical review of  available measurement tools.\nEffectiveness of interventions  designed to reduce the use of imaging for lowback pain:  a systematic review.\nPremorbid psychosocial factors are  associated with poor healthrelated quality of life in  subjects with new onset of chronic widespread pain.\nIllness beliefs among patients with chronic widespread  painassociations with selfreported health status,  anxiety and depressive symptoms and impact of pain.\nLiving with chronic low back  pain: a metasynthesis of qualitative research.\nExperiences of chronic low back pain:   a metaethnography of qualitative research.\nLives on hold: a qualitative synthesis  exploring the experience of chronic lowback pain.\nPsychosocial predictors of health  related quality of life and health services utilisation   in people with chronic low back pain.\nLow back pain and healthrelated quality of  life in communitydwelling older adults.\nSpinal pain and its  impact on older people.\nHealth care providers  orientations towards common low back pain predict  perceived harmfulness of physical activities and  recommendations regarding return to normal activity.\nResilience in mental health:   linking psychological and neurobiological perspectives.\nEmpirical evaluation of very large treatment effects of  medical interventions.\nExplaining how cognitive behavioral approaches  work for low back pain: mediation analysis of the  back skills training trial.\nApplying causal mediation methods to clinical trial  data: what can we learn about why our interventions  (dont) work? Eur.\nCausal mediation analysis in the  context of clinical research.\nStratified models of care.\nNof-1 trials to enhance patient outcomes:  identifying effective therapies and reducing harms,  one patient at a time.\nRevision of a method quality rating  scale for singlecase experimental designs and   nof-1 trials: the 15-item Risk of Bias in Nof-1 Trials  (RoBiNT) Scale.\nmHealth: a strategic field  without a solid scientific soul.\nLiteracyadapted cognitive  behavioral therapy versus education for chronic pain  at lowincome clinics: a randomized controlled trial.\nModic changesTheir associations with  low back pain and activity limitation: A systematic  literature review and metaanalysis.\nis supported by the Research Foundation Flanders,  Belgium (FWO Vlaanderen: #G001818N and #G071118N),  the Asthenes longterm structural fundingMethusalem  grant by the Flemish Government, Belgium (METH/15/011)  and the National Institute for Health and Disability Insurance  (NIHDI: #2018-00047).\nis supported by the National  Health and Medical Research Council of Australia  (APP1103022, APP1113532 and APP1134856).\nis  supported the Louise and Alan Edwards Foundation.\nis supported by the Canadian Excellence Research Chair fund  (grant CERC 09).\nAuthor contributions Introduction (J.\n); Diagnosis, screening and prevention (C.\n); Quality of life (M.\n); Overview of the Primer  (J.\nis chief investigator or associate investigator on multiple previous and current research grants from Belgium,  including the Flemish Government, Research Foundation  Flanders (FWO Vlaanderen) and the National Institute for  Health and Disability Insurance (NIHDI).\nHe has received  travel expenses for speaking at conferences from the professional associations hosting the conferences and has received  honoraria for reviewing grants from government grant agencies and honoraria for marking theses from universities.\nHe  has received travel expenses for speaking at conferences from  the professional associations hosting the conferences and has  received honoraria for talks from professional associations  and the industry hosting the talks, honoraria for reviewing  grants from government grant agencies and honoraria for  marking theses from the relevant university.\nHe has received travel  expenses for speaking at conferences from the professional  associations hosting the conferences and has received honoraria for reviewing grants and giving educational lectures.\nPublishers note Springer Nature remains neutral with regard to jurisdictional  claims in published maps and institutional affiliations.\nMoseley, and other anonymous  reviewer(s), for their contribution to the peer review of   this work."}