{"title": "33.pdf", "contents": "Disinhibition of the primary somatosensory cortex in patients with fibromyalgia.\nAbstract Fibromyalgia (FM) is a chronic widespread pain condition linked to central sensitization.\nAltered excitability of sensorimotor cortex has been proposed as an underlying pathology of FM.\nThis study aimed to investigate intracortical excitability of the primary somatosensory cortex (S1) and its potential role in clinical pain in patients with FM.\nSomatosensory evoked magnetic fields were recorded in 17 right-handed females with FM and 21 age-, sex-, and handedness-matched healthy control subjects.\nPaired-pulse median nerve stimulation was delivered to the left and right wrist.\nPatients with FM displayed significantly higher PPS ratio for the N20mP35m in both hemispheres, indicating reduced intracortical inhibition in the S1.\nNotably, PPS ratio for the P35m was higher in patients with FM than in healthy controls, whereas no differences were apparent in PPS ratio for the N20m in both hemispheres.\nFor both the N20mP35m and the P35m in the left hemisphere, PPS ratios were positively associated with the sensory pain on the shortform McGill Pain Questionnaire.\nThis study demonstrated that intracortical inhibition in the S1 is compromised bilaterally in patients with FM, and the extent of disinhibition can be closely associated with increased clinical pain.\nOur results suggest that changes of intracortical inhibition of the S1 may contribute to the pathophysiology of FM pain.\nFibromyalgia (FM) is a chronic pain syndrome characterized by widespread pain and tenderness, often accompanied by fatigue, nonrestorative sleep, and cognitive dysfunction.\nsuggested that the augmented and ongoing nociceptive input to the brain leads to cortical reorganization and maladaptive neuroplasticity within the somatosensory and motor sys-.\n25,34,35,41,44,50 In a previous study using transcranial magnetic stimulation (TMS) of the motor cortex, it showed that the patients with FM had deficits in intracortical modulation possibly involving both g-aminobutyric acid-releasing (GABAergic) and glutamatergic mechanisms.\n41 Recently, we found that patients with FM showed lower white matter integrity as measured by fractional anisotropy in the corpus callosum, the structure that enables interhemispheric communication between the sensorimotor cortices.\n22 However, intracortical inhibitory function in the somatosensory system of patients with FM has not been well understood so far.\n16,25,26,52 This study aimed to investigate intracortical inhibition of the primary somatosensory cortex (S1), as measured by paired-pulse suppression (PPS) ratio of the N20mP35m response, in patients with FM by using pairedpulse median nerve stimulation and magnetoencephalography (MEG).\nWe hypothesized that intracortical inhibition of the S1 would be reduced in patients with FM, ie, patients with FM would demonstrate higher PPS ratios than healthy control (HC) subjects, and that the higher reductions of inhibition would be associated with increased clinical pain.\nAddress: Department of Neurosurgery, Seoul National University Hospital, 101 Daehak-ro, Jongno-gu, Seoul, 110-744, South Korea.\nCopyright  2015 by the International Association for the Study of Pain.\nS1, respectively,15,16,28,55 we further examined PPS ratios separately for each of these components.\nNineteen right-handed female patients were recruited from the outpatient clinics of the Rheumatology Departments of the Seoul National University Hospital (SNUH) and Hallym University Sacred Heart Hospital.\nAll examinations, except diagnosis and self-report questionnaires, were conducted at SNUH to ensure consistency of the results.\nEligibility criteria for patients with FM were: (1) meeting the American College of Rheumatology 1990 criteria for primary FM,56 (2) having a duration of widespread pain at least 3 months, but less than 10 years, (3) experiencing a pain intensity of at least 40 on the 0to 100-mm pain visual analog scale over the past week, (4) between 30 and 60 years of age, and (5) willing to stop taking medications known to influence the somatosensory system (eg, analgesics, antidepressants, and anticonvulsants) at least 3 days before the assessments.\nPatients were excluded if they had: (1) secondary FM associated with inflammatory arthritis, (2) a medical history of axis 1 psychiatric disorders (ie, major depressive disorder, schizophrenia, substance abuse) or other disorders affecting the central nervous system (ie, cerebrovascular accident, multiple sclerosis, Parkinsons disease), (3) signs of peripheral neuropathy at the upper extremities (eg, related to trauma, polyneuropathy), (4) concomitant acute pain in the upper extremities (eg, due to injury), (5) hearing loss or use of hearing aids, (6) pregnancy or breastfeeding, or (7) contradictions for MEG (ie, dental braces, permanent retainers) and/or magnetic resonance imaging (MRI) (ie, pacemakers, cochlear devices, surgical clips, metallic implants, orthopedic pins) assessments.\nAge-, gender-, and handedness-matched 21 HC subjects were recruited by local advertisement.\nThe study protocol was approved by the Institutional Review Board at SNUH and Hallym University Sacred Heart Hospital and was conducted in compliance with the Declaration of Helsinki.\nAll participants provided written informed consent.\nFor patients with FM, the disease duration (since the onset of widespread pain) and the number of tender points (as assessed by the treating rheumatologist using manual palpation upon inclusion) were registered.\nBeck Depression Inventory,2 Beck Anxiety Inventory,1 and the Fibromyalgia Impact Questionnaire3 were assessed.\nThe pain intensity for current and average and the medication intake were assessed.\nSensory and affective components of pain quality were assessed by the short-form McGill Pain Questionnaire (SF-MPQ).\nDemographic and clinical characteristics of the participants are presented in Table 1.\n2 milliseconds of constant current pulses using bipolar electrodes in separate sessions.\nElectrical stimulations were sequenced with a STIM2 system (Neuroscan, El Paso, TX) and.\ndelivered by using a high-voltage constant current stimulator (Digitimer DS7AH; Digitimer Ltd, Hertfordshire, United Kingdom).\nBefore the recordings, sensory and motor threshold were.\nWe defined the sensory threshold as the lowest level of electrical stimulus intensity that produces the subtle tactile sensation on the skin of the wrist.\nThe motor threshold was determined as the lowest level of stimulus intensity for eliciting a visible twitch of the abductor pollicis brevis muscle.\nAll thresholds were determined twice and then averaged.\nThe stimulus intensity was set to 130% of each subjects motor threshold during the recording,14 where all participants did not feel any painful sensation.\nThe subjects were instructed not to pay attention to the stimulus and to keep their gaze fixed on a cross, shown in the center of the display in front of them.\n16 The order of the stimulation on the left and right median nerves at the wrist was randomized across subjects.\nDuring the MEG recordings, the subjects sat comfortably under the helmet-shaped sensor array and were asked to keep their heads as still as possible.\nThe exact location of the head with respect to the sensors was found by measuring the magnetic signals produced by electrical currents delivered to 4 head position indicator coils placed at known sites on the scalp.\nThe location of head position indicator coils with respect to 3 anatomical landmarks, the nasion and 2 preauricular points, were measured by using a 3-dimensional digitizer (FASTRAK; Polhemus, Colchester, VT), to allow alignment of the MEG and MRI coordinate systems.\nThe x-axis passed through the 2 preauricular points with the positive direction to the right.\nThe positive y-axis passed through the nasion, and the z-axis pointed upward.\ndigitized at 1 kHz.\n10; Elekta Neuromag, Helsinki, Finland).\nThe analysis period of 400 milliseconds included a prestimulus baseline of 100 milliseconds.\nEpochs with amplitudes exceeding 3000 fT/cm for MEG channel or 150 mV for electrooculogram were excluded from the average.\nAt least 120 artifact-free epochs were averaged for each single pulse and first pulse of the paired-.\nThe data of 2 FM subjects were excluded from further analyses for the following reasons: excessive rejections of epochs due to signals contaminated by eye movements and the absence of MEG data with left median nerve stimulation.\n100 milliseconds, it was shown that the response to the second pulse rides on the response to the first pulse (Fig.\nTherefore, linear superposition effect was factored out, by subtracting the response to single-pulse stimuli from the response to paired-pulse stimuli, to assess true paired-pulse interaction (Fig.\nBased on these analysis procedures, the baseline corrected responses of N20m and P35m were obtained (Fig.\nelectrical stimuli were modeled in the time domain as equivalent current dipoles (ECDs).\n11 This source analysis was performed blind to group status.\nThe ECD, which best explains the measured data, was determined at around 35 milliseconds to obtain an S1 source with a high signal-to-noise ratio28 by a leastsquares search using a subset of 24 gradiometers over contralateral parietal areas.\n3-dimensional location, orientation, and strength of the ECD in a spherical volume conductor model of the head.\nAfter identifying the single dipole, the entire analysis period and all channels were taken into account in computing the time-varying single-dipole model.\nTo validate the single-dipole model, measured MEG signals were compared with the responses predicted by the model.\n1B) and to the difference between paired-pulse and the single-pulse conditions (Fig.\nThe peak-to-peak amplitudes of the N20mP35m and the peak amplitude of N20m and P35m components to the second pulse of the paired-pulse stimulation were obtained in the source waveform of paired-pulse minus single-pulse conditions (A2s).\nThe higher ratios are associated with reduced PPS, whereas lower ratios are associated with stronger PPS.\nIndividual MRIs were spatially normalized in the Talairach.\ncoordinates using BrainVoyager QX software (version 1.\n10; Brain Innovation, Maastricht, the Netherlands) according to Lim et al.\nSource locations of the S1 responses in the head coordinates were transformed into Talairach coordinates using Brain Electrical Source Analysis software (version 5.\nDuration of illness, mo 37.\nBeck Depression Index score 19.\nBeck Anxiety Index score 22.\nOut of the 19 patients involved in the study, 17 whose MEG data were analyzed are described.\nAdditionally, analgesics were used by 71%, antidepressants by 71%, and anticonvulsants by 35% of these patients.\nThe earliest downward deflection peaking at 20 milliseconds (N20m) and the following deflections of opposite polarity peaking at 27 milliseconds (P35m) were identified after the stimulus onset.\nAfter strong N20m and P35m responses to the first pulse of the paired-pulse stimulation, clear but weaker N20m and P35m responses to the second pulse of the paired-pulse stimulation was observed (B).\nThe N20m and P35m responses to the second pulse of the paired-pulse stimulation were shown, after subtracting the response to a single-pulse from the paired-pulse stimulation (C).\nBlack triangles indicate stimulus onset.\nTwenty HC subjects whose MRI data were available are included in deriving the source location in the Talairach coordinates.\nThe PPS ratios of S1 response were compared using repeatedmeasures analysis of variance (ANOVA) with hemisphere.\n(contralateral to each hand) as the within-subject factor and group (FM and HC) as the between-subject factor.\nSource locations of the S1 responses were compared in each hemisphere separately by means of repeated-measures ANOVA with coordinate (x, y, and z) as the within-subject factor and group (FM and HC) as the between-subject factor.\nThe Mauchlys test of sphericity was used to evaluate whether the sphericity assumption was violated.\nOur main question is to what extent intracortical inhibition of the S1 explains the variance of clinical pain in FM patients.\nTherefore, linear regression analysis was performed with the PPS ratio as an independent variable, and the sensory and affective pain scores of the SF-MPQ and pain intensity on a visual analog scale (past week) as a dependent variable.\nThus, the potential relationship between depressive or anxiety symptoms of FM patients and the PPS ratio were tested using Pearsons correlation in an exploratory fashion.\nWe performed all statistical analyses using the SPSS 13.\nAll group data are presented as mean 6 SDs.\n40 mA and HC for 1.\n453) and right hand (FM for 1.\nThe stimulusintensities set at 130%of motorthresholdfor median nerve were not different between groups in both left (FM for 5.\n20 mA and HC for 5.\nFigure 2 shows the cortical responses to singleand pairedpulse median nerve stimuli in one representative HC and FM subject, respectively.\nIn an HC subject, the amplitudes of the second response were markedly suppressed as compared with the first response in both hemispheres (A).\nIn contrast, in patients with FM, amplitudes of the second response were comparable with the first response in both hemispheres (B).\nThe mean source locations of S1 in each hemisphere were.\n001; right, P , 0.\n431; right, P 5 0.\ngroup interaction effect (left, P 5 0.\n369, respectively) were found both in the left and right hemispheres.\nIn the FM group, the mean coordinates (in millimeters) were x 5 242.\n7 for the left S1; and x 5 41.\n2 for the right S1.\nIn the HC group, the mean coordinates (mm) were x 5 242.\n3 for the left S1; and x 5 42.\n6 for the right S1.\nFigure 3B shows the mean PPS ratios for the N20mP35m in patients with FM and HC subjects.\nA repeatedmeasures ANOVA showed a significant main effect of group (P 5 0.\n009), indicating that the PPS ratios were higher in patients with FM than in HC subjects.\nThere was no significant main effect of hemisphere (P 5 0.\n377) nor was there a group X hemisphere interaction effect (P 5 0.\nAs such, the mean PPS ratio for the N20mP35m in both the left and the right hemispheres were higher in patients with FM than in HC subjects (Table 2).\nNotably, there was a significant main effect of group (P 5 0.\n009) for P35m component, with no main effect for the hemisphere (P 5 0.\n124) and no significant group X hemisphere interaction (P 5 0.\nIn contrast, we did not find any significant effect of group (P 5 0.\n890), hemisphere (P 5 0.\n698), or their interaction (P 5 0.\n837) for the N20m component (Fig.\neffect of group (A1, P 5 0.\n639), hemisphere (A1, P 5 0.\n301), or any group X hemisphere interaction effect (A1, P 5 0.\n870), hemisphere (P 5 0.\nFor amplitude of the second P35m after subtracting the response to a single-pulse (A2s), ANOVA revealed a significant main effect of hemisphere (P 5 0.\n426) or group X hemisphere interaction effect (P 5 0.\nCorrelation with symptom severity.\nFigure 4 shows the relationship between the PPS ratio and clinical pain intensity in FM patients.\nAfter correcting for multiple comparisons, a higher PPS ratio for the N20mP35m in the left hemisphere was significantly associated with higher clinical pain ratings in the sensory (r2 5 0.\n014) but not the affective (r2 5 0.\nNotably,ahigher PPS ratio for the P35m was more closely associated with higher clinical pain ratings in the sensory (r2 5 0.\nThe PPS ratio for P35m component was also positively associated with average pain intensity over the past week (r2 5 0.\nIn our exploratory analysis, we did not find any significant correlation between PPS ratios.\nThis study is the first to demonstrate that in patients with FM, intracortical inhibition in the S1 is compromised bilaterally and the.\nCopyright  2015 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited.\nextent of disinhibition can be closely associated with increased clinical pain.\nHowever, the paininduced cortical reorganization and maladaptive neuroplasticity in the S1 has been suggested to be involved in the development and maintenance of chronic pain.\n25,35,44,50 Reorganization of the somatotopic map within S1 was closely related to clinical pain in other chronic pain disorders such as phantom limb pain or complex regional pain syndrome.\n35,44 In addition, a recent paired-pulse SEP study by Lenz et al.\n25 showed higher PPS ratio in the hemispheres contralateral to both the affected and unaffected hands in patients with complex regional pain syndrome type I.\nPrevious FM studies have revealed evidence of cortical reorganization of the S1 due to central sensitization associated with persistent pain.\nSeveral electrophysiological and neuroimaging studies assessing brain activity during painful stimulus in patients with FM showed widespread augmented activation in brain regions including the S1.\n4,7,33 In addition, a recent resting-state functional MRI study reported increased spectral power in the S1, indicating the high level of baseline neural activity in FM patients.\nassociated with structural reorganization, ie, increased white matter fractional anisotropy, in the bilateral postcentral gyri.\n32 In this study, we observed a robust positive relationship between the reduced intracortical inhibition of the S1 and the sensory pain score on the SF-MPQ.\nThus, cortical reorganization appearing as reduced intracortical inhibition of the S1 may be responsible for chronic pain in patients with FM.\nThis cortical reorganization may explain the diffuse tenderness and widespread pain,49 as well as disturbances in body perception, such as reduction in awareness of limb positions and phantom swelling of the hands commonly reported by patients with FM.\nthe changes in motor cortex excitability41 and pain reduction after repetitive TMS over the motor cortex in the patients with FM40,46.\nIt has been suggested that the analgesic effects produced by motor cortex stimulation are related to the restoration of defective intracortical inhibition.\nquestion is whether the abnormal intracortical inhibition in S1 would be reversed after repetitive TMS of the motor cortex.\nBased on studies in animals, both presynaptic and postsynaptic GABAergic inhibitions have emerged as important regulators of PPS.\n47,54 In human subjects, paired-pulse SEP experiments have shown that PPS is generated rostral to the brainstem nuclei, presumably in the cortex.\n13 Moreover, after the intravenous injection of the lorazepam, a GABAA receptor agonist, the amplitude of P35m response was attenuated in the single-pulse condition and PPS of P35m component was.\n16 They further observed that P35m response did not recover in the 100-millisecond paired-pulse condition,16 which was similar to the behaviors of inhibitory postsynaptic potentials in intracellular recording.\n5 Thus, taken together, our results of higher PPS ratio of the P35m component in FM patients compared with HC subjects could be related to reduction of GABA-mediated inhibitory function in the S1.\nRecent studies using in vivo magnetic resonance spectroscopy provided direct evidence of dysfunction of GABAergic system in FM.\n6 Patients with FM had lower GABA level within the right anterior insula.\nposterior insula was positively correlated with pressure pain threshold, suggesting alterations of inhibitory neurotransmission in FM.\nAdditional assessments of GABA levels in the S1 might further contribute to the interpretation of our results.\nsingle-pulse or first pulse of the paired-pulse stimuli are in line with.\nresults from a previous study that demonstrated no difference in the amplitude of the P50 response to first tactile stimuli of paired stimuli between FM patients and HC subjects.\n33 reported that FM patients showed an augmented S1 response to subjectively matched painful pressure stimulation on tender points.\nDifferences found between studies can be attributed to 2 points; first, it might stem from the use of different stimulus sites (tender vs nontender points) and properties (painful vs nonpainful).\nSecond, responses to nonpainful sensory stimuli may not be augmented in early sensory cortices but may appear augmented during later stages of sensory integration as suggested by a recent functional MRI study.\n10,16 This was confirmed by our results, showing that the amplitude of the N20m and P35 components was successfully suppressed by paired-pulse stimulation in HC subjects.\nHowever, higher PPS ratios in patients with FM were only found for P35m but not for N20m.\nThis might be explained by the relatively short recovery cycle of the N20m component, which reflects excitatory postsynaptic potentials.\nThird, a recent study in HC subjects demonstrated no significant difference in PPS ratios when comparing different stimulus intensities (250% of the sensory threshold and 100%, 120%, and 140% of the motor threshold).\n14 Moreover, the stimulus intensity for the left and right median nerves was not different between the groups in our study.\nThus, it is unlikely that the stimulus intensity might have affected between-group differences of PPS ratio.\nHowever, in previous somatosensory evoked field studies, the amplitude of the S1 response was not changed by paying attention to the stimuli.\nThus, we consider it is highly unlikely that the fixed order of stimuli affected the response to singleor paired-pulse stimuli in individual subjects and altered the PPS ratio of the N20mP35m response.\ntried to negate medication effects on cortical excitability by stopping all medications 3 days before the MEG recording, this may not have been enough to rule out a potential effect.\n41 demonstrated that motor cortex excitability and intracortical modulation in patients with FM was not different between patients with and without taking medications.\nTherefore, medication effects on cortical excitability in our study might be considered minimal as compared with disease effects.\nIn the clinical correlation analyses between PPS ratio and clinical pain, a significant result was only found in the left hemisphere.\nWe have no clear explanation for this finding at this stage.\nWe speculated that this could be due to a hemispheric imbalance of disinhibition.\nRelationship between PPS ratio and clinical pain in patients with fibromyalgia.\nThe sensory dimension of clinical pain was measured by the SF-MPQ (A and B).\nThe average pain intensity over the past week was rated on a VAS (C).\nChanges of the PPS ratio (A2s/A1) can be influenced by the amplitude of the second response or by the amplitude of the first response.\nTaken together, our results cannot determine which amplitudes contribute to a reduced PPS ratio in patients with FM.\nIn summary, this study demonstrated that intracortical in-.\nhibition in the S1 is compromised bilaterally in patients with FM, and the extent of disinhibition can be closely associated with increased clinical pain.\nOur results suggest that changes of intracortical inhibition of the S1 may contribute to the pathophysiology of FM pain.\nThe authors have no conflicts of interest to declare.\nArticle history: Received 26 September 2014 Received in revised form 30 December 2014 Accepted 7 January 2015 Available online 27 January 2015.\nFunctional imaging of pain in patients with primary fibromyalgia.\nneocortical neurones in vitro.\n[7] Gracely RH, Petzke F, Wolf JM, Clauw DJ.\n[8] Gross J, Baillet S, Barnes GR, Henson RN, Hillebrand A, Jensen O,.\nGood practice for conducting and reporting MEG research.\nmodulation of cortical activities in human somatosensory areas.\nThe profile of the recovery.\ncycle in human primary and secondary somatosensory cortex:.\nMagnetoencephalographytheory, instrumentation, and applications to noninvasive studies of the working human brain.\nsomatosensory cortex is determined by GABA-mediated intracortical inhibition.\nrecording after paired median nerve stimulation suggests origin of pairedpulse inhibition rostral of the brainstem.\nsuppression in somatosensory evoked potentials: a systematic analysis.\ncortical responses to stimulus trains and their modulation by motor activity.\nsomatosensory evoked fields from SI and SII by acute GABA A-agonism and paired-pulse stimulation.\nEvidence of dysfunctional pain inhibition in fibromyalgia reflected in rACC during provoked pain.\nCognitive behavioral therapy increases pain-evoked activation of the prefrontal cortex in patients with fibromyalgia.\nPatients with fibromyalgia display less functional connectivity in the brains pain inhibitory network.\nOverlapping structural and functional brain changes in patients with long-term exposure to fibromyalgia.\n[22] Kim DJ, Lim M, Kim JS, Son KM, Kim HA, Chung CK.\nIncreased power spectral density in resting-state painrelated brain networks in fibromyalgia.\nBilateral somatosensory cortex disinhibition in complex regional pain syndrome type I.\nsomatosensory cortex in aged humans is associated with impaired tactile acuity.\nOscillatory interaction between the hand area.\nof human primary motor cortex and finger muscles during steady-state isometric contraction.\nmagnetic fields by intensity of interfering stimuli in human somatosensory cortex: an MEG study.\nmuscle to sensorimotor cortex contributes to enhanced steady-state isometric contraction in humans.\nDisrupted brain circuitry for pain-related reward/punishment in fibromyalgia.\nAltered functional magnetic resonance imaging responses to nonpainful sensory stimulation in fibromyalgia patients.\nWhiteandgray matter abnormalities in the brain of patients with fibromyalgia: a diffusiontensor and volumetric imaging study.\nIncreased brain responses during subjectivelymatched mechanical pain stimulation in fibromyalgia patients as evidenced by MEG.\nThe motor system shows adaptive changes in complex regional pain syndrome.\nreorganization during recovery from complex regional pain syndrome.\nFibromyalgia: mechanisms and potential impact of.\nSomatosensory conflicts in complex regional pain syndrome type 1 and fibromyalgia syndrome.\nThe short-form McGill Pain Questionnaire.\nLong-term maintenance of the analgesic effects of transcranial magnetic stimulation in fibromyalgia.\ncortical excitability in patients with fibromyalgia.\nTruyols M, Collado D.\nEffects of unilateral repetitive transcranial magnetic stimulation of the motor cortex on chronic widespread pain in fibromyalgia.\n[47] Porter JT, Nieves D.\nexcitation of inhibitory and excitatory neurons in the mouse barrel cortex.\nThe contribution of sensory system functional connectivity reduction to clinical pain in fibromyalgia.\nNat Rev Rheumatol 2011;7:51827.\nMechanisms of disease: pain in fibromyalgia.\nPaired pulse depression in the somatosensory cortex: associations between MEG and BOLD fMRI.\nrejecting nearby interference in MEG measurements.\nSynaptic mechanisms of forward suppression in rat.\nEffects of interstimulus interval on somatosensory evoked magnetic fields (SEFs): a hypothesis concerning SEF generation at the primary sensorimotor cortex.\nElectroencephalogr Clin Neurophysiol 1996;100:47987.\nTugwell P, Campbell SM, Abeles M, Clark P, Fam AG, Farber SJ, Fiechtner JJ, Michael Franklin C, Gatter RA, Hamaty D, Lessard J, Lichtbroun AS, Masi AT, McCain GA, John Reynolds W, Romano TJ, Jon Russell I, Sheon RP.\nThe American College of Rheumatology 1990 criteria for the classification of fibromyalgia.\nReport of the multicenter criteria committee.\nCopyright  2015 by the International Association for the Study of Pain.\nUnauthorized reproduction of this article is prohibited."}