{"title": "37.pdf", "contents": "The Journal of Physiology.\nAbstract In this prospective electrostimulation study, based on 50 operated patients with no sensory deficit and no brain lesion in the postcentral gyrus, we acquired coordinates in the standard MNI space of the functional areas of the somatosensory homunculus.\nFor 647 sites stimulated on Brodmann Area 1 (and 1025 in gyri nearby), 258 positive points for somatosensory response (40%) were found in the postcentral gyrus.\nIn the contralateral BA1, the hand representation displayed not only medial-to-lateral and little-finger-to-thumb somatotopy, but also rostral-to-caudal discrete somatotopy, with the tip of each finger located more caudally than the proximal phalanx.\nThe analysis of the MNI body coordinates showed rare inter-individual variations in the medial-to-lateral somatotopicorganizationinthesepatientswithintactsomatosensorycortex.\nPositivestimulations were detected through the on/off outbreak effect and discriminative touch sensations were the sensations reported almost exclusively by all patients during stimulation.\nWe propose a rationalization of the standard drawing of the somatosensory homunculus according to MNI space.\n(Received 12 September 2017; accepted after revision 18 December 2017; first published online 29 December 2017) Corresponding author F.\nRoux: CNRS (CERCO) UMR Unite 5549 and Service de Neurochirurgie, Hopital Purpan, F-31059 Toulouse, France.\nThe Journal of Physiology C 2017 The Physiological Society DOI: 10.\nRoux and others J Physiol 596.\nThe primary somatosensory cortex can be divided into four distinct cytoarchitectonic areas (Powell & Mountcastle, 1959; Jones et al.\n1978), named Brodmann areas (BA) 3a, 3b, 1, and 2 (Brodmann 1909; Vogt & Vogt, 1919), areas 3a and 3b being located within the central sulcus, area 1 in the crown of the postcentral gyrus, and area 2 more caudally in the postcentral sulcus (White et al.\nAnimal studies have shown that BA 3a receives inputs from muscles and joints, whereas BA 3b and 1 receive from the skin, and BA 2 can combine skin and proprioceptive information (Kandel et al.\nThis information progresses hierarchically in a rostrocaudal direction (Iwamura et al.\n1993) with receptive fields increasing in size from area 3b to area 2 (Gardner, 1988).\n2014) with a sequential, somatotopic organization of each finger in narrow strips (Shoham & Grinvald, 2001).\nIn hand area 3b, there is a rostral-to-caudal arrangement with the fingertip located rostrally (Paul et al.\nIn contrast, in area 1, the organization of the sensitivity of the phalanx is reversed, with the fingertip located more caudally (Paul et al.\nSuch reversal of the maps between 3b and 1 could be a functional criterion of 3b/1 limits (Sanchez-Panchuelo et al.\n1950; Penfield & Jasper, 1954) mostly described the functional anatomy of this area in humans, emphasizing the somatotopic organization of the hemibody.\nMore recently, activation studies have also found a somatotopic organization of the somatosensory hemibody with more activation overlapping in areas 1 and 2 (Nelson & Chen, 2008) than in area 3 (Krause et al.\n2016) and anatomical (White et al.\n1997) variability of primary somatosensory maps.\nHowever, since the seminal works of Penfield et al.\nsystematic mapping of the human somatosensory cortex has been performed in a large number of subjects.\nThe presentstudywasbasedon50patientswithnosomatosensory deficit (intact patients).\ncoordinates of the functional areas of the somatosensory homunculus in the standard MNI space and to study the human hand and tongue cortical somatotopies in particular.\nParameters of excitability of human primary somatosensory areas in conscious individuals are also discussed.\nThe National Consultative Committee of INSERM (Institut National de la Sante et de la Recherche Medicale) gave its approval for the storage of patients data and preservation of their anonymity.\nHowever, the study conformed to the standards set by the Declaration of Helsinki.\nAll the patients and their families gave their informed consent for a study of the functional areas by direct brain mapping and each chart was discussed pre-operatively in a surgical staff meeting with different neurosurgeons.\nOnce 50 brain mappings had been included, the study was closed.\nData from successive brain mappings were prospectively collected by the same team using the same protocol throughout the 8 years of the study (June 2008June 2016).\nTwo main conditions of inclusion were defined: patients should have no initial sensory deficit and no brain lesion directly located in the postcentral gyrus.\nPatients were examined regarding their absence of initial sensory deficit using clinical tests (see Table 1 for preoperative testing details).\nBefore the operation, each patient underwent three tests: the tuning fork test; the warm/cold test; and the two-points discriminative test on the cheek, the hand (index finger) and the foot (hallux).\ndiscriminative distance is around 4 mm in the index (both sexes), 7 mm in the cheek (both sexes), and 11 mm for males and 13 mm for females in the hallux, with no differences between the left and right sides.\nOur criteria for exclusion were: patients with a discrimination threshold double the normal and/or any perturbed tuning fork or warm/cold test results on any of the three tested regions.\nElectrostimulation for brain mappings was performed to help with the removal of recently discovered brain lesions.\nThe mean time between the first clinical sign and operation was 38 days (range 3150 days; SD 37 days).\nWe found 15 WHO grade I and II gliomas, 25 WHO grade III and IV gliomas, 4 arteriovenous malformations or cavernomas, 5 metastases and 1 grade II meningioma.\nThey were located in 29 right and 21 left hemispheres.\nThe mean age of patients was 49.\nNineteen of the patients were women.\nThirty-seven patients had been recently treated with antiepileptic drugs, always less than 3 months before the operation.\nNone of them had chronic intractable epilepsy.\n5 Human somatosensory homunculus 943.\nResults of pre-operative testing of the 50 patients.\nTuning fork test Warm/cold test Two-point threshold discriminative test.\nPatients/sex Hand Cheek Foot Hand Cheek Foot Hand (index) Cheek Foot (hallux).\n1/F 1 1 1 1 1 1 3 6 16.\n2/M 1 1 1 1 1 1 5 12 18.\n3/F 1 1 1 1 1 1 6 13 22.\n6/M 1 1 1 1 1 1 3 10 20.\n8/F 1 1 1 1 1 1 7 9 16.\n10/F 1 1 1 1 1 1 2 11 19.\n12/F 1 1 1 1 1 1 5 13 23.\n14/M 1 1 1 1 1 1 6 8 10.\n15/M 1 1 1 1 1 1 2 5 13.\n16/M 1 1 1 1 1 1 2 5 17.\n17/M 1 1 1 1 1 1 6 10 21.\n18/M 1 1 1 1 1 1 3 6 18.\n19/M 1 1 1 1 1 1 4 9 15.\n20/F 1 1 1 1 1 1 5 12 21.\n21/M 1 1 1 1 1 1 3 8 17.\n22/F 1 1 1 1 1 1 5 11 20.\n23/M 1 1 1 1 1 1 6 12 19.\n45/M 1 1 1 1 1 1 4 9 15.\n47/M 1 1 1 1 1 1 2 6 10.\n48/F 1 1 1 1 1 1 5 7 8.\n49/F 1 1 1 1 1 1 4 4 10.\n50/M 1 1 1 1 1 1 5 4 14.\nTuning fork test: Do you feel the tuning fork? Yes: 1; no: 0.\nWarm/cold test: Do you feel warm/cold? Yes: 1; no: 0.\nTwo-point threshold discriminative test: None of the patients of our study had a discriminative deficit in the tested zones and none failed the tuning fork or warm/cold tests in any of the 3 different regions tested.\nDiscrimination test thresholds:Whole group for index: Mean discriminative test, 3.\nWhole group for cheek: Mean discriminative test, 8.\nWhole group for hallux: Mean discriminative test, 16.\nThe Journal of Physiology C 2017 The Physiological Society.\nSee the Terms and Conditions (https://onlinelibrary.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nRoux and others J Physiol 596.\nAnaesthetic drugs can, in theory, interfere with stimulation thresholds.\nOur objective during brain mapping was to avoid any anaesthetic drugs.\nSedation with spontaneous respiration was provided by continuous infusion of Propofol (13 mg kg h1).\n25 g kg h1) was used for analgesia.\nPropofol infusion was stopped during the dural opening (around 10 min before brain mapping) and the patient was fully awakened.\nOnce the cortical mapping procedure was completed, patients were put back to sleep using the same protocol for the rest of the operation.\nA neuronavigational system was used to guide tumour removal.\nAnatomical structures (gyri and sulci) were identified according to this neuronavigational data and the visual identification of the shape of gyri and sulci.\nThe cortex was directly stimulated before any surgical approach using the bipolar electrode of the Nimbus cortical stimulator (1 mm electrodes; Innopsys, Toulouse, France) with biphasic square wave pulses of 1 ms duration and 50 Hz trains.\nThe maximum train duration of each stimulation was 5 s.\nThe afterdischarge threshold was determined by electrocorticography using a strip electrode.\nAlthough this point remains controversial, the afterdischarge threshold seemed to change little from site to site during one short mapping session (Ojemann, 1993).\nThe level of electrostimulation was always kept 1 mA below that expected to cause electrical diffusion and afterdischarges so as to ensure that the stimulated area remained accurately localized on the area of cortex under study.\nIf any afterdischarge (or epilepsy) was detected, the protocol was adapted to the afterdischarge threshold found.\npatients acknowledged feeling something.\nPatients were encouraged to report their sensations during stimulation.\nThepatientslevelofalertnessintheabsenceofstimulation was regularly evaluated throughout the testing, as further assurance that changes during stimulation were not random events.\n3 interferences to validate a cortical site as positive).\nAtleast3trialswereperformed on positive sites.\nIf allowed by electrocorticography results, the intensity of stimulation was raised to as high as 10 mA if necessary to obtain a response.\nIf patients felt any unpleasant sensation or pain at any time, or any sensation that could evoke seizures, the stimulation was stopped and the intensity reduced.\nWe tested only what was really useful for the treatment of the patients.\nStimulation around and between detected positive areas may not have been tested because such testing was not clinically relevant for the patient.\nThis legitimate constraint limited the ability to find complete somatotopies of the part of the body tested in individual patients.\n1997), BA1 was defined as the crown of the postcentral gyrus from the central sulcus anteriorly to the postcentral sulcus.\nThese divisions are similar to those used for primate studies (Mountcastle, 2005).\nBecause of their localizations deep in the sulci, BA3a, BA3b, and BA2 were not accessible to electrostimulation.\nThus, the current functional exploration focused on BA1.\nWhen a functional site was found, it was marked by a sterile ticket of 0.\nIt was decided that the minimal spatial resolution of our electrostimulation technique corresponded to the size of the bipolar electrode separated by 3 mm.\nOnce a positive functional area was detected, the cortical areas located 3 mm from it were also tested.\nEach patient had her/his positive stimulations positioned on the left or right 3D cortical surface reconstructions of.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nFor each positive site, MNI space coordinates (X, Y, Z) were obtained and stored year by year in an Excel database, with a detailed account of the type of response obtained.\nParameters of stimulation of the somatosensory primary areas in the conscious human.\nOver 647 sites stimulated in BA1, we found 258 positive areas (40%).\nStimulation of somatosensory primary areas had several characteristics (positive intensity threshold; type of outbreak; accuracy; type of patients feelings).\nThe mean general positive intensity threshold was 2.\n5 to 7 mA) with a limited standard deviation (SD 0.\nSpecific mean finger (2.\nPositive stimulations were detected with a clear-cut threshold effect (for instance, at 1.\nTingling (discriminative touch domain) was the main and almost exclusive sensation reported by all patients.\nPain was felt only once by one patient; another also had a bad taste in the mouth and another reported burning in the hand during some stimulations.\nNo other sensations (from the proprioception domain for instance) were detected.\nStrictly no other isolated, positive somatosensory sensation was found among the 1025 stimulations performed outside the postcentral gyrus.\nFinger responses were found in 34 patients and the medial-to-lateral somatotopy was respected with no aberrant localization.\nThey were located in the main postcentral somatotopic representation of the digits.\nOnly one patient reported sensations in the dorsal part of her fingers when one cortical area was stimulated.\nOne stimulation elicited tinglinginthelittlefingerandthemedialpartofthenearby ring finger.\nMore areas were found for the thumb (41 areas) and 2nd finger (31 areas), than for the 3rd finger (25 areas), the 4th finger (19 areas) and the little finger (21 areas).\nDispersions were computed by calculating the Euclidean distance (in mm) between each stimulation point and the barycentre of the corresponding finger.\n01) between the left and right hemispheres.\nHowever, there was no significant difference in the distances from the barycentres of each finger between the two hemispheres (t = 0.\nIn addition to this medial-to-lateral sequence, 10 patients felt either the tip or the base of at least one finger during electrostimulation.\nFurthermore, four patients displayed both tip and base finger phalange representation, all of them with a caudal discrete representation of the finger tip.\nThus,groupanalysisofthese14patientswhodisplayed base and/or tip of the finger sensations during stimulation showed a clear rostral-to-caudal finger somatotopy with the tips of the fingers located more caudally than the base, as shown in Fig.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nPatients felt tingling exclusively on the contralateral space of the tongue.\nTip sensations were rather rare (6 sites), as were sensations of the base of the tongue during stimulation (7 sites).\nAlthough a rostral-to-caudal somatotopy (for instance different cortical representation for the lateral and the central parts of the tongue) may exist for the human tongue, no such organization was detected.\nThe medial-to-lateral sequence of the contralateral body.\nVarious contralateral representations of the skin from the feet, knee, abdomen, thorax, eyebrows, gums or jaws were detected in BA1, among other sensations.\n5 and in Table 4, the variations in localization were limited.\nest (thumb, index, middle finger, middle part of the tongue, and lips), calculated from MNI coordinates, were all less than 5 mm.\nThe analysis of MNI coordinates demonstrated that BA1 of the somatosensory cortex in humans was organized somatotopically from the medial to lateral and anterior to posterior parts of the postcentral gyrus.\nThe contralateral cutaneous areas of the body are represented in small patches of cortex and, although almost all cutaneous parts of the contralateral body were found at least once in this series, two main zones were detected: the hand and the face/tongue.\nThe hand and the face/mouth areas occupied parts of the cortex that were proportionally much larger than their cutaneous surface area, because of their much more marked discriminative properties and small receptive fields.\nThe relatively high number of positive responses found for hand and face/tongue is an indirect sign that the human brain multiplies the cortical representations of small receptive fields to increase its discriminative abilities for these two body regions.\nExample of electrostimulation mapping for somatosensory BA1 cortex A, 38-year-old patient with a right diffuse astrocytoma IDH mutant (WHO 2016) with no sensorimotor deficit.\nWe observed that the displacement of the bipolar electrode on the cortex located adjacent to a positive area often induced another interference.\n5 Human somatosensory homunculus 947.\n55 50 45 40 35 30 25.\n25 30 35 40 45 50 55.\n25 30 35 40 45 50 55.\nRelative distance: Dposterior / (Dposterior+Danterior).\nB and C, representation of the barycentre of each finger (coloured dots) in right and left hemispheres with amplitude bars representing the standard variations of each localization (coloured lines).\nThe Journal of Physiology C 2017 The Physiological Society.\nSee the Terms and Conditions (https://onlinelibrary.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nRoux and others J Physiol 596.\nOverall, the medial-to-lateral space (X MNI coordinates) devoted to the fingers in BA1 was around 1.\nD, right and left hemispheric distribution of the MNI coordinates of the somatosensory base of the fingers (yellow); whole finger sensation (grey); and tips of the fingers (light blue).\nIndividual analysis showed the rostral-to-caudal somatosensory cortical representation of the ventral part of the skin of the fingers.\nThis rostral-to caudal somatotopy was detected at least once in all 5 fingers.\nE, group analysis confirmed this somatotopic representation with average X, Y, Z MNI coordinates for the group of fingertip points located more posteriorly (X = 41.\n[Colour figure can be viewed at wileyonlinelibrary.\narea, magnifications of the ventral part of the thumb and index were particularly evident, as described in other studies (Penfield & Rasmussen, 1950; Martuzzi et al.\n1997) studies argue for the variability of this somatosensory functionalorganization.\nOur results showed that no aberrant somatotopic organization was detected and the localization of each skin cortical representation within the postcentral gyrus.\nvaried little (standard deviations of the barycentre of main cortical representations were less than 5 mm).\ndescribed long ago, the anterior-to-posterior organization of the postcentral gyrus in the human is less well known (Nelson & Chen, 2008).\nThis study showed that the finger topography is organized with the tip of the fingers located more posteriorly than their base, in both group and single subject analysis.\nThis finding matches previous studies in primates that suggested such a rostral-to-caudal finger organization in BA1 (Darian-Smith et al.\nThe somatotopic sequence of the tongue The contralateral somatotopic representations displayed the following somatotopy: base of the tongue (red dots) close to the Sylvian fissure, and middle (pink dots) and tip of the tongue (yellow dots) more medial.\nThe representation of the tongue occupied a large portion of the postcentral gyrus (2.\nThis figure is composed of isolated points found punctually in some patients and of multiple points found in four individual patients (marked 1, 2, 3 and 4 in square boxes).\nAlthough a certain degree of variation may exist within this part of the postcentral gyri in the exact location of the tip, middle, and base of the tongue somatosensory cortical localizations, individual somatotopy respects the tip/medialbase/lateral tongue somatotopy.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\n5 Human somatosensory homunculus 949.\nMNI coordinates, barycentres (bold) and standard deviations (italics) of main region of interest for all 258 positive points (specific cutaneous sensation reported by patients).\nThumb Index finger Middle finger.\n45 21 59 9 45 24 58 14 42 26 60 14.\n42 27 63 9 47 28 56 14 47 26 57 15.\n51 25 51 10 44 22 60 16 42 26 62 16.\n44 23 60 11 42 28 62 17 43 24 62 17.\n46 22 58 12 42 28 62 19 41 27 62 21.\n47 19 56 13 46 23 58 20 40 26 62 22.\n48 23 54 14 46 26 58 21 41 26 63 23.\n50 23 51 14 48 30 56 21 43 31 58 26.\n47 25 56 15 43 24 60 22 45 25 59 27.\n44 19 58 16 45 25 58 23 41 26 62 28.\n47 19 55 16 43 27 61 24 42 32 60 28.\n45 21 59 17 47 29 57 26 40 30 64 34.\n44 25 61 17 44 26 59 27 42 31 61 34.\n46 20 57 20 46 18 54 28 38 29 65 40.\n48 23 54 21 48 30 55 28 38 32 65 40.\n47 22 55 22 43 24 61 34 34 34 66 41.\n47 24 56 22 42 27 62 34 33 32 68 41.\n51 24 51 23 45 26 59 34 36 33 65 50.\nC 2017 The Authors.\nThe Journal of Physiology C 2017 The Physiological Society.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nRing finger Little finger.\nC 2017 The Authors.\nThe Journal of Physiology C 2017 The Physiological Society.\n14697793, 2018, 5, Downloaded from https://physoc.\nThe Journal of Physiology C 2017 The Physiological Society.\n1113/JP275243 by University Of California, San, Wiley Online Library on [21/01/2023].\nThe Journal of Physiology C 2017 The Physiological Society.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nfindings of some activation studies performed in humans (Blankenburg et al.\n2003; Sanchez-Panchuelo et al.\nThe coordinate of the caudal discrete representations of fingertips in area 1 found in group analysis (X = 47; Y = 31; Z = 53) by Blankenburg et al.\nIn those patients with intact postcentral gyrus, somatosensory responses were obtained with mean thresholds around 2.\nWe found that the age of the patients and the presence of antiepileptic drugs had no effect on these thresholds.\n1993) such as current frequencies and monopolar versus bipolar stimulation devices, the type of anaesthesia used, stimulations during the refractory period, patients sensory skills or the presence of a sensory deficit.\nobtained depended only on the ability of the patient to be conscious of his/her sensation and to report it.\nThe stimulation could be located on a functional area without the sensation reaching the patients consciousness, a phenomenon described in language mappings (Roux et al.\nClinical information (and further scientific data) could thus have been missed.\nAlthough our study matches many findings by Penfield and co-workers, four main differences can be noted.\nThe somatotopic sequence of the body A, global somatotopic organization of the body (flesh colour), hand (mauve), and head (green).\nB, top: somatotopic representation of the limbs with their medial-to-lateral somatotopic sequence.\nThe medial-to-lateral somatotopic sequence of the eyebrows, eyes, cheeks, both lips, teeth, gums, jaws, pharynx, and larynx is shown.\nThe Journal of Physiology C 2017 The Physiological Society.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License.\nFirstly, they found that 25% of the somatosensory responses were outside the postcentral gyrus, in the precentral gyrus or parietal lobe (Penfield & Rasmussen, 1950; Penfield & Jasper, 1954).\nWe detected no somatosensory responses outside the postcentral gyrus.\nA second difference is that we recorded no bilateral responses for stimulation in the face and tongue regions, whereas 13% (27 out of 202) of the responses in Penfield and collaborators works were bilateral (Penfield & Rasmussen, 1950).\nOne hypothesis is that paradoxical responses may not have been uncommon in the epileptic patients treated by Penfield, particularly in those with organic lesions and chronic epilepsy (Urasaki et al.\nSome of Penfields patients had huge brain lesions around the central gyri and thus possible cerebral reorganizations.\nThe findings of somatosensory responses outside the postcentral gyri may not have been uncommon.\nThirdly, Penfields team also described some sensations.\nproduced by stimulation, such as a sense of movement and, more rarely, a desire to move (Penfield & Rasmussen, 1950; Penfield & Jasper, 1954), that were never reported by our patients.\nFourthly, we reported rare sensations on the dorsal.\npart of the hand or fingers, a cutaneous territory.\nPenfield & Rasmussen (1950) did not identify in the cortex because of its small size.\nSeldom studied, the somatotopic representation of the dorsal surface of the digits could be comparable to that of the ventral surface in human area 3b (Druschky et al.\nThis finding is perhaps a question of opportunity.\nDuring their career, Penfield and colleagues used different types of stimulators, the frequency of which was not always controlled (Penfield and Roberts, 1959).\nIt is possible that the accuracy of the stimulator we used, in terms of localization (with 3 mm wide electrodes) and stability of the electric frequency, allowed us to detect such rare sensations.\nEvidence for a rostral-to-caudal somatotopic organization in human primary somatosensory cortex with mirror-reversal in areas 3b and 1.\nCereb Cortex 13, 987993.\nThe tangible features of textured surfaces: their representation in the monkeys somatosensory cortex.\nIn Dynamic Aspects of Neocortical Function, eds Edelman GM, Gall WE & Cowan WM.\nSomatotopic organization of the ventral and dorsal finger surface representations in human primary sensory cortex evaluated by magnetoencephalography.\nfeature detection in tactile and kinesthetic discrimination.\ncortex of human: cytoarchitecture and regional distributions of receptor-binding sites.\nimaging of bipolar cortical stimulation.\ngradients in the neuronal receptive field complexity in the finger region of the alert monkeys postcentral gyrus.\nconnectivity of architectonic fields in the somatic sensory, motor and parietal cortex of monkeys.\nMultiple representations of the body within the primary somatosensory cortex of primates.\nInvestigating the stability of fine-grain digit somatotopy in individual human participants.\nHuman finger somatotopy in areas 3b, 1, and 2: a 7T fMRI study using a natural stimulus.\nrepresentation of the body surface within cytoarchitectonic areas 3b and 1 in SI in the owl monkey (Aotus trivirgatus).\nareas of the postcentral gyrus in humans.\nCereb Cortex 18, 23412351.\nRaven Press, New York.\nAnatomy of the Human Brain.\nThe Cerebral Cortex of Man.\nSpeech and Brain Mechanisms.\nPrinceton University Press, Princeton, NJ, USA.\nthe postcentral gyrus of the monkey Macaca mulatta.\nRoux FE, Durand JB, Djidjeli I, Moyse E & Giussani C (2016).\nVariability of intraoperative electrostimulation parameters in conscious individuals: language cortex.\n& Demonet JF (2015).\nWithin-digit functional parcellation of Brodmann areas of the human primary somatosensory cortex using functional magnetic resonance imaging at 7 tesla.\nthe hand in macaque and human area S-I: high resolution optical imaging.\ntongue area studied by chronically implanted subdural electrodes  with special reference to parietal motor and frontal sensory responses.\nsurface-based (PALS) atlas of human cerebral cortex.\nAn integrated software system for surface-based analyses of cerebral cortex.\nIntensive and extensive aspects of tactile.\nsensitivity as a function of body part, sex and laterality.\nStructure of the human sensorimotor system.\nI: Morphology and cytoarchitecture of the central sulcus.\nCereb Cortex 7, 1830.\nThe authors declare that they have no competing interests.\nThis work was supported by the CNRS (Centre National pour la Recherche Scientifique).\nExperiments were performed at The University of Toulouse III.\nAll authors revised the article critically for important intellectual content.\nAll persons designated as authors qualify for authorship, and all those who qualify for authorship are listed.\nC 2017 The Authors.\nThe Journal of Physiology C 2017 The Physiological Society.\ncom/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License."}