{"title": "9.pdf", "contents": "MRI Findings of Disc Degeneration are More Prevalent in Adults with Low Back Pain than in Asymptomatic Controls: A Systematic Review and Meta-Analysis.\nBACKGROUND AND PURPOSE: Imaging features of spine degeneration are common in symptomatic and asymptomatic individuals.\nWe compared the prevalence of MR imaging features of lumbar spine degeneration in adults 50 years of age and younger with and without self-reported low back pain.\nMATERIALS AND METHODS: We performed a meta-analysis of studies reporting the prevalence of degenerative lumbar spine MR imaging findings in asymptomatic and symptomatic adults 50 years of age or younger.\nSymptomatic individuals had axial low back pain with or without radicular symptoms.\nTwo reviewers evaluated each article for the following outcomes: disc bulge, disc degeneration, disc extrusion, disc protrusion, annular fissures, Modic 1 changes, any Modic changes, central canal stenosis, spondylolisthesis, and spondylolysis.\nThe meta-analysis was performed by using a random-effects model.\nRESULTS: An initial search yielded 280 unique studies.\nImaging findings with a higher prevalence in symptomatic individuals 50 years of age or younger included disc bulge (OR, 7.\n03), spondylolysis (OR, 5.\n01), disc extrusion (OR, 4.\n01), Modic 1 changes (OR, 4.\n04), disc protrusion (OR, 2.\n01), and disc degeneration (OR, 2.\nImaging findings not associated with low back pain included any Modic change (OR, 1.\n43), central canal stenosis (OR, 20.\n17), annular fissures (OR  1.\nCONCLUSIONS: Meta-analysis demonstrates that MR imaging evidence of disc bulge, degeneration, extrusion, protrusion, Modic 1 changes, and spondylolysis are more prevalent in adults 50 years of age or younger with back pain compared with asymptomatic individuals.\nL ow back pain affects up to two-thirds of adults at some point in their lives.\n1 Back painrelated disability has significant economic consequences due to consumption of health care resources and loss of economic productivity.\n2 Increased use of MR imaging and CT in the evaluation of patients with back pain consumes a large amount of health care resources.\ndisc bulge and disc protrusion/extrusion are often interpreted as causes of back pain, triggering both medical and surgical interventions.\nNumerous studies have examined and compared the prevalence of degenerative spine findings in symptomatic and asymptomatic populations.\nGiven the large number of adults who undergo advanced imaging to help determine the etiology of their back pain, it is important to know whether these findings are indeed more prevalent in symptomatic-versus-asymptomatic patients.\nSuch information will help radiologists, referring clinicians, and patients interpret the importance of degenerative findings noted in radiology reports.\nThe purpose of this meta-analysis of case-control studies was to compare the prevalence of MR imaging features of lumbar spine degeneration in adult individuals.\nPlease address correspondence to Waleed Brinjikji, MD, Mayo Clinic, Department of Radiology, Mayo Clinic, 200 1st St SW, Rochester, MN 55905; brinjikji.\n50 years of age or younger with and without self-reported low back pain.\nMATERIALS AND METHODS Data Sources and Searches We performed a comprehensive search for studies describing relevant imaging findings as described below by using MEDLINE and EMBASE.\nTo identify studies on imaging of symptomatic and asymptomatic spinal disorders, a medical librarian searched Ovid MEDLINE, Ovid EMBASE, and the Web of Science through April 24, 2014 (week 16).\nEMBASE was searched beginning in 1988 to April 24, 2014, and MEDLINE was searched beginning in 1946 through April 24, 2014.\nThe Web of Science is text-word-based, but it tends to be more current and multidisciplinary, so studies may be discovered that are not included in the other data bases.\nThe initial search terms included spinal diseases or disorders affecting the spine: intervertebral disc degeneration or displacement, spondylolysis, low back pain, or specific vertebrae and joints (eg, lumbar vertebrae).\nThis search term was combined with diagnostic imaging techniques (MR imaging) and the terms symptomatic, pain, undetected, asymptomatic, and asymptomatic disease (subject heading available in EMBASE, but not MEDLINE).\nStudies identified from the literature search underwent further evaluation for inclusion in the meta-analysis.\nStudy Selection and Data Extraction To be included in our review, a study needed to be published in English and report the prevalence of degenerative findings on spine MR imaging in both asymptomatic and symptomatic individuals.\nCase-control and cross-sectional studies were included in this analysis.\nPatient symptomatology was generally determined at the time of the MR imaging findings.\nWe defined asymptomatic individuals as those with no history of back pain and symptomatic individuals as those with any history of back pain, which included axial back pain and/or sciatica or radiculopathies.\nAny studies reporting the prevalence of degenerative findings in patients older than 50 years of age were reviewed to determine whether they stratified outcomes by age so that findings in individuals 50 years of age or younger could be abstracted.\nInclusion criteria, including age cutoffs, were agreed on by the authors by consensus.\nOne reviewer examined abstracts of studies identified from the literature search to determine whether the studies met the inclusion criteria and to exclude any studies that were not relevant to the topic being studied (ie, neck pain, studies correlating CT or radiographs and low back pain, review articles, and so forth).\nFor each study that met inclusion criteria, we used a standard form to abstract imaging technique, sample sizes, and the prevalence rates for the following imaging findings: central spinal canal stenosis, disc degeneration, annular fissure (including high-intensity zones), high-intensity zones (a subgroup of annular fissures defined as annular fissures with a focal area of increased T2.\nsignal), disc bulge, disc protrusion, disc extrusion, Modic changes (type 1 Modic changes and all Modic changes), spondylolisthesis, and spondylolysis.\nThese entities are defined in detail by the combined task forces of the American Society of Neuroradiology, American Society of Spine Radiology, and North American Spine Society.\n8 Each study that met the initial inclusion criteria was abstracted by 2 reviewers.\nAny differences in data abstraction were resolved by having a third, independent reviewer arbitrate the findings.\nThere were 6 studies that, when further reviewed during data abstraction, were not thought to meet the inclusion criteria.\nThese studies were sent to an independent reviewer to verify that they did not meet the inclusion criteria.\nQuality Assessment We performed quality assessment of the studies by using the Newcastle-Ottawa Scale.\nThis tool is used for assessing the quality of nonrandomized studies included in systematic reviews and/or meta-analyses.\nEach study is judged on 8 items categorized into 3 groups: 1) selection of the study groups, 2) comparability of the study groups, and 3) ascertainment of the outcome of interest.\nStatistical Analysis From each study, we extracted a 2  2 table for binary outcomes.\nRandom-effects meta-analysis was used for pooling across studies.\n10 The I2 statistic was used to express the proportion of inconsistency that was not attributable to chance.\n11 I2 values of 50% indicated substantial heterogeneity of the observed odds ratios.\nMeta-analysis results were expressed as odds ratios for binary outcomes with respective 95% confidence intervals.\nTo further explore heterogeneity and the effect of confounding by age, in addition to conducting subgroup analysis based on age, we conducted meta-regression.\nIn the regression model, the dependent variable is the log of the odds ratio and the independent variable is age as a continuous outcome.\nWe conducted the meta-analysis by using Comprehensive MetaAnalysis, Version 2.\nWe also reported the mean prevalence and 95% CI for each imaging finding.\nWe provide these data for reference but did not use them for statistical comparison.\nOur initial search yielded 280 unique studies.\n8%) that did not meet our review inclusion criteria.\n9%) because they either did not separate the prevalence of findings by symptomatic status, did not include a truly asymptomatic cohort, or had ambiguous symptomatic status of the patients.\n0%) studies comprising 3097 patients met the inclusion criteria.\n6% of the overall cohort.\n(1193 individuals), and symptomatic individuals composed 61.\nStudy Quality All included studies had a high-quality as assessed by the New CastleOttawa Scale.\nOutcomes were clearly reported in all included studies.\nThree included studies were at risk for selection bias because they studied the prevalence of degenerative findings in elite athletes.\n01), disc extrusion (OR, 4.\n04), disc protrusion (OR, 2.\nImaging findings not associated with low back pain included any Modic change (OR, 1.\n32), highintensity zone (OR, 2.\nfissures (including patients with and without high-intensity zones) (OR, 1.\n06), and spondylolisthesis (OR, 1.\nThese data, including the prevalences and 95% CIs of each of these findings, are summarized in the Table.\nMeta-Regression Results Meta-regression based on age was possible only in 2 outcomes (disc degeneration and protrusion, with 12 and 9 studies, respectively).\nWe were unable to demonstrate a statistically significant association between age and these 2 outcomes (P values for the model of.\nThis is likely due to low power and the small number of available studies and should not be interpreted as lack of effect of age on these 2 outcomes.\nStudy Heterogeneity Meta-analysis of the following findings demonstrated I2 values of 50%, indicating a lack of substantial heterogeneity in reported ORs: Modic 1 changes (0%), disc extrusion (0%), spondylolisthesis (0%), and spondylolysis (0%).\nMeta-analysis of the following findings demonstrated I2 values of 50%, indicating substantial heterogeneity of reported ORs: central spinal canal stenosis (94%), disc bulge (90%), disc degeneration (89%), high-intensity zones (72%), disc protrusion (62%), annular fissure (59%), and any Modic changes (65%).\nDISCUSSION This meta-analysis of 14 high-quality case-control studies including 3000 individuals demonstrates that many degenerative spine findings have a higher prevalence in individuals 50 years of age or younger with self-reported low back pain compared with asymptomatic individuals.\nDisc findings, including disc bulge, disc degeneration, and disc extrusion and protrusions, had significant associations with low back pain.\nType 1 Modic changes and spondylolysis also demonstrated a significant association with low back pain.\nWhile these findings do not prove that discand endplate-related imaging and spondylolysis are pain generators, they do suggest that evidence of these findings could be explored as candidates for biomarkers of low back pain.\nOur findings corroborate those of other studies examining the association between disc imaging findings and low back pain.\n04 0 Spondylolisthesis 4 1.\n20 0 Spondylolysis 2 5.\na P values are computed from the meta-analysis of ORs.\nPrevalence data are provided for reference but are not meant for statistical comparison.\nof disc findings in symptomatic-versus-asymptomatic individuals.\nDisc protrusions are not uncommon in asymptomatic adult populations, with prevalences ranging from 10% to 30%, depending on the studied age group.\n12-20 In general, epidemiologic studies demonstrate that the prevalence of disc protrusions in asymptomatic populations increases with age.\n12-20 Our study found that nearly 20% of asymptomatic patients 50 years of age or younger had disc protrusion compared with nearly 40% in the symptomatic group.\nDisc extrusions are rare in asymptomatic populations.\nThe prevalence of disc extrusions ranged from 0% to 4% in asymptomatic patients, with most studies reporting prevalence rates of 2%.\n21-24 On the contrary, prevalence of disc extrusions ranged from 5% to 10% in symptomatic populations.\nOne surprising finding from our study was that disc bulge had a strong association with low back pain.\nBecause of the high prevalence in the asymptomatic population, disc bulges are often considered incidental findings and not associated with low back pain.\nThe prevalence of disc bulges in asymptomatic populations ranges from 20% in young adults to 75% in patients older than 70 years of age.\n25-30 Our meta-analysis found a prevalence of disc bulges of 6% in asymptomatic populations and 43% of symptomatic populations.\nAll 3 studies included in our meta-analysis assessing the association between disc bulges and pain demonstrated a very strong association between disc bulge with low back pain.\n19,21,31 Two of these studies only included patients younger than 30 years of age.\n21,31 These findings suggest that the association between disc bulge and low back pain may be more significant in younger adults, in whom the prevalence in the general asymptomatic population is much lower.\nIt is possible that the association between disc bulges and low back pain disappears in older populations, in whom the prevalence of this imaging finding is 90% in the asymptomatic population.\nSimilar to disc bulge, disc degeneration also has a very high prevalence in asymptomatic individuals, ranging from 30% to 95%, depending on the age group.\n5,13,15,18,19,23,27,29,32-36 Some studies have demonstrated no association between disc degeneration and low back pain, especially in older individuals.\n37,38 Our meta-analysis on 12 studies found a strong association of disc degeneration and low back pain in individuals 50 years of age or younger, with 30% of asymptomatic individuals and 50% of symptomatic individuals found to have disc degeneration on MR imaging.\nOur study also found that in the adult population of 50 years of age or younger, annular fissures and high-intensity zones had no association with low back pain.\nThe association between annular fissures and low back pain is controversial.\nA majority of studies in our analysis demonstrated a higher prevalence of annular fissures in symptomatic-versus-asymptomatic patients.\nHowever, the largest study in our analysis, which included 500 patients 1821 years of age, demonstrated no association between annular fissures and low back pain.\nModic 1 changes had a significant association with low back pain in our analysis.\nHowever, Modic changes as a whole (Modic 13) did not have an association with low back pain.\nHowever, when considering case-control studies, this analysis demonstrated no association between Modic changes and low back pain.\nLarge cohort studies have demonstrated that type 1 Modic changes are, in fact, strongly associated with low back pain.\n40 Spondylolysis was strongly associated with low back pain in patients 50 years of age or younger.\nThese findings are supported in studies from the surgical literature that demonstrate that direct screw repair of pars interarticularis defects provides long-term pain relief and improves the biomechanical function of the lower lumbar spine.\nFindings not directly related to the disc such as spondylolisthesis and central canal stenosis demonstrated no association with low back pain in our study.\nThese findings are consistent with what has been previously reported in the literature.\nSpondylolisthesis is also consistently not associated with low back pain in case-control studies.\nOur finding that central canal stenosis was not associated with low back pain is likely because this entity typically presents with lower extremity rather than back pain (ie, neurogenic claudication).\nIn addition, only the presence rather than the severity of central canal stenosis was evaluated.\nIt was limited to individuals 50 years of age or younger; thus, our findings pertain only to this specific population.\nWith the increasing prevalence of some degenerative findings such as degenerative disc and disc bulge with increasing age, it is possible that the association between these entities and low back pain is less significant in older age groups.\nThere was substantial geographic, ethnic, and occupational heterogeneity in the populations included our analysis.\nAnother major limitation is that the studies included in our analysis were published during a broad time period, and not all of the studies used the original or more recent Fardon et al8 and Fardon and Milette42 combined task force nomenclature recommendations.\nThus, differences in nomenclature and definitions of some entities could affect our results.\nAnother limitation is that our study defined back pain broadly, including axial, sciatica and radicular pain.\nMost of the studies did not explicitly define whether patients had axial or radicular symptoms or both.\nIn general, the studies in our analysis included patients with self-reported low back pain, which was confirmed on physical examination at or around the time of the MR imaging examination.\nAnother important limitation is that only the presence of these degenerative findings was considered, not the extent or severity.\nThis is especially important because increased severity and extent of Modic changes, spinal stenosis, and disc degeneration are associated with increased pain.\n43 Modic changes could only be analyzed as type 1 changes and combined type 2 and 3 changes because the included studies generally did not differentiate between type 2 and 3 changes.\nAs such, we did not have the opportunity to study whether type 2 or 3 changes were associated with low back pain.\nRegarding the study design, our study included primarily casecontrol and cross-sectional studies but did not include cohort studies.\nAs such, we did not study the association between MR imaging findings and future back pain.\nSymptomatology was determined at the time of imaging.\nIn addition, we could not perform separate subgroup analyses by decade of life due to a paucity of studies that stratified findings by decade of life.\nIt is possible that the association of pain and degenerative findings is different for patients 30 years of age and younger and those 3050 years of age.\nMany of the I2 values were 50%, suggesting substantial heterogeneity in reported results.\nThe imaging features examined in this study are correlated (ie, a patient with one finding is more likely to have another).\nHence, the observed associations are affected by confounding and cannot be used for diagnostic purposes.\nAll these limitations highlight the need for further studies on the association between MR imaging findings and low back pain.\nCONCLUSIONS This meta-analysis of epidemiologic studies demonstrates that MR imaging evidence of disc bulge, disc degeneration, disc extrusions and protrusions, Modic 1 changes, and spondylolysis had significant associations with low back pain in adult patients 50 years of age or younger.\nThe association between these degenerative findings and pain should not be interpreted as causation.\nThese imaging findings may be considered as candidate biomarkers for low back pain in younger patients (younger than 50 years of age).\nThe role of these findings in determining treatment strategies or prognosis of low back pain has not been established.\nEffect of increased MRI and CT scan utilization on clinical decision-making in patients referred to a surgical clinic for back pain.\nCan J Surg 2011;54:12832 CrossRef Medline.\nCarragee E, Alamin T, Cheng I, et al.\nAre first-time episodes of serious LBP associated with new MRI findings? Spine J 2006;6:62435 CrossRef Medline.\nA study of computer-assisted tomography, I: the incidence of positive CAT scans in an asymptomatic group of patients.\nLumbar disc nomenclature: version 2.\nSpine J 2014;14:252545 CrossRef Medline.\nEvaluating non-randomised intervention studies.\nMeta-analysis in clinical trials.\nControl Clin Trials 1986;7:17788 CrossRef Medline.\nHiggins JP, Thompson SG, Deeks JJ, et al.\nMeasuring inconsistency in meta-analyses.\nTissue characterization of symptomatic and asymptomatic disc herniations by quantitative magnetic resonance imaging.\nMagnetic resonance study of lumbar disks in female dancers.\nAxially loaded magnetic resonance image of the lumbar spine in asymptomatic individuals.\nThe significance of spinal canal dimensions in discriminating symptomatic from asymptomatic disc herniations.\nEur Spine J 2002;11:57581 CrossRef Medline.\nMRI evaluation of lumbar spine flexion and extension in asymptomatic individuals.\nClinical significance on protruded nucleus pulposus: a comparative study of 44 patients with lumbar intervertebral disc protrusion and 73 asymptomatic control in tridimensional computed tomography [in Chinese].\nJensen MC, Brant-Zawadzki MN, Obuchowski N, et al.\nTandem age-related lumbar and cervical intervertebral disc changes in asymptomatic subjects.\nBennett DL, Nassar L, DeLano MC.\nLumbar spine MRI in the elitelevel female gymnast with low back pain.\n1995 Volvo Award in clinical sciences: the diagnostic accuracy of magnetic resonance imaging, work perception, and psychosocial factors in identifying symptomatic disc herniations.\nAssociation of Modic changes, Schmorls nodes, spondylolytic defects, high-intensity zone lesions, disc herniations, and radial tears with low back symptom severity among young Finnish adults.\nSpine (Phila Pa 1976) 2012;37:123139 CrossRef Medline.\nHealy JF, Healy BB, Wong WH, et al.\nThe relationship between the magnetic resonance imaging appearance of the lumbar spine and low back pain, age and occupation in males.\nMRI of lumbar intervertebral discs: diurnal variations in signal intensities.\nSpine (Phila Pa 1976) 1995;20:80711; discussion 81112 CrossRef Medline.\nPrevalence of lumbosacral intervertebral disc abnormalities on MR images in pregnant and asymptomatic nonpregnant women.\nRadiology 1989;170: 12528 CrossRef Medline.\nVisuri T, Ulaska J, Eskelin M, et al.\nNarrowing of lumbar spinal canal predicts chronic low back pain more accurately than intervertebral disc degeneration: a magnetic resonance imaging study in young Finnish male conscripts.\nSystematic literature review of imaging features of spinal degeneration in asymptomatic populations.\nDiurnal T2 value changes in the lumbar intervertebral discs.\nMagnetic resonance imaging and low back pain in adults: a diagnostic imaging study of 40-year-old men and women.\nMagnetic resonance imaging of the lumbar spine in asymptomatic professional fast bowlers in cricket.\nT1 magnetic resonance imaging quantification of early lumbar intervertebral disc degeneration in healthy young adults.\nThree-year incidence of low back pain in an initially asymptomatic cohort: clinical and imaging risk factors.\nJensen TS, Karppinen J, Sorensen JS, et al.\nJensen RK, Leboeuf-Yde C, Wedderkopp N, et al.\nSnyder LA, Shufflebarger H, OBrien MF, et al.\nJ Neurosurg Spine 2014;21:32933 CrossRef Medline.\nNomenclature and classification of lumbar disc pathology: recommendations of the combined task forces of the North American Spine Society, American Society of Spine Radiology, and American Society of Neuroradiology.\nKuisma M, Karppinen J, Niinimaki J J, et al.\nModic changes in endplates of lumbar vertebral bodies: prevalence and association with low back and sciatic pain among middle-aged male workers.\nCarragee EJ, Paragioudakis SJ, Khurana S.\n2000 Volvo Award winner in clinical studies: lumbar high-intensity zone and discography in subjects without low back problems.\nDisc degeneration and chronic low back pain: an association which becomes nonsignificant when endplate changes and disc contour are taken into account.\nAge-dependent correlation of low-back pain and lumbar disc regeneration.\nLumbar intervertebral disk degeneration in elite competitive swimmers: a case control study.\nLow-back pain and disk degeneration in children: a case-control MR imaging study.\nDoes lumbar disc degeneration on magnetic resonance imaging associate with low back symptom severity in young Finnish adults? Spine (Phila Pa 1976) 2011;36:218089 CrossRef Medline."}