{"title": "18.pdf", "contents": "While alterations in spinal kinematics have been frequently reported in patients with chronic low back pain (CLBP), a better characterization of the kinematics during functional activities is needed to improve our understanding and therapeutic solutions for this condition.\nRecent studies on healthy subjects showed the value of analyzing the spine during sit-to-stand transition (STST) using multi-segment models, suggesting that additional knowledge could be gained by conducting similar assessments in CLBP patients.\nThe objectives of this study were to characterize three dimensional kinematics at the lower lumbar (LLS), upper lumbar (ULS), lower thoracic (LTS) and upper thoracic (UTS) joints during STST, and to test the hypothesis that CLBP patients perform this movement with smaller angle and angular velocity compared to asymptomatic controls.\nTen CLBP patients (with minimal to moderate disability) and 11 asymptomatic controls with comparable demographics (52% male, 37.\n8 kg/m2) were tested using a three-dimensional camera-based system following previously proposed protocols.\nCharacteristic patterns of movement were identified at the LLS, ULS and UTS joints in the sagittal plane only.\nSignificant differences in the form of smaller sagittal-plane angle and smaller angular velocity in the patient group compared to the control group were observed at these three joints.\nThis indicated a more rigid spine in the patient group and suggested that CLBP rehabilitation could potentially be enhanced by targeting movement deficits in functional activities.\nThe results further recommended the analysis of STST kinematics using a pelvis-lumbar-thoracic model including lower and upper lumbar and thoracic segments.\nChronic low back pain (CLBP) is one of the most frequent causes for limitations in daily, leisure and work related activities.\nAlthough CLBP is associated with significant decreases in quality of life and induces severe economic burden in most western countries, responses to treatments are still fairly limited (Hoy et al.\n, 2010; Mansell et al.\npersistence of symptoms and disability in CLBP (Dubois et al.\nSeveral studies reported reduced range of motion and angular velocity at the lumbar spine in CLBP patients compared to asymptomatic individuals (Laird et al.\n, 2014; Lehman, 2004).\nHowever, these studies used biomechanical models considering the lumbar spine as a single segment, whereas recent research with healthy subjects showed that the upper and lower regions of the lumbar spine move differently (Leardini et al.\nSpecifically, rotation between the upper and lower lumbar segments were reported in the sagittal-plane during sit-tostand transitions (Parkinson et al.\nFurthermore, in the study by Parkinson et al.\nThese observations suggest that single-segment models could hide.\nimportant kinematic information and additional CLBP knowledge could be gained with multi-segment lumbar models.\nPrior research also suggests that kinematic analyses of CLBP patients should include the thoracic region.\nWhile pain in CLBP patients is mainly present in the lumbar region, alterations in thoracic kinematics were shown in this population (Crosbie et al.\nTherefore, there is a need to characterize the spinal kinematics of CLBP patients using a pelvis-lumbar-thoracic multi-segment model and to compare CLBP and asymptomatic subjects.\nThe sit-to-stand transition (STST) is a particularly relevant movement to improve our understanding of spinal kinematics in CLBP because it is a frequent daily activity (on average 60 times per day) requiring around 60% of total sagittal-plane lumbar mobility (Dall and Kerr, 2010; Hsieh and Pringle, 1994).\nStudying STST is further motivated by the fact that this movement is frequently described as painful by CLBP patients and is often addressed in rehabilitation (Andersson et al.\nAdditionally, Shum and Colleagues (2005) compared this movement between patients with subacute low back pain and pain-free controls, and reported significant differences in sagittal-plane range of motion and angular velocity.\nBecause recent research on healthy subjects recommended differentiating the lower and upper lumbar spine regions and testing thoracic kinematics (Crosbie et al.\nThis study aimed at comparing spinal kinematics (angle and angular velocity) between CLBP patients and asymptomatic controls during STST using a pelvis-lumbar-thoracic model with lower and upper lumbar segments.\nThis study then tested the hypothesis that CLBP patients perform STST with smaller angle and angular velocity than asymptomatic controls.\n, 2011) and with an age and body mass index (BMI) comprised between 30 and 50 years old and 18 and 27 kg/m2, respectively.\nHealthy subjects without history of low back pain requiring medical attention during the last two years were enrolled as asymptomatic controls.\nControls were selected to match the age, sex and BMI of the patient group, as these factors were shown to influence lumbar kinematics (Marras et al.\nGeneral exclusion criteria for both groups were pregnancy and pain or injury in any other body parts that could compromise the evaluation of lumbar kinematics.\nThe research was approved by the local Research Ethics Committee (protocol VD-340/ 14) and all participants signed an informed consent form before enrollment in the study.\nSpinal kinematics was measured using a camera-based motion capture system recording marker positions at 120 Hz (VICON, Oxford Metrics, UK).\nNineteen reflective markers were attached to the pelvis, lumbar spine and thoracic spine, following previously described protocols (Ebert et al.\nData collection started with the capture of a reference standing posture.\nThe height of the stool was adjusted individually in order to have participant thighs horizontal while sitting.\nThree STST were recorded after participants had practiced the movement.\nAfter the recording, patients were asked to evaluate the pain associated with the STST they just did using a numeric pain rating scale (NPRS) (Dworkin et al.\nIn addition to the kinematic test described above, pain during the last 24 h, disability and kinesiophobia were assessed for the CLBP patients using the Oswestry Disability Index (ODI), the NPRS and the Tampa Scale of Kinesiophobia (TSK) (Chapman et al.\n, 2011; Fairbank and Pynsent, 2000; Vlaeyen et al.\nBriefly, markers trajectories were used to calculate the position and orientation of the anatomical frames of the five segments (pelvis and lower lumbar, upper lumbar, lower thoracic and upper thoracic spine).\nThe joint coordinate system (Grood and Suntay, 1983) was used to calculate three-dimensional joint angles (i.\nEach STST was screened to determine visually the beginning and the end of the movement; a single investigator followed the same rules (start of C7 anterior displacement and stop of L5 displacement) for every subject.\nNext, the CMC was calculated, for each angle and angular velocity, first based on the standardized curves of all CLBP patients and then based on the standardized curves of all control subjects.\nThe curves reporting a consistent pattern among controls (CMC40.\n5) were further analyzed to compare patients and controls STST kinematics.\nThis was done by screening the curves to identify characteristic minimum or maximum peaks and then by extracting the amplitude and time of occurrence of the characteristic peaks in each curve.\nReliability of these measurements for the three STST repetitions was assessed using the intraclass correlation coefficient of variation (ICC 2,1) and the standard error of measurement (SEM).\nFinally, to compare kinematics between CLBP and asymptomatic individuals, the three measurements obtained for each participant and each characteristic peak were averaged to have only one data point per participant and variable of interest.\nThis study analyzed 10 CLBP patients and 11 asymptomatic controls (Table 1).\nThere were no significant differences in age, weight, height and BMI between patient and control groups (p40.\nSimilarly, there were no significant differences between patients and controls in the spinal angles (LLSa, ULSa, LTSa and UTSa) measured during the standing posture (p40.\nClinical scores indicated minimal disability in half of the patients and moderate disability in the other half.\nMoreover, 60% of patient had a TSK score indicating high kinesiophobia.\nLLSv and UTSv had similar patterns in the sagittal plane for patients and controls.\nOn the contrary, none of the angle and angular velocity curves in the frontal and transverse planes reported consistent pattern among the control or CLBP groups (CMCo0.\nBased on this pattern analysis, only sagittalplane kinematics was further analyzed.\nSpecifically, 7 characteristic peaks were identified in the flexion-extension angle curves and 5 in the flexion-extension angular velocity curves.\nSagittal-plane spinal kinematics during STST differed between CLBP patients and controls, with patients reporting smaller angle and angular velocity amplitudes (Table 2, Fig.\nSpecifically, the peak extension angle at the lower lumbar joint (LLSaextension) was significantly smaller, on median by 4.\n3, in the patient compared to the control groups (p0.\nAdditionally, the peak flexion angle (ULSaflexion) and the total range of motion (ULSaextenion ULSaflexion) at the upper lumbar joint were smaller for the patients compared to the controls, with median differences between groups of 14.\nPatients also had a smaller range of motion between the extension peak and the terminal flexion peak at the upper thoracic joint (UTSaextension  UTSaterminal-flexion), on median of 2.\nFurthermore, the angular velocity was smaller in the patient compared to the control groups for the peak extension velocity (LLSvextension; median differences of 5.\n008) and range between flexion and extension peak velocities at the lower lumbar joint (LLSvextensionLLSvflexion; median differences of 8.\nThe amplitude of the peak extension velocity at the upper lumbar joint (ULSvextension; median differences of 11.\n01) and the peak flexion velocity at the upper thoracic joint (UTSvflexion; median differences of 3.\n02) were also significantly smaller in the patient group compared to the control group.\nAccording to the NPRS, STST was pain-free for 60% of patients.\n2] for the amplitude of the angle peaks, respectively.\nThe amplitude of the angular velocity peaks reported a median ICC of 0.\n8] and a median SEM of 3.\nThe sagittal-plane movement at the upper lumbar joint observed in this study supported the analysis of spinal kinematics during STST using a biomechanical model considering the lumbar spine region as two segments.\nIndeed, consistent angle patterns existed in the sagittal plane between the lower and upper lumbar segments (ULSa) in the asymptomatic controls and CLBP patients, and consistent angular velocity pattern was noticed between these segments (ULSv) in the controls.\nIn addition to confirming the importance of modeling this spinal region as two segments to accurately describe lumbar kinematics, the CMC results also stressed the importance of separating the lower and upper sections of the lumbar spine to understand kinematic alterations with CLBP.\nIn fact, the lower consistency for the angular velocity (ULSv) in the patient group was a first indication of altered kinematics with CLBP.\nSpecifically, this lower consistency indicated that the movement between the lower and upper lumbar segments in the sagittal plane varied more among CLBP patients than among controls, thus suggesting an individual adaptation in the patient population.\nThe large peak amplitudes observed in the angle and angular velocity curves at the upper lumbar joint (ULSa and ULSv) compared to those obtained at the other spinal joints further supported the modeling of the lumbar region as two segments in healthy subjects and in CLBP patients.\nrecommended two-segment lumbar models based on the range of motion measured between the lower and upper regions during STST in asymptomatic individuals (Mitchell et al.\n, 2008; Parkinson et al.\nIn fact, this study suggested that the movement between the lower and upper lumbar segments is particularly affected by CLBP.\nThe results indicated that the lower and upper lumbar joints move similarly during STST, following a flexion-extension-flexion sequence.\nInterestingly, while both the amplitude of the peak flexion angle during the first half of STST and the amplitude of the extension peak during the second half of STST were smaller in the patient group, the differences among groups were observed at different joints.\nPatients had smaller flexion angle at the upper lumbar joint (ULSa) and smaller extension angle at the lower lumbar joint (LLSa).\nThese differences between groups were large (more than 60%) and can thus be considered as clinically important for a daily activity like STST.\nPrevious research using single-segment lumbar models already identified a flexion-extension-flexion sequence between the pelvis and lumbar spine segments during STST and reported limited flexion angle in CLBP patients (Janssen et al.\nThe present study improved our understanding of CLBP by showing that flexion reduction occurred principally at the upper.\nlumbar joint (ULSa) and by detecting reductions in extension.\nIt is highly probable that the alterations in extension were not detected in prior studies due to the use of single-segment lumbar models.\nAs STST is often described as a painful movement by CLBP patients (Claeys et al.\n, 2005), it is possible that pain is related to the rapid changes from a flexion to an extension posture required by this movement.\nThis interpretation is further supported by the smaller extension angular velocity observed at the lower and upper lumbar joints (LLSv and ULSv) in patients compared to controls.\nLimited sagittal-plane spinal kinematics in CLBP patients was also noticed in the thoracic region.\nThe consistent angle and angular velocity patterns in the sagittal plane among patients and controls at the upper thoracic joint (UTSa and UTSv) indicated that this joint has a characteristic function during STST.\nWhen comparing this joint between groups, a smaller range of motion and a smaller angular velocity peak towards flexion were observed during the second half of STST in the CLBP patients.\nThis finding of less movement suggested that the lack of movement at the lumbar spine in CLBP patients is not compensated at the thoracic spine.\nThis observation further suggested that CLBP effects on sagittalplane kinematics are not limited to the lumbar region and thus confirmed the value of studying CLBP with a pelvis-lumbarthoracic biomechanical model.\nSTST with a more rigid spine.\nThis observation could be related to previous studies showing muscle hyperactivity in this clinical population (Dankaerts et al.\n, 2009; Hodges et al.\nThis increased spinal stiffness could modify movement patterns in a harmful way and possibly induce sensitization of spinal and peripheral structures, which could adversely contribute to the chronicity of pain (Hodges and Smeets, 2015; O'Sullivan, 2012).\nAlthough patients in this study had chronic pain, most of them did not feel pain during STST, suggesting that the kinematics differences compared to the asymptomatic controls were not due to painful stimuli at the time of data collection.\n(2013) also demonstrated altered kinematics in patients with recurrent LBP who were in a pain-free period at the time of experiment.\nTogether these results suggested that spinal motor behavior is generally altered in CLBP patients, even during painless activities.\nThis interpretation is supported by other research reporting disruption in the sensorimotor system in CLBP patients, implying a reorganization of motor tasks planning (Pijnenburg et al.\n, 2015; Tsao et al.\nThis study should be interpreted in regards of its limitations.\nFirstly, although consistent differences between groups were detected and although the results agreed with previous research,.\nother studies with larger cohorts will be necessary to derive definite clinical conclusions.\nSecondly, the cross-sectional design of this study precluded the investigation of any causal relationship between CLBP and spinal kinematics.\nFurther longitudinal studies will be needed to understand the relationship between movement disorders and clinical outcomes (Mansell et al.\nconsistent pattern was observed for the angles and angular velocities in the frontal and transverse planes.\nAlthough these results agree with the fact that STST is a movement mainly occurring in the sagittal plane, they also suggest that in the future it could be interesting analyzing additional functional movements involving lateral bending and rotation of the spine.\nThe UTS, ULS and LLS abbreviations correspond to the upper thoracic, upper lumbar and lower lumbar joints, respectively.\nThe a and v subscript letters refer to angle and angular velocity curves, respectively.\nAngles Median IQR Median IQR.\n5 UTSaextension () 5.\n06 UTSaextension  UTSainitial-flexion () 3.\nUpper lumbar joint ULSaflexion () 7.\n02 ULSaextension () 0.\n65 ULSaextension  ULSaflexion () 10.\n007 LLSaextension  LLSaflexion () 11.\nAngular velocity Upper thoracic joint UTSvextension (/s) 5.\n92 UTSvflexion (/s) 5.\nUpper lumbar joint ULSvextension (/s) 10.\nLower lumbar joint LLSvflexion (/s) 4.\n008 LLSvextension  LLSvflexion (/s) 13.\nThe UTS, ULS and LLS abbreviations correspond to the upper thoracic, upper lumbar and lower lumbar joints, respectively.\nThe a and v subscript letters refer to angle and angular velocity curves, respectively.\nUpper thoracic joint UTSainitial-flexion (%) 10.\nUpper lumbar joint ULSaflexion (%) 11.\nLower lumbar joint LLSaflexion (%) 18.\nAngular velocity Upper thoracic joint UTSvextension (%) 19.\n81 UTSvflexion (%) 53.\nSEM values were good, it should be acknowledged that limited information exists in the literature regarding the validity and reliability of the spinal model used in this study.\nNevertheless, both groups were equally exposed to soft tissue artefacts and other measurement errors and thus it is unlikely that the differences between groups were due to such errors.\nIn conclusion, this study showed that the lower lumbar, upper lumbar and upper thoracic joints have characteristic sagittal-plane movement during STST both among asymptomatic individuals and CLBP patients.\nMoreover, the results indicated that patients performed STST with less spinal movement in the lumbar, but also in the thoracic, regions.\nThis denoted a more rigid spine in the patient group and suggested that CLBP rehabilitation could potentially be enhanced by targeting these movement deficits in functional activities.\nPerformance tests in people with chronic low back pain: responsiveness and minimal clinically important change.\nLancet 379 (9814), 482491.\nEvaluating common outcomes for measuring treatment success for chronic low back pain.\nNeuromuscular adaptations predict functional disability independently of clinical pain and psychological factors in patients with chronic non-specific low back pain.\nLumbar spine side bending is reduced in end range extension compared to neutral and end range flexion postures.\nAverage sagittal-plane angle (left column) and angular velocity (right column) curves for the CLBP patient group (in dark gray) and the asymptomatic control group (in black).\nThe light gray areas correspond to the time occurrence (mean7standard deviation) of the characteristic peak used to describe spinal kinematics during STST.\nPlease refer to Table 2 for a comparison of the peak amplitude between patients and controls and Table 3 for a comparison of peak occurrence time.\nVertical axes are in degrees () or in degrees per second (/s).\nHorizontal axes correspond to the normalized duration of the STST, with 0% and 100% corresponding to the beginning and the end of the transition, respectively.\nThe Oswestry disability index.\nRising to stand from a chair: symmetry, and frontal and transverse plane kinematics and kinetics.\nChanges in the mechanical properties of the trunk in low back pain may be associated with recurrence.\nInteraction between pain, movement, and physical activity: short-term benefits, long-term consequences, and targets for treatment.\nDeterminants of the sit-to-stand movement: a review.\nRepeatability of kinematic, kinetic, and electromyographic data in normal adult gait.\nComparing lumbo-pelvic kinematics in people with and without back pain: a systematic review and metaanalysis.\nMulti-segment trunk kinematics during locomotion and elementary exercises.\nBiomechanical assessments of lumbar spinal function.\nHow low back pain sufferers differ from normals.\nPart I: Kinematic assessments of lumbar function.\nPain measurement in patients with low back pain.\nHow can we design low back pain intervention studies to better explain the effects of treatment? Spine 39 (5), E305E310.\nThe effect of task asymmetry, age and gender on dynamic trunk motion characteristics during repetitive trunk flexion and extension in a large normal population.\nRegional differences in lumbar spinal posture and the influence of low back pain.\nDiagnosis and classification of chronic low back pain disorders: maladaptive movement and motor control impairments as underlying mechanism.\nIt's time for change with the management of non-specific chronic low back pain.\nUpper and lower lumbar segments move differently during sit-to-stand.\nResting-state functional connectivity of the sensorimotor network in individuals with nonspecific low back pain and the association with the sit-to-stand-to-sit task.\nEffect of low back pain on the kinematics and joint coordination of the lumbar spine and hip during sit-to-stand and stand-to-sit.\nThree-dimensional kinetics of the lumbar spine and hips in low back pain patients during sit-to-stand and stand-to-sit.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nFear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nCortical changes in chronic low back pain: current state of the art and implications for clinical practice."}