{"title": "26.pdf", "contents": "Decreased variability in postural control strategies in young people with non-specific low back pain is associated with altered proprioceptive reweighting.\nAbstract Optimal postural control is an essential capacity in daily life and can be highly variable.\nThe purpose of this study was to investigate if young people have the ability to choose the optimal postural control strategy according to the postural condition and to investigate if non-specific low back pain (NSLBP) influences the variability in proprioceptive postural control strategies.\nThe role of proprioception in postural control was directly examined by means of muscle vibration on triceps surae and lumbar multifidus muscles.\nRoot mean square and mean displacements of the center of pressure were recorded during the different trials.\nappraise the proprioceptive postural control strategy, the relative proprioceptive weighting (RPW, ratio of ankle muscles proprioceptive inputs vs.\nback muscles proprioceptive inputs) was calculated.\nPostural robustness was significantly less in individuals with NSLBP during the more complex postural conditions (p \\ 0.\nSignificantly higher RPW values were observed in the NSLBP group in all postural conditions (p \\ 0.\n05), suggesting less ability to rely on back muscle proprioceptive inputs for postural control.\nTherefore, healthy controls seem to have the ability to choose a more optimal postural control strategy according to the postural condition.\nIn contrast, young people with NSLBP showed a reduced capacity to switch to a more multi-segmental postural control strategy during complex postural conditions, which leads to decreased postural robustness.\nFor example, the maintenance of quiet stance can be performed through adjustments at the ankles, knees, hips and spine (Allum et al.\nWhen postural conditions change, the central nervous system (CNS) must identify and selectively focus on the most reliable sensory inputs to provide optimal control.\nInputs from the vestibular, the visual and the proprioceptive system are weighted by the CNS.\nCommunicated by Fausto Baldissera.\nAn ankle strategy restores the equilibrium by moving the body primarily around the ankle joints (Horak and Nashner 1986).\n, hip strategy) (Horak and Nashner 1986).\nIn contrast, according to the multi-segmental postural control model, postural control is achieved not only by corrections at one joint but also by multiple corrections at different joints coordinated by the CNS (Morasso and Schieppati 1999; Schieppati et al.\n2002; Kiemel et al.\nOne factor that could disturb the optimal multi-segmental postural control is non-specific low back pain (NSLBP).\nIndividuals with NSLBP have been observed to have decreased postural robustness during standing, particularly when the standing task becomes more difficult such as standing on an unstable support surface (Mientjes and Frank 1999; Mok et al.\nFurthermore, individuals with NSLBP have shown poorer postural control during sitting (Radebold et al.\nBoth during standing (Mok et al.\n2004) and during sitting (Radebold et al.\n2009), impaired proprioception has been suggested as a possible mechanism causing the impaired postural control, although a specific assessment of the impaired proprioception was not performed in these studies.\nSeveral studies already evaluated proprioceptive changes in people with NSLBP by determining the lumbosacral position sense.\nLarger repositioning errors in people with NSLBP suggest proprioceptive impairments (Newcomer et al.\n2000; Brumagne et al.\n2000; Descarreaux et al.\n2005; Dolan and Green 2006), while other studies could not demonstrate larger repositioning errors and associated impaired proprioception (Koumantakis et al.\nHowever, these studies did not evaluate repositioning errors in combination with postural sway characteristics.\nHence, it remains unclear if proprioceptive impairments are associated with reduced postural robustness.\n, rely more on memory) and therefore less representative of normal proprioceptive control.\nWithin the proprioceptive system, reweighting of sensory signals has already been demonstrated in both healthy controls and in individuals with NSLBP (Brumagne et al.\nAnother study investigating two postural standing conditions (standing on stable and unstable support) in a larger test population already suggested decreased variability of postural control strategy in people with NSLBP (Brumagne et al.\nThese studies only evaluated standing postural conditions, so the role of proprioceptive reweighting as a characteristic of variability in postural control strategies (during standing as well in sitting conditions) was not evaluated specifically.\nVariability, as a fundamental property of biological systems, means that the person has multiple options to perform one task based on adaptive strategies, rather than on rigid programs (Harbourne and Stergiou 2009).\nTo have more insight into the variability of postural control strategies and its changes in people with NSLBP, it is recommended to investigate this under a variety of different postural conditions (e.\n, standing on a stable and on an unstable surface as well as sitting).\nA decrease in variability of anticipatory adjustments (APAs) during postural control has been observed in an experimental-induced acute NSLBP and in recurrent NSLBP (Moseley and Hodges 2006; Jacobs et al.\nPain-related beliefs have been suggested as a possible mechanism for this decreased variability in postural strategy in both studies (Moseley and Hodges 2006; Jacobs et al.\n2009), but the role of proprioception was not evaluated in these studies.\nFurthermore, subjects were only tested during one condition (standing), so it remains unclear if the persons had the variability to choose the optimal strategy upon different postural conditions.\nTo get more insight into the selection variability of postural control strategies upon the condition and the possible role of impaired proprioception, investigating the specific role of proprioception during diverse postural conditions is essential.\nTherefore, this study had two aims.\nThe first aim of this study was to investigate if healthy people show variability in their proprioceptive postural control strategy to ensure postural robustness during increased postural complexity.\nTo investigate this first aim, different postural conditions (standing on a stable and unstable surface and sitting) were chosen.\nFurthermore, muscle vibration, known as a strong stimulus for muscles spindles (Roll and Vedel 1982), was used to more specifically appraise the role of proprioception.\nThe second aim was to investigate if age-matched people with NSLBP show a similar variability in postural strategy.\ntheir proprioceptive postural control strategy depending on the postural demands and that individuals with NSLBP demonstrate less variability by selecting the same anklesteered strategy independent of the postural condition.\nOne hundred fifty-six students (47 men, 109 women) volunteered in this study.\nAll subjects were included or excluded in the study by an experienced musculoskeletal physical therapist.\nExclusion criteria were a history of vestibular disorders, neurological or respiratory disease, previous spinal surgery, structural spinal problems, acute radiculopathy, serious neck problems and recent musculoskeletal problems (\\6 months).\nIn addition, they had to score the pain at the moment of testing on a numerical rating scale (NRS).\nSubjects were included in the NSLBP group if they reported a NRS [ 0 and if they scored ODI-2 [ 6 at the moment of the test.\nThe healthy controls did not report any pain (NRS = 0) and had an ODI-2 score of 0.\nAll subjects gave their written informed consent and all test procedures were approved by the Medical Research Ethics Committee of K.\nLeuven with respect to the declaration of Helsinki (Ethical Principles for Medical Research Involving Human Subjects).\nPostural sway characteristics were measured using a sixchannel force plate (Bertec Corporation, Ohio, USA).\nTo evaluate trunk position in space, two piezo-resistive accelerometers (ICSensors, UK), also connected with the data-acquisition system, were placed on the spinous processes of thoracic (T1) and sacral (S2) vertebra in upright posture.\nIn six trials, the role of proprioception in postural control was directly examined by means of muscle vibration, known as a powerful stimulus of Ia afferents (Roll and Vedel 1982).\nTherefore, two muscle vibrators (self-manufactured with Maxon motors, Switzerland) were used.\nVibration was applied bilaterally to triceps surae muscles or to lumbar multifidus muscles, respectively.\nThe values are mean with standard deviations.\nMuscle vibration was initiated 15 s after the start of the trial for duration of 15 s.\nActivation and deactivation of the vibrators were manually controlled.\nThe frequency of the vibration was set at 60 Hz and the amplitude was approximately 0.\nThese characteristics of vibration were chosen to induce maximal illusory joint movement and were demonstrated to induce a significant muscle lengthening illusion in healthy individuals (Roll and Vedel 1982; Cordo et al.\nWhen triceps surae muscles are vibrated in a healthy subject during standing, a postural sway in backward direction is expected; when lumbar multifidus muscles are vibrated during standing, a healthy subject is expected to show a postural sway in a forward direction.\nThe effect of lumbar multifidus muscle vibration will be different depending on the reference frame the CNS is using (Gurfinkel et al.\nDuring standing, the sacrum-pelvis will be considered as the mobile body part compared to the stationary trunk.\nTo appraise postural stability and proprioceptive postural control in quiet stance, two test conditions were used: (1) an upright standing condition on a stable support surface and (2) an upright standing condition on an unstable support surface (foam), respectively.\nTo appraise proprioceptive postural control in sitting, subjects sat on a stable stool with the feet stable.\nThe sitting condition was chosen to evaluate the possibility to switch to a more appropriate postural control strategy when the postural condition changes (e.\n, from standing to sitting).\nIn all standing conditions, subjects had to stand barefoot on the force plate (Trials 1, 2, 3, 4) or on the foam (Trials 5, 6, 7, 8) with the arms loosely hanging along the body, both heels 10 cm separated and the forefeet in a free splayed out position.\nFeet position is standardized in all trials using a transparency sheet to mark off both feet.\nThe foam condition is used to create a postural condition in which ankle proprioceptive signals are less reliable and therefore the CNS should rely more on other proprioceptive signals to control posture (Ivanenko et al.\nIn all sitting trials (9, 10, and 11), subjects sat on a stable stool with height adjusted to create a rectangle between the greater trochanter (lateral femoral condyle line) and the lateral femoral condyle (lateral malleolus line), respectively.\nSubjects were asked to adopt a usual sitting posture with the arms loosely hanging along the body.\nIn all trials, vision was occluded and subjects were asked to remain as immobile, but relaxed as possible in upright standing or usual sitting posture, respectively (Fig.\nCondition 1: stable support surface.\nTrial 1 Quiet standing.\nTrial 2 Quiet standing, ballistic shoulder flexion at 30 s Trial 3 Quiet standing, bilateral triceps surae vibration.\nTrial 4 Quiet standing, bilateral lumbar multifidus muscle vibration.\nCondition 2: unstable support surface (foam).\nTrial 5 Quiet standing.\nTrial 6 Quiet standing, ballistic shoulder flexion at 30 s.\nTrial 7 Quiet standing, bilateral triceps surae vibration.\nTrial 10 Sitting, bilateral triceps surae vibration.\nTrial 11 Sitting, bilateral lumbar multifidus muscle vibration.\nData reduction and statistical analysis.\nPostural sway characteristics from the force plate readings were collected and calculated using Spike2 (CED, Cambridge, UK) and Microsoft Excel software, for all trials of both groups.\nDisplacements of the COP in anteriorposterior (AP) direction were estimated from the raw force plate data using the equation:.\nFurther data reduction was performed by calculating the root mean square (RMS) values of the COP displacements for the stability trials (1, 2, 5, 6,) and the mean values for the muscle vibration trials in order to appraise the directional effect of muscle vibration on COP displacement.\nThe COP displacements in the muscle vibration trials were analyzed over two epochs: the 15 s preceding and the 15 s during muscle vibration.\nPositive values correspond to forward COP displacement, negative values correspond to backward displacement.\nFurthermore, proprioceptive control strategy or relative proprioceptive weighting (RPW) was appraised using the equation:.\nwhere abs TS is the absolute value of the mean COP displacement during triceps surae muscle vibration and abs LM is the absolute value of the mean COP displacement during lumbar multifidus muscle vibration.\nA score equal to 1 corresponds to 100% reliance on triceps surae muscle afference.\nA score equal to 0 corresponds to 100% reliance on lumbar multifidus muscle afference.\nDifferences in RMS and mean values of COP displacement between the conditions, between the trials, and between the NSLBP and healthy group were compared,.\nbased on repeated measures analysis of variance (ANOVA/ MANOVA).\nWhere a significant main and interaction effect was found, post hoc tests (Tukeys unequal N HSD) were performed to further analyze the detailed effects.\nAll data are presented as mean  standard deviations (SDs).\nThe level of statistical significance was set at p B 0.\nIn the usual standing trial on a stable surface, the subjects with NSLBP showed significantly less sway compared to the healthy group (Trial 1; p \\ 0.\nHowever, the individuals with NSLBP showed significantly larger sways when standing on a foam support (Trial 5; p \\ 0.\n0001) and while performing a ballistic arm movement on an unstable support surface (Trial 6; p \\ 0.\nWhen standing on a stable support surface, individuals with NSLBP performed significantly more backward sway during triceps surae muscle vibration (Trial 3; p \\ 0.\n0001) compared to the healthy group.\nMuscle vibration on lumbar multifidus muscles showed no significant differences between the two groups (Trial 4; p [ 0.\nIn the foam conditions, however, larger forward sways were observed by the healthy control group compared to the individuals with NSLBP when vibration is applied on the lumbar multifidus muscles (Trial 8; p \\ 0.\nduring sitting, significantly larger sways were recorded when vibration was applied on lumbar multifidus muscle in the healthy group compared to the people with NSLBP (Trial 11; healthy: 0.\nSubjects with NSLBP showed significantly higher RPW values compared to healthy individuals both during standing on a stable support surface and on an unstable support surface (p \\ 0.\nAlso, during sitting, significantly higher RPW values were demonstrated in the NSLBP group (p \\ 0.\nThe main finding of this study is that young people with NSLBP (compared to healthy controls) show a stronger ankle-steered proprioceptive postural strategy during standing on a stable support surface and in a condition, where this strategy is less appropriate (i.\nFurthermore, in a condition where lumbar proprioceptive afference is expected to be crucial (sitting), persons with NSLBP are not able to rely on this afference to control posture.\nResults of this study demonstrate greater AP sways of the COP when standing on an unstable support surface and when performing a ballistic arm movement on an unstable support.\nStanding with vision occluded.\nsitting with feet stable and vision occluded.\n4 Mean displacements of the center of pressure (COP) during the vibration trials for both groups during sitting (NSLBP non-specific low back pain, NS not significant).\nstanding on a stable support standing on foam sitting.\n5 Relative proprioceptive weighting (RPW) values of both groups during standing on stable support surface and on foam and during sitting.\nHigher RPW values mean more reliance on proprioceptive inputs of ankle muscles (NSLBP non-specific low back pain).\nThese findings are in agreement with the results of previous research, where larger AP sways were found when the postural task became more difficult and vision was occluded (Mientjes and Frank 1999; Mok et al.\nMoreover, our findings are in agreement with earlier results where the integration of somatosensory signals during postural control of a young healthy population was tested (Isableu and Vuillerme 2006).\nThey found that the less the subjects swayed in a stable condition, the more they swayed in an unstable support surface (foam) condition.\nOur results show that in an easy postural condition (e.\n, standing on a firm surface), the NSLBP group demonstrated less sway than the healthy group where the healthy group was more robust in all other (more complex) postural conditions.\nThese findings might indicate that the adopted postural strategy of persons with NSLBP is effective for easy postural conditions; however, this postural strategy seems to fail in more complex postural conditions leading to decreased postural robustness.\nProprioceptive postural control strategy or RPW.\nIn the present study, we used muscle vibration, known as a powerful stimulus of muscle spindles, to evaluate the role of proprioception in postural control directly (Roll and Vedel 1982; Cordo et al.\nIt is demonstrated that (1) people with NSLBP demonstrate larger backward sways during triceps surae muscle vibration when standing on a stable support compared to the control group and (2) healthy people demonstrate significantly more forward sway during multifidus muscle vibration when standing on a foam support.\nThese findings illustrate clearly that proprioceptive differences are an influencing factor in this strategy selection.\nPrevious studies already demonstrated more reliance on ankle signals during stable standing conditions in people with NSLBP (Brumagne et al.\nThe higher RPW values in the group with NSLBP compared to healthy controls when standing on a stable or an unstable support and during sitting indicate that the NSLBP group relies less on back muscle proprioceptive inputs independent of the postural condition.\nThis reduced multi-segmental strategy seems to be adequate in stable support conditions, but leads to decreased postural robustness in unstable support conditions.\nLumbosacral proprioceptive deficits were suggested as a possible reason why people with NSLBP could not switch to a more appropriate postural control strategy upon the condition (Mok et al.\nThese results are in accordance with previous studies showing that people with NSLBP used a more ankle-steered strategy to maintain upright position while healthy controls.\npredominantly use a hip strategy when tested on a translational platform (Henry et al.\n2006) or on a rotational platform (della Volpe et al.\nIn contrast, Isableu and Vuillerme 2006 demonstrated that some healthy people use an ankle strategy in all conditions.\nIt may be possible that these people are at higher risk to get NSLBP in the future, due to impaired proprioception of the lumbosacral area.\nIt is hypothesized that these proprioceptive changes may cause less fine-tuned control of the spine during postural control which may increase the risk to induce more mechanical stress on the spinal column causing (recurrent) NSLBP (Hodges and Moseley 2003).\nProspective studies investigating the role of reduced variability caused by altered proprioceptive inputs in postural control strategies are needed to clarify the role of reduced variability as a causing factor for NSLBP.\nFurthermore, during sitting, people with NSLBP also show higher RPW values compared to the healthy controls.\nThis suggests that they use less afferent signals from the back muscles in a condition where these signals are expected to play a predominant role in postural control.\nThese results underscore the hypothesis that in NSLBP lumbosacral proprioceptive impairment is associated with decreased postural control variability.\nThis finding is in accordance with earlier results where greater AP sways of the COP during unstable sitting without vision are shown in people with NSLBP (Radebold et al.\nThe underlying mechanism causing the altered proprioceptive steering in people with NSLBP remains still unclear.\nHowever, the relation between these changes and altered proprioceptive steering remains unclear.\nA possible mechanism underlying the decreased reliance on back muscle proprioception in patients with NSLBP might be a different muscle spindle density in the paraspinal muscles.\nMuscle spindles tend to concentrate mainly where oxidative muscle fibers predominate, often in the deeper and central portions of muscles (Kokkorogiannis 2004).\nIndividuals with NSLBP have been observed to have more fatigable muscle fibers due to decreased oxidative capacity (Mannion et al.\n1997) and therefore might have a decreased density of muscle spindles in their back muscles.\nThis hypothesis warrants further investigation.\nVariability in postural control strategies.\nFew studies demonstrated a reduced variability of anticipatory control in young healthy people and age-matched.\npersons with NSLBP (Moseley and Hodges 2006; Jacobs et al.\nIn these studies, fear of movement and painrelated beliefs were suggested as influencing factors.\n(2008b) demonstrated that only healthy persons show lower RPW values during standing on an unstable support surface compared to a firm surface condition, whereas people with NSLBP showed similar RPW values in both postural conditions.\nThese earlier findings are in contrast with our findings demonstrating that healthy controls have lower RPW values in all postural conditions.\nThus, our results demonstrated that both young people with NSLBP and healthy controls have the ability to make a proprioceptive switch, but this capacity to switch is observed to be reduced in people with NSLBP.\nWhen subjects are about 5 years older, this proprioceptive variability may be further reduced (Brumagne et al.\nThese findings suggest that age may be an important factor in the capacity of varying postural control strategies and the associated sensory reweighting variability.\nIt might be possible that at a certain age, young people with NSLBP move from adaptive switchable postural control strategies to more rigid postural control strategies based on less variability in somatosensory reweighting.\nProspective studies in different age groups are necessary to further explore this hypothesis.\nIn addition, in this study, fear may be likely ruled out as a causing factor for the reduction in postural strategy variability as there were no significant differences in the scores on FABQ and TSK questionnaires between the NSLBP and the control group.\nMoreover, the people with NSLBP had a low mean pain score of 2/10 at the time of testing, so pain is probably not the predominant factor responsible for the reduction in proprioceptive postural strategy variability.\nSome limitations of our study warrant discussion.\nFirst, a very young population with minimal pain and disability scores was investigated.\nTherefore, the results of this study cannot be generalized to the average NSLBP patient population.\nMoreover, a sub-classification based on pain aggravating movements and postures was not made.\nIt could be possible that the people with NSLBP are still robust in some pain-free postures, but less robust in the pain aggravating postures.\nAnother limitation of this study is that only rather static postural conditions (sitting and standing) were tested.\n, sit-tostand, lifting a weight, forward bending) could give more insights into the role of proprioception in postural control.\nWhile more optimal investigation of proprioceptive changes may optimize treatment of persons with NSLBP, it remains difficult in clinical practice to evaluate these changes without the use of precise and accurate instruments as in a laboratory setting.\nTherefore, based on the laboratory results, a functional clinical test battery should be developed and its concurrent validity should be assessed before wider integration into clinical practice.\nIn addition, it might be fruitful to pay more attention on increasing the variability in postural strategies in rehabilitation of NSLBP.\nA large amount of multi-segmental postural correction possibilities depending on the postural task should be included in exercise programs.\n, stable, unstable) and in different postural conditions (e.\n, standing, sitting) might optimize this proprioceptive variability.\nYoung healthy people have the ability to choose the optimal multi-segmental postural control strategy according to the postural condition.\nIn contrast, young people with mild NSLBP exhibit a reduced variability in proprioceptive postural control strategies due to a decreased proprioceptive reweighting capacity.\nThis loss of variability in strategy selection is associated with a decreased postural robustness.\nProspective studies are needed to further clarify the relation between reduced variability of postural control strategies and the development, reoccurrences or maintenance of NSLBP.\nBrumagne S, Janssens L, Janssens E, Goddyn L (2008a) Altered postural control in anticipation of postural instability in persons with recurrent low back pain.\nGait Posture 4:657662 Brumagne S, Janssens L, Knapen S, Claeys K, Suuden-Johanson E (2008b) Persons with recurrent low back pain exhibit a rigid postural control strategy.\nExp Brain Res 167(3):324334 Dankaerts W, OSullivan P, Burnett A, Straker L (2006) Altered patterns of superficial trunk muscle activation during sitting in nonspecific chronic low back pain patients: importance of subclassification.\nSpine 31(17):20172023 della Volpe R, Popa T, Ginanneschi F, Spidalieri R, Mazzocchio R, Rossi A (2006) Changes in coordination of postural control during dynamic stance in chronic low back pain patients.\nGait Posture 24(3):349355 Descarreaux M, Blouin JS, Teasdale N (2005) Repositioning accuracy and movement parameters in low back pain subjects and healthy control subjects.\nEur Spine J 14(2):185191 Dolan KJ, Green A (2006) Lumbar spine reposition sense: the effect of a slouched posture.\nNeuroscience 68(1): 229243 Harbourne RT, Stergiou N (2009) Movement variability and the use of nonlinear tools: principles to guide physical therapist practice 5.\nPhys Ther 89(3):267282 Henry SM, Hitt JR, Jones SL, Bunn JY (2006) Decreased limits of stability in response to postural perturbations in subjects with low back pain.\nJ Neurophysiol 55(6):13691381 Isableu B, Vuillerme N (2006) Differential integration of kinaesthetic signals to postural control 2.\nExp Brain Res 174(4):763768 Ivanenko YP, Talis VL, Kazennikov OV (1999) Support stability influences postural responses to muscle vibration in humans.\nEur J Neurosci 11(2):647654 Jacobs JV, Henry SM, Nagle KJ (2009) People with chronic low back pain exhibit decreased variability in the timing of their anticipatory postural adjustments.\nBehav Neurosci 123(2):455 458 Kiemel T, Elahi AJ, Jeka JJ (2008) Identification of the plant for upright stance in humans: multiple movement patterns from a single neural strategy 2.\nJ Neurophysiol 100(6):33943406 Kokkorogiannis T (2004) Somatic and intramuscular distribution of muscle spindles and their relation to muscular angiotypes.\nJ Theor Biol 229(2):263280 Koumantakis GA, Winstanley J, Oldham JA (2002) Thoracolumbar proprioception in individuals with and without low back pain: intratester reliability, clinical applicability, and validity.\nJ Orthop Res 15(6):881887 Mientjes MI, Frank JS (1999) Balance in chronic low back pain patients compared to healthy people under various conditions in upright standing.\nClin Biomech (Bristol, Avon) 14(10):710716 Mok NW, Brauer SG, Hodges PW (2004) Hip strategy for balance control in quiet standing is reduced in people with low back pain.\nSpine 25(19):24882493 OSullivan PB, Mitchell T, Bulich P, Waller R, Holte J (2006) The relationship between posture and back muscle endurance in industrial workers with flexion-related low back pain.\nMan Ther 11(4):264271 Paulus I, Brumagne S (2008) Altered interpretation of neck proprioceptive signals in persons with subclinical recurrent neck pain 1.\nJ Rehabil Med 40(6):426 Popa T, Bonifazi M, Della VR, Rossi A, Mazzocchio R (2007) Adaptive changes in postural strategy selection in chronic low back pain.\nExp Brain Res 177(3):411418 Radebold A, Cholewicki J, Polzhofer GK, Greene HS (2001) Impaired postural control of the lumbar spine is associated with delayed muscle response times in patients with chronic idiopathic low back pain.\nSpine (Philadelphia, PA, 1976) 26(7): 724730 Roll JP, Vedel JP (1982) Kinaesthetic role of muscle afferents in man, studied by tendon vibration and microneurography.\nExp Brain Res 47(2):177190 Runge CF, Shupert CL, Horak FB, Zajac FE (1999) Ankle and hip postural strategies defined by joint torques.\nGait Posture 10(2):161170 Schieppati M, Giordano A, Nardone A (2002) Variability in a dynamic postural task attests ample flexibility in balance control mechanisms 73.\nExp Brain Res 144(2):200210 Silfies SP, Cholewicki J, Reeves NP, Greene HS (2007) Lumbar position sense and the riskof low back injuries incollege athletes: a prospective cohort study.\nBMC Musculoskelet Disord 8:129 Van Daele U, Hagman F, Truijen S, Vorlat P, Van Gheluwe B, Vaes P (2009) Differences in balance strategies between nonspecific chronic low back pain patients and healthy control subjects during unstable sitting.\nSpine 34(11):12331238 Vlaeyen JW, Kole-Snijders AM, Boeren RG, van Eek H (1995) Fear of movement/(re)injury in chronic low back pain and its relation to behavioral performance.\nPain 62(3)363372 Waddell G, Newton M, Henderson I, Somerville D, Main CJ (1993) A Fear-Avoidance Beliefs Questionnaire (FABQ) and the role of fear-avoidance beliefs in chronic low back pain and disability 58."}