{"title": "34.pdf", "contents": "Is the Organization of the Primary Motor Cortex in Low Back Pain Related to Pain, Movement, and/or Sensation?.\nAim/Background: Primary motor cortex (M1) organization differs between individuals with and without chronic low back pain (CLBP), in parallel with motor and sensory impairments.\nThis study investigated whether movement behaviour and tactile/pain sensation are related to M1 organisation in CLBP.\nMethods: Transcranial magnetic stimulation (TMS) was used to map the M1 representation of the erector spinae and multifidus muscles in 20 participants with and without CLBP.\nCortical organisation was quantified by: map volume; center of gravity (CoG); number of peaks; and primary and secondary peak location.\nMovement behaviour was assessed as the ability to dissociate lumbar from thorax motion and sensory function as two-point discrimination, pressure pain thresholds, and pain intensity (visual analogue scale).\nMap peaks were more numerous in CLBP participants who performed the movement task good than those with poor performance.\nConclusions: This study confirms that M1 maps differ between people with and without CLBP, but these changes are variable within the CLBP group and are not related to motor and sensory features in a simple manner.\n5,6 There is early evidence for a relationship between brain changes, movement, and pain.\nFor example, a shift of the M1 representation of the transversus abdominis muscle correlates with the amplitude of delayed activation of this muscle during rapid arm movements.\n3 Further, the amplitude of shift of the S1 representation correlates with pain duration.\n6 Detailed investigation of the relationship between cortical changes and sensorimotor functions is necessary.\n7 It is plausible that convergence of the normally separate M1 representations (ie, smudging4) of the back muscles in CLBP could have behavioral relevance.\n810 For example, altered M1 function could translate to reduced ability to individually control separate fascicles of the back muscles.\n9,11 This observation appears relevant to the common clinical presentation of a reduced ability to dissociate movement of the lumbar (an action of the shorter back muscles) and thoracic (an action of the longer back muscles) regions of the spine (ie, thoracolumbar dissociation).\n12 Less independent function of discrete components of the back muscles and less independence of cortical organization (loss of separate motor cortex representation) in CLBP appears congruent.\nThe objective of this study was to evaluate the relationship between measures of M1 organization and tests of motor behavior or sensory (including pain) function.\nWe aimed to: (1) compare M1 organization, and motor and sensory function between individuals with and without CLBP; (2) evaluate the relationship between M1 and a motor behavior test; (3) evaluate the relationship between M1 and sensory function; and (4) evaluate the relationship between tests of motor and sensory function.\nOur primary hypothesis was that the representation of the trunk muscles at M1 (eg, number of peaks,16 map volume,15 location of map peak3) would correlate with the ability to dissociate lumbar and thoracic movement and discrimination of 2 simultaneously applied stimuli.\nThe authors declare no conflict of interest.\nClin J Pain  Volume 34, Number 3, March 2018 www.\nparticipants against the potential to observe differences and relationships in the data.\nThe sample size was similar to that used in studies that have observed changes in cortical organization with similar methodology.\n15 Twenty individuals with a history of nonspecific CLBP lasting for more than 3 months who reported limited function or required intervention from a health care professional (32 9 y, 9 males/11 females) participated.\nA group of 20 agematched and gender-matched pain-free participants with no history of CLBP (285 y) were also recruited.\nParticipants were excluded from the study if they had major spinal pathology (eg, tumor, infection, fracture, inflammatory disease), pregnancy, nerve root compromise, previous spinal surgery, or major surgery scheduled.\nParticipants completed a transcranial magnetic stimulation (TMS) safety questionnaire17 and were excluded if they did not fulfil the criteria for safety considerations to receive TMS.\n18 Participants in the control group were excluded if they presented with any history of chronic neck, lower back or leg pain that was sufficient for them to seek treatment or modify function.\nThe institutional Medical Research Ethics Committee approved the study and all participants provided written, informed consent.\nMotor Cortex Organization The region of the primary motor cortex with inputs to lumbar paraspinal muscles was mapped using TMS and surface electromyography (EMG).\nPairs of surface electrodes (Ag/AgCl) were placed in a longitudinal direction over the erector spinae (ES) 3 cm lateral to the spinous processes of L3 and 1 cm adjacent to L5 on both sides.\n19 EMG data were preamplified 2000 times, band-pass filtered (20 to 1000 Hz) and sampled at 2000 Hz using a Power 1401 Data Acquisition System with Signal 2 software (Cambridge Electronic Design, CED, UK).\nData were exported and analyzed with Matlab 6.\nTMS was delivered using a single-pulse monophasic Magstim 2002 (Magstim Company, UK).\nA figure-of-eight coil was placed with the crossover position over the target scalp site and orientated along the sagittal plane.\nAlthough it was possible to evoke motor evoked potentials (MEP) in ES using TMS for all participants, it was not possible to provide standardized stimulation at 120% of motor threshold as this generally exceeded the 100% output of the stimulator.\nThus, stimulator output was set at 100% for all participants.\nFive stimuli were delivered at each intersecting point on the grid (interstimulus interval: 5 s) during submaximal muscle activation.\nBefore commencement of the trial, participants performed 3 maximum voluntary contractions (MVC) of the paraspinal muscles (3 s duration).\nThis involved extension of the back with the participant sitting upright in a chair with a backrest at 90 degrees.\nWith the arms crossed and the feet fixed on the floor the participants extended isometrically against manual resistance applied to the shoulders, with no movement of the trunk.\nThe trunk posture was identical to that used for the remainder of the testing session.\nThe maximum amplitude across the trials for L5 ES was recorded.\nFor the experimental trials, participants activated the paraspinal muscles by leaning forward with a straight back to match a visual target indicating 20% MVC root mean square (RMS) EMG amplitude of the L5 ES recording.\nApproximately 10% variation of the value estimated for the 20% of their MVCs was allowed.\nVerbal feedback was provided to the participant to make adjustments if necessary.\nMotor Behavior Measurement Coordination of spine movement was evaluated using a clinical test of the ability to dissociate motion of the lumbar spine from that of the thoracic spine.\nThis test is based on the observation that some subgroups of patients with CLBP have difficulty with this maneuver and the hypothesis that this might be related to smudging of the M1 representation of the lumbar muscles in CLBP.\nMotion was assessed with clinical criteria using the Clinical test of thoracolumbar dissociation that has been validated previously.\n12 This test is scored from 0 to 10 based on the quality and consistency of performance of the task and a score of 5.\n5 has been established as the cutoff for good/poor performance.\nThe test was assessed by a trained rater with known reliability for this specific test.\n21 Test scores are used in the analysis as the proportion of participants in each group who presented with good and bad performance.\nSensory Function Measurement Pain and tactile sensation were assessed using pressure pain thresholds (PPT) and two-point discrimination (TPD), respectively.\nTPD was assessed on both sides of the back between the L1 and the iliac crest with a calliper.\nThreshold for TPD was identified as the shortest distance between calliper points that the participant could accurately identify as 2 (rather than 1) points.\nWith each sequence of application, after the initial presentation at the maximum or minimum aperture, the order of apertures was generally presented in sequential stimuli delivered out of order (  4 increments from the next expected stimulus).\nPPT was assessed with a pressure algometer (1 cm2 rubber tip) applied to the back (at the site of worst pain reported by the participant or a matched side for the painfree participants) and a remote site (thumbnail).\nParticipants indicated when the sensation of pressure first changed to one of pain22 by depressing a button that produced an audible sound.\nThe algometer was applied perpendicular to the skin and pressure applied manually with increasing force.\nParticipants also reported the intensity of their low back pain during the TMS and test of motor behavior on a 10-cm visual analog scale, anchored with no pain at zero and worst pain imaginable at 10.\nPain was reported immediately after TMS and after the motor behavior test.\nData Analysis Maps of M1 were generated from the surface EMG recordings from ES at L3 and L5.\noffset of the MEP were visually determined.\nMEP amplitude was quantified as the RMS EMG amplitude for the period between onset and offset of the MEP, and the background RMS EMG amplitude recorded before the TMS pulse (55 to 5 ms before stimulation) was subtracted.\nThe RMS EMG amplitudes of the MEP were superimposed over a grid of respective scalp sites to produce a topographical map of the amplitude of responses recorded with the L3 and L5 ES EMG.\nResponse amplitude was normalized to the amplitude of the greatest MEP amplitude or primary peak response and values under 25% of the peak were removed.\n4 Parameters of cortical organization (eg, map volume, center of gravity [CoG] location) were calculated from normalized maps.\nThe maps were averaged across participants with data aligned in 2 configurations.\nFirst, maps for each participant were aligned by anatomic landmarks based on the 57 cm grid orientated to the vertex.\nSecond, maps for each participant were aligned to the stimulation site with the greatest MEP amplitude.\nMap volume (a measure of the total excitability of the cortical representation) was calculated as the sum of the normalized MEPs recorded across all scalps sites where MEPs exceeded the 25% threshold.\nThe location of the CoG was calculated using the formula = zixi/zi,ziyi/zi (For scalp sites xi (mediallateral), yi (anteriorposterior), and zi (amplitude))23 and expressed as x-coordinate and y-coordinate.\nThe number of discrete peaks in the M1 representation of the ES muscles was determined using a published criteria that define a peak as a scalp site where the MEP amplitude is > 60% of the greatest MEP amplitude for the whole map and that was separated from other peak in the anteroposterior direction by a reduction in MEP amplitude of at least 20%.\n15 The locations of the primary (greatest amplitude) and secondary (second greatest amplitude) peaks in the motor maps were defined using the x-coordinate and y-coordinate and the vector length between each peak and the vertex of the scalp (coordinates 0,0).\nTo address aim 1, M1 map variables (map volume, CoG, number of peaks, and peak location) and sensory function variables (TPD, PPT) were compared between groups (CLBP vs.\npain-free) and levels (L3 vs.\nMotor map volumes at the L3 and L5 EMG recording site were transformed (square root method) to achieve normal distribution.\nThe proportion of participants in each group who displayed poor performance on the motor behavior test were compared with a 2 test.\nTwo analyses were conducted to address aim 2.\nFirst, the relationship between motor map variables at L3/L5 and measures of motor behavior were examined using the Spearman rank test.\nSecond, differences in the number of map peaks between participants in each group who displayed good/poor performance on the test of motor behavior were assessed with 2 tests.\nAim 3 was addressed by the relationship of motor map volumes and measures of sensory function (including pain).\nWe also assessed the correlation between M1 measures and pain experienced during the TMS and motor behavior test.\nFor all analyses the Spearman rank test was used.\nTo address aim 4, the relationship between the tests of motor behavior and sensory function were assessed with the Spearman rank test.\nFor all analyses the significance level was set at P  0.\nComparison of M1 Organization Between Groups The location of the CoG for each motor map (regardless of the number of peaks) was more anterior in the CLBP group (y-coordinatemain effect: groupP = 0.\n02) and this was observed for ES EMG recordings at both levels (main effect: levelP = 0.\n26; interaction: grouplevel P = 0.\nNo differences in CoG location were found in the mediolateral direction (x-coordinate main effect: group P = 0.\n23, interaction: P = 0.\nMap volume was smaller at L5 than L3 (main effect: levelP = 0.\n03), and although not significant, there was a tendency for a smaller map volume in those with CLBP than pain-free controls (main effect: groupP = 0.\n07) that did not differ between L5 and L3 (interaction: grouplevel P = 0.\nWhen TMS maps of ES EMG recorded at L3 and L5 were aligned by the anatomic reference (vertex) and averaged across participants, a single discrete peak was identified for each group and each muscle (Fig.\nIn contrast, when TMS maps were averaged across participants with the maps aligned to the location of the greatest peak (Fig.\n2), multiple peaks were identified in the average map for the recording made at L3 for the pain-free controls, but only a single peak was identified in the CLBP group (Fig.\nFor the L5 EMG recording, the pain-free group showed a single peak (primary peak) in the M1 motor maps with a tendency toward a second peak, but this did not meet our a priori defined criteria.\nAlthough the CLBP group had 2 peaks in the motor maps of L5, this was very distant from the primary peak and on the edge of the averaged map.\nDespite the differences observed for the averaged maps in each group, when maps were considered for individual participants according to our conservative criteria for definition of a peak there was no difference between groups.\nA second peak at L3 was identified for 13/20 and 12/20 of the pain-free and CLBP participants, respectively (2 = 0.\n74), and 12/20 and 11/20 at L5 (2 = 0.\nThe distance of the primary peak from the vertex (vector length) was significantly different between groups and site of EMG recordings (interaction grouplevel P = 0.\nPost hoc analyses showed that vector length in the pain-free group at L3 level was larger than L5 recordings (Duncan testP = 0.\nThis difference was not present for CLBP participants.\nNo significant differences in the vector location of the primary peak of each M1 map were found in the mediolateral direction (x-coordinate interaction: P = 0.\n26, main effect: group P = 0.\n89) or for the anteriorposterior direction (y-coordinate interaction: P = 0.\n69, main effect: groupP = 0.\nThere was no difference in the vector length of the secondary peak between groups or level of EMG recordings (interaction: grouplevelP=0.\nAt L3 level, the secondary peak in the CLBP group showed a nonsignificant tendency to be more anteriorly and laterally located from the vertex than in the pain-free group (main effect: groupP=0.\n6) than anterior (y-coordinates CLBP: 1.\nThe post hoc analysis revealed that this difference was significant only within the pain-free group (Duncan test P=0.\nComparison of Sensory Function Between Groups Although not significant, CLBP participants showed a tendency (main effect: groupP = 0.\n06) to require a larger vertical distance to detect 2-points than pain-free participants.\nThere were no significant differences between affected and nonaffected sides between groups (interaction: groupsideP = 0.\nFor the detection of 2 points in the horizontal direction there was no difference between groups or sides (interaction: groupsideP = 0.\nPPT had a significant interaction between groups and area of test (interaction: groupareaP = 0.\na significantly lower threshold than pain-free group at the back (Duncan testP = 0.\nPain-free participants, but not CLBP participants, had a lower threshold for thumbnail than the back (Duncan testP = 0.\nRelationship Between Motor Cortex Organization and Motor Behavior The scores achieved by the participants in the test of motor performance were not correlated in a linear manner or showed trends toward correlation with any of the M1 map measures (all: P > 0.\n3A) with good performance on the clinical test showed 2 peaks in the average of the maps aligned to the primary peak, but these were medial-laterally distributed which does not fit the criteria to determine the presence of secondary peak.\nIn contrast, CLBP participants with poor performance had a single peak in the average map.\nWhen the pain-free participants were subgrouped by score on the test of motor behavior, TMS maps at L3 (Fig.\n3B) showed 2 discrete map peaks, regardless of the score achieved on the clinical test.\nA single peak was present for both groups regardless of performance on the clinical test for EMG recordings made at L5 (Figs.\nBetween-group Comparisons of Motor Cortex Organization, Motor Behavior, and Sensory Function.\nMEP amplitude L3 0.\n9 20    L3 y-coordinates 0.\n7 20    L3 y-coordinates 0.\n7 20    Vector length secondary peakL3 2.\n7 11    L3 y-coordinates 1.\n1 11    Motor behavior (proportion with good performance) 5.\n1 20    TPDaffected side horizontal 4.\n72 TPDunaffected side horizontal 5.\n6 20    PPTlumbar 584.\n001 PPTthumb nail 413.\nSquare root transformation for t test as data were not normally distributed.\nRelationship Between M1 Organization and Sensory Function There was a significant inverse correlation between the distance of the CoG of the motor map from the vertex (vector length, and x-coordinate and y-coordinate) at L3 and PPT at the lumbar site (vector:  = 0.\n02, xcoordinate:  = 0.\n03; y-coordinate:  = 0.\nPain intensities reported during TMS and during movement were related with some map variables.\n5H) at L3 were also correlated with higher pain intensity during movement.\nRelationship Between Motor Behavior and Sensory Function The score on the test of motor behavior was inversely correlated with pain intensity during performance of the test ( = 0.\n03) and with the PPT at the thumbnail site ( = 0.\nThat is, motor behavior test scores were lower, and thumbnail PPT higher, in those with higher pain.\nDISCUSSION The findings of this study demonstrate that the M1 representation of back muscles in individuals with CLBP is more complex and in a different location to that of individuals with no history of pain.\nDifferences between groups were also observed in movement performance and sensory function, which provides some evidence of parallel between M1 organization and simple motor and sensory measures.\nHowever, these changes were weakly related at best and not in a linear manner.\nSome features of the motor map did not differ from those of pain-free controls in the manner that has been reported previously or narrowly missed significance.\nOur correlation analyses suggest some of these features are dependent on pain, which highlights the heterogeneity of the CLBP group.\nThe clinical significance of the change in mapping characteristics of the motor cortex in LBP is largely unknown.\nAlthough we provide some evidence of relationships, the interaction between cortex changes and clinical observations of motor behavior and sensory function appears to be more complex than predicted.\nMotor Cortex Organization in Individuals With CLBP Our data show that the M1 representation of back muscles in individuals with CLBP is located more anterior than that of pain-free individuals.\nAlthough a shift in the CoG was expected based on previous studies of paraspinal4 and abdominal2 muscles, the direction was opposite to the more posterior location identified in some previous work for similar muscles.\n4 This outcome might be explained by differences in the muscles recorded and in the EMG recording technique used.\nPrevious work in CLBP has used intramuscular EMG (fine-wire) electrodes, that record activity from individual fascicles of the multifidus muscle.\n16 Using that method, different locations have been observed for the site of peak cortical excitability for short/deep and long/ superficial fascicles (each recorded with separate, fine-wire electrodes).\nOur data were collected with surface electrodes, that record more generalized activity from a larger area and include activity from multiple muscle fascicles within.\nOur surface electrode recording at L5 (1 cm lateral to the spinous process) would have included contribution from both deep and superficial fibers of multifidus, and the surface electrode at L3 (3 cm lateral to the spinous process) would likely include contribution from multifidus and the more lateral longissimus/iliocostalis.\nThus, the properties of the M1 map estimated from each recording site would reflect the net response of multiple muscles (including those not recorded in the earlier study) and the response of individual muscles would be impossible to isolate.\nThese features could explain the difference to earlier work such as the anterior (rather than posterior) shift of the CoG, and differences in the number of map peaks in the data for our CLBP group.\nAlternatively, these differences could also relate to features such as differences in the intensity of pain; Schabrun et al15 showed a relationship between some features of the M1 representation and current pain.\nOur data replicate the observation of 2 peaks in the M1 map of pain-free participants and 1 peak in the M1 map (smudging) in CLBP4, but only at the L3 recording site and only when data were averaged across participants with individual maps aligned to the location of the primary peak.\nAverage of normalized M1 maps aligned to the stimulation site that evolved the greatest motor evoked potential (center grid reference in map) obtained for each individual.\nData are shown for pain-free (B, D) and chronic low back pain (A, C) groups.\nL3 electromyography recording sites (A, B) and the L5 (C, D).\nHowever, inspection of individual data revealed 2 peaks for most participants and the number did not differ between groups.\nThis differs from previous work15 where the smudging of the representation of back muscles in M1 was consistent with the fewer secondary peaks between LBP participants.\nOur observation is best explained by variation in the location of the second peak relative to the primary peak that resulted in removal of the second peak from the average.\nThis proposal is supported by the longer average and greater SD of the vector length for the CLBP group (pain-free: 1.\nOther observations also support the greater variation in CLBP participants.\nFor instance, the length of the vector for the primary peak differed between L3 and L5 recording sites for the pain-free but not CLBP participants.\n27 The functional relevance of reduced volume is unclear.\nThe correlation between higher levels of pain and smaller map volume in CLBP participants demonstrates that the characteristics of the CLBP group were not homogenous in this study.\n5) and good ( > 5.\nData are shown for participants with chronic low back pain (CLBP) at L3 (A) and L5 (C) electromyography recording sites, and for pain-free participants at L3 (B) and L5 (D).\nA, Correlation between PPT and with the distance of the center of gravity (CoG) of the motor map from the vertex.\nLower pressure pain thresholds were related to a location of the CoG that was further from the vertex.\nbetween groups and suggests that a comparison that includes CLBP participants with higher levels of pain might show a clearer difference in features of the motor cortex map relative to pain-free individuals.\nIt is unclear whether differences in M1 organization precede or follow pain development as all patients in the present study reported current pain.\nThe presence of a single map peak in some healthy participants could be a precursor.\nRelationship between motor cortex organization variables and pain intensity.\nLeft panels show the relationship of pain reported during TMS and (A) volume of the map at L3 electromyography recording site, (B) volume of the map at L5 electromyography recording site, (C) centre of gravity of the map at L3 electromyography recording site, and (D) vector length of the secondary peak of the map at L3 electromyography recording site.\nRight panels show relationships of pain reported during movement task with (E) volume of the map at L3 electromyography recording site, (F) volume of the map at L5 electromyography recording site, (G) centre of gravity of the map at L3 electromyography recording site, and (H) vector length of the secondary peak of the map at L3 electromyography recording site.\nPrevious studies have involved participants with current pain15 and during symptom remission.\nMotor Behavior and Sensory Function in CLBP Consistent with previous studies of some motor tasks,13 the thoracolumbar dissociation task was performed poorly by more participants with CLBP than pain-free in the present study.\nAlthough most participants with CLBP scored below the cutoff (75%), and most pain-free scored above this value (65%), this was not uniform across the groups.\nThe inability to move the lumbar spine and pelvis separately from the thorax has been identified in a specific subgroup of CLBP in the clinical literature.\nSensory function is commonly modified in CLBP using both painful and nonpainful stimuli in the area of pain.\n33,34 Our data show weak evidence for impaired tactile acuity (ability to discriminate between 2 points) of the back in CLBP which concurs with findings of a recent systematic review of sensory changes in CLBP.\n35 As expected, PPTs were lower in the lumbar area of our CLBP cohort, but there was no evidence of more generalized central sensitization as PPTs were not modified at the thumbnail.\nRelationships Between Motor Cortex Organization and Motor or Sensory Function Contrary to our hypothesis, we found no simple linear relationship between differences in M1 organization and either the ability to dissociate movement between spine regions or the ability to discriminate between simultaneous sensory inputs.\nSeveral studies in humans and animals have correlated changes in brain organization with motor variables.\nThe amplitude of delay in feedforward activation of the abdominal muscles correlates with the shift in their cortical representation in CLBP during rapid arm movements.\n3 The ability to activate the multifidus muscle voluntarily correlates with the amplitude of reduced short interval intracortical inhibition and active motor threshold in people with CLBP.\n36 Further, skilled movement and motor skill learning modify the topography of M1 maps in rats37,38 and humans.\nFirst, motor map volume was smaller in participants with higher pain intensity, which aligns with previous studies.\n19,39 Pain intensity has also been shown to relate to the density or thickness of the gray matter.\n39,40 Second, anterior shift in the CoG location was correlated with PPT in the painful region, which implies a relationship between pain intensity and M1 organization.\nWe aimed to investigate the clinical significance of a key change in the motor cortex map, but also uncovered some other characteristics of the variation in the map organization.\nThis suggests the nervous system may adopt a variety of strategies in the presence of CLBP.\nAlthough, it is too early to understand the clinical significance of minor and variable differences in map organization, we do provide evidence of some parallels between map and behavior.\nMotor Behavior was not Related to Tactile Discrimination Previous work has reported a positive correlation between motor behavior and sensory function in CLBP.\n41 In that work, individuals with poor tactile acuity also exhibited poorer performance on motor tests.\nAlthough tactile acuity and motor behavior were different between groups in our study, we found no relationship between the ability to discriminate 2 points and the motor task assessed.\nPain is associated with regional grey matter reduction in the general population.\nReorganization of the motor cortex is associated with postural control deficits in recurrent low back pain.\nCortical reorganisation and chronic pain: implications for rehabilitation.\nClin J Pain  Volume 34, Number 3, March 2018 Motor Cortex, Movement and Sensation in Back Pain.\nExtensive reorganization of primary somatosensory cortex in chronic back pain patients.\nLow back pain suppresses preparatory and triggered upper-limb activation after sudden upper-limb loading.\nWhy do some patients keep hurting their back? Evidence of ongoing back muscle dysfunction during remission from recurrent back pain.\nDifferent ways to balance the spine: subtle changes in sagittal spinal curves affect regional muscle activity.\nValidation of a clinical test of thoracolumbar dissociation in chronic low back pain.\nMovement control tests of the low back; evaluation of the difference between patients with low back pain and healthy controls.\nAlterations in central motor representation increase over time in individuals with rotator cuff tendinopathy.\nSmudging of the motor cortex is related to the severity of low back pain.\nTsao H, Danneels L, Hodges PW.\nIndividual fascicles of the paraspinal muscles are activated by discrete cortical networks in humans.\nTranscranial magnetic stimulation (TMS) safety considerations and recommendations.\nTargeting chronic recurrent low back pain from the top-down and the bottom-up: a combined transcranial direct current stimulation and peripheral electrical stimulation intervention.\nA checklist for assessing the methodological quality of studies using transcranial magnetic stimulation to study the motor system: an international consensus study.\nA clinical test of lumbopelvic control: development and reliability of a clinical test of dissociation of lumbopelvic and thoracolumbar motion.\nNoninvasive mapping of muscle representations in human motor cortex.\nMotor training induces experience-specific patterns of plasticity across motor cortex and spinal cord.\nMotor skill training induces changes in the excitability of the leg cortical area in healthy humans.\nMotor training of the lumbar paraspinal muscles induces immediate changes in motor coordination in patients with recurrent low back pain.\nMotor cortex reorganization and impaired function in the transition to sustained muscle pain.\nLumbar repositioning deficit in a specific low back pain population.\nPhysiotherapy movement based classification approaches to low back pain: comparison of subgroups through review and developer/expert survey.\nSensory characteristics of chronic non-specific low back pain: a subgroup investigation.\nIs tactile acuity altered in people with chronic pain? A systematic review and meta-analysis.\nCorticomotor control of lumbar multifidus muscles is impaired in chronic low back pain: concurrent evidence from ultrasound imaging and double-pulse transcranial magnetic stimulation.\nIn search of the motor engram: motor map plasticity as a mechanism for encoding motor experience.\nSkill learning induced plasticity of motor cortical representations is time and age-dependent.\nChronic back pain is associated with decreased prefrontal and thalamic gray matter density.\nBrain morphological signatures for chronic pain.\nTactile acuity and lumbopelvic motor control in patients with back pain and healthy controls."}