{"title": "35.pdf", "contents": "Cortical sensory representation of  the human hand:  Size of finger regions and nonoverlapping digit somatotopy.\nTo resolve these differences, we mapped cortical sensory representation of  each of the five digits and of median and ulnar nerves in three patients, using focal peripheral electrical shock stimuli.\nWe compared locations and sizes of cortical regions among digits and nerves, using the model of a current dipole in a  sphere applied to electrocorticography fi-om subdural grids.\nCortical representation was larger for the index finger  than for the little finger and for the middle finger than for the ring finger, which are similar to findings in the monkey  but different from Penfield's classic sensory homunculus.\nThe thumb was larger than the middle finger, as in the  homunculus.\nThese findings demonstrate a previ ously unrecognized similarity of cortical sensory organization of the fingers between humans and other primates.\nThere are differences between the classic cortical  sensory homunculus of Penfield and recent reports  of cortical sensory representation in monkey.\nThe  classic homunculus shows about equal cortical rep resentation for the index finger compared with the  little finger and for the middle finger compared  with the ring finger.\nThe classic  a composite dia gram derived from intraoperative cortical stimula tions in a large population of patients, apparently  without identifying all of the five digits in the same  brain and based on subjective reports that fre quently included sensation in two or more digits  during one stimulation, shows the five digits as  separate and sequentially somatotopic.\nI0J1  Dipole methods from physics recently have  demonstrated cortical somatotopy in other modali ties and have shown retinotopic organization in  human visual cortex,I2 tonotopic organization in  human auditory c o r t e ~ , ] ~ \" ~   and closely adjacent sub regions in human hand somatosensory  Hence, dipole methods applied to ECoG appear to  be an accurate strategy for localizing activity and  resolving detail in human somatosensory cortex.\nDue to discrepancies in the literature on cortical  somatotopy in human and monkey hand, and to the  demonstrated precision of dipole methods and of  direct cortical recordings, we used ECoG dipole  estimates to define cortical sensory representation  of the hand by stimulating each of the five digits  and the median and ulnar nerves in three patients,  of whom two previously had verified cortical local ization for the median nerve.\nRecording of sotnatosmsory evoked responses  on ECoG.\nEvoked responses were recorded from somato sensory cortex (somatosensory evoked responses; SERs)  in three patients evaluated for epilepsy surgery using.\nAccepted for publication in final form October 9, 1991.\nAddress correspondence and reprint requests to Dr.\nReed Iieurological Research Center, 710 Westwood Plaza, Ids Angeles, CX  90024.\nAll patients had seizures arising out side sensorimotor cortex and have had significant reduc tion of seizures after focal excision.\nThe location and extent of sensorimotor cortex were  defined using cortical stimulations according to pub lished procedures.\n'\" This study conformed to the  Declaration of Helsinki and was approved by the UCLA  Human Subject Protection Committee.\nAll patients gave  informed consent.\nECoG was measured during the first  60 msec after shock stirnulation of each contralateral  digit at the proximal interphalangeal joint and of the  median and ulnar nerves at the wrist.\nThe first 5 msec  were excluded from analysis to avoid contamination by  stimulus artifact.\nThe digits were stimulated with ring  electrodes and were isolated from each other during  stimulation by dry cotton pads between adjacent fingers.\n1 Hz were applied to disks, which produced a  thumb or little finger twitch.\nDuring stimulation of the  thumb, patients reported tingling in the thumb.\nDuring  stimulation of the median nerve, patients reported tin gling in the thumb, index finger, middle finger, and often  the ring finger, in the appropriate distribution.\npatients reported tingling  in the little and ring fingers.\nA 48-channel rectangular  matrix covering somatosensory cortex was sampled  simultaneously at 4,096 Hz (bandpass, 1 to 1,000 Hz; 12 bit resolution) on high-performance amplifiers (Grass  Instruments, Quincy, MA).\nTwo reproducible sets of' 500  trials were averaged for each digit and nerve.\nThe original  traces of the time series were plotted and isocontour  maps were constructed at the estimated average latency  of the initial amplitude peak for the digits and for the  nerves.\nNot all digit evoked responses had well-defined  early amplitude peaks in each patient, so the average  latency was used at which most digits had an initial  peak.\nThese traces and isocontours were correlated with  the composite image of electrode positions and functional  anatomy from cortical stimulations, intraoperative pho tographs, skull x-rays, and MRIs (figures 1 and 2).\nA current dipole was used to  localize the centroid of each cortical region with a model  that we have previously shown to locate central fissure in  hand sensorimotor cortex accurately, with a mean error of  less than 3 mm.\nI\" The model allowed the dipole to move  within a homogeneous sphere to obtain the smallest value  of least squares between the model and the data using  the nonlinear minimization simplex algorithm of Nelder  and Mead,% as in our previous  report^.\nThe location of the dipole for digits and nerves was  estimated by two methods.\nThe localization estimates  were robust, and both methods gave equivalent results.\nFirst, the dipole location was estimated at the latency of  the initial amplitude peak, according to standard proce dures.\nSecond, the average or mean dipole location was.\nWe confirmed the  localizations using both methods to avoid a biased com parison.\ninitial cortical peaks like the N20-P30 or  P25-N35 after median nerve stimulation, visual selection  of the latency of cortical activity may have introduced  bias for some digits.\nInaccurate selection of latency  would be expected to include more cortical activity for  one digit than for another and might change the size of a  cortical region and its centroid.\nModeling the entire time series has localized  and separated multiple cortical sources after median  nerve stimulation1?17 without any detectable error from  including small-amplitude subcortical activity.\nThe procedure of analyzing the entire times series  was useful here because it allowed uniform analysis of  all digits and nerves.\nThe results for the entire time  series were equivalent to those using a visual estimate of  the latency of digit cortical activity.\nWe also analyzed the  entire time series starting from 5 msec after stimulation  and the time series beginning at the initial amplitude  peak.\nFor the locations in the study, the unbiased results  for the entire time series were correlated with cortical  functional anatomy.\nThe mean location of the dipole was  used as the measure of the centroid or center of mass of  the cortical activity after stimulation.\nThe data also were  analyzed using the median statistic of all dipole loca tions.\nThe results were similar using the mean or median  statistic as a measure of central tendency.\nThe mean of the goodness-of-fit measure was calculat ed for the entire time series.\nThe goodness of fit to a  dipole is a measure of how well a cortical region corre sponds to a point dipole.\nA dipole is a good approximation  of a focal source and is the first approximation to the  description of any source.\n12 The goodness of fit, used in  this way, is an objective measure of focality of a brain  region.\nA small region would be expected to have a good  fit to a point dipole, but a large region would be expected  to have a poor fit to a dipole.\nThe goodness-of-fit value  has been shown to predict accurately the presence of an  extended source based on comparison with recordings  directly from neocortex.\nThis use of intraoperative pho tographs allowed precise correlation of dipole location,  with anatomy in a visualized reference frame.\nI5,l6  A two-dimensional graph of the cortical map was con structed for each patient.\nA line was drawn from each  dipole location to the nearest point of' central fissure.\nThe  line gave a reflection of the dipole location onto central  [issure.\nWe measured the absolute distance along central  fissure between the reflection of one digit to the reflec tion of an adjacent digit.\nThese distances were plotted on  the vertical axis of the graph (figure 3B).\nRecording matrix, original traces, and isocorrtour maps of righ.\nAt top left is composite  image from skull x-ray and intraoperative photograph with subdural electrode recording matrix (circles), results of  behavioral testing during cortical stimulations at shaded electrode sites, and location of central fissure.\nTraces and isocontour maps of sensory responses for  median and ulnar nerves at bottom left and for digits at right.\nTraces are from electrodes enclosed by dotted rectangle  above.\nIsocontour maps are from entire matrix: for nerves at in,itial peak of 15 nisec poststimu1u.\nLocation of highest amplitude for digits and nerves shifts up and backward, along the  direction of central fissure in a somatotopic sequence.\nIsocontours also show somatotopic sequerim of polarity reversal  with predominantly tangential dipolar pattern.\nTraces for 60 msec after stimulation, excluding the first 5 msec that  contained stimulus artifact.\nCalibrations = 50 pV, 50 msec, positive up.\ndistance was measured from each dipole location to cen tral fissure to estimate the size of the cortical representa tion of the digit or nerve, analogous to estimates of a  \"rostrocaudal b a n d  in monkey.\n25 These estimates of cor tical representation were plotted on the horizontal axis of  the graph.\nThe following hypotheses were  tested to determine whether hand somatosensory cortex  was identical in human and monkey.\nIs the index finger  cortex larger than the little finger cortex? Is the middle  finger cortex larger than the ring finger cortex? Do the  digits show a somatotopic sequence, as expected, or is  there overlap of the centroids of digit cortex for adjacent  fingers?  The sizes of cortical representations of each digit were  compared using two complementary measures.\nFirst, the  distance from the mean location of the dipole to central.\nfissure was used to estimate the size of digit cortex on  the surface of the postcentral gyrus.\nSecond, the good ness of fit measure between the cortical region compared  with a point dipole was used as a measure of focality.\nThe distance and goodness-of-fit criteria gave nonredun dant confirmation.\nThe distance to central fissure mea sures anterior-to-posterior length of an area on the sur face of a gyrus, whereas the goodness of fit to a dipole  measures the entire cortical volume activated.\nTo ana lyze distances and goodness-of-fit values, we used repeat ed-measures analysis of variance with the post hoc t  test.\n26 We used repeated measures because the SDs of  the dipole locations of each of the digits and of the nerves  were similar.\nA one-tailed t test was used because our  hypothesis addressed whether the index and the middle  fingers were larger than or equal to the little and the  ring fingers.\nIsocontour maps: for nerves at 20 msec poststimulus, for digits at 25 msec poststimulus.\nWe determined whether the observed  sequence of digits was different from chance by compar ing the actual frequency to the expected probability of  the observed sequences in the patients, considering the  probabilities of all possible sequences.\nThe original time series  traces and isocontour maps showed a gradual shift  in location of amplitude peaks and of polarity  reversal, up and backward along central fissure,  consistent with a somatotopic sequence (figures 1  and 2).\nMost of the digits and nerves had time  series traces that showed a contiguous area of  high-amplitude peaks.\nFor the ring and little fin gers in patient 1, there was a spatial separation of  high-amplitude peaks with the same polarity (fig ure 1).\nThese separate peaks had different laten cies, consistent with dipolar sources.\nAs expected, all mean locations of dipoles were  in hand somatosensory cortex and agreed with cor tical stimulations and intraoperative photographs.\nFigure 3B shows that, in each patient,  each digit dipole was separate from every other  digit dipole, with no overlap of two SEs of dipoles of  any two digits (p < 0.\nThe digit dipoles in all  patients had identical somatotopic organizations  from sylvian fissure to vertex in the sequence:  thumb, index, middle, ring, little fingers.\nAs expect ed, the median nerve dipole always was nearer the  sylvian fissure than the ulnar nerve dipole.\nThe  digit locations tended to cluster near the location of  the nerve in the appropriate distribution.\n21  We first analyzed all the digits together.\nThe  observed sequences were different from chance for  all digits taken together.\nFor all five digits togeth er, in five positions in the same brain, there are  120 possible permutations of digit sequences.\nGiven  a specific digit sequence in the first brain sampled,  the probability that the same sequence would occur  again by chance in another two brains is small (p <  0.\nthumb  L----2L  t  +.\n(A) Anatomic  maps at left are enlargements of  area of hand sensorimotor cortex  xhere digit and nerve dipoles  were located, constructed from  intraoperative photographs of  nearby electrode locations and  central fissure.\nIn anatomic maps,  each large circle with a dot  shows the mean location of the  current dipole that best fits the  cortical electrical activity after  stimulation of one digit.\nThe  small unfilled circles indicate  the dipoles for median and ulnar  nerves.\nThe mean locations of  the dipoles agree with locations  of sensory responses during  cortical stimulation.\nA line is  drawn between each dipole  location to the nearest point of  central fissure to derive the  graphs at right.\n(B) Graphs  of digit dipole locations in  relation to central fissure  constructed from maps at left.\nThe cortex has been unfolded to  make central fissure parallel to  the vertical axis.\nThe vertical  axis shows the distances between  the reflections of digit dipoles  onto central fissure.\nThe  horizontal axis shows the  distance from each dipole  location to central fissure, giving  an estimate of cortical  representation, analogous to an  anterior-posterior rostrocaudal  band.\nEach map shows a nonover lapping somatotopic sequence  from the thumb to the little  finger and from the median to  the ulnar nerve.\nfinger somatotopy and separation of adjacent fin gers rather than the relative position of the thumb,  we also analyzed the fingers only, with the thumb  excluded from the analysis.\nThe observed  sequences were different from chance and from  overlap of adjacent fingers.\nFor the four fingers,  there are five possible somatotopic sequences in  which there is either complete separation of all fin gers or overlap of two adjacent fingers: one with  separation of the fingers and four with overlap of  two adjacent fingers.\nThe size of corti cal representation for fingers was like that of mon key and different from the classic sensory homun  culus, based on anterior-posterior distance on the  surface of the postcentral gyrus.\nCortical  representation was larger for the index finger than  for the little finger (p < 0.\n05) and for the middle.\nAnterior-posterior length of cortical representation (mm) and goodness of fit between cortical  representation and a dipole.\n70  76  77  75  73  (3.\nThumb  <  middle  median  ulnar  (n < 0.\nF test (betweedwithin groups) was significant: withp = 0.\n03 for API, and p = 0.\nfinger than for the ring finger (p < 0.\nA single dipole did not explain all the data.\nThe  table also shows the goodness-of-fit values for all  patients with means and SEs.\nThe goodness of fit,  or amount of data variance explained by the model,  often was below the usual criterion of 80% for a  focal region.\nz3 The distribution of goodness of fit  among digits was similar in all patients (p > 0.\nBased on fit values, the thumb  had a larger cortical representation than the mid dle finger did (p < 0.\n051, like the homunculus but  different from monkey.\nThis  appeared to be due to differences in two patients,  whereas the third had about equal fit values for the  thumb and the median nerve.\nWe applied a new multiple dipole  spatiotemporal model to the data.\nThis model has  accurately identified two subregions in human.\nWe  therefore used the more stable single dipole model  for analysis to obtain unambiguous localizations  that could be compared among digits.\nThese findings demonstrate that the  size of cortical sensory representation of human  fingers is similar to that in monkey and different in  two respects from the homunculus of Penfield1,2  and that there is nonoverlapping somatotopy in the  individual human brain.\nWhere prior  human and monkey studies agreed, we found simi lar patterns of cortical representation.\nWhere there  were differences between human and monkey  reports on cortical representation of fingers, our  findings supported those in monkey and were differ ent from those in the classic sensory homunculus.\nPenfield and Boldrey reported about the same  number of positive subjective reports for sensation  for the index finger compared with the little finger  and for the middle finger compared with the ring  finger.\nexposed sensory cortex on gyral surface was larger  for the index finger than for the little finger and for  the middle finger than for the ring finger.\nThese  findings are analogous to those in m a c a q ~ e.\nOur finding of a larger representation for the  thumb than the ring and little fingers and for the  index finger than the ring finger is similar to the  classic homunculus and to macaque.\nOur finding of  a larger representation for the thumb than for the  middle finger, based on dipole fit, is different from  studies of macaque4s5 and similar to those of the  classic homunculus.\nIt is not surprising that the  thumb had a larger gyral surface representation  and a lower fit to a single dipole than did the other  digits because the thumb had the largest cortical  representation by cortical stimulations here (figure  3A) and in the literature.\n>  Our findings of extended cortical representations  posterior to central fissure are similar to rostrocau dal bands in monkey studiesz5 and to the classic  homunculus.\nSize of surface cortical representation likely  would be shown more accurately by a dipole esti mate for only area 1 on the gyral cortical surface,  since the first 60 msec of cortical somatosensory  evoked activity combines activity from areas 3b  and l.\nlH  Since area 3b is buried in central fissure,  combining ECoG activity from areas 3b and 1  would be expected to give a localization nearer cen tral fissure than a dipole for area 1.\nWe tried to isolate areas 3b and 1 for each  digit with more complex procedures, including a  new multiple dipole model, but this was less stable  than the single dipole model.\nAn unexpected finding was that the median and  ulnar nerves had better dipole goodness of fits than  did the thumb in two patients, and a similar dipole  fit in the third.\nThe median nerve, however, repre sents the distribution of the thumb, two and a half  fingers, and the palm2$ therefore, the median nerve  would be expected to have at least as large an area  as the thumb and two fingers combined and, there fore, a lower dipole fit than that for the thumb.\nThe  opposite case observed here-a  lower fit for the  thumb compared with that for the median and  ulnar nerves-has  several possible explanations.\nIt  is unlikely that it is due to multiple sources for dig its but not nerves, since multiple sources have been  shown for the median nerve.\n15-zo  The differences  between nerves and digits also are not likely due to  lower signal-to-noise ratios for digit evoked respons.\nes, since nerves and digits had similar ratios (fig ures 1 and 2).\n34 Since each patient reported tingling in  three or four digits during stimulation of the medi an nerve, it is likely that the cortical representa tions of multiple digits were activated and that  there was not cancellation or reduction of distribu tion of the receptive fields in peripheral nerve or  spinal cord.\nA remaining possibility is a cortical  interaction due either to a geometry of cortex that  could produce self-cancellation of potentials or to an  interaction among cortical receptive fields of the  digits.\nThere are changes in cortical representation  due to cortical interactions in different states of  peripheral stimulation in monkey.\nAdjacent fingers had nonoverlap ping centers in the same brain, unlike previous  noninvasive and invasive studies.\nAlthough the  report of somatotopy for all five digits is not new,  we believe this study may be the first demonstra tion of nonoverlapping somatotopy of all five digits  in the individual human brain.\nThe finding of  somatotopy of the median nerve, ulnar nerve, and  digits in these patients is analogous to our previous  study of the median nerve, ulnar nerve, and  These findings clarify work from prior human  studies, which did not separate all digits in the  same brain or showed variability in relative digit  location.\nThe separate somatotopic locations of the  digits here confirm the classic sensory homunculus  from cortical stimulations in composite maps from  patient populations.\n'J Noninvasive studies using  scalp electric fields6 and the magnetic  field^^,^  showed somatotopy for alternate digits but not for  all digits in the same subject.\nPET studies focused  on groups of digits rather than isolating each of the  five  digit^.\n^ Woolsey et all1 showed somatotopy in  individual patients using ECoG amplitude during  finger tapping; however, all illustrations show  widespread cortical activity during shocks or joint  movement of fingers, producing at least one reverse  or overlapping sequence in each patient.\nWe found  separate amplitude peaks for some digits, as did  Woolsey et all1 (figure 1); however, dipoles of adja cent digits were nonoverlapping.\nThe somatotopic map here is similar to that in  monkey sensory ~ o r t e x ~ , ~   but different from that in  motor cortex, which is organized in muscle  groups.\n36 Primary sensory cortex of human digits  appears to have an organization similar to primary  essential, unimodal, agranular cortex in other  modalities, with a one-to-one mapping of peripher al receptive fields onto cortex in a somatotopic  sequence.\nThis simple organization does not rule  out more complex interactions among receptive  fields, which is one explanation for our finding a  lower dipole fit for the thumb than for the median  nerve.\nDipole modeling of the magnetic field has  shown complex interaction among receptive fields  in human primary auditory cortex, where pitch  may be mapped as well as frequency.\nThe  new findings in this study may arise from several  factors.\nWe used dipole models to derive current  sources from cortical voltages.\nA dipole model  avoided bias from subjective visual analysis and  ambiguity of peak voltage amplitude, which can be  distant from a source tilted from radia1.\n2,5,8J9  The  dipole model would be expected to make more pre cise estimates than those from location of highest  peak amplitude.\nMeasurement of central tendency  of early cortical activity over a time series, rather  than a map at one instant, improved the stability  of the estimates and increased spatial resolution to  distinguish adjacent cortical regions.\nWe had large signal-to-noise ratios by averaging  voltages directly from cortex in alert patients,  which reduced errors inherent in noninvasive mea surements such as distance15J7 and skull smear ing,6J5,:1H  and those due to state changes from anes thesia or fatigue.\nDirect comparisons of current  sources and cortical anatomy from photographs of  the same grid used for stimulations and dipole  localization aided accurate correlation.\nPrecise cor relation with central fissure geometry in patient 3  was necessary to determine sequence of middle and  ring fingers.\nElectrical measurement from a 60 msec window avoided temporal averaging of initial  localized and later propagated activity, which might  have obscured organization of somatotopy.\nInitial  evoked responses arise from areas 3b and l.\nI 8   Reports in monkey have shown somatotopy in areas  3b and 14.\n^^  It is unlikely that the new findings here are due  to pathology in epileptic brains.\nAlthough one  patient had seizures that propagated rapidly to  sensorimotor cortex, the findings in the other two  patients were the same as the mean findings of the  group and the new findings here.\nThe other two  patients had seizure foci distant from sensorimotor  cortex.\nFurther research is warranted, using more real istic models on higher-resolution intracranial  recordings.\nDipole interpretation of the ECoG maps  here is an abbreviated representation of cortical  activity compared with single-cell recordings in ani mals.\nAlthough ethical constraints in humans pre vent the detailed studies possible in animals, fur ther correlations with primate cortex, smaller inter electrode distances, multiple dipole modeling of  dynamic activation of cortical neuronal populations  after peripheral afferent stimulation, and study of  longer epochs could help resolve finer details of  human digit cortical organization and test focused  hypotheses of differences from other primates.\nPenfield WJ, Boldrey E.\nSomatic mot,or and sensory repre sentation in the cerebral cortex of man as studied by elect.\nPenfield WJ, Jasper HH.\nEpilepsy and the funct,ional anat.\nOrganization of somatic sensory and motor  areas of the cerebral cortex.\nBiological and biochemical basis of behavior.\nRepresentations of  slowly and rapidly adapting cutaneous mechanoreceptors of  the hand in Brodmanns areas 3 and 1 of macaca mulatta.\nDouble represcn tation of the body surface within cytoarchitectonic areas 3b  and 1 in SI in the owl monkey (Aotzcs triuirgntus).\nTopography of scalp recorded potentials evoked by  stimulation of the digits.\nSomatotopic organization of the human somatosensory cor tex revealed by neuromagnctic measurements.\nExp Brain  Kes 1984;56:197-205.\nical actil-ity evoked by somatosensory and noxious stimula tion.\nNew approaches to pain measure ment in man.\nSOT cortex with positron emission tomography.\nStudy of the postcentral gyrus of  man by the evoked potential technique.\nLocalization in somatic  sensory and motor areas of human cortex determined by  direct recording of evoked potentials and electrical stimula tion.\nMethods for location of elec trical sources in the human brain.\nTonotopic organiza tion of the human auditory cortex.\nTonotopic  organization of the auditory cortex: pitch versus frequency  representation.\nSutherling WW,  Crandalt PH, Darcey TM, Becker DP,  Levesque MF, Barth DS.\nBaumgartner C, Barth DS, Levesque MF, Sutherling WW.\nomy of human hand sensorimotor cortex  from spatiotemporal analysis of electrocorticography.\nSpatiotemporal modeling of cerchral evoked magnetic fields  t o  median nerve stimulation.\nHuman cortical potentials evoked by stimu lation of the median nerve: I.\nElectrical sources in the human somatosensory cortex: iden tification by combined magnetic and electric potential  recordings.\nScience 1985;227: 1051 -1 053.\nThe  magnetic field of epileptic spikes agrees with intracranial  localizations in complex partial epilepsy.\nPowell TPS, Mountcastle VB.\nOverlapping represcn tation of fingers in the somatosensory cortex (area 2) of the  conscious monkey.\nInvestigation  of multiple simultaneously active brain sources in the elec troencephalogram.\nfield modeling of multiple brain regions producing interictal  spikes in human epilepsy.\nCutaneous hyperalgesia: contribu tions of the peripheral and central nervous systems to the  increase in pain sensitivity after injury.\nDevor M, Wall PD.\nPlasticity in the spinal cord sensory map  following peripheral nerve injury in rats.\nCerebral cortical control of movement.\nDemonstration of useful differences  between the magnetoencephalogram and electroencephalo gram.\nElectroencephalogr Clin Neurophysiol 1983;56:38-51.\nThe editors apologize for the  error.\nTransuerse section of IBZM-SPECT obtained in a patient with parkinsonism and normal IBZM bind ing and a positive response to apomorphine (A), and decreased ZBZM binding and a negative response to apo morphine (B).\nThe images were generated by adding the two consecutive sections with the highest specific IBZM  binding.\nLevesque and Christoph Baumgartner nonoverlapping digit somatotopy Cortical sensory representation of the human hand: Size of finger regions and.\nsince 1951, it is now a weekly with 48 issues per year.\nCopyright  1992 by Advanstar   is the official journal of the American Academy of Neurology."}