{"title": "36.pdf", "contents": "The production of skilled finger movements in humans relies on the   activity of neurons in the hand area of primary motor cortex (M1)1.\nWe found that   finger-specific patterns of activation, although stable in each individual,  were highly variable across subjects.\nDoes this apparent lack of organization reflect random variation or is there a common underlying principle  that shapes the fine-grained patterns associated with each movement? Previous results have suggested that neurons in M1 encode coordinated, rather than individual, finger movements.\nFirst, the areas in M1  that innervate each hand muscle are not segregated4.\nSecond, neurons  in M1 are not tuned to individual finger movements, but show broad  tuning for movements of all five fingers and wrist2,3.\nFurthermore, activity patterns observed in fMRI for single finger movements are highly  overlapping5,6.\nFinally, cortical stimulation of both humans7,8 and monkeys9 evokes simultaneous movements of multiple fingers, resembling  the multi-joint movements observed during natural hand use.\nWe tested the hypothesis that the organization of cortical finger  representations is determined by natural hand use.\nGiven that hand  usage patterns are relatively invariant across individuals10, cortical   finger representations should also be organized in an invariant fashion, even though they may show considerable spatial variability.\nWe used fMRI and representational similarity analysis11 to uncover  this invariant organization and found that the fine-grained spatial   activation patterns in M1 and S1 can be quantitatively predicted by  the natural statistics of hand use.\nAs reported  earlier5,6, there was no clear spatial segregation of finger activation  patches.\nInstead, individual voxels were activated to varying degrees  by all fingers, consistent with previous electrophysiological recordings that found that individual neurons have similarly broad tuning  functions for finger movements2,3.\nThe activity patterns were replicable and stable in each participant  and hemisphere: split-half correlations of the patterns in participants  were r = 0.\nWe also tested the long-term stability  of digit representations in a different set of nine participants.\nActivity  patterns were measured four times over a period of 6 months (Online  Methods).\nIf finger-specific patterns were perfectly stable, then the  inter-session correlation should be as high as the within-session   split-half correlations (Fig.\nEven after 6 months, correlations   were only 13.\n3% for M1 and 14.\n8% for S1 below the   theoretical maximum.\n1), a blurry somatotopic  arrangement became visible with the thumb activating more ventral and the other fingers more dorsal areas of the motor strip.\nHowever, this organization only accounted for part of the replicable  activity pattern; the correlation between the finger-specific activity  patterns across all possible pairs of participants and hemispheres  (Online Methods) was r = 0.\n20) for M1 and r = 0.\nHand use predicts the structure of representations   in sensorimotor cortex.\nNaveed Ejaz1, Masashi Hamada2 & Jrn Diedrichsen1.\nFine finger movements are controlled by the population activity of neurons in the hand area of primary motor cortex.\nExperiments  using microstimulation and single-neuron electrophysiology suggest that this area represents coordinated multi-joint, rather than  single-finger movements.\nHowever, the principle by which these representations are organized remains unclear.\nWe analyzed  activity patterns during individuated finger movements using functional magnetic resonance imaging (fMRI).\nAlthough the spatial  layout of finger-specific activity patterns was variable across participants, the relative similarity between any pair of activity patterns  was well preserved.\nThis invariant organization was better explained by the correlation structure of everyday hand movements  than by correlated muscle activity.\nThis also generalized to an experiment using complex multi-finger movements.\nFinally, the  organizational structure correlated with patterns of involuntary co-contracted finger movements for high-force presses.\nTogether,   our results suggest that hand use shapes the relative arrangement of finger-specific activity patterns in sensory-motor cortex.\nRepresentational structure is invariant across subjects We then asked whether these idiosyncratic patterns reflect random   variation or whether their organization follows a common   principle.\nClose inspection of Figure 1 reveals some common   features: for example, in all participants, the patterns for ring and  little fingers were more similar to each other than to the thumb   pattern.\nThus, an invariant organization may be found in the relative   similarities between activity patterns of each pair of fingers, rather  than in their exact spatial distribution.\nWe quantified these similarities using a cross-validated Mahalanobis distance (Online Methods)13,  which calculates the sum of squared voxel-by-voxel differences  in activation, with each voxel weighted by the multivariate noise   structure.\nA small pattern distance between two fingers implies  that voxels that are activated for one finger are also activated for the  other.\nThe distances between the ten possible pairs of fingers per hand  were then arranged into a dissimilarity matrix (Fig.\n3b)11, which  revealed a robust organization across individuals (see Supplementary  Fig.\n3 for equivalent dissimilarity matrix for S1).\nThe distances  between the thumb and the remaining fingers were large, indicating  a distinct activity pattern for this digit.\nIn contrast, distances between  middle and ring fingers were generally small, reflecting large overlaps.\n3c), the  relationship between these ten possible finger distances was well preserved.\nThe average pairwise correlation, excluding the diagonal, was  r = 0.\n943) for M1 and r = 0.\nThis invariance was not solely a result of the thumb; the inter-subject   correlation remained high even when the thumb was excluded   (average pairwise correlation r = 0.\n916) for M1 and   r = 0.\n1)? To test  this, we removed the finger-specific mean pattern (calculated after  functional alignment) from each individual map and recalculated the  distances using only the subject-specific component.\nThe resulting  distance structure remained nearly unchanged and the inter-subject   correlation remained high (r = 0.\n933) for M1 and   r = 0.\n902) for S1), indicating that even the subject specific patterns exhibited a common organization.\n3d and Online Methods), reflecting the uniqueness of the thumb  pattern, the orderly arrangement of the other fingers, and the fact that  first digit is closer to the fifth than the third and fourth digits.\nSpecifically, the  similarity between activation patterns for all possible finger pairs  was highly preserved across individuals.\nThis invariance was even  present in the individual fine-grained patterns of activity and could  not be explained by the common somatotopic arrangement of finger  activation patches.\nFigure 1 Evoked activity patterns during single finger presses of the left  hand in the hand area of the right primary motor cortex, recorded from  three different participants at 3T.\nThe dotted line indicates the fundus of the central sulcus.\nThe last row shows the  activity patterns averaged across all six participants.\nFigure 2 Pattern stability across a period of 6 months in a group of nine  separate participants.\nThe correlation for week 0 is the split-half reliability  of finger-specific patterns in the first testing session.\nSubsequent weeks  show the average correlation between finger-specific patterns from the  first session with patterns recording 424 weeks later.\nTo make these  values comparable to the split-half correlations, we based betweensession correlations on half of the data from each session.\nThe gray line  indicates the theoretically attainable inter-session correlation if the  patterns remained perfectly stable.\nError bars (and shaded areas) indicate  between-subjects s.\n1036  VOLUME 18 | NUMBER 7 | JULY 2015 nature neurOSCIenCe.\n3-mm isotropic), we replicated the experiment using  a higher resolution in a separate group of seven subjects (7T scanner,   1.\nThis representational structure was  again stable across individuals (r = 0.\n843) for M1 and   r = 0.\n884) for S1) and was highly correlated across the   3T and 7T experiments (r = 0.\n964 for M1, r = 0.\nNatural statistics of hand use predicts single-finger pattern distances Thus far, we have shown that the relative similarities (or overlap)  between activity maps associated with single finger movements is  highly preserved across individuals, even though the maps themselves exhibit large inter-individual variability.\nThis suggests that the  development of individual maps is guided by some factor that ensures  that they all arrive at the same representational structure, without  dictating their exact spatial layout.\nWhat is this factor? We considered the idea that the structure of activation patterns  is determined by the way we use our hands in everyday life15.\nFor example, the  middle and the ring fingers often move together to facilitate grasping,  whereas the thumb typically moves independently10.\nWe predicted that frequently co-occurring finger movements  would lead to strong associations between the cortical modules that  encode them.\nWhen an individual finger is moved, activation would  automatically spread to these associated circuits.\nThus, the handusage model predicts that fingers that often move together would  also be associated with similar activation patterns.\nIt should be   noted that the measured activation does not necessarily imply that  associated muscle activity is evoked, given that the BOLD signal  mainly reflects synaptic processes, rather than spiking of output  neurons1820.\nFurthermore, pyramidal tract neurons can show   substantial increases in firing without measurable changes in muscle   activity21.\nIndeed, although the middle and ring fingers were   associated with overlapping patterns of cortical activity, participants  were able to individuate the two fingers well, with minimal force  produced by the neighboring finger (right hand, 0.\n02 N;   left hand, 0.\nTo quantify predictions for the hand-usage model, we used an   existing data set10 in which six participants went about their daily  activities while movements around 19 finger joints of the right hand  were measured for 24 h per subject.\n4b) between the standardized absolute  joint velocities for each pair of fingers, with small distances reflecting  highly correlated movements.\nThe hand-usage model explained the observed pattern distances  quite well (Fig.\n4cf), with correlations reaching r = 0.\n931) for S1 in the 7T data set.\nThe maximum achievable correlation  is bounded by the measurement noise on the distance structure of  each individual; this noise ceiling can be estimated on the basis of the  inter-subject reliability of the distance structures (Fig.\n4e,f and Online  Methods).\nAlthough the correlation was clearly below its theoretical  maximum for the 3T data, it fell close to the estimated bounds for the  7T data.\nThis is largely because the distance between thumb and index  patterns (distance 12) was estimated to be larger using higher resolution imaging (Fig.\nOverall, the data suggests that the  similarity structure of cortical activation patterns closely reflect the  co-occurrence of movements made in everyday life.\nNo differences between dominant and non-dominant hands We found no differences in the representational structure between  right (dominant) and left (non-dominant) hands (ANOVA on hand  differences; M1, F9,50 = 0.\n962; S1, F9,50 = 0.\nThis  lack of a difference raises the question of whether everyday usage patterns differed between hands.\nTo investigate this, we used an unpublished data set22 in which kinematic data was recorded for both hands  while eight healthy right-handed participants performed everyday  tasks.\nAlthough the predicted distance structure for the right hand  correlated highly (r = 0.\n936) with the one derived from the older data  set10, there were no significant differences between the structure of  distances for the dominant and non-dominant hands (F9,70 = 1.\nThus, although the dominant hand  generally showed more activity, the correlation structure between fingers was not appreciably different from the non-dominant hand.\nFigure 3 Representational structure of finger  movements in M1.\n(a) Activity patterns were  concatenated into vectors of activations   across voxels.\nEach row of the matrix constitutes  the tuning function of a voxel over the five  fingers, and each column represents the   activity pattern for one of the fingers.\n(b) Cross-validated Mahalanobis distances  between patterns for all digits in right M1 for  the three participants depicted in Figure 1.\n(d) Multidimensional scaling of the pattern distances in  two-dimensional space.\nafter Procrustes alignment across participants  corrected for the reduction in variability induced  by the alignment.\nWe first considered how well an orderly somatotopic arrangement of digits along the cortical strip could explain  the representational structure.\nFor this model, finger activations  patches were assumed to be overlapping Gaussian kernels sequentially  arranged along the cortical strip (Fig.\nFrom these activation patterns, a predicted distance structure was calculated (Fig.\nThe spatial width of the kernels (in arbitrary units with an inter-digit spacing   of 1) was estimated to best fit the distance structure for each   individual subject (1.\nThe  somatotopic model did not correlate with the cortical distances as  well as the hand-usage model (Fig.\nCombined over the 3T  (six participants  two hemispheres) and 7T (seven participants),  this difference was significant for M1 (two-sided t test, t18 = 3.\nAlternatively, we considered that the representational structure  reflects the patterns of muscular activation associated with each  movement, independent of natural use.\nIf M1 is assumed to represent hand muscles in an overlapping, yet  independent, fashion (Online Methods), then the similarity of cortical  activity patterns can be directly predicted from the similarity of the  corresponding muscular activity patterns.\n5c) while a separate set of seven subjects  performed single-finger movements outside of the scanner.\nThe distinct patterns of activity for each of the five individuated finger presses  (Fig.\n4e,f), the hand-usage model predicted the observed cortical activation pattern distances significantly  better.\n005) and in 16 of 19 in S1 (t18 = 3.\nTo summarize, our data suggest that the similarity structure of  cortical activation patterns more closely reflects the co-occurrence  of hand movements in everyday life than the similarity of muscle  activations.\nThe relatively good prediction by both models, however,  also indicates that there is a tight correspondence between how we  use our hands and the structure of muscle activity patterns necessary  to generate these movements.\nFigure 4 Representational structure in M1 is best explained by natural  statistics of hand use.\n(a) Raw velocities for a 30-s snippet of everyday  movements around the MCP joints for each of the five digits.\n4 mm, isotropic, d).\n(e,f) Average  correlation between predicted and measured inter-digit distances in M1  at 3T (e) and 7T (f).\n(a) The somatotopic model assumes an orderly, and partly overlapping,  arrangement of finger activation patches along the sensory-motor cortical  sheet.\n(c) 14 high-density electrodes were placed on the palmar and dorsal  surface of the right hand, recording from abductor pollicis brevis (APB),  flexor pollicis brevis (FPB), 24 lumbricales (Lum), abductor digiti minimi  (ADM), 14 interossei dorsales (DO), and extensor (WE) and flexor (WF)  muscles at the radial (r) and ulnar (u) sites of the forearm.\n(d) Predicted  distance structure for the muscle model.\nThe hand-usage model should therefore be able to predict  the representational structure for complex multi-finger movements.\nTo test this idea, we asked eight participants to perform multi finger presses with their right hand while we measured corresponding   activity patterns using fMRI at 3T.\n6a), each involving  simultaneously pressing down with the instructed fingers while   maintaining a baseline force with the others23.\nThe entire set of 31  configurations resulted in a total of 465 pairwise distances.\nAs with  the single-finger task, the representational structure for the multifinger task was notably stable across individuals, with an average  inter-subject reliability of r = 0.\nTo evaluate whether this invariant representational structure could  also be predicted by hand use, we averaged the angular velocities of  the active fingers in the natural statistics data set.\nAs for the singlefinger task, we then determined the Euclidean distance between the  standardized time series.\nIf two different configurations were both  similar to a frequently occurring joint-velocity combination, then  their resultant distance would be small (Fig.\nIf, however, each  configuration was similar to independently occurring movements  (Fig.\n6c), then their distance would be large.\nAs predicted, the handusage model correlated highly with the cortical distances (r = 0.\n727) for M1 and r = 0.\n784) for S1; Fig.\nFirst, we considered the muscle model.\nEMG activity was  recorded in a separate group of seven participants who performed   the multi-finger task and the distances between all possible pairs   of 31 muscle activation patterns were calculated.\nThe correlations   of the muscle model with the cortical distances were lower than  those for the hand-usage model for all eight subjects, with the   difference being highly significant (t7 = 7.\nWe then considered the possibility that the predictions of the handusage model are simply a result of the physical similarity of joint   movements for two configurations (the distance between C1 and C2;  Fig.\n5b,c) rather than the probability density of natural movements.\nWe therefore correlated the cortical distances with the Euclidian  distance between the normalized movement vectors for each configuration, without taking the natural statistics data in account.\n6d,e),  indicating that the statistics of natural movement rather than the  physical similarity of the configurations are critical for the models  goodness of fit.\nCross-validation was used to prevent over-fitting in this combined  model, with the mixture proportion for the two models estimated on  seven participants and the fit evaluated on the eighth.\nFinally, we determined whether the observed distance structure for  multi-finger movements could be predicted by a linear combination of  the single-finger representations.\nIn sum, these results strongly suggest that hand usage,  rather than anatomical constraints, shape the reliable cortical representations for both simple and complex finger movements.\n6 N and black squares indicating  that the finger had to stay relaxed on the  keyboard.\n(b,c) For the hand usage model,  the distance between two configurations C1 and  C2 will be small if they are similar to the same  synergy (b), and large if they associated with  different independent features of the underlying  joint movement distribution (c).\n(d,e) Correlation  between predicted and measured distances for  the multi-finger configuration task in M1 and  S1.\n(a) Averaged cocontraction (r.\nrelative to baseline) in the un-instructed fingers when  seven participants produced a 75% of maximal force with the instructed  finger.\nThe average inter-subject reliability  of the enslaving pattern was r = 0.\n(b) Spearman rank  correlation between the structure of force enslaving and the hand-usage  and muscle models.\nError bars indicate s.\nand gray region indicates  estimates of the upper and lower bounds of the best possible model fit.\nassociated with an isolated finger movement spreads to circuits  associated with normally co-occurring movements.\nHowever, during near-maximal or maximal voluntary contractions (MVCs), neighboring fingers often show co-contraction, or   enslaving24.\nWe therefore predicted that enslaving would be stronger  for finger pairs with similar activity patterns and weaker for pairs  with distinct patterns.\nTo test this idea, we asked seven participants to perform individuated finger presses at 75% of MVC (Online Methods).\n7a) shows the well-known co-contraction of neighboring   fingers24.\nEnslaving was also found between the thumb and little   finger, reminiscent of the smaller distance between thumb and little  finger pattern in the cortical representation.\nIndeed, the enslaving  structure correlated more negatively (that is, better, as small distances  predict stronger enslaving; Fig.\nThis result is consistent  with the notion that enslaving has, in part, a cortical origin2527.\nDISCUSSION Our results uncover an invariant representational structure for simple  and complex hand movements in M1 and S1.\nThe relative similarities   between activity patterns11,14 were preserved across individuals,  despite the substantial spatial inter-subject variability of the activity  patterns themselves.\nThe representational structure remained invariant even when the shared somatotopic arrangement of the digits  was removed from the data.\nThe representational structure could be predicted by the natural  statistics of hand use.\nEspecially for complex multi-finger movements,  the usage model outperformed a muscle model, which tested the  idea that two cortical activity patterns are similar simply because the  associated movements require similar muscles.\nThus, the inferior fit of the muscle model does not necessarily indicate  that M1 represents movements rather than muscles28, but that such  muscle representations must be highly structured.\nIndeed, our results  are compatible with the idea that representations of single muscles  are predictable from the correlations between muscle activities during  everyday movements9.\nHowever, because humans cannot voluntarily  activate individual hand muscles, we needed to base our predictions  on correlations between individual finger movements rather than  between individual muscles activations.\nTwo studies have shown that the movements elicited by cortical   stimulation resemble the main elements of everyday action7,9.\nOn  the contrary, if the cortex had simply evolved to optimally activate  neural synergies that are encoded in the spinal cord, then M1 would  have to produce two very different activity patterns to individuate two  fingers that normally move together29.\nWe found that the correlation  structure of everyday hand use also dictates the similarity structure of  cortical activity patterns.\nThe overlap of these patterns is most likely  determined by the strength of intra-cortical connections within M1.\nThe spread of activation along these connections could also explain  the patterns of muscle activity elicited by cortical stimulation9,30, as  well as the pattern of finger-enslaving at high force levels.\nThe higher spatial resolution at 7T allowed us to  resolve thumb and index finger representations better and improved  the fit of the hand-usage model.\nNonetheless, many important   aspects of the spatial activity structure may remain invisible to   fMRI investigations.\nA second limitation of our study was that the hand-usage model was  based only on movement kinematics and did not take into account  contact forces or sensory input.\nHowever, the similar representational  structures in M1 and S1 raise the possibility that the observed patterns  reflect, to a large degree, how sensory information from the skin,   muscles and tendons is represented on the cortical sheet.\nBecause   sensory input it most often caused by movement, it is likely that  the statistical structure of sensory input is tightly related to that of  movement.\nFurthermore, sensory information from each part of  the hand projects to the circuits involved in making the associated  movements31,32.\nIn fact, we observed high correlations in activity   patterns between movements and sensory stimulation5.\nThis tight  correspondence makes it difficult to experimentally dissociate   sensation and movement.\nOverall, our data provide a quantitative evaluation of the idea that  hand usage shape cortical representations15 and is consistent with the  idea that the invariant representational structure is the result of an  unsupervised learning process that arranges finger representations  on a two-dimensional cortical sheet.\nThe resulting activity patterns associated with independent  finger movements should therefore exhibit a correlational structure  that matches that of the correlations occurring during everyday use.\nGiven that the statistics of natural hand movements are very similar   across individuals10, this learning rule will tightly determine the   relationships between activity patches for different movements.\nIn contrast, the spatial arrangement of maps resulting from such a  learning process can be much more variable15.\nThis is because many  different spatial arrangements satisfy the same representational structure, and the choice between these possible solutions will be determined  only by slight differences in initial conditions.\nThus, invariances in the  spatial arrangement, such as the consistent ventral-dorsal somatotopic  organization of the digits must be determined by alternative mechanisms, such as molecular gradients during development35,36.\nOur results suggest that the intrinsic connectivity of motor cortex is shaped the probability distribution of its activation states37.\nQuantifying this invariant representational structure constitutes a  crucial first step toward understanding cortical changes associated  with learning, aging or disease.\nOReilly for help with the  acquisition of the 7T data set, and J.\nKrakauer for sharing the data regarding stability of finger  representations.\nFinally we thank J.\nSaleem for  helpful comments on the manuscript.\nThe research was supported by grants by the  Wellcome trust (094874/Z/10/Z) and James McDonnell foundation to J.\nThe Wellcome Trust Centre for Neuroimaging is supported by core funding from  the Wellcome Trust (091593/Z/10/Z).\nwere jointly responsible for design of experiments, analysis  and writing of the manuscript.\ncontributed the data for the multi-finger  experiment and M.\nwas instrumental in the muscle activity recording.\nLocalization of the motor hand area to a knob on the precentral  gyrus.\nHow somatotopic is the motor cortex hand area?.\nScience 261, 489492 (1993).\nMotor cortex and the distributed anatomy of finger movements.\nIntegration of sensory and motor.\nOn somatotopic representation centers for finger.\nModular organization of finger movements by the human.\nEncoding of motor skill in the corticomuscular system of musicians.\na handful of muscle synergies.\nrepresentations for individuated finger movements.\nCortex 23, 13621377  (2013).\nMapping behavioral repertoire onto the cortex.\nPostural hand synergies for tool use.\nand the influence of sensory guidance.\nThe neural basis of functional brain imaging signals.\ntranscranial direct current stimulation enhances effector-independent representations  of motor synergy and sequence learning.\nCoordinated force production in multi-finger.\ntasks: finger interaction and neural network modeling.\nEnslaving effects in multi-finger force.\nmechanical coupling versus active neuromuscular control.\nLimits to the control of the human thumb.\nand fingers in flexion and extension.\nthe primary motor cortex.\nStimulating news about modular motor control.\nPeripheral afferent inputs to the forelimb area of the monkey.\nVariety of functional organization within the monkey motor cortex.\nA dimension reduction framework for understanding.\nOptimal unsupervised motor learning for dimensionality reduction of.\nCortex 9, 586600 (1999).\nSpontaneous cortical activity reveals hallmarks.\nof an optimal internal model of the environment.\nONLINE METHODS All experimental procedures were approved by the research ethics committees at   University College London, Johns Hopkins University, Columbia University and  University of Zurich.\nNo power calculation was used to pre-determine sample sizes  but our sample sizes are similar to those reported in previous publications12.\nSix healthy right-handed participants (two females, four males,  mean age = 25.\n1) performed individuated finger movements using  both their left and right hands.\nParticipants placed their fingers on a custom-built  keyboard device with ten piano-like keys.\nEach key was equipped with a force  transducer (Honeywell FS series) that measured the applied force with a repeatability of <0.\nVisual feedback was provided via a back projection screen.\nEach trial started with the presentation of a keyboard outline with the target  key highlighted in green for 1.\nThe instruction was then removed and a gocue signaled participants to make a short isometric force press with the instructed  finger.\nThe finger press needed to exceed 2.\n3 N, in which case the cue turned blue.\n36 s, the cue turned white again, signaling the next finger press.\nDuring task performance, functional images were acquired using a 3T Siemens  TRIO scanner with a 32-channel head coil.\nFor each participant, eight runs were  conducted, using a two-dimensional echo-planar imaging sequence (TR = 2.\nEach run consisted of three repetitions of each of the  ten fingers in random order, plus five randomly interspersed rest phases lasting 13.\nA T1-weighted anatomical scan (3D MPRAGE sequence, 1-mm  isotropic, 240  256  176 mm FOV) was also acquired.\nNine healthy control  participants were scanned four times over the course of a 6-month period, at  weeks 0, 4, 12 and 24, performing the single finger task with their left and right  hands.\nOtherwise, the protocol was  identical to the one described above, although only four fingers (excluding the  ring finger) were tested.\nAll functional scans were aligned to the anatomical image  obtained in the first testing session and re-sliced into the same voxel space.\nSeven subjects (four females, three  males, mean age = 25.\n6) were placed inside a Siemens 7T scanner (FMRIB).\n4-mm isotropic resolution  (TR = 3.\n0 s, 47 slices, 107 volumes per run).\nThe multi-finger experiment was similar in  structure to the 3T single-finger experiment and consisted of eight healthy righthanded participants (four male, four female, mean age = 23.\nFollowing  training, participants then performed the multi-finger task inside the scanner  while functional imaging data was collected.\nFollowing the presentation of the instruction cue, which showed the target  finger highlighted in green (2 s), participants made three short isometric presses  of the instructed finger configuration.\nParticipants were required to maintain a  baseline force of 0.\n6 N on each of  the instructed fingers.\nEach trial lasted 13.\nEach participant was scanned  over three sessions (1.\nThe activation of each trial was modeled using a boxcar function (duration: 8 s for single-finger,  10.\n8 s for multi-finger task) and convolved with a standard hemodynamic response  function.\nThe regression parameter estimates and residuals from this analysis were  then used to calculate the distance measures and pattern correlations (see below).\nSurfaces were registered across participants and  hemispheres using spherical alignment.\nIndividual surfaces were morphed to  match a template, first in terms of the sulcal depth map, and in a second step in  terms of the local curvature, resulting in a nearly perfect overlap of the fundus of  the central sulcus across participants39 (Supplementary Fig.\nThe anatomical regions of interest (ROIs) were defined on the group surface  using probabilistic cytoarchitectonic maps aligned to the average surface40.\nThese  regions were then projected into the individual brains via the reconstructed individual anatomical surfaces.\nThis approach ensures a precise definition of ROIs,  respecting the individuals folding anatomy.\nTo analyze the hand representation in  M1, all surface nodes with the highest probability for Brodmann area (BA 4) 2 cm  above and below the hand knob1 were selected.\nSimilarly, the hand region in S1  was isolated using BA 3a, 3b, 1 and 2 (combined), again 2 cm above and below the  hand knob.\nTo avoid possible contamination of signals across the central sulcus,  all voxels that had more than 25% of their volume located on the opposite side  of the sulcus were excluded.\nTo evaluate the within-subject reliability of activation maps, we split the  functional data into two halves (odd and even runs) and subtracted the  mean activity pattern (averaged across fingers) from each half.\nTo evaluate the consistency of activation maps across participants, we calculated the average correlation between all possible aligned functional maps  of the same finger.\nTo make the correlations comparable to the within-person  correlations, each map was based on half the data and each pairing of halves  was used.\nFor inter-subject alignment, we initially relied on anatomically driven   normalization (see above), which superimposed the hand knob area well across  participants (Supplementary Fig.\nWe also judged the functional alignment,  by mapping the average pattern distance (see distance measures), averaged over  all 10 digit pairs, onto the flat-map (Supplementary Fig.\nAreas with large  distance indicate regions in which movements of single fingers evoked significantly different activity patterns.\nTo further improve the inter-subject alignment,  we started from the solution found by anatomical normalization and then locally  optimized (on 5  5-cm large sheet around the hand area) the correlation between  functional distance maps of each participant/hemisphere and a group-averaged  functional map.\nThe shifts of the maps required for the improved functional  alignment were on average 0.\n67 mm) in each of the spatial directions.\nEven though these shifts were rather small, they led to some increases in the  correlation between the finger-specific patterns across participants.\nThe stability of the digit-specific activity  patterns was also estimated by dividing the data from each session into odd  and even runs.\nFor each ROI, we then calculated the voxel-by-voxel correlation between patterns associated with the same finger, either between the two  halves in a single session (within-session correlation) or between any of the  halves of two different sessions (between-session correlation).\nIf the activity  patterns did not change at all, the correlation between session i and j should be  as high as the within-session correlations for each session, or, more precisely,  equal to the geometric mean of the split-half correlations for session i and j,  r r r i j i i j j , , , =.\nThis value therefore constitutes a reference value for absolutely.\nnpg  2015 Nature America, Inc.\nThe dissimilarity between the activation patterns was   measured for each finger pair (xi, xj) within each hand using the cross-validated  Mahalanobis distance13.\nHere we  calculated the distances using each possible pair of imaging runs and then averaged the resulting distances.\nTherefore, the average inter-digit distance can be taken as a functional  criterion to detect regions that differentiate between the finger movements of  a hand.\nSimilar results were also obtained when using correlations between activity  patterns as a distance measure, with large correlations corresponding to small  distances.\nWe used here Mahalanobis distances, as they take into account the  multivariate noise structure and do not dependent on the activity baseline.\nInter-subject invariance of the distance structure was quantified by calculating  the correlation of the ten distances (for each digit pair) across all possible pairs of  participants.\nThe calculation excluded the diagonal of the dissimilarity matrix.\nTo visualize the distances between all possible finger pairs, we used classical  multidimensional scaling (MDS).\nMDS projects the N-dimensional dissimilarity  matrix into a lower-dimensional space such that the distances between finger pairs  are preserved as well as possible43.\nMDS was performed on data from individual  participants, and the projections averaged after Procrustes alignment.\nBecause  Procrustes alignment does not only remove the arbitrary rotation induced by  MDS, but also some of the true inter-subject differences, the standard errorellipses in all MDS plots were inflated by 1.\n9, a factor estimated in Monte-Carlo  studies using the structure and noise level found in this data set.\nStatistical analysis of correlations.\nCorrelations between activity patterns (across  voxels) or correlations between distances (across finger pairs) were calculated for  each participant/hemisphere separately.\nWe Fisher Z-transformed these values and  then calculated the mean and standard error.\nAssuming normality, we could then  determine the lower and upper bounds of the 95% confidence interval.\nThe mean  and the bounds were transformed back into correlations and reported as such in  the text.\nAll statistical tests were performed on Fisher Z-transformed values.\nGiven that the cortical pattern distances were estimated in the presence of measurement noise, even a perfect model  would not result in a correlation of 1 with the distance estimates from each subject.\nTo estimate a noise ceiling for the fits, we calculated the average correlation  of each individual distance structure with the group mean13, where the group  mean serves as a surrogate for the perfect model.\nBecause the individual distance  structure is also averaged into this group mean, this value slightly overestimates  the true ceiling.\nAs a lower bound, each individual distance structure was also  correlated with the group mean in which this individual was removed.\nThe statistics for naturalistic hand  movements in humans were taken from two independent studies.\nAll reported  model fits were based on a first study10, in which six healthy male subjects   (ages 3143) wore a cloth glove with imbedded motion sensors (CyberGlove,  Virtual Technologies) while they pursued everyday activities.\nHand movement  statistics were collected for each participant across multiple sessions, on average  for 2.\nThe sensors measured the angular positions across the  19 degrees of freedom of the hand continuously at 83 Hz.\nBecause our finger  presses were mostly generated using the MCP joints, only data from these five  channels were used.\nThe second study22 was used to assess differences of natural statistics across  hands.\nEight healthy right-handed participants performed everyday tasks within  a bedroom, kitchen and office environment, while kinematic data was recorded  simultaneously from both hands.\nAs with the previous study, only data from the  five channels corresponding to the MCP joints was used.\nFor the single finger-experiment, we used  the velocity time series corresponding to the MCP joints of the five fingers.\nTo account for differences in scaling, each vector was normalized to a length   of 1.\nFor the multi-finger experiment,  MCP velocities were first averaged for all instructed fingers for each configuration, and then the distances between these 31 normalized time series were  calculated as for the single-finger model.\nFor this model, we assumed that the finger activation  patches were arranged linearly and equidistant along the cortical sheet and had  the shape of a Gaussian kernel with the same width.\nThe degree of overlap was  estimated to best fit the pattern distances from each participant.\nWe then calculated the Euclidean distance between the Gaussian finger activation patterns, as  for the experimental data.\nInstead of assuming an equidistant arrangement, we also attempted to estimate  the centers of the kernels by determining the center-of-gravity for each finger on  the two-dimensional surface from the actual data.\nThe resulting correlations of  this model with the real cortical pattern distances, however, were lower than for  the equidistant arrangement.\nSeven healthy volunteers (different from the imaging  participants, one male, six female, mean age = 23.\nSimilar to the imaging task, participants were required to  produce isometric forces, with either individual or multiple fingers, at a level  specified by 25% of MVC for each finger (average finger forces, 4.\nEach  trial consisted of a short announce phase (23 s) following which the subject had  to press and maintain force on the instructed finger(s) for approximately 34 s.\nA total of 15 blocks were measured per participant, each block containing a single  repetition per trial type (participant 6 had only ten blocks).\nMuscle activity was recorded using 14 high-density Ag/AgCl electrodes in  a belly-tendon montage while the participant performed the task.\nThe signal  from each electrode was sampled at 1,000 Hz, de-meaned, rectified and low-pass  filtered (fourth order butterworth filter, fc = 40 Hz).\n5-s time window starting from  the time when the instructed finger(s) first moved.\nAs for the fMRI analysis, cross-validated Mahalanobis distances  (equation (1)) were used to determine the similarity of movements in muscle  space.\nThe only assumption that needs to be made is that the measured signals   (y, a 14x1 vector) reflect an arbitrary linear mixture of activity of a set of muscles  or muscle groups (x), y = Ax.\nThis holds for any arbitrary A, as long as it is invertible (that is, as long as we  measure with as many electrodes as muscle groups of interest).\nThe average intersubject reliability of the distance measure for the multi-finger experiment was   r = 0.\n742), providing evidence that a reasonable degree of invariance was indeed achieved.\nProduction of individuated finger movements requires the co-activation of  specific combinations of muscles.\nThe muscle model tested whether the representational structure can be explained by the correlation structure of muscle  activity alone, without assuming any special correlation structure that is imposed  by usage.\nBecause both EMG signals and fMRI signals are weighted by their  reliability (implicit in the Mahalanobis distance), this model also assumes that a  muscle or muscle group that is reliably activated during the task would also have  a reliable cortical representation.\nOne concern in the comparison  of hand usage and muscle and models is that their predictions are derived from  measured and therefore potentially noisy data.\nparticipant or due to noise (se 2).\nGiven the independence of different participants, the  reliability of the averaged muscle model can be estimated to be r = 0.\n942, roughly  matching the reliability of a single subject for the natural statistics data.\nDespite nearly equated reliability, the cortical distances correlated significantly better with prediction of the hand usage model (averaged over individual   subjects from the natural statistics data set) than with the average prediction   from the muscle model, both for M1, t7 = 7.\n1, and for S1,   t7 = 4.\nestimating finger independence during movement.\nTo estimate the degree of  co-contraction of adjacent fingers, the participants of the muscle recording study  performed the same task at 75% MVC.\nAveraged across fingers, participants  produced forces of 14.\nforce deviation for each uninstructed  finger from the pre-trial baseline was calculated.\nThese values were then arranged  in an enslaving matrix that shows the involuntary force change across passive  fingers for presses of the instructed finger.\nGiven the symmetry of the handusage and muscle models, this matrix was symmetrized for model comparison  purposes.\nSpearman-rank correlations were used for model evaluation, as a linear  relationship could not be assumed.\nImproved estimation of the covariance matrix of stock   returns with an application to portfolio selection.\nFinance 10, 603621  (2003).\nModern Multidimensional Scaling: Theory and Applications  (Springer-Verlag, New York, 2005)."}