{"title": "38.pdf", "contents": "Low back skin sensitivity has minimal impact on active lumbar  spine proprioception and stability in healthy adults.\ndemonstrate that treating the skin of the low back with an  EMLA anesthetic can effectively decrease the cutaneous  sensitivity of low back region.\nFurther, these decreases in  peripheral cutaneous sensitivity are similar in magnitude  to those reported in CLBP patients.\nWithin this healthy  population, decreased cutaneous sensitivity of the low back  region has minimal influence on active lumbar spine proprioception, neuromuscular control and dynamic stability.\nTo complete dynamic motor tasks and ensure adequate  stability of the lumbar spine, sensitivity of the proprioceptive and kinesthetic systems is necessary.\nSensory  feedback systems, which facilitate coordinated and stable  movement patterns, include inputs from visual, vestibular,  cutaneous, ligamentous and muscular subsystems (Proske  and Gandevia 2012).\nIn the absence of visual information,  ones body representation in space (proprioception) has  primarily been attributed to muscular receptors whereas  a complimentary, supplementary or substitutory role has  been attributed to more peripheral receptors, such as those  within the skin (Aimonetti et al.\n2012; Kavounoudias et al.\n2001; Proske and Gandevia 2012).\nIn particular, previous  research has classified these skin receptors into separate  groups responding independently to target biologically relevant phenomena (Johansson et al.\n1982; Johansson and  Vallbo 1979; Morioka et al.\nThese receptors include  rapidly adapting Meissner and Pacinian corpuscles which  respond to skin slips/lateral movements and high-frequency.\nAbstract The purpose of the current work was to (1)  determine whether low back cutaneous sensitivity could  be reduced through the use of a topical lidocaineprilocaine anesthetic (EMLA) to mirror reductions reported  in chronic lower back pain (CLBP) patients, as well as to  (2) identify whether reductions in cutaneous sensitivity  resulted in decreased lumbar spine proprioception, neuromuscular control and dynamic stability.\nTwenty-eight  healthy participants were divided equally into matched  EMLA and PLACEBO treatment groups.\nGroups completed cutaneous minimum monofilament and two-point  discrimination (TPD) threshold tests, as well as tests of  sagittal and axial lumbar spine active repositioning error,  seated balance and repeated lifting dynamic stability.\nThese  tests were administered both before and after the application of an EMLA or PLACEBO treatment.\nResults show  that low back minimum monofilament and TPD thresholds  were significantly increased within the EMLA group.\nSkin  sensitivity remained unchanged in the PLACEBO group.\nIn the EMLA group, decreases in low back cutaneous sensitivity had minimal effect on low back proprioception  (active sagittal and axial repositioning) and dynamic stability (seated balance and repeated lifting).\nIn chronic lower back pain  (CLBP) patients, previous research has noted a decrease in  the cutaneous sensitivity of low back using two-point discrimination tests (Moseley 2008; Catley et al.\nPrevious works have demonstrated that CLBP patients  have diminished tactile sensitivity atop the skin of the  low back, paired with encumbered motor strategies of the  lumbopelvic region (Luomajoki and Moseley 2011; Moseley 2008; Catley et al.\nIt is possible that the deficits in tactile acuity stem from reorganization within the  somatosensory cortex (Flor et al.\n1997; Lloyd et al.\n2008),  changes in peripheral receptor sensitivity (such as is the  case in diabetic neuropathies) or some combination of both  factors.\nBased on these findings, recent research has begun  to suggest that sensory retraining paradigms that target  tactile sensitivity of a painful region can assist in reducing  perceptions of pain as well as improving the motor control  of the lumbar spine.\nThese paradigms appear to be especially promising when paired with conventional physiotherapy style training paradigms (Wlti et al.\nIt  is currently unknown, however, whether the tactile acuity  deficits observed in CLBP (as well as the effects of tactile  sensory retraining) act through peripheral (e.\nAs a means to modulate cutaneous sensory feedback,  previous works have employed the use of an anesthetic to  decrease/eliminate cutaneous sensitivity from a particular  anatomical area (Bjrkman et al.\nWith this idealized  removal of skin information, researchers are able to speculate on how the eliminated cutaneous mechanosensitive  feedback contributes to the control of posture, dynamic  movement or proprioception.\ncan also infer whether individuals are able to cope with the  loss of accessible sensory information with an increase in  the reliance on information originating from the remaining senses.\nBased on this, the primary goals of the present  study were to (1) discern whether decreases in lumbar tactile acuity (as a result of the EMLA treatment) in healthy  participants could mirror those reported in CLBP patients,  as well as to (2) identify whether these peripheral tactile  insensitivities alone would result in larger movement variability, decreased stability and decreased proprioception of  the lumbar spine.\nAll participants  (n = 28) completed a health screening questionnaire and  signed informed consent prior to data collection.\nThe first half an hour  was allotted for instruction and practice of the experimental tasks as well as for the consent process.\nThe remaining  4 h was used for skin sensitivity, proprioceptive and stability testing procedures as well as the administration of the  anesthetic or placebo skin treatment (Fig.\nThe order  of proprioceptive and stability tasks were randomized and  balanced between participants and were held in a constant  order during repeated assessments within each participant.\n1 g/cm2 atop the skin of the low back for a  period of 2 h.\nGroup Height (cm) Weight (kg) Age (years) Dose area (cm).\n2217 Exp Brain Res (2016) 234:22152226.\nThis anatomical location  was targeted due to reports of decreased cutaneous sensitivity in CLBP patients within this region (Luomajoki and  Moseley 2011; Moseley 2008).\nThe average dose area for  each participant group is presented in Table 1.\nDuring the  administration of the EMLA or PLACEBO treatment, all  participants, and experimenters taking any measurements,  were blinded to the type of skin treatment cream.\nCutaneous sensitivity was measured across three separate  assessments relative to the application of either the EMLA  or PLACEBO treatment cream.\nThese assessments included  measures prior to cream application (PRE-SENS), immediately following cream removal (POST-SENS1) as well as  immediately following the completion of the second round.\nThe POST-SENS1 and POST-SENS2 assessments  were separated in time by ~4045 min.\nControl test locations (outside of dose area) were assessed at the T9 level  both immediately superior to the vertebral spinous process  (T9SP) and superior to the right-side paraspinal muscle  belly (T9MB).\nExperimental test locations (within dose  area) were assessed at the L1 and L4 vertebral levels, again  both superior to the vertebral spinous process (e.\n, L1SP)  and muscle belly (e.\nPrior to any cutaneous  sensitivity tests, each test location was lightly shaved with  a disposable razor, with care not to abrade the skin.\n2010) as well as a two-point discrimination (TPD)  threshold test (e.\nMMTS tests were completed at  six anatomical test locations including T9SP, T9MB, L1SP,  L1MB, L4SP and L4MB.\nTPD tests were completed in a  superiorinferior orientation at two anatomical test locations, T9MB and L4MB.\nBoth the MMTS and TPD tests  utilized a modified stepwise 4-2-1 approach (Dyck et al.\n1993) such that minimum sensitivity threshold was defined  as a 66 % success rate (e.\nThe first tests were completed prior to cream application, immediately following  the cutaneous sensitivity assessments (PRE), while the  second tests were completed following cream removal,  again immediately following the cutaneous sensitivity  tests (POST).\nSagittal repositioning was performed while seated  in a kneeling chair, while axial repositioning was performed while seated upright on a twisting platform.\nFor  each task, participants were required to (without the use  of vision, at a self-selected pace) either flex or rightward  twist, away from their starting neutral position, toward  a random target within ~10 of each participants neutral  range of motion (ROM).\nAfter holding this target for ~2 s,  participants were required to flex/twist to their end ROM  and hold this position again for ~2 s.\nNext, participants  were instructed to begin moving back toward the neutral  position and, however, were instructed to pause for an additional ~2 s when they believed they were repositioned at  the original target location (Fig.\nTests included i minimum  monofilament tactile sensitivity (MMTS) and two-point discrimination  (TPD) threshold testing both within (L1 and L4) and outside  (T9) of the experimental test area (dashed box), ii proprioceptive acuity testing for both flexion/extension and axial twisting movements  and iii dynamic stability estimation during both seated stability and  repetitive sagittal lifting tasks.\nand axial repositioning tests was repeated five times at both  PRE and POST assessments.\nAxial repositioning kinematic data  were acquired from a rigid body placed on the twist platform.\nBoth sets of kinematic data were sampled at 100 Hz  (Optotrak 3D Investigator, Northern Digital, Waterloo, ON,  Canada).\nSimilar to the proprioceptive acuity tests, each lumbar  spine stability test was completed at the same PRE and  POST assessments.\nStability tests included both a seated  balance (e.\n2010) test  as well as a repeated sagittal lifting (e.\n2014; Graham et al.\nFor the  seated balance assessment, participants sat atop a hemispherical wobble board (10 cm radius) placed on a force  platform (True Impulse, Northern Digital, Waterloo, ON,  Canada); data were sampled at 50 Hz for 60 s.\nParticipants  were instructed to remain as stable as possible with their  arms crossed against their chest and legs strapped together  at the knees and ankles to minimize potential compensatory leg movements.\nEach seated balance test was repeated  five times at both the PRE and POST assessments.\nFor the  repeated sagittal lifting test, participants were required to  lift a light load (4.\nTo quantify 3D lumbar spine  angles (for the sagittal plane repositioning task as well as  the repeated lifting task), a flexion/extension (FE), lateral  bend (LB), axial twist (AT) Cardan rotational sequence  was implemented.\nFor the repeated lifting test, these 3D  lumbar spine angular data were used in the estimation of  lumbar FE, LB and AT ROM as well as FE, LB and AT  ROM variability (standard deviation of each repeated lift  to lift ROM).\nUsing these CoP waveforms, AP  and ML displacements and velocities were quantified and  assessed using maximum range, root mean square (RMS)  and cumulative path length outcome parameters (e.\nCE  values assess a participants tendency toward over-/undershooting the target angle such that positive values represent  the magnitude (in degrees) of overshoot.\nAE values quantify  the amount of error, irrespective of direction (AE = |CE|),  associated with active repositioning and quantifies the proprioceptive accuracy.\nVE values quantify the variability  (standard deviation) in CE values and quantify proprioceptive precision throughout repeated measurements.\nPrevious  research has demonstrated good within-session reproducibility (0.\n73) for active  repositioning measurements, particularly within the axial  plane (e.\nLocal dynamic stability (LDS).\nTo estimate the LDS, the maximum finite-time Lyapunov exponent (LyE) was calculated for each seated balance and repeated lifting time series.\n1993),  positive LyEs are indicative of dissipative (unstable)  dynamics and deterministic chaos whereas negative LyEs  are representative of convergent (stable) dynamics (Stergiou et al.\nThese estimates have been used previously in the analysis of trunk movements during walking  (e.\n2009; Dingwell and Cusumano 2000),  joint movements during repeated lifting (e.\n, Graham and  Brown 2012) and walking (Beaudette et al.\n2015), as well  as during standing balance tests (Roerdink et al.\nThe time series data used to estimate LDS were Euclidean norm lumbar spine angles during the repeated lifting.\nmovements, as well as AP and ML CoP displacement data  during the seated balance tasks.\nTo best ensure steadystate repeated lifting dynamics, lifts 15 were excluded.\nSimilarly, to mitigate any data collection initiation/termination effects, the first and last 5 s of each seated balance trial were excluded.\nFor repeated lifting, a time delay  (Td) of 10 % of a lifting cycle was used, paired with an  embedding dimension (dE) of 6, estimated using a global  false nearest neighbors (GFNN) analysis (Kennel et al.\nLyE values for the repeated lifting movements  were approximated from the average local divergence  curve between 0 and 0.\n5 lifting cycles to mirror previous  analyses (Beaudette et al.\n2014; Graham et al.\n2012a, b;  Graham and Brown 2012).\nFor seated balance, a Td of 11  and 10 frames was used for the AP and ML CoP displacement data, respectively, paired with a dE of eight.\nAll of these analyses were performed using custom software developed in MATLAB (The MathWorks,  Natick MA, USA).\nAll statistical analyses were performed  using SAS 9.\n2 (SAS Institute, Cary NC, USA).\nWithin the EMLA group, there was a significant twoway  PRE-SENS/POST-SENS1/POST-SENS2  assessment  location interaction for both the MMTS  (F-ratio = 2.\n0243) and TPD (F-ratio = 9.\nPost hoc tests revealed that the  EMLA treatment induced significantly higher MMTS and  TPD thresholds, indicating reduced sensitivity, within the  test locations, especially at POST-SENS1.\nSpecifically, participants in the EMLA group had larger MMTS thresholds  at the L1SP (p = 0.\n0434) and L4SP (p = 0.\nAll MMTS and TPD measurements at the control T9 level  (T9SP or T9MB) were unaffected by the EMLA treatment.\nWithin the PLACEBO group, MMTS thresholds were constant across all PRE-SENS/POST-SENS1/POST-SENS1  assessments (F-ratio = 0.\nTPD  data from the PLACEBO participant group were observed  to differ significantly based on location (F-ratio = 4.\n0433); however, were unaffected based on the PRESENS/POST-SENS1/POST-SENS2 assessment being analyzed (F-ratio = 0.\nPost hoc tests revealed  that TPD thresholds at the L4MB level (28.\n9 mm) in  the PLACEBO participant group (Fig.\nWithin the EMLA group, sagittal repositioning estimates  of CE (F-ratio = 0.\n9158), AE (F-ratio = 1.\n2742) or VE (F-ratio = 0.\nSimilarly, within  the PLACEBO group, sagittal repositioning estimates  of CE (F-ratio = 1.\n2819), AE (F-ratio = 0.\n5081) and VE (F-ratio = 0.\n8187) were  again unaffected by PRE/POST assessment.\nFor the EMLA  group, axial repositioning estimates of VE were observed  to differ significantly between PRE and POST assessments  (F-ratio = 7.\n9918) estimates  were unaffected.\nSpecifically, within the EMLA group  axial VE data, post hoc analyses revealed participants  had significantly larger VE during POST when compared.\nto PRE (Table 2).\nFor the PLACEBO group, axial repositioning estimates of CE (F-ratio = 0.\n6645),  AE (F-ratio < 0.\n9748) and VE (F-ratio = 0.\n3290) were all unaffected by the PRE/POST assessment.\nWithin the EMLA group, seated balance outcomes of  CoP AP velocity range (F-ratio = 7.\nAP velocity RMS (F-ratio = 4.\n0327) were  observed to differ significantly across PRE/POST assessments.\nFurther, within the EMLA group, estimates of CoP  path length (F-ratio = 3.\n0596) and ML LyE  (F-ratio = 2.\n0861) tended toward being different across PRE/POST assessments.\nSpecifically, post hoc  tests revealed that CoP AP velocity ranges and AP velocity RMS were larger during PRE when compared to POST.\nSimilar trends were observed for the CoP path length and  ML LyE estimates.\nNote  that an increased threshold  indicates a decreased sensitivity.\nAsterisks show  significant post hoc differences (p < 0.\n05) relative to the  PRE-SENS assessment at each  location.\nAll data are presented  as mean  SEM.\nbalance estimates of AP LyE were observed to differ significantly across PRE/POST assessments (F-ratio = 8.\n0883), ML velocity range  (F-ratio = 2.\n0868) and ML velocity RMS  (F-ratio = 2.\n0924) tended toward being different across PRE/POST assessments.\nSpecifically, post hoc  tests revealed that the AP LyE estimate was significantly.\nlarger during PRE when compared to POST.\nFurther, similar trends were observed for CoP AP velocity range, ML  velocity range and ML velocity RMS.\nFor both the EMLA and PLACEBO participant groups, all repeated lifting dependent  variables (FE, LB and AT range and variability as well as  LyE) were unaffected by each PRE/POST assessment.\nAll  repeated lifting data are given in Table 4.\nNote that  an increased threshold indicated  a decreased sensitivity.\nAsterisks  show significant post hoc differences (p < 0.\n05) either between  locations or relative to the  PRE-SENS assessment at each  location.\nAll data are presented  as mean  SEM.\nError estimates include constant errors (CE), absolute errors (AE) and variable errors (VE) for each of the EMLA and PLACEBO participant  groups.\n* Significance at the p < 0.\nAssessment Treatment Outcome PRE () POST () F-ratio (p value) Effect size (d).\nNote that a smaller LyE value represents an increase in stability.\n* Significant PRE/POST assessment differences at the p < 0.\nComparisons tending toward being different across PRE/POST assessments (p < 0.\n26 ML range (cm) 1.\n26 Cumulative path length (cm) 96.\n55 PLACEBO AP range (cm) 1.\n30 ML range (cm) 1.\n34 AP RMS (cm) 0.\n16 ML RMS (cm) 0.\n2223 Exp Brain Res (2016) 234:22152226.\nThe primary goals of the present study were to (1) determine whether topical anesthesia (EMLA) atop the skin of  the low back had the capacity to decrease cutaneous mechanosensitivity (mirroring cutaneous insensitivities observed  in CLBP patients) and (2) to assess whether this decrease  in cutaneous sensitivity of the low back influenced estimates of lumbar spine proprioception, dynamic movement  control and LDS in a group of healthy young adults.\nWe  were able to confirm a decrease in cutaneous sensitivity in  response to an EMLA treatment; however, we were unable  to detect any consistent declines in lumbar spine proprioception, dynamic movement control or LDS in response to  decreased skin sensitivity.\nIn accordance with our first hypothesis, the EMLA topical anesthetic decreased cutaneous sensitivity based on our  estimates of MMTS and TPD thresholds (Figs.\nInspecting our POST-SENS1 cutaneous assessments, the  current data show that EMLA induced an average increase  in MMTS threshold of 6462 %, paired with an average  increase in TPD threshold of 200 %, across all test locations (e.\n, L1 and L4) relative to the original PRE-SENS  assessment.\nThis cutaneous insensitivity persisted until  our final POST-SENS2 cutaneous assessment for both  the MMTS (2038 % increase) and TPD (175 % increase)  threshold measures.\n5 cm2) to contribute to any sensory  feedback needed to control dynamic movement of the lumbar spine.\nThese reductions are similar to those shown previously using topical anesthesia to decrease the cutaneous.\n2015; Lowrey et al.\nIn partial accordance with our second hypothesis,  decreased cutaneous sensitivity of the skin of the low back  resulted in decreased axial repositioning precision (VE)  within our EMLA treatment group (Table 2).\nThis suggests that the cutaneous information from the skin of the  low back may be used, to some degree, to provide feedback for the precision of active movements of the lumbar  spine within the axial plane.\nTherefore, it is possible that feedback from  the skin of the low back serves a larger role within these  axial plane tasks, and further, removal of cutaneous sensory  feedback has some effect.\nHowever, overall, any potential  effects of the decreased cutaneous sensitivity were limited,  as no other variables assessed within the current paradigm  demonstrated a significant effect.\nFurther, the small effect  sizes (Cohens D) preversus post-EMLA application support the notion of a lack of a clinically significant impact.\nd effect size (Cohens d).\nTreatment Outcome PRE POST F-ratio (p value) Effect size (d).\n48 FE ROM variability () 3.\n22 PLACEBO FE ROM () 26.\n19 FE ROM variability () 2.\n32 LB ROM variability () 1.\n23 AT ROM variability () 0.\n2015), it is possible that our anesthesia treatment was too focal and that other areas of skin (or other  sensory systems) were able to compensate for the decreased  low back cutaneous sensitivity.\nIt is also possible that under  different circumstances (e.\n, during standing balance), the  contribution of cutaneous sensory feedback may have a  more profound effect in the maintenance of lumbar spine  proprioception or stability.\nContrary to our second hypothesis, it is clear that a  decreased sensitivity of the skin of the low back has no significant effect on estimates of active sagittal repositioning  error (Table 2), seated balance (Table 3) or repeated lifting  (Table 4).\nThrough previous research, active sagittal repositioning tests have been shown to be sensitive to vibrational  sensory perturbations in healthy participants (Brumagne  et al.\n2000; Hidalgo et al.\n2013); however, cutaneous sensory perturbations (such as taping techniques designed to  illicit skin stretch) have shown mixed results (Hidalgo et al.\n2013; Ruggiero et al.\nSeated balance tests, similar  to those used in the current paradigm, have also been used  previously in the analysis of trunk stiffening (Reeves et al.\n2015) and movement pace  (Granata and England 2006).\nTherefore, these tests of lumbar spine movement control have been shown previously  to be sensitive to various sensory perturbations and task  demands.\nThe current results demonstrate that information  from the skin of the low back has little effect in providing feedback for dynamic movements of the lumbar spine,  especially when the necessary muscular activation is relatively large (e.\n, seated balance, repeated lifting), or when  the motion is within the sagittal plane (e.\n, sagittal repositioning or repeated lifting).\n, muscle spindle sensory feedback).\nThis reliance on muscle-mediated feedback  within sagittal plane movements has been noted during previous research using vibrational interventions designed to  target muscle spindle sensory channels (e.\n2013, 2015; Kiers et al.\n2014, 2015; Willigenburg et al.\n2012; Willigenburg et al.\nAlthough healthy participants were studied the current research, the data from the  present study suggest that the peripheral tactile insensitivities, observed within CLBP patients, alone cannot account.\nfor the reported changes in lumbar spine movement control.\nIt is possible, however, that cortical changes (e.\n1997; Lloyd et al.\n2008; Tsao et al.\n2011) or changes  to other sensory systems may drive the movement control  deficits observed in CLBP groups.\nIn interpreting the results of this study, there are some  limitations to consider.\nHowever, the  current MMTS data demonstrate that even if the desensitization brought on by the EMLA anesthetic was reduced  at the POST-SENS2 assessment, its effects are still present  (2038 % increase in MMTS threshold at POST-SENS2  relative to PRE-SENS).\nSecond, due to the maximum dose  suggested by the EMLA manufacturers (400 cm2), it was  only possible to anesthetize a relatively small area of the  low back (Table 1).\nThird, it is apparent within our seated balance data  that both participants groups improved at the task between  our PRE and POST time points (Table 3).\nHowever, as  this was true for both our EMLA and PLACEBO groups,  it does not impact our ability to address the influence of  decreased cutaneous sensitivity on this task.\nThese tasks were  chosen as: (1) they are functional in nature and (2) best  represent movements in which motor control deficiencies  have been detected in CLBP populations.\nHowever, we  were most interested in an ecologically relevant, real-world  scenario in which any potential use of cutaneous sensory  information would occur in addition to readily available  information from other remaining senses.\nIn conclusion, the current work demonstrates that over-thecounter, topical lidocaineprilocaine-based anesthetic (1)  can effectively decrease the cutaneous sensitivity of low  back region and (2) has a minimal effect on low back proprioceptive and movement capability during active tasks.\nThe decreases in low back cutaneous sensitivity observed  here mirror those reported in CLBP patients.\nwith recurrent CLBP, it appears that peripheral cutaneous insensitivities alone cannot explain declines in lumbar  spine motor control.\nIt is possible that higher level cortical changes drive any motor declines associated with tactile  insensitivity and that benefits from tactile sensory retraining modalities necessitate more than simple changes in  peripheral sensitivity alone.\nAcknowledgments This project was funded by the Natural Sciences and Engineering Research Council (NSERC) of Canada.\nLeah Bent and Nicholas Strzalkowski for discussions related to the topics addressed in this work.\nConflict of interest The authors declare that there are no conflicts  of interest.\nExp Brain Res 221:167176 Beaudette SM, Graham RB, Brown SHM (2014) The effect of unstable loading versus unstable support conditions on spine rotational stiffness and spine stability during repetitive lifting.\nJ Biomech 47:491496 Beaudette SM, Worden TA, Kamphuis M, Vallis LA, Brown SHM  (2015) Local dynamic joint stability during human treadmill  walking in response to lower limb segmental loading perturbations.\nJ Biomech Eng 137:091006-1091006-7 Bjrkman A, Rosn B, Lundborg B (2004) Acute improvement of  hand sensibility after selective ipsilateral cutaneous forearm  anaesthesia.\nEur J Neurosci 20:27332736 Boucher JA, Normand MC, Descarreaux M (2013) Trunk isometric  force production parameters during erector spinae muscle vibration at different frequencies.\nJ Neuroeng Rehabil 10:89 Boucher JA, Normand MC, Boisseau E, Descarreaux M (2015) Sensorimotor control during peripheral muscle vibration: an experimental study.\nJ Manip Physiol Ther 38(1):3443 Bruijn SM, van Dien JH, Meijer OH, Beek PJ (2009) Is slow walking more stable? J Biomech 42:15061512 Brumagne S, Cordo P, Lysens R, Verschueren S, Swinnen S (2000) The  role of paraspinal muscle spindles in lumbosacral position sense in  individuals with and without low back pain.\nJ Pain 15(10):9851000 Cordo PJ, Horn JL, Knster D, Cherry A, Bratt A, Gurfinkel V (2011)  Contributions of skin and muscle afferent input to movement  sense in the human hand.\nJ Neurophysiol 105:18791888 Dingwell JB, Cusumano JP (2000) Nonlinear time series analysis of  normal and pathological human walking.\nChaos 10(4):848863 Dyck PJ, OBrien PC, Kosanke JL, Gillen DA, Karnes JL (1993) A 4,  2 and 1 stepping algorithm for quick and accurate estimation of  cutaneous sensation threshold.\nNeurology 43:15081512 Fallon JB, Macefield VG (2007) Vibration sensitivity of human muscle spindles and golgi tendon organs.\nFlor H, Braun C, Elbert T, Birbaumer N (1997) Extensive reorganization of primary somatosensory cortex in chronic back pain  patients.\nNeurosci Lett 224:58 Frost LR, Bijman M, Strzalkowski NDJ, Bent LR, Brown SHM  (2015) Deficits in foot skin sensation are related to alterations  in balance control in chronic low back patients experiencing  clinical signs of lumbar nerve root impingement.\nIn: Kandel ER, Schwartz JH,  Jessel TM, Siegelbaum SA, Hudspeth AJ (eds) Principles of neural science.\nMcGraw Hill, New York, pp 498529 Graham RB, Brown SHM (2012) A direct comparison of spine rotational stiffness and dynamic spine stability during repetitive lifting tasks.\nInt J Ind Ergonom 42:428434 Graham RB, Sadler EM, Stevenson JM (2012b) Local dynamic stability of trunk movements during the repetitive lifting of loads.\nJ Back Musculoskelet 26:381387 Howe EE, Toth AJ, Vallis LA, Bent LR (2015) Baseline skin information from the foot dorsum is used to control lower limb kinematics during level walking.\nExp Brain Res 233:24772487 Johansson RS, Vallbo B (1979) Detection of tactile stimuli.\nBrain Res  244:1725 Johnson KO (2001) The roles and functions of cutaneous mechanoreceptors.\nCurr Opin Neurobiol 11:455461 Johnson KO, Phillips JR (1981) Tactile spatial resolution.\nJ Neurophysiol 46(6):11771191 Kavounoudias A, Roll R, Roll JP (2001) Foot sole and ankle muscle inputs contribute jointly to human erect posture regulation.\nJ  Physiol 532(3):869878 Kennel MB, Brown R, Abarbanel HDI (1992) Determining embedding dimension for phase-space reconstruction using geometrical  construction.\nGait Posture 40:166171 Kiers H, van Dien JH, Brumagne S, Vanhees L (2015) Postural sway  integration of proprioceptive signals in subjects with LBP.\nHum  Mov Sci 39:109120 Lee H, Granata KP (2008) Process stationarity and reliability of trunk  postural stability.\nClin Biomech 23(6):735742 Lee BC, Martin BJ, Sienko KH (2012) Directional postural responses  induced by vibrotactile stimulations applied to the torso.\nExp  Brain Res 222:471482 Lloyd D, Findlay G, Roberts N, Nurmikko T (2008) Differences in  low back pain behavior are reflected in the cerebral response to  tactile stimulation of the lower back.\nSpine 33(12):13721377 Lowrey CR, Strzalkowski NDJ, Bent LR (2010) Skin sensory information from the dorsum of the foot and ankle is necessary for  kinesthesia at the ankle joint.\n2226   Exp Brain Res (2016) 234:22152226.\nExp Brain Res 233:12371245 Morioka M, Whitehouse DJ, Griffin MJ (2008) Vibrotactile thresholds at the fingertip, volar forearm, large toe and heel.\nSomatosens Mot Res 25(2):101112 Moseley GL (2008) I can find it! Distorted body image and tactile dysfunction in patients with chronic back pain.\nPain  140:239243 Nolan MF (1985) Quantitative measure of cutaneous sensation: twopoint discrimination values for the face and trunk.\nPhys Ther  65:181185 Proske U, Gandevia SC (2012) The proprioceptive senses: their roles  in signaling body shape, body position and movement, and muscle force.\nAnn Biomed Eng 41(8):17131725 Rausch Osthoff AK, Ernst MJ, Rast FM, Mauz D, Graf ES, Kool J,  Bauer CM (2015) Measuring lumbar reposition accuracy in  patients with unspecific low back pain.\nSpine 40(2):E97E111 Reeves NP, Everding VQ, Cholewicki J, Morrisette DC (2006) The  effects of trunk stiffness on postural control during unstable  seated balance.\nExp Brain Res 174:694700 Roerdink M, De Haart M, Daffertshofer A, Donker SF, Geurts ACH,  Beek PJ (2006) Dynamical structure of center-of-pressure trajectories in patients recovering from stroke.\nExp Brain Res  174:256269 Rosenstein MT, Collins JJ, De Luca CJ (1993) A practical method  for calculating largest Lyapunov exponents from small data sets.\nPhys D 65:117134 Ross GB, Mavor M, Brown SHM, Graham RB (2015) The effects  of experimentally induced low back pain on spine rotational stiffness and local dynamic stability.\nAnn Biomed Eng  43(9):21202130 Ruggiero SA, Frost LR, Vallis LA, Brown SHM (2015) Effect of  short-term application of kinesio tape on the flexion-relaxation  phenomenon, trunk postural control and trunk repositioning in  healthy females.\nThe Commonwealth Fund, Harvard University Press, Cambridge, pp 462 Silfies SP, Cholewicki J, Reeves NP, Greene HS (2007) Lumbar position sense and the risk of low back injuries in college athletes:  a prospective cohort study.\nChampaign, Human Kinetics, pp 6390 Tsao H, Danneels LA, Hodges PW (2011) ISSLS prize winner:  smudging the motor brain in young adults with recurrent low  back pain.\nPhysiotherapy 96:317323 Wand BM, Catley MJ, Luomajoki HA, OSullivan KJ, Di Pietro F,  OConnell NE, Moseley GL (2014) Lumbar tactile acuity is near  identical between sides in healthy pain-free participants.\nJ Hand Ther 6(1):1122 Willigenburg NW, Kingma I, van Dieen JH (2012) Precision control  of an upright trunk posture in low back pain patients.\nClin Biomech 27:866871 Willigenburg NW, Kingma I, Hoozemans MJM, van Dieen JH (2013)  Precision control of trunk movement in low back pain patients.\nHum Mov Sci 32:228239."}