{"title": "5.pdf", "contents": "A systematic review on the effectiveness of physical and rehabilitation interventions for chronic non-specific low back pain.\nAbstract Low back pain (LBP) is a common and disabling disorder in western society.\nThe management of LBP comprises a range of different intervention strategies including surgery, drug therapy, and non-medical interventions.\nThe objective of the present study is to determine the effectiveness of physical and rehabilitation interventions (i.\nexercise therapy, back school, transcutaneous electrical nerve stimulation (TENS), low level laser therapy, education, massage, behavioural treatment, traction,.\nmultidisciplinary treatment, lumbar supports, and heat/cold therapy) for chronic LBP.\nThe following were included for selection criteria: (1) randomized controlled trials, (2) adult (C18 years) population with chronic (C12 weeks) nonspecific LBP, and (3) evaluation of at least one of the main clinically relevant outcome measures (pain, functional status, perceived recovery, or return to work).\nTwo reviewers independently selected studies and extracted data on study characteristics, risk of bias, and outcomes at short, intermediate, and long-term follow-up.\nThe GRADE approach was used to determine the quality of evidence.\nCompared to usual care, exercise therapy improved post-treatment pain intensity and disability, and long-term function.\nBehavioural treatment was found to be effective in reducing pain intensity at short-term follow-up compared to no treatment/waiting list controls.\nFinally, multidisciplinary treatment was found to reduce pain intensity and disability at short-term follow-up compared to no treatment/waiting list controls.\nOverall, the level of evidence was low.\neffectiveness of a multidisciplinary treatment compared to no treatment and other active treatments at reducing pain at short-term in the treatment of chronic low back pain.\nLow back pain (LBP) is related to disability and work absence and accounts for high economical costs in western societies [1].\nThe management of LBP comprises a range of different intervention strategies including surgery, drug therapy, and non-medical interventions.\nDuring the last years, a large number of randomized controlled trials (RCTs) have been published and these have been summarized in systematic reviews.\nMost of these systematic reviews focus on the effectiveness of a single intervention and describe the effectiveness on the different types of LBP.\nThe current study presents an upto-date overview on the current literature on physical and rehabilitation medicine in patients with chronic LBP.\nThe physical and rehabilitation medicine interventions include exercise therapy, back schools, transcutaneous electrical nerve stimulation (TENS), superficial heat or cold, lowlevel laser therapy (LLLT), individual patient education, massage, behavioural treatment, lumbar supports, traction, and multidisciplinary rehabilitation.\nThis systematic review will provide an overview on these physical and rehabilitation medicine interventions applied in chronic LBP patients and its effectiveness.\nA study must fulfil the following inclusion criteria to be included in this review.\nOnly RCTs were included.\nThe study population should consist of adults, older than 18 years, with non-specific chronic LBP that persisted for 12 weeks or more.\nThe diagnosis for these specific entities had to be confirmed by means of an MRI or another diagnostic tool.\nRandomized controlled trials (RCTs) studying the following physical and rehabilitation interventions were included in this overview: exercise therapy, back schools, transcutaneous electrical nerve stimulation (TENS), superficial heat or cold, low-level laser therapy (LLLT), individual patient education, massage, behavioural treatment, lumbar supports, traction, and multidisciplinary rehabilitation.\nExercise therapy was defined as a series of specific movements with the aim of training or developing the body by a routine practice or physical training to promote good physical health [2].\nA back school was defined as consisting of educational and skills acquisition program, including exercises, in which all lessons were given to groups of patients and supervised by a paramedical therapist or medical specialist [3].\nAll standard modes of transcutaneous electrical nerve stimulation (TENS) were considered in this review.\nTENS is a non-invasive therapeutic modality.\nTENS units stimulate peripheral nerves via skin surface electrodes at well-tolerated intensities and are capable of being selfadministered [4].\nSuperficial heat or cold included all kinds of heat or cold therapies, such as ice, cold towels, cold gel packs, ice packs, and ice massage; hot water bottles, heated stones, soft-heated packs filled with grain, poultices, hot towels, hot baths, saunas, steam, heat wraps, heat pads, electric heat pads, and infrared heat lamps [5].\nLow-level laser therapy (LLLT) is a light source that generates pure light of a single wavelength with nonthermal effects [6].\nFor this intervention, all types of LLLT, including all wavelengths, are included.\nPatient education was defined as a systematic experience, in a one-to-one situation, that consists of one or more.\nmethods, such as the provision of information and advice and behaviour modification techniques, which influence the way the patient experiences his illness and/or his knowledge and health behaviour, aimed at improving or maintaining or learning to cope with a condition [7].\nBehavioural treatments included operant, cognitive, and respondent treatments or a combination of these treatments.\nEach of these focus on the modification of one of the three response systems that characterize emotional experiences: behaviour, cognition, and physiological reactivity [9].\nLumbar supports included any type of lumbar support, flexible or rigid, used for the treatment of chronic nonspecific LBP [10].\nThe intervention traction included any type of traction, such as mechanical traction, manual traction (unspecific or segmental traction), computerized traction, auto traction, underwater traction, bed rest traction, inverted traction, continuous traction, and intermitted traction [11].\nFinally, the multidisciplinary treatment included multidisciplinary bio-psychosocial rehabilitation with minimally one physical dimension and one of the other dimensions (psychological or social or occupational) [12].\nFor all types of interventions, additional treatments were allowed, provided that the intervention of interest was the main contrast between the intervention groups included in the study.\nThe primary outcomes for this overview were pain and physical functional status.\nSearch methods for identification of studies.\nExisting Cochrane reviews of the 11 interventions were screened for studies fulfilling the inclusion criteria.\nAdditionally, a search was conducted in MEDLINE, EMBASE, CINAHL, CENTRAL, and PEDro up to 22 December 2008.\nThe searches were updated from the last date of the literature search in the Cochrane reviews.\nThe language was limited to English, Dutch, and German, because these were the languages that the review authors were able to read and understand.\nTwo reviewers working independently from each other conducted the electronic searches.\nMethods of the review.\nThree authors (MM and SR/TK) independently screened the abstracts and titles retrieved by the search strategy and applied the inclusion criteria to all these abstracts.\nAll full text articles were compiled and screened on inclusion criteria by the two authors, independently.\nAny disagreements between the authors were resolved by discussion and consensus.\nA third author was consulted if disagreements persisted.\nTwo reviewers (MM, SMR) conducted the risk of bias assessment, independently.\nRisk of bias of the individual studies was assessed using the criteria list advised by the CBRG, which consists of 11-items.\nItems were scored as positive if they did fulfil the criteria and negative when there was a clear risk of bias, and marked as inconclusive if there was insufficient information.\nA total score was computed, and high quality was defined as fulfilling six or more (more than 50%) of the internal validity criteria (range 011).\nThe same two review authors who performed the risk of bias assessment conducted the data extraction, independently from one another.\nData were extracted onto a standardized web-based form.\nThe following data were extracted from the studies: (1) characteristics of the studies: number of participants, gender, age, setting, and duration of complaints; (2) characteristics of the interventions: the type, frequency, duration, co-interventions, and control intervention; (3) characteristics of the outcomes: outcome measures, instruments, and scores (e.\nComparison therapies were combined into main clusters of presumed effectiveness (no treatment/waiting list controls, other interventions).\nSeparate analyses were planned for: (1) each type of intervention, (2) each type of control, (3) each main outcome measure, and (4) time of follow-up (post-treatment; short-term (closest to 3 months), intermediate (closest to 6 months), and long-term (closest to 12 months) follow-up).\nA test for heterogeneity was calculated using the Q-test (Chi-square) and I2.\nConfidence intervals (95%CI) were calculated for each effect.\nA random effects model was used and funnel plots were examined for publication bias.\nFinally, if none of these data were reported, an estimation of the standard deviation was based on study data (population and score) of other studies.\nTo correct for bias introduced by double-counting of subjects of trials that had two control groups in the same meta-analyses, the number of subjects of these trials were divided by two.\nGrades of Recommendation, Assessment, Development, and Evaluation (GRADE) were used to evaluate the overall quality of evidence and the strength of the recommendations [13].\nQuality of evidence of a specific outcome was based upon four principal measures: (1) limitations (due to for example, study design), (2) consistency of results, (3) indirectness (e.\ngeneralizability of the findings), (4) precision (e.\nThe overall quality was considered to be high when RCTs with a low risk of bias provide consistent, sufficient, and precise results for a particular outcome; however, the quality of the evidence was downgraded by one level when one of the factors described above was not met.\nHigh quality: Further research is very unlikely to change our confidence in the estimate of effect.\nModerate quality: Further research is likely to have an important impact on our confidence in the estimate of effect and may change the estimate.\nLow quality: Further research is very likely to have an important impact on our confidence in the estimate of effect and is likely to change the estimate.\nVery low quality: We are very uncertain about the estimate.\nOf the 11 existing Cochrane reviews a total of 114 full text articles were screened for eligibility.\nOf these 114 articles, 58 studies fulfilled the inclusion criteria and were included.\nOf these, 127 full text articles were evaluated of which a total of 35 studies fulfilled the inclusion criteria.\nMultiple publications were found for Bendix et al.\n92, 97], Gudavalli et al.\n[26, 98, 99], Harkapaa et al.\n[96, 100102], Niemisto et al.\n[35, 103], Smeets et al.\n[41, 104], and Tavafian et al.\nInformation from all publications was used for assessment of risk of bias and data extraction, but only the first or most prominent publication was used for citation of these studies.\nThe study characteristics of all included studies are presented in Table 1.\nA total of 8,816 patients were included.\nMost patients were included in the exercise studies (n = 3,957), followed by the behavioural studies (n = 2,062), and multidisciplinary studies (n = 1,229).\nA total of 50 studies (60%) reported on the outcome pain intensity, measured with a VAS or numerical rating scale (NRS).\nRisk of bias assessment.\nThe results of the risk of bias assessment are shown in Table 1.\nAll studies were described as randomized,.\nhowever, the method of randomization was only explicit in 56.\nOnly 28 studies (33.\n7%) met six or more of the criteria, which was our preset threshold for low risk of bias.\nCompliance of the interventions was clearly acceptable in only 37.\nThe effectiveness of exercise therapy.\nExercise therapy versus waiting list controls/no treatment.\nEight studies [14, 23, 24, 36, 40, 41, 43, 48] were identified as comparing some type of exercise therapy to waiting list controls or no treatment.\nPapers excluded on basis of  title and abstract (n=1273).\nPublications included  (n=35).\nTotal number of studies included  (n=93).\nNumber of included  studies for chronic low  back pain (n=83).\n1 Flow diagram of systematic review inclusion and exclusion of articles for nonmedical treatments for chronic low back pain.\nTable 1 Risk of bias of studies investigating non-medical interventions for chronic low back pain.\nReference Randomization adequate? Allocation concealed? Groups similar at baseline?.\nPatient blinded? Care provider blinded?.\nCo-interventions avoided or similar?.\nCompliance acceptable? Drop-out rate described and acceptable?.\nTiming outcome assessment similar?.\n[14] ? ? ? ? ? ? ? ? ? 5.\n[15] ? ? ? ? ? ? ? 7.\n[30] ? ? ? ? ? ? ? 6.\n[49] ? ? ? ? ? ? ? ? 3.\n[31]a ? ? ? ? ? ? ? ? 7.\n[32]a ? ? ? ? ? ? ? 5.\n[33] ? ? ? ? ? ? ? ? ? ? ? 11.\nReference Randomization adequate? Allocation concealed? Groups similar at baseline?.\nPatient blinded? Care provider blinded?.\nCo-interventions avoided or similar?.\nCompliance acceptable? Drop-out rate described and acceptable?.\nTiming outcome assessment similar?.\nHurri [51] ? ? ? ? ? 4.\nKlein and Eek [63] ? ? ? ? ? ? ? ? ? ? ? 11.\nSoriano and Rios [64] ? ? ? ? ? ? ? 6.\nHurri [51]c ? ? ? ? 4.\n[65]a ? ? ? ? ? ? ? ? 1.\nEur Spine J (2011) 20:1939 25.\nReference Randomization adequate? Allocation concealed? Groups similar at baseline?.\nPatient blinded? Care provider blinded?.\nCo-interventions avoided or similar?.\nCompliance acceptable? Drop-out rate described and acceptable?.\nTiming outcome assessment similar?.\nKole-Snijders [74] ? ? ? ? ? ? ? ? 8.\nNouwen [79] ? ? ? ? ? ? 6.\na New studies (not included in Cochrane reviews).\nb Not included in the Cochrane review because of control group.\nc Duplicate; also included in other intervention section.\n26 Eur Spine J (2011) 20:1939.\npost-treatment data only, because after the treatment period the waiting list controls alsoreceivedthe treatment.\nAll studies reported data that could be used in the statistical pooling.\nThe WMD for post-treatment improvement in disability was -3.\nThe pooled mean WMD for pain intensity at intermediate follow-up was -16.\nThere were no differences between the groups receiving exercise therapy and the waiting list control group.\nTherefore, there is low quality evidence (serious limitations, imprecision) that there is no statistically significant difference in pain reduction and improvement of disability between exercise therapy and no treatment/waiting list controls.\nA total of six studies [28, 35, 45, 49, 50, 106] investigated the effect of exercise therapy compared to usual care.\nFour of these studies had an intermediate or long-term followup.\nStatistical pooling of three studies [49, 50, 106] showed a significant decrease in pain intensity and disability in favour of the exercise group (WMD -9.\nOne study [49] reported on pain and disability at short-term follow-up, and found no statistically significant differences between the exercise group and the control group receiving home exercises.\nTwo studies [35, 106] showed a statistically significant pooled WMD for disability at intermediate follow-up of -5.\nOne study [35] found a statistically significant difference at intermediate follow-up for pain relief for the exercise group compared to the usual care group.\nThree studies [45, 103, 106] reported on pain and/or disability at long-term follow-up.\nThe pooled WMD for pain was not statistically significant (-4.\n58]); the WMD for disability was statistically significant in favour of the exercise group (WMD -3.\nOne study [28] reported recovery at post-treatment and during intermediate and long-term follow-up.\nAs much as 80% of the patients in the exercise group regarded themselves as recovered at 3 months follow-up versus 47% in the usual care group.\nThere is low quality evidence (serious limitations, imprecision) for the effectiveness of exercise therapy compared to usual care on pain intensity and disability.\nPost-treatment results for disability were reported in two studies, with a significant pooled WMD of -11.\nOne study reported on pain post-treatment and found no statistically significant difference between both the intervention groups [44].\nThe pooled mean differences for pain and disability at 3 months follow-up were -7.\nTwo studies [19, 25] reported intermediate outcomes on pain and three studies [19, 25, 39] reported on disability.\nThe pooled WMDs showed no statistically significant differences between the groups: 5.\nOnly one study (n = 346) reported long-term outcomes, and these were not statistically significantly different between the groups [25].\nThe data provided very low quality evidence (serious limitations, imprecision, and inconsistency) that there was no statistically significant difference in effect on pain and disability at shortand intermediate follow-up for exercise therapy compared to back school/education.\nThree studies, one with a low risk of bias, were identified comparing exercise therapy with a behavioural treatment [17, 41, 43].\nTwo studies reported post-treatment pain and disability and the pooled WMDs were 1.\nAll three studies reported intermediate and long-term follow-up on pain intensity and disability.\nFor intermediate follow-up the pooled WMDs for pain and disability were -2.\nLong-term results showed a pooled WMD for pain intensity of -0.\nThere is low quality evidence (serious limitations, imprecision) that there are no statistically significant differences between exercise therapy and behavioural therapy on pain intensity and disability at shortand long-term follow-up.\nFive studies, two with a low risk of bias, were identified comparing exercise therapy with passive therapies, such as.\nThe pooled WMD for post-treatment pain intensity was -9.\n13] and for post-treatment disability -2.\nTwo studies [18, 49] reported on short-term pain intensity and disability and the pooled mean differences were 1.\nOne study with a low risk of bias [30] reported intermediate and long-term outcomes, and found a statistically significant difference for pain intensity of 16.\n2 points, respectively, in favour of exercise therapy.\nAlso a statistically significant difference was found for disability.\nFive studies, two with a low risk of bias, were identified comparing exercise treatment with spinal manipulation or manual therapy [21, 25, 26, 34, 47].\nPost-treatment data were available for three studies.\nThe pooled WMDs for pain intensity and disability were 5.\nOne study reported a statistically significant difference in global perceived effect post-treatment [21] in favour of spinal manipulation.\nTwo studies reported short-term effects on pain intensity and disability and the pooled WMDs were -1.\nIntermediate results on pain and disability were reported by three studies [21, 25, 26] and the pooled WMDs were -0.\nAll studies reported long-term results on disability and the pooled WMD -0.\nFour studies reported long-term results on pain intensity and the pooled WMD was 2.\nGlobal perceived effect was reported by one study during intermediate and longterm follow-up.\nThe data provided low quality evidence (inconsistency, imprecision) that there was no statistically significant difference in effect (pain intensity and disability) for exercise therapy compared to manual therapy/manipulation at shortand long-term follow-up.\nPosttreatment results showed a statistically significant difference.\nNo post-treatment differences between both groups were found for pain intensity.\nAt 6 months followup, both disability and pain intensity scores were lower in the exercise group compared to the psychotherapy group, but not statistically significant.\nTwo studies found statistically significant differences between different exercise interventions.\nOne study [42], with a high risk of bias, reported statistically significant difference in pain relief at 3 months follow-up of an aerobic exercise training program compared with a lumbar flexion exercise program of 3 months.\nOne large trial [21] with a low risk of bias (n = 240) compared a general exercise program (strengthening and stretching) with a motor control exercise program (improving function of specific trunk muscles) of 12 weeks.\nThe motor control exercise group had slightly significantly better outcomes (mean adjusted between group difference function 2.\n9 and global perceived effect 1.\n7) than the general exercise group at 8 weeks.\nA total of eight studies did not find any statistically significant differences between the various exercise interventions [20, 29, 31, 33, 37, 38, 46, 48].\n[39] compared a 12-week yoga (viniyoga) program with a 12-week conventional exercise class program.\nBack-related function in the yoga group was superior to the exercise group at 12 weeks.\nThree studies compared back school with waiting list controls, no treatment, and a usual care clinic group [52, 54, 55].\nPain post-treatment was reported by 2 studies [52, 55] and the pooled WMD was -4.\nDisability post-treatment was only reported by Ribeiro et al.\n[55] and showed no statistically significant difference between both groups.\nTwo studies [54, 55] reported shortterm follow-up data on disability and the pooled WMD was -13.\nOne study [54] with a high risk of bias, reported on disability at intermediate and long-term follow-up and no significant differences were found at both time points between the back school group and the clinic group.\nDue to serious limitations, inconsistency, and imprecision, low quality evidence was provided that there is no statistically significant short-term difference in treatment effect on pain and disability for a back school treatment compared to waiting list controls/no treatment/usual care.\nTwo studies, one with a low risk of bias, were identified comparing a back school treatment with an active treatment [19, 53].\nThe pooled WMDs for pain intensity and disability at short-term follow-up were 4.\nAt intermediate follow-up, the pooled WMDs for pain intensity and disability were -2.\nLow quality evidence (serious limitations, inconsistency, and imprecision) was provided that there is no statistically significant difference in effect for back school treatment compared to active treatments on pain and disability at short-term and intermediate follow-up.\nOne study [51] with a high risk of bias was identified comparing back school with given instructional material.\nAt 6 months follow-up, there was a statistically significant difference in pain intensity and disability in favour of the back school group.\nAt long-term follow-up (12 months), there was still a significant difference between both intervention groups on the outcome disability, but not for pain intensity, in favour of the back school group.\nFive studies, two with a low risk of bias, compared the effectiveness of TENS with sham TENS or sham percutaneous electrical nerve stimulation (PENS).\nFour studies [18, 56, 59, 61] described post-treatment results on pain and the pooled WMD was -4.\nThe pooled WMD of post-treatment disability of two studies [18, 61] was -1.\n[56] reported on disability and found no significant difference between the TENS and sham-PENS group.\n[59] with a low risk of bias, compared TENS with sham-TENS and demonstrated a significant carry-over.\nTwo studies [18, 58] found no statistically significant difference between the TENS and sham TENS groups at short-term follow-up.\nThe data provided low quality evidence (serious limitations, heterogeneity) that there is no statistically significant difference on post-treatment pain intensity and disability between TENS and sham-TENS.\nPost-treatment results of two studies [56, 60] showed a pooled WMD for pain intensity of 16.\nOutcomes on shortterm pain intensity were reported in three studies [57, 58, 60].\nThe pooled WMD was 6.\nOne study [58], with a high risk of bias, reported no statistically significant difference on short-term disability.\nVery low quality evidence (serious limitations, inconsistency, and imprecision) was provided that PENS/acupuncture is more effective than TENS for post-treatment and short-term pain relief.\nTwo studies, of which one with a high risk of bias, compared the effectiveness of TENS with active treatments [18, 56].\n[18] reported no statistically significant difference on pain intensity, disability, and recovery at short-term follow-up between TENS and exercise therapy.\nOne study [58] with a high risk of bias investigated the effectiveness of conventional TENS compared to biphasic new wave TENS for the outcomes of pain and disability post-treatment and at short-term follow-up.\nNo statistically significant differences were found for both outcome measures at both time points.\nOne study [64] with a low risk of bias, compared low-level laser therapy treatment with sham laser therapy treatment.\nThe study provided low quality evidence that LLLT was more effective in pain relief at intermediate follow-up (44.\nLow-level laser therapy ? exercise versus sham LLLT ? exercise.\nResults on pain and disability at post-treatment were reported by one study [62] and no difference was found between the intervention groups on both outcome measures.\nTwo studies [62, 63] reported on pain intensity and disability at short-term (3 months) follow-up.\nNo difference was found on disability between those who received LLLT plus exercise and those who received sham LLLT ? exercise (WMD -5.\nLow-Level laser therapy versus exercise.\nOne study [27] compared the effectiveness of LLLT with exercise therapy post-treatment.\nNo statistically significant difference was found between both therapy groups on pain level and disability.\nThe effectiveness of patient education.\nPatient education versus active non-educational interventions.\nThree studies [25, 39, 51], one with a low risk of bias, compared the effectiveness of patient education with physiotherapy [25], Swedish Back School [51] and exercise/yoga exercises [39].\n[39] compared the effectiveness of yoga exercises and conventional exercises with education on the outcome disability.\nPost-treatment, there was a statistically significant difference between the yoga exercise group and the education group in favour of the yoga group (WMD -3.\nNo statistically significant difference was found between the conventional exercise group and the education group.\nPain and disability at short-term follow-up were reported by Goldby et al.\n[25] and no significant difference.\nbetween the education group and the exercise group was found for both outcome measures at this time point.\nTwo studies [25, 51] reported on pain intensity at intermediate follow-up and the WMD was -9.\nDisability at intermediate follow-up was reported by three studies [25, 39, 51]; the pooled WMD was 3.\nLong-term follow-up data on pain intensity and disability were reported by two studies [25, 51] and the pooled WMDs were 5.\nDue to serious limitations, inconsistency, and imprecision, low quality evidence is provided that there is no difference in effect at intermediate and long-term effect on pain and disability for patient education compared to active non-educational interventions.\nOne study [89] with a high risk of bias compared oneon-one education with a focus on anatomy compared to a focus on the neurosystem in 58 patients who presented themselves at private rehabilitation clinics.\nFifteen weekdays after the first session, a significant reduction in disability was found in the group with focus on the neurosystem compared to the control group.\nHowever, no differences on pain perception were found.\nPost-treatment, there was no statistical significant reduction in pain intensity in the massage group compared to the control group; the pooled WMD was 0.\nLow quality evidence (serious limitations, imprecision) was provided that there was no statistically significant difference in effect of massage therapy compared to passive interventions on pain intensity post-treatment.\nOne study [90] (n = 42) with a high risk of bias compared motorized traction treatment plus standard physiotherapy with standard physiotherapy only.\nNo statistically significant differences were found on pain intensity, disability, and recovery at post-treatment and after 3 months followup between both intervention groups.\nAs much as 21 randomized trials were identified investigating the effectiveness of behavioural treatment in chronic low back patients.\nA total of 12 studies, of which 3 studies [41, 74, 79] had a low risk of bias, were identified comparing some type of behavioural treatment to waiting list controls, no treatment, or a placebo treatment.\nThe pooled WMD post-treatment for pain intensity was 19.\nNo shortor long-term results were reported in these studies.\nRespondent therapy (EMG biofeedback) A total of four studies [70, 76, 79, 82] were identified comparing EMG biofeedback (respondent therapy) with waiting list controls or placebo.\nThe WMD for pain intensity of the three studies of which the data could be pooled was 8.\nDisability data were only available of 2 studies and the pooled WMD post-treatment was 7.\nOperant therapy Four studies [41, 43, 74, 84], of which three could be pooled, were identified comparing operant therapy with waiting list controls.\nThe pooled WMD for disability was 2.\nThe study of Kole-Snijders [74], with a low risk of bias, showed a significant decrease in negative affect, motoric behaviour and coping control in the operant behavioural treatment group compared to the waiting list control group at posttreatment.\nCombined respondent and cognitive therapy Four studies were identified comparing a combination of respondent and cognitive behavioural treatment with waiting list controls.\nCognitive therapy Two studies [69, 85] were identified comparing the post-treatment effectiveness of cognitive treatment compared with waiting list controls.\nThe pooled WMD for pain intensity was 12.\nPost-treatment disability was only described by Turner et al.\nin 1993 and a significant decreased pain intensity between the preand post-treatment was found for the patients in the cognitive behavioural group, but not for the waiting list control group.\nOne study [72] with a high risk of bias reported on the intermediate follow-up effects of cognitive therapy compared to waiting list controls.\nNo statistically significant differences were found for pain intensity and disability between both intervention groups at 6 months follow-up.\nSummarized, there is low quality evidence (serious limitations, inconsistency) provided for the effectiveness of behavioural therapy compared to no treatment/waiting list controls/placebo for pain intensity and disability at shortterm follow-up.\nSeven studies compared one type of behavioural treatment plus an additional treatment with the additional treatment alone [41, 43, 68, 77, 78, 81, 87].\nThree studies [41, 43, 77], one with a low risk of bias, compared operant therapy plus exercise/physiotherapy with exercise/physiotherapy alone and the WMD for pain intensity and disability posttreatment were 8.\nAt intermediate followup the WMD for pain and disability were respectively 0.\nThe post-treatment WMD for pain and disability were 0.\nA significant difference in favour of the combination group was found for pain intensity post-treatment, but also after 6 weeks and 6 months.\nWe found a total post-treatment WMD for pain intensity and disability of 2.\nAt 6 months follow-up the total WMDs for pain intensity and disability were 0.\nThree studies [41, 43, 77] reported on the long-term outcomes pain and disability.\nThree studies compared a combination of operant behavioural treatment with exercise therapy/physiotherapy with exercise/physiotherapy alone.\nOne study also compared a combination of cognitive treatment with physiotherapy with physiotherapy alone.\nWe found a non-significant total WMD for longterm pain intensity and disability of 0.\nNo significant differences were found post-treatment and at 6-months follow-up.\nHowever, a statically significant difference in favour of the exercise group was found at 12 months follow-up.\n[68] found that 48% in the behavioural treatment group had returned to work after 6 months, compared to 67% in the control group.\nHowever, this difference was not statically significant.\n[81] reported on the costs due to sick leave.\nDuring follow-up, the costs were lower in the cognitive behavioural group than in the usual care group.\nSummarized, there is low to moderate quality evidence (serious limitations, inconsistency) provided for not finding an effect of behavioural therapy in addition to another treatment compared to the other treatment alone in pain intensity and disability at shortand long-term follow-up.\nA total of six studies compared some kind of behavioural treatment with another treatment.\nTwo studies [41, 43] compared operant behavioural treatment with exercise therapy, one study [88] compared operant therapy with physiotherapy, one study [75] compared respondent therapy (muscle relaxation) with self-hypnosis, one study [73] compared cognitive treatment with usual GP care, and one study [71] compared operant therapy and respondent therapy (biofeedback) with education.\nAll studies reported on pain intensity, four studies reported on disability, and two studies reported on global recovery.\nPost-treatment pain intensity was reported by four studies and the WMD for operant treatment was 1.\n60] and for respondent (biofeedback) therapy 11.\nThe total non-significant WMD for post-treatment pain intensity was 2.\nDisability post-treatment was reported by three studies, all comparing operant therapy with exercise therapy/ physiotherapy and the total WMD was 0.\nShort-term follow-up results were reported by four studies [71, 73, 75, 88].\nThe WMD for pain intensity for operant therapy was 1.\n25], for respondent therapy (biofeedback) 5.\n10] and the total WMD for pain intensity was 5.\nDisability was reported by two studies [73, 88], of which one had a low risk of bias, and the total WMD for disability at short-term follow-up was 0.\nThree studies, comparing an operant therapy with exercise/physiotherapy reported on the intermediate outcomes pain and disability and the WMDs were 0.\nFour studies, of which two with a low risk of bias, reported on pain and disability at 12 months follow-up [41, 43, 73, 88].\nThe significant WMD for pain intensity was 6.\n40] and the WMD for disability was 2.\nGlobal perceived effect was reported by van der Roer et al.\n[41] and both studies did not find statistically significant differences between operant behavioural treatment and exercise/physiotherapy, at posttreatment and at 3, 6, and 12 months follow-up.\nSummarized, there is low to moderate quality evidence (serious limitations, and inconsistency) provided that there is no difference in effect in pain intensity and disability at shortand long-term follow-up for behavioural therapy compared to other kinds of treatment.\nCognitive versus operant One study [77] (n = 20) with a high risk of bias compared cognitive to operant therapy.\nThe operant therapy group reported a significantly greater improvement in general function status, but not in pain intensity.\nCognitive versus respondent therapy Two studies (n = 67) with a high risk of bias compared cognitive to respondent therapy consisting of progressive muscle relaxation training [83, 85].\nThe pooled WMD (n = 67) for post-treatment pain intensity was 3.\n52] and for disability 2.\none study (n = 33) reported on long-term pain and disability, and these outcomes were not statistically significantly different between the groups [85].\nDue to serious limitations and imprecision, low quality evidence is provided for that there is no effect at posttreatment on pain and disability for cognitive compared to respondent therapy.\nOperant therapy versus respondent One study with a high risk of bias compared operant therapy (relaxation training) with respondent biofeedback therapy [71].\nNo statically significant differences were found on shortand long-term (4 years) follow-up.\nCognitive-behavioural versus cognitive Only one study (n = 33) with a high risk of bias included a comparison between groups receiving cognitive-behavioural therapy and cognitive therapy [85].\nThere were neither posttreatment nor long-term statistically significant differences between the groups on any of the outcome measures (global improvement, disability, and pain intensity).\nCognitive-behavioural versus operant therapy Two studies, one with a low risk of bias, were identified [74, 84].\nOne study compared cognitive-behavioural therapy to operant therapy and found statistically significant better post-treatment results on pain behaviour, and physical functioning with operant therapy, but no differences between the groups after 6 and 12-month follow-up [84].\nThe second study reported better pain control post-treatment with cognitive-behavioural therapy, but no other posttreatment or long-term differences [74].\nNo significant differences were found between the groups for pain or any of the outcome measures in the behavioural domain, at either post-treatment or 6-month follow-up.\nNo significant differences on pain intensity and disability at post-treatment or 6-month follow-up were identified between both intervention groups.\nCognitive-behavioural treatment: group or individual therapy One study compared the effectiveness of cognitive-behavioural group treatment with individual treatment.\ngroup) on pain intensity and disability were demonstrated post-treatment and at 6 months follow-up.\n[93] reported on post-treatment pain intensity and found a statistical significant difference in favour of the multidisciplinary treatment compared to the waiting list controls.\nTwo studies [92, 96] reported on short-term pain intensity and the significant pooled WMD was 9.\nLong-term outcomes revealed no statistically significant differences between a multidisciplinary rehabilitation and no treatment.\nThe long-term non-significant WMDs for pain intensity and disability were 9.\nTherefore, there is moderate quality evidence for the effectiveness of multidisciplinary treatment on short-term pain intensity compared to no treatment/waiting list controls and there is moderate quality evidence for not finding an effect on disability and on long-term outcomes.\nOne study [92] reported on sick leave and found a statistically significant difference at 4-months follow-up between the treated and the non-treated group; the median days of sick leave in the intervention group was 10 days compared to 122 days in the control group.\nFour studies [15, 91, 94, 95] were identified comparing a multidisciplinary treatment with inpatient exercises [91], physiotherapy [94], usual care [95], and exercise therapy [15].\nOne study reported on post-treatment disability and found no significant difference between both intervention groups [95].\nShort-term pain intensity was reported in two studies [15, 91] and the statistically significant pooled WMD was 11.\nOne study [15] reported on functional outcome and found a significant difference between both groups in favour of the multidisciplinary treatment at short-term follow-up.\nOne study [15] with a low risk of bias, reported on workreadiness and found a highly significant difference between the multidisciplinary intervention and the exercise intervention; 75% of the patients in the multidisciplinary group achieved work-readiness at 4 months compared to 42% in the active treatment group.\nAnother study with a low risk of bias reported on sick leave and found no significant difference between both intervention groups, 1 and 2 years after rehabilitation [94].\nOne study [15] with a low risk of bias reported on pain, disability, and return to work after 5 years follow-up.\nNo significant differences were found on pain intensity; however, patients in the multidisciplinary treatment group showed a lower disability level compared to the patients in the exercise group.\nSummarized, there is moderate evidence for the effectiveness of multidisciplinary treatment compared to other kinds of active treatment on pain intensity at short-term follow-up and there is also moderate evidence that there is no statistically significant difference on pain intensity at long-term follow-up.\nOne study [96] (n = 316) with a high risk of bias compared a 3-week inpatient back school rehabilitation program with a 15-session outpatient back school rehabilitation program.\nNo statistically significant differences were found between both intervention groups at short-term as well as on the long-term follow-up.\nIn this review, 83 RCTs were included that evaluated the effectiveness of physical and rehabilitation interventions for non-specific chronic LBP.\nNo significant treatment effects of exercise therapy compared to no treatment/waiting list controls were found on pain intensity and disability.\ncare, pain intensity and disability were significantly reduced by exercise therapy at short-term follow-up.\nWe found no difference in effectiveness of TENS and sham TENS and there were also no differences between TENS and active treatments.\nAll types of behavioural therapy were more effective in reducing pain intensity than waiting list controls, but it is unknown whether this also applies to back-specific function.\nAdditionally, there are some indications that the addition of behavioural components can reduce sick leave and costs due to sick leave.\nFinally, multidisciplinary treatment was found to be more effective in reducing pain intensity compared to no treatment/waiting list controls and active treatments (e.\nexercise therapy, physiotherapy, and usual care), and sick leave is reduced at short-term follow-up.\nAdverse events were not reported in any of the included studies.\nNone of the significant differences found in this overview study reached a difference larger than 10%, where in most studies a difference of 1520% is defined as clinically relevant.\nTherefore, the differences found in this overview must be regarded as small and not clinically relevant.\nThis review showed that behavioural therapy has an effect on pain intensity.\nThis is apparent because the aim of behavioural therapy is not to treat pain, but to modify one of the three response systems (behavioural, cognition, and physiological reactivity [107]).\nThe decrease in pain intensity might be related to the combination of different treatment strategies applied in a great number of the included studies.\nIt was apparent that there were no studies identified studying the effectiveness of lumbar support for the treatment of chronic LBP and few studies were found for massage therapy and traction.\nTherefore, further research is encouraged to identify the effectiveness of these interventions.\nTwo of the earlier conducted reviews on the described interventions were conducted on chronic low back patients only: behavioural therapy and TENS [4, 9].\nBecause we applied strict criteria for chronic low back pain, not all studies included in that reviews were included in our overview.\non behavioural treatment to ours, it is apparent that Ostelo et al.\nfound strong evidence in favour of a combined respondent-cognitive therapy for medium.\nThis difference is probably caused by the different inclusion criteria used on chronic LBP and the different methods used to define the level of evidence.\nIf we compare the conclusion of the Cochrane review from Khadilkar et al.\nThe methodological quality of the studies was generally poor.\nBlinding of the patient and blinding of the care provider were not properly conducted in many studies.\nBlinding of patients is also difficult in many RCTs investigating the effectives of exercise therapy, back schools, education, behavioural treatment, and multidisciplinary rehabilitation.\nThe quality of future RCTs in the field of back pain should be improved to reduce bias in systematic reviews and overviews, as it has been demonstrated that statistical pooling of low quality trials results in overestimation of treatment effects.\nOverall, evidence provided from the meta-analyses in this overview study was low.\nIn the most analyses there were serious limitations regarding the methodological quality and in most analyses there was imprecision of data because of sparse data and wide confidence intervals.\nAdditionally, in some analysis there was a matter of inconsistency because of heterogeneity.\nTherefore, further research is very likely to have an important impact on our confidence in the estimate of effect and is likely to change the estimate.\nSeveral biases can be introduced by literature search and selection procedure.\nWe might have missed relevant unpublished trials, which are more likely to be small studies with non-significant results, leading to publication bias.\nScreening references of identified trials and systematic reviews may result in an over representation of positive studies in the review, because trials with a positive result are more likely to be referred to in other publications, leasing to reference bias.\nSubgroups were pooled because of the clinical homogeneity.\nHowever, methodological heterogeneity occurred in some of the comparisons between different interventions strategies.\nOnly a small number of the studies were rated as high quality and this may have led to an overestimation of effect.\nThe only outcome measure used in the majority of studies was pain intensity, limiting the ability to report on other important outcomes.\nBecause of the relatively small number of studies pooled within the different subgroups, it was not possible to conduct a sensitivity analysis.\nHowever, with the GRADE method applied, we have tried to account for the risk of bias found in the different studies.\nThe most promising interventions for a physical and rehabilitation treatment in chronic LBP patients are a multidisciplinary treatment or behavioural treatment.\nAll types of behavioural therapy were more effective in reducing pain intensity than waiting list controls.\nMultidisciplinary treatment was found to be more effective in reducing pain intensity compared to no treatment/waiting list controls and active treatments (e.\nexercise therapy, physiotherapy, and usual care), and sick leave is reduced at short-term follow-up.\nAdditionally, there are some indications that the addition of behavioural components can reduce sick leave and costs due to sick leave.\nAlso exercise therapy reduced pain intensity and disability significantly compared to usual care.\nBecause of the lack of evidence and the conflicting evidence on the effectiveness of different interventions discussed in this review, only multidisciplinary treatment, behavioural treatment, and exercise therapy should be provided as conservative treatments in daily practice in the treatment of chronic LBP.\nTo conclude, we identified 83 RCTs that evaluated treatment effects for patients with chronic non-specific LBP.\nMost of the studies included in this review showed methodological deficiencies.\nFor future research the focus should be on high-quality RCTs with sufficient sample size to be able to draw firm conclusions.\nunclear or insufficient, such as multidisciplinary treatments, education, and exercise.\nFor example, a large highquality study comparing exercise therapy and education with a wait and see approach could give the evidence for the effectiveness of exercise therapy compared to education or a wait and see approach, and of education compared to a wait and see approach.\nAdditionally, comparing the multidisciplinary approach to exercise therapy alone could give insight in the additional value of the multidisciplinary approach, which is probably more expensive than a single exercise program.\nFinally focus in research on specific subgroups of LBP patients for whom a certain intervention is most effective is also needed.\nSome patients might respond better to exercise therapy than others, but insight in the patient characteristics of such a subgroup is still lacking.\nReport of the International Paris Task Force on Back Pain.\nHeymans MW, van Tulder MW, Esmail R, Bombardier C, Koes BW (2004) Back schools for non-specific low-back pain.\nKhadilkar A, Milne S, Brosseau L, Robinson V, Saginur M, Shea B, Tugwell P, Wells G (2005) Transcutaneous electrical nerve stimulation (TENS) for chronic low-back pain.\nFrench SD, Cameron M, Walker BF, Reggars JW, Esterman AJ (2006) A Cochrane review of superficial heat or cold for low back pain.\nEngers A, Jellema P, Wensing M, van der Windt DA, Grol R, van Tulder MW (2008) Individual patient education for low back pain.\nFurlan AD, Brosseau L, Imamura M, Irvin E (2002) Massage for low-back pain: a systematic review within the framework of the Cochrane Collaboration Back Review Group.\nOstelo RW, van Tulder MW, Vlaeyen JW, Linton SJ, Morley SJ, Assendelft WJ (2005) Behavioural treatment for chronic low-back pain.\nvan Duijvenbode IC, Jellema P, van Poppel MN, van Tulder MW (2008) Lumbar supports for prevention and treatment of low back pain.\nClarke JA, van Tulder MW, Blomberg SE, de Vet HC, van der Heijden GJ, Bronfort G, Bouter LM (2007) Traction for lowback pain with or without sciatica.\nGuzman J, Esmail R, Karjalainen K, Malmivaara A, Irvin E, Bombardier C (2001) Multidisciplinary rehabilitation for chronic low back pain: systematic review.\nAlexandre NM, de Moraes MA, Correa Filho HR, Jorge SA (2001) Evaluation of a program to reduce back pain in nursing personnel.\nBendix AF, Bendix T, Ostenfeld S, Bush E, Andersen A (1995) Active treatment programs for patients with chronic low back pain: a prospective, randomized, observer-blinded study.\nChatzitheodorou D, Kabitsis C, Malliou P, Mougios V (2007) A pilot study of the effects of high-intensity aerobic exercise versus passive interventions on pain, disability, psychological strain, and serum cortisol concentrations in people with chronic low back pain.\nCritchley DJ, Ratcliffe J, Noonan S, Jones RH, Hurley MV (2007) Effectiveness and cost-effectiveness of three types of physiotherapy used to reduce chronic low back pain disability: a pragmatic randomized trial with economic evaluation.\nDeyo RA, Walsh NE, Martin DC, Schoenfeld LS, Ramamurthy S (1990) A controlled trial of transcutaneous electrical nerve stimulation (TENS) and exercise for chronic low back pain.\nDonzelli S, Di Domenica E, Cova AM, Galletti R, Giunta N (2006) Two different techniques in the rehabilitation treatment of low back pain: a randomized controlled trial.\nElnaggar IM, Nordin M, Sheikhzadeh A, Parnianpour M, Kahanovitz N (1991) Effects of spinal flexion and extension exercises on low-back pain and spinal mobility in chronic mechanical low-back pain patients.\nFerreira ML, Ferreira PH, Latimer J, Herbert RD, Hodges PW, Jennings MD, Maher CG, Refshauge KM (2007) Comparison of general exercise, motor control exercise and spinal manipulative therapy for chronic low back pain: a randomized trial.\nFrost H, Lamb SE, Doll HA, Carver PT, Stewart-Brown S (2004) Randomised controlled trial of physiotherapy compared with advice for low back pain.\nGalantino ML, Bzdewka TM, Eissler-Russo JL, Holbrook ML, Mogck EP, Geigle P, Farrar JT (2004) The impact of modified Hatha yoga on chronic low back pain: a pilot study.\nGladwell V, Head S, Haggar M, Beneke R (2006) Does a program of Pilates improve chronic non-specific low back pain? J Sport Rehabil 15:338350.\nGoldby LJ, Moore AP, Doust J, Trew ME (2006) A randomized controlled trial investigating the efficiency of musculoskeletal physiotherapy on chronic low back disorder.\nGudavalli MR, Cambron JA, McGregor M, Jedlicka J, Keenum M, Ghanayem AJ, Patwardhan AG (2006) A randomized clinical trial and subgroup analysis to compare flexion-distraction with active exercise for chronic low back pain.\nGur A, Karakoc M, Cevik R, Nas K, Sarac AJ, Karakoc M (2003) Efficacy of low power laser therapy and exercise on pain and functions in chronic low back pain.\nHildebrandt VH, Proper KI, van den Berg R, Douwes M, van den Heuvel SG, van Buuren S (2000) [Cesar therapy is temporarily more effective in patients with chronic low back pain than the standard treatment by family practitioner: randomized, controlled and blinded clinical trial with 1 year follow-up] Cesar-therapie tijdelijk effectiever dan standaardbehandeling door de huisarts bij patienten met chronische aspecifieke large rugklachten; gerandomiseerd, gecontroleerd en geblindeerd onderzoek met 1 jaar follow-up.\nJohannsen F, Remvig L, Kryger P, Beck P, Warming S, Lybeck K, Dreyer V, Larsen LH (1995) Exercises for chronic low back pain: a clinical trial.\nKankaanpaa M, Taimela S, Airaksinen O, Hanninen O (1999) The efficacy of active rehabilitation in chronic low back pain.\nLewis JS, Hewitt JS, Billington L, Cole S, Byng J, Karayiannis S (2005) A randomized clinical trial comparing two physiotherapy interventions for chronic low back pain.\nMannion AF, Muntener M, Taimela S, Dvorak J (1999) A randomized clinical trial of three active therapies for chronic low back pain.\nMarshall P, Murphy B (2008) Self-report measures best explain changes in disability compared with physical measures after exercise rehabilitation for chronic low back pain.\nRisch SV, Norvell NK, Pollock ML, Risch ED, Langer H, Fulton M, Graves JE, Leggett SH (1993) Lumbar strengthening in chronic low back pain patients.\nRittweger J, Just K, Kautzsch K, Reeg P, Felsenberg D (2002) Treatment of chronic lower back pain with lumbar extension and whole-body vibration exercise: a randomized controlled trial.\nRoche G, Ponthieux A, Parot-Shinkel E, Jousset N, Bontoux L, Dubus V, Penneau-Fontbonne D, Roquelaure Y, Legrand E, Colin D, Richard I, Fanello S (2007) Comparison of a functional restoration program with active individual physical therapy for patients with chronic low back pain: a randomized controlled trial.\nSherman KJ, Cherkin DC, Erro J, Miglioretti DL, Deyo RA (2005) Comparing yoga, exercise, and a self-care book for chronic low back pain: a randomized, controlled trial.\nSjogren T, Nissinen KJ, Jarvenpaa SK, Ojanen MT, Vanharanta H, Malkia EA (2005) Effects of a workplace physical exercise intervention on the intensity of headache and neck and shoulder symptoms and upper extremity muscular strength of office workers: a cluster randomized controlled cross-over trial.\nSmeets RJ, Vlaeyen JW, Hidding A, Kester AD, van der Heijden GJ, van Geel AC, Knottnerus JA (2006) Active rehabilitation for chronic low back pain: cognitive-behavioral, physical, or both? First direct post-treatment results from a randomized controlled trial [ISRCTN22714229].\nTritilanunt T, Wajanavisit W (2001) The efficacy of an aerobic exercise and health education program for treatment of chronic low back pain.\nWilliams KA, Petronis J, Smith D, Goodrich D, Wu J, Ravi N, Doyle EJ Jr, Gregory Juckett R, Munoz Kolar M, Gross R, Steinberg L (2005) Effect of Iyengar yoga therapy for chronic low back pain.\nChown M, Whittamore L, Rush M, Allan S, Stott D, Archer M (2008) A prospective study of patients with chronic back pain randomised to group exercise, physiotherapy or osteopathy.\nHarts CC, Helmhout PH, de Bie RA, Staal JB (2008) A highintensity lumbar extensor strengthening program is little better than a low-intensity program or a waiting list control group for chronic low back pain: a randomised clinical trial.\nKoldas Dogan S, Sonel Tur B, Kurtais Y, Atay MB (2008) Comparison of three different approaches in the treatment of chronic low back pain.\nTekur P, Singphow C, Nagendra HR, Raghuram N (2008) Effect of short-term intensive yoga program on pain, functional disability, and spinal flexibility in chronic low back pain: a randomized control study.\nHurri H (1989) The Swedish back school in chronic low back pain.\nScand J Rehabil Med 21:3340 52.\nKeijsers JF, Groenman NH, Gerards FM, van Oudheusden E, Steenbakkers M (1989) A back school in The Netherlands: evaluating the results.\nKlaber Moffet J, Chase S, Portek I, Ennis J (1986) A controlled prospective study to evaluate the effectiveness of a back school in the relief of chronic low-back pain.\nRibeiro LH, Jennings F, Jones A, Furtado R, Natour J (2008) Effectiveness of a back school program in low back pain.\nGhoname EA, Craig WF, White PF, Ahmed HE, Hamza MA, Henderson BN, Gajraj NM, Huber PJ, Gatchel RJ (1999) Percutaneous electrical nerve stimulation for low back pain: a randomized crossover study.\nGrant DJ, Bishop-Miller J, Winchester DM, Anderson M, Faulkner S (1999) A randomized comparative trial of acupuncture versus transcutaneous electrical nerve stimulation for chronic back pain in the elderly.\nJarzem PF, Harvey EJ, Arcaro N, Kaczorowski J (2005) Transcutaneous Electrical Nerve Stimulation [TENS] for Chronic Low Back Pain.\nJarzem PF, Harvey EJ, Arcaro N, Kaczorowski J (2005) Transcutaneous electrical nerve stimulation [TENS] for shortterm treatment of low back pain-randomized double blind crossover study of sham verus conventional TENS.\nYokoyama M, Sun X, Oku S, Taga N, Sato K, Mizobuchi S, Takahashi T, Morita K (2004) Comparison of percutaneous electrical nerve stimulation with transcutaneous electrical nerve stimulation for long-term pain relief in patients with chronic low back pain.\nTopuz O, O zfidan E, Ozgen M, Ardic F (2004) Efficacy of transcutaneous electrical nerve stimulation and percutaneous neuromodulation therapy in chronic low back pain.\nDjavid GE, Mehrdad R, Ghasemi M, Hasan-Zadeh H, SotoodehManesh A, Pouryaghoub G (2007) In chronic low back pain, low level laser therapy combined with exercise is more beneficial than exercise alone in the long term: a randomised trial.\nKlein RG, Eek BC (1990) Low-energy laser treatment and exercise for chronic low back pain: double-blind controlled trial.\nSoriano S, Rios R (1998) Gallium arsenide laser treatment of chronic low back pain: a prospective, randomized and double blind study.\nField T, Hernandez-Reif M, Diego M, Fraser M (2007) Lower back pain and sleep disturbance are reduced following massage therapy.\nHernandez-Reif M, Field T, Krasnegor J, Theakston H (2001) Lower back pain is reduced and range of motion increased after massage therapy.\nHaas M, Groupp E, Muench J, Kraemer D, Brummel-Smith K, Sharma R, Ganger B, Attwood M, Fairweather A (2005) Chronic disease self-management program for low back pain in the elderly.\nJohnson RE, Jones GT, Wiles NJ, Chaddock C, Potter RG, Roberts C, Symmons DP, Watson PJ, Torgerson DJ, Macfarlane GJ (2007) Active exercise, education, and cognitive behavioral therapy for persistent disabling low back pain: a randomized controlled trial.\ntraining add to operant behavioral treatment? Results of a randomized clinical trial.\nJ Consult Clin Psychol 67:931944 75.\nNewton-John TR, Spence SH, Schotte D (1995) Cognitivebehavioural therapy versus EMG biofeedback in the treatment of chronic low back pain.\nNicholas MK, Wilson PH, Goyen J (1991) Operant-behavioural and cognitive-behavioural treatment for chronic low back pain.\nNicholas MK, Wilson PH, Goyen J (1992) Comparison of cognitive-behavioral group treatment and an alternative nonpsychological treatment for chronic low back pain.\nRose MJ, Reilly JP, Pennie B, Bowen-Jones K, Stanley IM, Slade PD (1997) Chronic low back pain rehabilitation programs: a study of the optimum duration of treatment and a comparison of group and individual therapy.\nSchweikert B, Jacobi E, Seitz R, Cziske R, Ehlert A, Knab J, Leidl R (2006) Effectiveness and cost-effectiveness of adding a cognitive behavioral treatment to the rehabilitation of chronic low back pain.\nStuckey SJ, Jacobs A, Goldfarb J (1986) EMG biofeedback training, relaxation training, and placebo for the relief of chronic back pain.\nTurner JA (1982) Comparison of group progressive-relaxation training and cognitive-behavioral group therapy for chronic low back pain.\nTurner JA, Clancy S (1988) Comparison of operant behavioral and cognitive-behavioral group treatment for chronic low back pain.\nTurner JA, Jensen MP (1993) Efficacy of cognitive therapy for chronic low back pain.\nLeeuw M, Goossens ME, van Breukelen GJ, de Jong JR, Heuts PH, Smeets RJ, Koke AJ, Vlaeyen JW (2008) Exposure in vivo versus operant graded activity in chronic low back pain patients: results of a randomized controlled trial.\nvan der Roer N, van Tulder M, Barendse J, Knol D, van Mechelen W, de Vet H (2008) Intensive group training protocol versus guideline physiotherapy for patients with chronic low back pain: a randomised controlled trial.\nMoseley GL, Nicholas MK, Hodges PW (2004) A randomized controlled trial of intensive neurophysiology education in chronic low back pain.\nBorman P, Keskin D, Bodur H (2003) The efficacy of lumbar traction in the management of patients with low back pain.\nAlaranta H, Rytokoski U, Rissanen A, Talo S, Ronnemaa T, Puukka P, Karppi SL, Videman T, Kallio V, Slatis P (1994) Intensive physical and psychosocial training program for patients with chronic low back pain.\nBendix AF, Bendix T, Vaegter K, Lund C, Frolund L, Holm L (1996) Multidisciplinary intensive treatment for chronic low back pain: a randomized, prospective study.\n38 Eur Spine J (2011) 20:1939.\nKaapa EH, Frantsi K, Sarna S, Malmivaara A (2006) Multidisciplinary group rehabilitation versus individual physiotherapy for chronic nonspecific low back pain: a randomized trial.\nVollenbroek-Hutten MM, Hermens HJ, Wever D, Gorter M, Rinket J, Ijzerman MJ (2004) Differences in outcome of a multidisciplinary treatment between subgroups of chronic low back pain patients defined using two multiaxial assessment instruments: the multidimensional pain inventory and lumbar dynamometry.\nHarkapaa K, Jarvikoski A, Mellin G, Hurri H (1989) A controlled study on the outcome of inpatient and outpatient treatment of low back pain.\nPain, disability, compliance, and reported treatment benefits three months after treatment.\nBendix AE, Bendix T, Haestrup C, Busch E (1998) A prospective, randomized 5-year follow-up study of functional restoration in chronic low back pain patients.\nEur Spine J 7:111119 98.\nCambron JA, Gudavalli MR, Hedeker D, McGregor M, Jedlicka J, Keenum M, Ghanayem AJ, Patwardhan AG, Furner SE (2006) One-year follow-up of a randomized clinical trial comparing flexion distraction with an exercise program for chronic lowback pain.\nHarkapaa K, Mellin G, Jarvikoski A, Hurri H (1990) A controlled study on the outcome of inpatient and outpatient treatment of low back pain.\nMellin G, Harkapaa K, Hurri H, Jarvikoski A (1990) A controlled study on the outcome of inpatient and outpatient treatment of low back pain.\nMellin G, Hurri H, Harkapaa K, Jarvikoski A (1989) A controlled study on the outcome of inpatient and outpatient treatment of low back pain.\nNiemisto L, Rissanen P, Sarna S, Lahtinen-Suopanki T, Lindgren KA, Hurri H (2005) Cost-effectiveness of combined manipulation, stabilizing exercises, and physician consultation compared to physician consultation alone for chronic low back pain: a prospective randomized trial with 2-year follow-up.\nSmeets RJ, Vlaeyen JW, Hidding A, Kester AD, van der Heijden GJ, Knottnerus JA (2008) Chronic low back pain: physical training, graded activity with problem solving training, or both? The one-year post-treatment results of a randomized controlled trial.\nTavafian SS, Jamshidi AR, Montazeri A (2008) A randomized study of back school in women with chronic low back pain: quality of life at three, six, and twelve months follow-up.\nFrost H, Klaber Moffet JA, Moser JS, Fairbank JC (1995) Randomised controlled trial for evaluation of fitness programme for patients with chronic low back pain.\nVlaeyen JW, Haazen IW, Schuerman JA, Kole-Snijders AM, van Eek H (1995) Behavioural rehabilitation of chronic low back pain: comparison of an operant treatment, an operantcognitive treatment and an operant-respondent treatment.\nBr J Clin Psychol 34(Pt 1):95118 108."}