{"title": "59.pdf", "contents": "Spinal kinematics during gait in healthy individuals across different age groups.\nMost studies investigating trunk kinematics have not provided adequate quantification of spinal motion, resulting in a limited understanding of the healthy spines biomechanical behavior during gait.\nThis study aimed at assessing spinal motion during gait in adolescents, adults and older individuals.\nFourteen adolescents (1018 years), 13 adults (1935 years) and 15 older individuals (65 years) were included.\nUsing a previously validated enhanced optical motion capture approach, sagittal and frontal plane spinal curvature angles and general trunk kinematics were measured during shod walking at a self-selected normal speed.\nPostural differences indicated that lumbar lordosis and thoracic kyphosis increase throughout adolescence and reach their peak in adulthood.\nThe absence of excessive thoracic kyphosis in older individuals could be explained by a previously reported subdivision in those who develop excessive kyphosis and those who maintain their curve.\nFurthermore, adults displayed increased lumbar spine range of motion as compared to the adolescents, whereas the increased values in older individuals were found to be related to higher gait speeds.\nThis dataset on the age-related kinematics of the healthy spine can serve as a basis for understanding pathological deviations and monitoring rehabilitation progression.\nFurthermore, they highlighted the motion of the pelvis and trunk to be essential determinants of bipedal gait.\nThe involvement of the upper body in gait stability as well as a variety of changes in motion patterns due to aging and disease were further pointed out by McGibbon and Krebs (2001).\nIn contemporary biomechanical research as well as in clinics, gait kinematics are usually measured using skin marker-based motion capture systems.\nWalking speed is known to have an influence on pelvis and head movements in healthy adults, whereby increased walking speed corresponds to an increase in the magnitude and variability of the acceleration of these segments (Menz et al.\nIt has therefore been proposed that an individuals comfortable walking speed is selected in order to minimize the level of acceleration variability as well as to ensure smooth and rhythmic pelvis and head movements (Menz et al.\nWhen looking at differently aged populations, this comfortable walking speed was reported to decline with increasing age (Himann, Cunningham, Rechnitzer, & Paterson, 1988; Imms & Edholm, 1981; Murray, Kory, & Clarkson, 1969) suggesting that older individuals might present kinematic changes due to a decreased walking speed.\nHowever, walking speed seems not to be the only factor responsible for altered trunk kinematics with advanced age, since older subjects have been shown to exhibit different head and trunk motion patterns compared to younger subjects even when walking at equal speeds (Kavanagh et al.\nIn addition, Van Emmerik et al.\n(2005) reported altered movement amplitudes of the pelvis and trunk segments between young, adult and older individuals that were not related to walking speed.\nThese non-walking speed-related changes might be explained by age-related morphological changes that lead to the previously observed decreases in maximal sagittal range of motion of the lumbar, thoracic and cervical spine in older individuals (Kuo, Tully, & Galea, 2009).\n, 2003), a reduced maximal range of motion might still have an influence on the neuromuscular control of the respective joints.\nIn order to be able to comprehensively investigate pathologies that directly or indirectly affect the spine, accurate knowledge of the biomechanics of a healthy spine during gait with respect to age is critical.\nUsing a previously validated enhanced non-invasive optical approach, the main aim of the current study was therefore to assess sagittal and frontal plane spinal curvature angles during gait in healthy adolescents, adults and older individuals and to provide a basis for future investigations involving pathologies.\nIn addition, spatio-temporal gait parameters and absolute and relative angles of a rigid pelvis, lumbar, thoracic and cervical segment were calculated in order to support the interpretation of the primary outcomes.\nAll participants (as well as the legal guardians of the adolescents) provided written informed consent and the study protocol was approved by the responsible ethics committees.\nSubsequently, all subjects were measured wearing their own comfortable shoes in a standing upright position for 2 s and during walking at self-selected normal.\nTable 1 Demographics of the healthy adolescents, adults and older individuals expressed as means with standard deviations (SD) and ranges (in brackets).\n83) Mass [kg] 53.\nHuman Movement Science 54 (2017) 7381.\nspeed on a 10 m level ground walkway until at least 4 were recorded.\nRaw data (unfiltered marker trajectories) from both laboratories were further processed by one single investigator using identical data analysis procedures.\n5, Vicon, Oxford, UK) was used for defining the gait events (i.\ninitial contact and toe-off).\nSpinal curvature angles in the sagittal and frontal planes were calculated based on the circles that were fitted into the markers on the spinous processes of the vertebrae T11, L1, L2, L3, L4 and L5 (i.\nmarkers SPT5, SPL1-5) for the lumbar curvature and T3, T5, T7, T9 and T11 (i.\nIn order to minimize possible projection error due to the transverse plane rotation of the thorax during gait, thoracic curves were calculated using a dynamic coordinate system, established on the basis of a moving sagittal plane that was defined by the apical marker of the thoracic frontal curve and the marker on the sternum.\nThese procedures have been previously described and successfully implemented for the evaluation of spinal curvature angles during gait in patients with adolescent idiopathic scoliosis (Schmid, Studer, et al.\n, 2016) and hemiplegic cerebral palsy (Schmid, Romkes, Taylor, Lorenzetti, & Brunner, 2016).\nThe threedimensional position and orientation of these segments during gait was then calculated in relation to the standing measurement trial (absolute segmental angles) as well as between the adjacent segments (relative segmental angles: cervical vs.\npelvis) as described elsewhere (Schmid, Studer, et al.\nThe individual curvature and segmental angle curves were time normalized to a left gait cycle consisting of 101 points per trial and averaged over the four trials per subject (i.\nNo filtering routines were applied throughout the data reduction process.\nThe primary outcome parameters of this study were defined as the average and range of.\nMarker placement according to the IfB trunk model in combination with the Plug-in Gait full body model for the assessment of spinal curvature angles and segmental trunk kinematics.\nmotion (RoM) values of the spinal curvature angles over one full gait cycle (expressed in degrees []).\nThe RoM values of the absolute and relative segmental angles over one full gait cycle (expressed in degrees []) as well as a number of spatio-temporal gait parameters served as secondary outcome parameters.\nThe spatio-temporal parameters were all expressed as dimensionless numbers (Hof, 1996): walking speed was divided by the square root of the product of gravitational acceleration and body height, cadence by the square root of the quotient of gravitational acceleration over body height, stride length by body height and stride time by the square root of the quotient of body height over gravitational acceleration.\nTo verify normal distribution of the outcome parameters, the Shapiro-Wilk test was used (normally distributed: p > 0.\nComparisons for several outcome parameters between the adolescents, adults and older individuals groups were carried out using one-way analyses of variance (ANOVA) with Tukey HSD post hoc tests.\nDue to the explorative character of the study, however, the interpretation of the results was mainly based on the magnitude of the effects (Cohens f and d, respectively) rather than the p-values.\nThereby, pairwise comparisons were carried out when the ANOVA yielded considerable effects (f  0.\nA difference was thereby classified as clinically relevant with a large effect (d  0.\n8) and the mean difference above the MCID and as clinically not relevant with a small to moderate effect (0.\nCurvature angles values that showed clinically relevant differences were additionally evaluated for a possible gait speed dependency using linear regression analyses.\nFurthermore, average sagittal curvature angles indicated clinically relevant differences between older individuals and adolescents (thoracic) as well as between older individuals and adults (thoracic and lumbar).\nNo further clinically relevant group differences could be found.\n001) but not than the adults (Table 2).\n014) with advancing age.\nLooking at the RoM values of the absolute and relative segmental angles (Table 2), several group differences seemed to be indicated.\nThe main aim of this study was to investigate spinal kinematics during normal walking in healthy adolescents, adults and older individuals to shed some light into the age-dependent biomechanical behavior of the healthy spine and to provide a basis for future investigations on spinal pathologies.\nThe analyses revealed that adults exhibit more distinct thoracic kyphosis and lumbar lordosis angles than the adolescents.\nIn addition, adults showed greater frontal plane curvature motion in the lumbar region compared to adolescents, whereas the greater frontal plane curvature motion in older individuals was found to be related to higher gait speeds in this group.\nThese observed average lumbar lordosis angles in adults and older individuals were similar to the values established by Dreischarf et al.\n, 2012) in order to assess the lumbar shape and its mobility as a function of age in 323 standing asymptomatic subjects.\n4 in 2029 years old subjects to 29 in subjects aged 50 years and more.\nBy taking a closer look at the lumbar shape, they further revealed that the lower part of the lumbar spine retained its shape and mobility, while the middle section flattened and became less mobile with increasing age (Dreischarf et al.\nbetween adolescents and adults, on the other hand, the results indicate a clinically relevant age-related increase in average lumbar lordosis.\nConsidering these and previous findings, it can be postulated that lumbar lordosis increases during adolescence, reaches its peak during adulthood and then again decreases with further advancing age, although the latter is likely to be dependent on the highly variable effects of ageing.\nThe thoracic kyphosis seemed to follow a similar pattern from adolescence to adulthood by showing clinically relevant increases in curvature angles.\nHowever, contrary to an expected further increase of thoracic kyphosis with advancing age, older individuals showed even tendencies for smaller curvature angles compared to the adults.\nThe older individuals in the current study showed no.\n) planes over one gait cycle (all angles expressed in degrees []) as well as the spatio-temporal gait parameters (expressed as dimensionless numbers) in healthy adolescents, adults and older individuals.\nIn addition, results for the group comparisons (one-way analyses of variance (ANOVA) and Tukeys post hoc tests as well as effect sizes (Cohens f and d, respectively) are presented.\n1)Adolescents (n = 14) 2)Adults (n = 13) 3)Older (n = 15) ANOVA Post hoc (Tukey HSD).\nPositive/negative AVG curvature angles: Kyphosis/lordosis (sagittal plane), right/left lateral bending (frontal plane).\n05), post hoc tests indicated.\n1) with statistical significance (p  0.\n05), post hoc tests indicated.\n+ Large effect size for Tukeys post hoc test (d  0.\nHuman Movement Science 54 (2017) 7381.\nAll angles are expressed in degrees [].\nThe dashed vertical lines represent the minimal clinically important difference of 5.\nDifferences were categorized as clinically relevant (large black diamonds) and clinically not relevant (small white diamonds).\nScatterplots and coefficients of determination (R2) illustrating the correlations for gait speed and the curvature angles which showed clinically relevant differences between adolescents and adults (A-C) as well as adolescents and elderly individuals (D).\nGait speed was normalized according to Hof (1996).\nThe asterisks (*) indicate a statistically significant coefficient of determination (p  0.\nAnother factor that could have influenced the thoracic curvature during gait is of motivational origin and will be discussed later on in this article.\nIn the frontal plane, although not clinically relevant, the lumbar and thoracic curvature angles tended to be slightly different between the adolescents and both the adults and older individuals.\nThese tendencies were not only recognizable during walking but also in the static measurement trial (values not presented).\nSince it is not very likely that such group-specific frontal plane differences are of physiological nature, a possible explanation could be that the measurements were carried out by two different examiners (i.\nadults and older individuals).\nGorton, Hebert, and Gannotti (2009), for example, investigated the variability of the measurements of one single healthy subject conducted in 12 different motion analysis laboratories.\nWhile the motion capture systems themselves contributed a negligible amount to the overall variability, marker placement differences between examiners were shown to have the largest impact on variability (Gorton et al.\nBut again, the differences observed in the current study were considered clinically not relevant and can therefore be considered negligible.\nAnother rather surprising finding was the observed increased RoM of the frontal lumbar curvature angle in older individuals compared to adolescents.\n, 1997a), one could have expected that the RoM of the spinal curvature angles in the older individuals group would decrease.\n, 1997a), it seems plausible that the currently observed increased walking speed in the older individuals group caused clinically relevant increases in frontal plane RoM.\nA possible explanation for this might be found in a phenomenon called the Hawthorne effect, or more recently known as research participation effect (McCambridge, Witton, & Elbourne, 2014).\nThis effect describes the possible impact on behavior that occurs in an experiment as a result of the awareness of being treated, studied or observed (Lied & Kazandjian, 1998).\nLooking at the older population in the current study, the attention given to them by asking them to be part of a biomedical research project in a laboratory with sophisticated technical equipment at a prestigious university seemed to have led to an overly motivated behavior to deliver their best possible performance, which was most likely directly associated with the increased walking speed.\na higher motivational level corresponding to a more upright posture, especially in the thoracic spine.\nThe adolescents were surely not less motivated, since they were all excited to see the systems that are being used to create their heroes in animated movies and video games.\nDifferences were categorized as clinically relevant (large black diamonds) and clinically not relevant (small white diamonds).\nRoM: range of motion.\nlaboratory atmosphere and the fact that the laboratory was located in the basement of a childrens hospital seemed to have an overwhelming and almost slightly intimidating effect on some of the young participants, leading to a rather shy behavior and hence slower walking speeds.\nThe current study indicated postural differences in the sagittal plane between adolescents and adults, whereby the magnitude of lumbar lordosis and thoracic kyphosis seemed to increase during adolescence and reach their peak in adulthood.\nThe absence of excessive thoracic kyphosis in older individuals could be explained by a previously reported subdivision of this population in those who develop excessive thoracic kyphosis and those who remain near the younger thoracic curve.\nFurthermore, adults displayed increased lumbar spine frontal plane RoM as compared to the adolescents, whereas the increased values in older individuals were found to be related to higher gait speeds.\nThis dataset on the age-related kinematic behavior of the healthy spine during gait can serve as an important basis for investigations on spinal pathologies or treatment effects.\nComparative evaluation of a novel measurement tool to assess lumbar spine posture and range of motion.\nEuropean Spine Journal, 21, 21702180.\nAge, gender and speed effects on spinal kinematics during walking.\nPatterns of spinal motion during walking.\nThe upper body segmental movements during walking by young females.\nAge-related changes in speed of walking.\nScaling gait data to body size.\nStudies of gait and mobility in the elderly.\nAge-related differences in head and trunk coordination during walking.\nSpine (Phila Pa 1976), 31, E898906.\nMulti-segment trunk kinematics during locomotion and elementary exercises.\nA Hawthorne strategy: Implications for performance measurement and improvement.\nKinematics of the trunk and the lower extremities during restricted and unrestricted squats.\nJournal of Clinical Epidemiology, 67, 267277.\nAge-related changes in lower trunk coordination and energy transfer during gait.\nJournal of Neurophysiology, 85, 19231931.\nJournal of Gerontology, 24, 169178.\nThe major determinants in normal and pathological gait.\nOrthotic correction of lower limb function during gait does not immediately influence spinal kinematics in spastic hemiplegic cerebral palsy.\nQuantifying spinal gait kinematics using an enhanced optical motion capture approach in adolescent idiopathic scoliosis.\nUsing skin markers for spinal curvature quantification in main thoracic adolescent idiopathic scoliosis: an explorative radiographic study.\nAge-related changes in upper body adaptation to walking speed in human locomotion.\nGait Posture, 22, 233239."}