{"title": "60.pdf", "contents": "Background: Skin marker-based analysis of functional spinal movement is a promising  method for quantifying longitudinal effects of treatment interventions in patients with spinal  pathologies.\nHowever, observed day-to-day changes might not necessarily be due to a  treatment intervention, but can result from errors related to soft tissue artifacts, marker  placement inaccuracies or biological day-to-day variability.\nResearch question: How reliable are skin marker-derived three-dimensional spinal kinematics  during functional activities between two separate measurement sessions?  Methods: Twenty healthy adults (11 females/9 males) were invited to a movement analysis  laboratory for two visits separated by 7-10 days.\nBetween-session reliability for continuous data and discrete parameters was  determined by analyzing systematic errors using one sample T-tests as well as by calculating  intraclass correlation coefficients (ICCs) and minimal detectable changes (MDCs).\nResults and Significance: The analysis indicated high overall consistency for sagittal plane  curvature angles during all activities, but lower consistency for frontal and transverse plane  angles during walking and running.\nMDCs were mostly below 15 and generally higher in the  lumbar than thoracic region.\nThis study provides important information that can serve as a  basis for researchers and clinicians aiming at investigating longitudinal effects of treatment  interventions on spinal motion behavior in patients with spinal pathologies.\nThis article is a preprint and has not been certified by peer review.\nOptical motion capturing is an appropriate method to quantify the biomechanics of the spine  during functional movement [1].\nIt provides an important basis for the longitudinal evaluation  of treatment effects in patients with spinal pathologies.\nHowever, observed day-to-day  changes might not necessarily be due to an administered treatment intervention, but can result  from errors related to instrumental inaccuracies, soft tissue artifacts, marker placement  inaccuracies or biological day-to-day variability [2-4].\nMost of these factors can only be  partially controlled and therefore, it is important to know the extent of variability resulting  from these factors.\nResearchers and clinicians need such information to determine whether an  observed change can in fact be ascribed to a treatment intervention or is just a result of the  aforementioned error sources.\nOne possible way to quantify the reliability of repeated  measurements is the three-layered approach by Weir [9].\nThis study aims at evaluating the between-session reliability of three-dimensional spinal  kinematics (continuous data as well as discrete parameters) during various functional  activities derived from marker-based optical motion capturing.\n5) kg/m2)  participated in this study.\nThe protocol was approved by the local ethics committee and  written informed consent was obtained prior to the first measurement.\nParticipants were invited to the movement analysis laboratory for two visits separated by 7-10  days.\nAt both visits, experienced physiotherapists equipped them with 58 retro-reflective  markers according to a previously described configuration [1].\nParticipants were then asked to  sit and stand quietly for 10 s and to perform four repetitions of the following activities  (barefoot and at self-selected normal speed): walking and running on a 10-meter level ground,  standing up and sitting down on a chair (chair rising), lifting up and putting down a 5 kg-box  (box lifting), and performing a vertical counter movement jump (CMJ).\nDetails on  standardization and execution of the activities can be found elsewhere [10].\nData were  recorded at a sampling frequency of 200 Hz using a 10-camera optical motion capture system  (8x Bonita 3 and 2x Bonita 10; Vicon, Oxford, UK).\n, Natrick, MA, USA)  to calculate sagittal and frontal plane curvature angles as well as transverse plane segmental  rotation angles for the lumbar and thoracic regions.\nData were then low-pass filtered at 6 Hz (Butterworth, fourth order,.\nData collected from the functional activities were  averaged over the four repetitions.\nTo evaluate between-session reliability, data was first  analyzed for systematic errors by using one sample T-tests (alpha-level: 0.\n05) to compare the  average of the individual differences to zero.\nFor continuous data, T-tests were thereby  implemented using one-dimensional Statistical Parametric Mapping (SPM; spm1d-package  www.\nSubsequently, relative reliability was determined using intraclass  correlations coefficients (consistency formula ICC(C,1)), and absolute reliability was  quantified by MDCs, calculated as 1.\n96*SDd (standard deviation of the differences) [14].\nSome trials had to be excluded due to incomplete or missing marker data.\nNo systematic errors were found (Figures 1 and 2, left columns).\nICC values for sagittal plane  angles indicated high overall consistency (ICCs mostly >0.\n75), whereas values for frontal and  transverse plane angles during walking and running showed only low to moderate consistency  (ICCs mostly <0.\nMDCs for sagittal plane angles were 7.\nNo systematic errors were found, except for lumbar RoM during sitting down on a chair  (p=0.\nMost ICCs ranged from 0.\n96, except from a few frontal and  transverse plane average angles during walking and running (ICCs of 0.\nMDCs for sagittal plane average values were 9.\n3 (other planes: 4.\n8) in  the lumbar and 4.\n0) in the thoracic region, and for sagittal plane RoM values  8.\nThis study aimed at quantifying the between-session reliability of continuous and discrete  three-dimensional spinal curvature and rotation angles during various functional activities.\nThe analysis indicated high overall consistency for sagittal plane curvature angles during all  activities, but lower consistency for frontal and transverse plane angles during walking and  running.\nMDCs were mostly below 15 and generally higher in the lumbar than thoracic  region.\nCompared to the literature, our results only partially agree with the recently published  findings by Fernandes et al.\nHowever, it should be considered that their  marker configuration and definition of kinematic parameters were substantially different from  ours, which complicates appropriate direct comparisons.\nDespite the possibility that frontal and transverse plane angles during walking and running  might simply be less reliable than sagittal plane angles, the lower consistency might be  partially explained by the considerably smaller movement extent.\nThe fact that thoracic spine angles showed lower MDCs than lumbar spine angles with  comparably high ICCs might be explained by a smaller and probably more controlled thoracic  motion resulting from restrictions imposed by the rib cage as well as a larger amount of soft  tissue in the lumbar region as previously discussed [11].\nThe left column shows results of the evaluation for systematic errors using independent  samples T-test (implemented by means of one-dimensional Statistical Parametric Mapping,  SPM), with the horizontal colored lines indicating the thresholds for statistical significance at  the p0.\nMiddle and right columns illustrate the intraclass correlation coefficient  (consistency formula ICC(C,1)) for relative reliability and the minimal detectable change  (MDC) for absolute reliability, respectively.\nThis article is a preprint and has not been certified by peer review.\nTable 1: Sagittal, frontal and transverse plane lumbar and thoracic spinal curvature angles  (average over four repetitions) in degrees [] as well as results of the between-session  reliability analyses for average and range of motion (RoM) parameters.\nStanding  Lumbar  Sagittal  Average  -42.\nThoracic      34.\nSitting  Lumbar  Sagittal  Average  -19.\nThoracic      30.\nStanding up  from chair.\nSitting down  on chair.\nPutting down  a box.\nThoracic      31.\nThoracic      29.\nAbbreviations: ICC = Intraclass correlation coefficient; MDC = Minimal detectable change.\na Negative average values in the sagittal plane represent a lordotic posture of the lumbar and thoracic back region, negative average values in  the frontal plane represent a left lateral bending and negative average values in the transverse plane represent a left rotation.\nMomentary ICC and MDC fluctuations such as observed in beginning of the chair rising and  box lifting activities might be ascribed to movement standardization and event detection  issues.\nAn important limitation of this study is that our motion capture system was not always able to  identify and distinguish all lumbar spine markers, especially in smaller individuals and  individuals with a pronounced lumbar lordosis.\nWe therefore suggest that future studies  include more cameras and/or cameras with a higher resolution to overcome such issues.\nThis article is a preprint and has not been certified by peer review.\nThis study provides important information that can serve as a basis for researchers and  clinicians aiming at investigating longitudinal effects of treatment interventions on spinal  motion behavior in patients with spinal pathologies.\nSpinal  kinematics during gait in healthy individuals across different age groups.\nHuman movement analysis using  stereophotogrammetry.\nHuman movement analysis using  stereophotogrammetry.\nPart 4: assessment of anatomical landmark misplacement and its  effects on joint kinematics.\n[4] Leardini A, Chiari L, Della Croce U, Cappozzo A.\nSoft tissue artifact assessment and compensation.\nA Study of Vicon System  Positioning Performance.\n[6] Eichelberger P, Ferraro M, Minder U, Denton T, Blasimann A, Krause F, et al.\nAnalysis of  accuracy in optical motion capture A protocol for laboratory setup evaluation.\nPelvis and lower limb anatomical landmark  calibration precision and its propagation to bone geometry and joint angles.\n[8] Zemp R, List R, Gulay T, Elsig JP, Naxera J, Taylor WR, et al.\nSoft tissue artefacts of the  human back: comparison of the sagittal curvature of the spine measured using skin markers  and an open upright MRI.\nQuantifying test-retest reliability using the intraclass correlation coefficient and  the SEM.\nMeasuring lumbar back  motion during functional activities using a portable strain gauge sensor-based system: A  comparative evaluation and reliability study.\nUsing Skin  Markers for Spinal Curvature Quantification in Main Thoracic Adolescent Idiopathic  Scoliosis: An Explorative Radiographic Study.\nWhat are  the biomechanical consequences of a structural leg length discrepancy on the adolescent spine  during walking? Gait Posture.\nApplying the right statistics: analyses of measurement studies.\nThree dimensional multi-segmental trunk kinematics and kinetics during gait: Test-retest  reliability and minimal detectable change."}