{"title": "61.pdf", "contents": "Soft Tissue Artefacts of the Human Back: Comparison of the Sagittal Curvature of the Spine Measured Using Skin Markers and an Open Upright MRI.\nSoft tissue artefact affects the determination of skeletal kinematics.\nThus, it is important to know the accuracy and limitations of kinematic parameters determined and modelled based on skin marker data.\nHere, the curvature angles, as well as the rotations of the lumbar and thoracic segments, of seven healthy subjects were determined in the sagittal plane using a skin marker set and compared to measurements taken in an open upright MRI scanner in order to understand the influence of soft tissue artefact at the back.\nSkin marker measurements therefore allow for the assessment of changes in the lumbar and thoracic curvature angles, but the absolute values suffer from uncertainty.\nNevertheless, this marker set appears to be suitable for quantifying lumbar and thoracic spinal changes between quasistatic whole body postural changes.\n(2014) Soft Tissue Artefacts of the Human Back: Comparison of the Sagittal Curvature of the Spine Measured Using Skin Markers and an Open Upright MRI.\nEditor: Shao-Xiang Zhang, College of Basic Medical Science, Third Military Medical University, China.\nReceived August 9, 2013; Accepted March 1, 2014; Published April 18, 2014.\nThis is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: The authors have no support or funding to report.\nCompeting Interests: JN is an employee of Rontgeninstitut Zurich-Altstetten.\nThere are no patents, products in development or marketed products to declare.\nThis does not alter the authors adherence to all the PLOS ONE policies on sharing data and materials.\nBack pain is an increasingly common affliction, with approximately one-third of the population suffering from low back pain at any given time [1].\nKinematic parameters of the lumbar spine, such as the rate of angular rotation and linear displacement at the joints (L3/L4; L4/L5; L5/S1), especially during the onset of lumbar flexion, are useful for discriminating between individuals with and without low back pain [2].\nWhile motion of the lumbar spine is accessible using video fluoroscopy [24], the approach is highly invasive and exposes subjects to unnecessary X-ray radiation [4].\nMoreover, while novel dynamic and non-invasive approaches now exist for assessing functional motion of the back, even over extended periods of time [58], the accuracy of such methods for evaluating the underlying skeletal kinematics remains unknown.\nIn addition to instability and degeneration of supporting soft tissue structures, overloading is considered a main cause of low back pain due to a combination of cumulative or acute loads [9,10].\nHowever, determination of the internal loading conditions requires knowledge of the spines position and movement.\nWhile bone pins allow direct access to skeletal kinematics [1113], they are only rarely used due to their invasive nature.\nMotion analysis, on the other hand, allows the non-invasive investigation of motion patterns [14].\nrarely limit the subjects movement, they are affected by soft tissue artefact (STA), which results from motion of the skin relative to the underlying bones due to inertial effects, skin elasticity and deformation caused by muscle contraction [1517].\nSTA occurs in all directions, and the distributions are known to be nonuniform [18].\nTo obtain an understanding of the accuracy of skin markers for assessing spinal kinematics, a marker set has been developed that allows global parameters of curvature angles [1925] and back segment rotations [2630] to be investigated [31].\nHowever, the accuracy and precision of these analyses remain unknown.\nSeveral studies have validated skin markers on different body regions [18,3238], but validation studies of back markers are rare [2628,39,40] (Table 1), and few have been validated against global spinal shape, including spinal segment curvature or rotations.\nUsing open MRI and skin markers, the goal of this study was to determine the magnitude and direction of STA on the back and compare the spinal curvature and segment angles.\nWe then examined whether the shape of the spine (lumbar and thoracic curvature angle and lumbar and thoracic segment rotation in the sagittal plane) can be measured with sufficient accuracy to determine spinal shape between posture changes or during quasi-static movements using skin markers.\nAccuracy of the marker and vertebra positions using MRI The accuracy of assessing vertebral location using MRI was determined using a plate of acrylic glass with five MRI-visible skin markers (paintballs) and two lamb vertebrae (Figure 1).\nThe two vertebrae were glued onto the plate between the markers.\n6 Tesla; Fonar Corporation, Melville, USA) in horizontal (0u), forward tilted (45u) and vertical (90u) positions in order to quantify the accuracy of the marker and vertebrae locations as well as the orientation of each vertebrae base plate plane (BPP) relative to horizontal.\nSubjects Seven healthy subjects (three female; average age 29 y (range 2246); height 174 cm (160184); mass 71 kg (5596)) provided written informed consent to participate in this pilot study that was approved by the local ethics committee.\nThe participant on Figure 2 has seen this manuscript and figure and has provided written informed consent for its use in publication.\nA wide range of subject height and weight was chosen in order to exemplarily investigate the range of kinematics that could be observed within a broad population.\nInstrumentation T2-weighted sagittal images were taken with a repetition time of 2750 ms, an echo time of 110 ms and a layer thickness of 4 mm.\nThe layers were ranked without any gaps between the marginal markers.\nAs a consequence, the lumbar and thoracic regions required approximately 35 and 50 images respectively, corresponding to a measurement time of approximately seven minutes for each posture.\nBody location Author Soft tissue artefact Motion.\n3 mm Static weight-bearing position.\n9 mm Static weight-bearing position.\n3 mm Level walking.\n[32] Up to 7 mm Static non-weight-bearing; knee flexion between 0u and 90u.\n1 mm Level walking.\n[32] Up to 22 mm Static non-weight-bearing; knee flexion between 0u and 90u.\n3 mm around the knee joint Functional activity: open-chain knee flexion, hip axial rotation, level walking, step up.\n[33] Mean marker error of about 67 mm Arm elevation.\n9 mm Hand flexion.\nHeneghan and Balanos [40] Up to 16 mm at thoracic levels (T1, T6, T12) 35u of axial rotation in a seated upright position.\n5 mm at thoracic levels (T1, T6, T12) Single arm elevation in a seated upright position.\n4 mm Static sitting position.\nAfter palpation, performed in an upright standing position, the markers were mounted on washers and were fixed to the skin using a toupee plaster.\nThe subjects lumbar and thoracic spines were then measured in the MRI in upright, flexed and extended seating positions (Figure 2b).\nSpheres were fitted to the markers (Geomagic Studio, v9, Raindrop Geomagic, USA), and the normal vector of each vertebral bodys BPP and centre of gravity (CoG) were determined.\nSTA was described by changes in the vectors pointing from the vertebral bodies CoG to the corresponding marker.\nThe normal vector of the BPP defined the cranial (z) axis of each vertebral body coordinate system.\nAs an exception, due to increased segmentation stability, the z-axis of the fifth lumbar vertebra was determined using the upper plate, and rotated accordingly.\nUpright seating position: lower spine had partial contact with the backrest, and the whole upper body was in an upright position.\nFlexed seating position: upper body was tilted about 30u forward and supported on a bar, while the arms were rested on their lap.\nExtended seating position: the subjects bottom was pushed approximately 20 cm forward and the head was supported by the backrest.\nThe vectors from the vertebral bodies CoG to the corresponding markers were constructed using the local coordinate systems.\nTo determine the curvature angles [48] of the lumbar (alumbar) and thoracic (athoracic) spines, the sagittal planes of the spines were defined normal to the vectors from RTBL to LTBL (V1) and from RTSC to LTSC (V2) respectively (Figure 2a).\nThe position vectors of the markers and the vertebral bodies were projected onto this plane.\nCircles [49] were created for the lumbar and thoracic spines that best fitted the CoGs of L1L5, and T3, T5, T7, T9 & T11 respectively.\nalumbar was then calculated as the angle between the two radius vectors from the circle centre to the CoG of L1 and L5, and athoracic accordingly as the angle between the radius vectors T3 & T11.\nThe same angles were calculated for the corresponding lumbar and thoracic markers.\nTo analyse the accuracy with which the skin markers were able to represent the rotation of the vertebral bodies, the mean sagittal rotation error (ESR) of the lumbar and thoracic segments (Table 2) was calculated.\nMarker cloud registration was performed using a least squares method41.\nThe sagittal rotation of the lumbar and thoracic segments was calculated between the corresponding marker cloud in the upright and compared to the flexed or extended positions.\nHere, the rotation of each vertebral section was calculated using a 3D regression line, fitted through the vertebral CoGs, and compared against the rigid rotation of the relevant marker cloud.\nThe absolute marker artefact was analysed using analyses of variance (ANOVA) for the subjects, positions and marker locations.\nFurthermore, correlations between the curvature angles based on the marker and vertebral body coordinates were investigated using linear regression analysis.\nAccuracy of the marker and vertebra positions using MRI The accuracy of the MRI and the image segmentation was similar to that of a conventional motion capture system.\n5 mm) and between the vertebral CoGs and the markers (1.\n1 mm), the direction-related measurement uncertainties (sx, sy, sz) of the markers were (1.\nThe orientation of the BPP relative to horizontal varied by up to 2.\nSubject measurements The mean STA in the flexed and extended positions were 10.\n2 mm (thoracic) and 10.\n4 mm for marker SPL5 in the flexed position.\nThe STA was significantly different between subjects (p,0.\nThe subjects mean STA of the lumbar and thoracic markers as well as the flexed and extended positions varied between 6.\nHowever, no clear relationship between STA and BMI was observed.\nThe root mean square errors (RMSEs) of the differences.\nRTSH, LTSH Right and left acromion Upper trunk segment.\nC7 7th cervical vertebrae.\nSTER Sternum Thoracic segment.\nRTSC, LTSC Right and left inferior angle of the scapula.\nT3, T5, T7, T9, T11 3rd, 5th, 7th, 9th, 11th thoracic vertebrae.\nL1, L2, L3, L4, L5 1st, 2nd, 3rd, 4th, 5th lumbar vertebrae.\nRTPS, LTPS Right and left posterior superior iliac spine.\norg 4 April 2014 | Volume 9 | Issue 4 | e95426.\nDirection-related (rx, ry, rz) mean marker artefact (mean) and the absolute values (|r|) with their standard deviations (SD) of the lumbar and thoracic skin markers in the flexed and extended positions.\nThoracic SPT1 (T3) 0.\nLumbar SPL1 (L1) 21.\nThoracic SPT1 (T3) 2.\nScatter diagram of the lumbar (a) and thoracic curvature angle (b) in the upright (circle), flexed (triangle) and extended positions (star).\nThe x-axis represents the values calculated from the markers, and the y-axis from the vertebral bodies.\nThe crosses show the open MRIs measurement uncertainty of the curvature angles calculated from the markers (x-axis) and calculated from the vertebral bodies (y-axis).\nbetween the curvature angles determined by the markers and by the vertebral bodies were approximately two times higher for the lumbar spine than the thoracic spine (Table 4).\nThe lumbar curvature angles from the upright to the flexed and extended positions showed the same sign in six of the seven subjects and three of the four subjects respectively, whereas the sign of the thoracic curvature angle was the same in all subjects (Figure 4).\nThe ESR of the lumbar and thoracic segments calculated using the skin markers were 2.\nThe largest ESRs were 6.\nMean (SD) lumbar (alumbar) and thoracic curvature angle (athoracic) in the upright, flexed and extended sitting positions calculated with the vertebral bodies and the skin marker, as well as the mean differences (SD; RMSE) between the values from the skin marker and the vertebral bodies.\nRange of lumbar (a/b) and thoracic (c/d) curvature angle of the subjects, calculated using the vertebral bodies (black) and the skin markers (hatched).\nThe range was defined from the upright to the flexed (a/c) and to the extended positions (c/d).\nWhile the exact motion of the vertebrae remains unclear without the use of invasive approaches, knowledge on the accuracy of skin markers for assessing skeletal kinematics provides a baseline for identifying situations where non-invasive approaches are appropriate, and where not [50].\nThe measurement uncertainty of our MRI-based measurement system was similar to those of a typical motion capture system (1.\nAnalysis of the back STA produced similar results to those observed in other studies [39,40] and also for other body parts (Table 1).\nThe observed intraand inter-individual patterns of STA during flexion and extension did not allow the determination of a common correction method by which to estimate the behaviour of single markers.\nIn general, the inter-individual differences were larger than the differences within a single subject a result that is in agreement with results from studies on the knee joint [36].\nKnowledge of the influence of STA when using skin markers is required to ensure compensation for the largest error sources [16,52,53].\nthe hip or the knee, since the spine consists of several segments that allow movement relative to one another, including a different range of motion (ROM) in several planes.\nThe present study only allowed the quantification of STA in a static set-up.\nIt must be assumed that during dynamic activities, and especially impact situations, STA is even larger.\nTherefore, studies using static measurements seem to underestimate the magnitude of STA, possibly by a factor of two or more.\nDue to the fact that the power analysis in this study was based on measurements using lamb vertebrae, the actual study in humans may require additional subjects to ensure sufficient power, due to secondary errors such as unintentional movements during MRI scanning.\nHowever, as a result of this power analysis, relatively few subjects were recruited into this study, and it was not possible to observe any clear relationships between STA and e.\nage, gender, height or material properties of the soft tissues.\nIt is, of course, entirely possible that these or other subject-specific factors contribute to the magnitude of STA on the back.\nHere, it is quite conceivable for example that the individual elastic properties of the soft tissues have a strong influence on the magnitude of STA; such observations have been reported at other regions of the body (thigh) by Kratzenstein and co-workers [52], who also demonstrated locally varying STA, which was mainly attributed to muscle contraction and skin elasticity.\nIn addition, no relationship between the levels of STA and BMI were observed in our study, but this could also be an artefact of the low number of subjects in our cohort.\nused fluoroscopy [36] or bone pins [54] to examine the role of soft tissues on the underlying skeletal kinematics.\nIncreasing the number of subjects could allow a better understanding of the relationships between BMI, age, gender, height or material properties of the soft tissues, but this was not the focus of the current study.\nIn order to establish the influence of such subjectspecific factors on STA, further research would be required in specific homogenous cohorts.\n385 (thoracic)), results that examine the lumbar and thoracic curvature angles by means of skin markers should be interpreted cautiously.\nHowever, the range of curvature angles exhibited the same sign when comparing the upright with the flexed and the extended seating positions in 22 out of the 24 cases (Figure 4).\nDue to the fact that the range of curvature calculated from the skin markers did not consistently overor underestimate that calculated from the vertebral bodies within subjects, positions or spinal segment, there is no clear method to enhance the accuracy of skin marker estimations through automated correction.\nTo summarise, the results of our study indicate that a change of lordotic/kyphotic shape, but not of the absolute amount of curvature, can be estimated using skin markers.\nBased on these findings, the use of the presented back marker set for analysing spinal motion seems to be as accurate as estimations of skeletal kinematics in the lower extremities (Table 1).\nChanges of the lumbar and thoracic curvature angle are measurable in the sagittal plane using the presented marker set, but measurement of the absolute curvature angles appears to be limited when using skin markers.\nThese limitations associated with STA must be taken into account during non-invasive assessment of back motion before an improved understanding of the kinematics of subjects with and without back pain can be gained.\nEthics: This study was approved by the ethics committee of the ETH Zurich under the number: EK 2010-N-43.\nMcBeth J, Jones K (2007) Epidemiology of chronic musculoskeletal pain.\nBest Pract Res Clin Rheumatol 21: 403425.\nTeyhen DS, Flynn TW, Childs JD, Kuklo TR, Rosner MK, et al.\nSpine (Phila Pa 1976) 32: E220229.\n(2002) Development and validation of a new technique for assessing lumbar spine motion.\nSpine (Phila Pa 1976) 27: E215220.\nTeyhen DS, Flynn TW, Bovik AC, Abraham LD (2005) A new technique for digital fluoroscopic video assessment of sagittal plane lumbar spine motion.\n(2012) Comparative evaluation of a novel measurement tool to assess lumbar spine posture and range of motion.\n(2012) Velocity of lordosis angle during spinal flexion and extension.\n(2013) Automatic distinction of upper body motions in the main anatomical planes.\nTaylor WR, Consmuller T, Rohlmann A (2010) A novel system for the dynamic assessment of back shape.\nKumar S (1990) Cumulative Load as a Risk Factor for Back Pain.\nHoogendoorn WE, van Poppel MNM, Bongers PM, Koes BW, Bouter LM (1999) Physical load during work and leisure time as risk factors for back pain.\n(2008) The in vivo three-dimensional motion of the human lumbar spine during gait.\nKramers-de Quervain IA, Baumgartner W, Stussi E, Grob D (2001) Segmental motion of L3/4 and L4/5 of the lumbar spine during stair ambulation.\n18th Conference of the International Society of Biomechanics Zurich, Switzerland.\nBaumgartner W, Grob D, Kramers-de Quervain IA, Stussi E (2001) Novel in vivo motion analysis of the healthy lower lumbar spine during standardized movements and complex daily activities.\n(2010) A novel device for improving marker placement accuracy.\nCappozzo A, Catani F, Leardini A, Benedetti MG, Croce UD (1996) Position and orientation in space of bones during movement: experimental artefacts.\nClin Biomech (Bristol, Avon) 11: 90100.\nJ Orthop Res 23: 726734.\nLeardini A, Chiari L, Della Croce U, Cappozzo A (2005) Human movement analysis using stereophotogrammetry.\nGait Posture 21: 212225.\nJournal of Biomechanics 41: 31893195.\nJ Biomech Eng 133: 114502.\nSpine J 5: 297309.\nAmonookuofi HS (1992) Changes in the Lumbosacral Angle, Sacral Inclination and the Curvature of the Lumbar Spine during Aging.\nNorton BJ, Sahrmann SA, Van Dillen LR (2004) Differences in measurements of lumbar curvature related to gender and low back pain.\nBae TS, Mun M (2010) Effect of lumbar lordotic angle on lumbosacral joint during isokinetic exercise: a simulation study.\nFrigo C, Carabalona R, Dalla Mura M, Negrini S (2003) The upper body segmental movements during walking by young females.\nBull AM, McGregor AH (2000) Measuring spinal motion in rowers: the use of an electromagnetic device.\nWu SK, Lan HH, Kuo LC, Tsai SW, Chen CL, et al.\n(2007) The feasibility of a video-based motion analysis system in measuring the segmental movements between upper and lower cervical spine.\nBull AMJ, Holt PJ, Wragg P, McGregor AH (2004) Validation of the use of a skin-mounted device to measure out-of-plane rotations of the spine for a rowing activity.\nSyczewska M, Oberg T, Karlsson D (1999) Segmental movements of the spine during treadmill walking with normal speed.\nCrosbie J, Vachalathiti R, Smith R (1997) Age, gender and speed effects on spinal kinematics during walking.\nList R, Gulay T, Lorenzetti S (2010) Kinematics of the trunk and the spine during unrestricted and restricted squats A preliminary analysis.\nbones based on magnetic resonance imaging.\nMatsui K, Shimada K, Andrew PD (2006) Deviation of skin marker from bone target during movement of the scapula.\nTranberg R, Karlsson D (1998) The relative skin movement of the foot: a 2-D roentgen photogrammetry study.\nMaslen BA, Ackland TR (1994) Radiographic Study of Skin Displacement Errors in the Foot and Ankle during Standing.\nClinical Biomechanics 9: 291 296.\nJ Biomech 40 Suppl 1: S1824.\nJ Biomech 39: 844852.\n(2010) Non-invasive assessment of soft-tissue artifact and its effect on knee joint kinematics during functional activity.\nJ Biomech 43: 12921301.\nHeneghan NR, Balanos GM (2010) Soft tissue artefact in the thoracic spine during axial rotation and arm elevation using ultrasound imaging: a descriptive study.\nFaul F, Erdfelder E, Buchner A, Lang AG (2009) Statistical power analyses using G*Power 3.\nBehav Res Methods 41: 11491160.\nDettwyler MT (2005) Biomechanische Untersuchungen und Modellierungen am menschlichen oberen Sprunggelenk im Hinblick auf Arthroplasiken.\nList R (2005) A hybrid marker set: for future basic research and instrumented gait analysis at the Laboratory for biomechanics.\nStoop M (2009) Biomechanik der Kniebeuge: Berechnung der Krafte und Drehmomente am Knieund Huftgelelnk in Abhangigkeit der Bewegungsausfuhrung.\nGulay T, List R, Lorenzetti S (2011) Moments in the knee and hip during descent and ascent of squats.\n(2012) Comparison of the angles and corresponding moments in the knee and hip during restricted and unrestricted squats.\nJ Strength Cond Res 26: 28292836.\n(2012) The spinal curvature of three different sitting positions analysed in an open MRI scanner.\nPratt V (1987) Direct Least-Squares Fitting of Algebraic Surfaces.\nComputer Graphics 21: 145152.\nList R, Gulay T, Stoop M, Lorenzetti S (2012) Kinematics of the Trunk and the Lower Extremities during Restricted and Unrestricted Squats.\nBarker S, Craik R, Freedman W, Herrmann N, Hillstrom H (2006) Accuracy, reliability, and validity of a spatiotemporal gait analysis system.\n(2012) Effective marker placement for functional identification of the centre of rotation at the hip.\n(2011) The weighted optimal common shape technique improves identification of the hip joint center of rotation in vivo.\n(1997) Surface movement errors in shank kinematics and knee kinetics during gait.\nGait & Posture 5: 217227."}