{"title": "62.pdf", "contents": "An OpenSim-based Inverse Kinematics Approach.\nMechanical loads on the human spine play a crucial role in the etiology of disorders of the  lower back.\nIn vivo evaluations are complex and highly invasive, therefore musculoskeletal  biomechanical models are used to estimate muscle forces and spinal loads during static and  dynamic activities.\nSubject-specific models instead of generic models have the potential to  improve diagnosis and optimize clinical treatment by predicting accurate outcomes on an  individual basis.\nIn this study, we developed a method to model a personalized sagittal spinal alignment based  on the external back profile obtained from motion capture (MoCap) data to improve the  estimation of spinal kinematics and intervertebral joint loading.\nThe spinal alignment  adjustments proposed in this study were applied to a full-body generic musculoskeletal model,  combined from a well-validated model for the thoracolumbar spine and a model of the lower  extremities, to allow simulating predominant activities of daily living.\nThis novel method  predicts intervertebral joint centers with an average mean error of 0.\n68 cm in the  frontal axis and 1.\n97 cm in the transverse axis relative to radiographic reference data.\nThe maximum mean joint prediction errors are 1.\n73 cm in the frontal axis (T1/T2 joint)  and 1.\n11 cm in the transverse axis (T3/T4 joint).\nThe generated subject-specific models  in this study were able to reproduce spine kinematics and dynamics for each subject and  derive qualitative joint load predictions with high task repeatability.\nThe results of this study  demonstrate the suitability of the proposed method and associated OpenSim workflow for  interand intra-subject investigations of muscle activity and joint reaction forces in the spine.\nThis article is a preprint and has not been certified by peer review.\nThe objectives of this study are to develop a robust modeling approach for assessing spinal  kinematics and forces acting on the spine for various functional activities.\nThe method shall  enable intra-subject or inter-subject investigations of muscle activity and joint reaction forces  as, for example, required to investigate loading characteristics of low back pain subjects and  compare them to healthy controls.\nThe novel approach should improve subject-specific  scaling and simulation accuracy, by modifying the spinal curvature of a generic OpenSim  model to create a subject-specific alignment based on the external back profile defined by  skin superficial markers.\nAs a result, the personalized spine modeling approach should reduce  joint angle estimation errors associated with inverse kinematics, guaranteeing a reliable  virtual reproduction of the 3D motion collected in the laboratory.\nThese base models were composed from a fully articulated  thoracolumbar spine model with a head-neck-complex as well as upper extremities (Bruno et  al.\nTo  reduce complexity of the model and improve simulation robustness, external and internal  intercostal muscle groups were removed from the model and ribs were considered as rigid  bodies attached to the vertebrae.\nThe axial rotation (AR) and lateral bending (LB) coordinates  of the thoracic intervertebral joints (IVJ) were locked (T1/T2-T11/T12) thereby reducing the  thoracic joints to pin joints with one degree of freedom (flexion and extension (FE)).\nAdditionally, the translational coordinates of the rib to sternum joints were locked, changing  the joints behavior from free to ball joint.\n, lifting a box or standing up from a chair) or.\n, running), coordinate actuators were added to some joints with  infinite minimum and maximal control values.\nThe FE, AR and LB coordinates of the L3/L4  to L5/S1 intervertebral joints were actuated with an optimal force of 10 Nm, whereas the  remaining lumbar IVJ were actuated with an optimal force of 5 Nm (T12/L1 to L2/L3).\nFor  the thoracic IVJ, only the FE coordinate was actuated with an optimal force of 1 Nm.\nTo  further improve simulation robustness, the coordinate actuators of the sternum (SternumRotX,  SternumRotY and SternumRotZ), the hip (hip_flexion, hip_adduction and hip_rotation), the  knee (knee_angle), and the ankle (ankle_angle) were all actuated with an optimal force of 25  Nm.\n, Fx, Fy, Fz, Mx, My, Mz) of the pelvis_ground joint, which connects the  model freely to the ground (origin of the coordinate system).\nVirtual markers were added to the model to allow an inverse kinematics approach driven by  motion-capture data from a movement laboratory.\nThe markers were  placed with the drag and drop OpenSim graphical user interface, for bilateral markers (such as  Right Forehead (RFHD) and Left Forehead (LFHD) etc.\n) the locations were mirrored to  create a symmetric virtual marker set, as can be seen in Figure 1.\nTo create a subject specific model, we selected the base model according to the gender of the  subject and then scaled the model using the OpenSim scaling tool.\nThis tool scales all  segments by factors obtained from the distances between experimental markers in the static  standing trial (see Table 1).\nFollowing the resizing of segments, the mass properties of the  body segments were scaled to preserve mass distribution and reproduce the total mass of the  subject (recorded using a standard scale).\nMuscle properties, such as fiber length and tendon  slack length were scaled proportionally to the total muscle resting length.\nAdditionally, virtual  marker locations were adapted to precisely match the experimental markers by using the  OpenSim scaling tool option Adjust Model Markers.\nTorso  C7  SACR (S2)  Pelvis, Sacrum, Abdomen, all  Intervertebral Bodies, all Ribs,  Sternum, Clavicles, Scapularies,  Head / Neck.\nUpper Extremities  (R/L)SHO  (R/L)FIN  Humerus, Ulna, Radius, Hand  (all bilateral).\nLower Extremities  (R/L)ASI  (R/L)ANK  (R/L)THI  (R/L)ANK.\nFemur, Tibia, Talus, Calcaneus,  Toes  (all bilateral).\nSubsequently, spinal curvature was adjusted in MATLAB (MathWorks, Inc.\n, Natick, MA,  USA) using the external back profile derived from fitting a 4th order polynomial through the  sagittal plane coordinates of the markers placed over the spinous processes of C7, T3, T5, T7,  T9, T11, L1-L5 and the sacrum (approximately height of S2) (Figure 2A).\nInput points for the  internal spinal curvature polynomial were acquired by subtracting the scaled marker to joint  center distance (in the base model) from the smoothened marker position.\nUnderlying  assumption was a vertebral orientation along the normal vector of the external back profile  polynomial at the height of the corresponding experimental marker (Figure 2B).\nAn exception  was the predicted joint center point for C7/T1 and T1/T2, the reason being that the  head_neck segment, to which the C7 marker is linked to, is always oriented horizontal to  the ground coordinate system in the base model.\nTherefore, the T1/T2 joint location offset to  the C7 marker was used as argument to calculate the T1/T2 predicted joint center.\nThe sagittal plane projection of the geometric center between the two posterior head markers  (RBHD and LBHD) was added as a supporting point to better account for cervical lordosis.\nThese points were then used to fit a second 4th order polynomial to predict the internal spinal  curvature (Figure 2C) and the estimated joint center locations in the sagittal plane derived  from the polynomial by setting the vertical height of each IVJ in the scaled base model as  function input (Figure 2D).\nThe orientation of each vertebrae was derived from the angle of  the normal vector at the joint center with respect to the frontal axis (Figure 2E).\nSubjectspecific spinopelvic alignment was not considered and therefore, the sacrum and pelvis  inclination of each personalized model was kept equal to the base model.\nB)  Approximation of intervertebral joint centers obtained by subtraction of the scaled OpenSim  joint center to marker offsets oriented with the normal vector of the external back profile (4th  order polynomial).\nC) Calculated internal spine shape using rough joint center prediction  points and supporting posterior head marker center point obtained from the 4th order  polynomial.\nD) Predicted final joint center with predefined (generic model) relative vertical  distances between intervertebral joints and internal spine shape.\nE) Calculated final joint  orientation with the normal vector to the internal spine polynomial.\nEstimated joint locations and orientations were converted from global to local threedimensional coordinate systems.\nThe joint coordinate systems of the template model  coincided with the centroid of the corresponding vertebral bodies.\nThus, location and  orientation of each joint center was calculated with respect to the former joint in a global  frame and converted to a local coordinate system by fixing each joint center in space and  rotating the reference frame by its orientation angle.\nAdditional model modifications such as  ribs and sternum reorientation and relocation were made to maintain the global distance and  orientation from the base model to the modified spine.\nCenter of mass locations for each  spinal segment were readjusted to ensure the same relative position to the vertebral body.\nMuscle fiber and tendon slack length were adjusted to match the proportions of the base  model.\n1 Adjustment of spinal alignment.\nTo validate the adjustment of spinal alignment, we conducted a radiographic analysis with  three subjects (2 females / 1 male, age: 27  7.\nRadio-opaque metallic spheres (fiducial) with a diameter of 3.\nOnce the modified markers were positioned.\non the subject, the subject underwent a full body biplanar radiographic examination in the  upright standing position using a low dose clinical x-ray scanner (EOS; EOS Imaging, Paris,  France).\nFrom the lateral radiographs, the centers of all vertebral bodies (ground truth) were  calculated as the average position of the four annotated corner points in the sagittal plane  using a custom graphical user interface developed in MATLAB (MathWorks, Inc.\nSubsequently, a modeled internal spinal curvature was predicted using the marker  positions from the radiograph as input.\nTo estimate the accuracy of the spinal curvature  modeling method, we calculated the difference between ground truth and the predicted joint  centers for all three subjects, as well as the mean errors between subjects in terms of position  (frontal and transverse axis), vertebrae orientation and the two most-used spinopelvic  parameters: lumbar lordosis (LL) and thoracic kyphosis (TK) angles.\nTo ensure the suitability of our subject-specific models for simulating spinal loading during  various functional activities, we recruited seventeen healthy subjects (13 males / 4 females,  age: 28  4.\n95 y, weight: 76.\n4 kg, height: 179.\n84 cm) with no history of chronic  back pain and no episodes of back pain within the last three months and invited them for a  single visit to the movement laboratory at the Balgrist University Hospital in Zurich,  Switzerland.\nAfter the acquisition of relevant anthropometric data, subjects were equipped  with retro-reflective markers in a configuration corresponding to the one implemented in the  model (see Figure 1) and asked to stand upright for 10s as well as to perform various  functional activities such as walking, running, lifting a 5kg box, standing up from a chair and  climbing stairs.\nDynamic tasks were repeated five times.\nMotion data were recorded at a  sampling rate of 200 Hz using a 27-camera optical motion capture system (Vicon, Oxford,  UK).\nRecorded data were processed using the software Nexus (Vicon, Oxford, UK) and  transformed into the OpenSim reference system by implementation of a custom MATLAB  script.\nGround reaction forces were recorded at a sampling rate of 1 kHz using six level  ground embedded force plates (AMTI, BP400600) and two mobile force plates (Kistler,  9260AA6) mounted on the first and second step of a four-step staircase.\nFollowing data acquisition, subject-specific models were generated with the mean marker  locations obtained during the first five seconds of the upright standing trial.\nFor the box lifting  task, a separate set of models was created by adding 2.\n5 kg to each hand and updating the  inertial properties to account for the measures of the respective side of the box.\nNo other  model properties were changed for the box lifting task.\nStartand end-events for walking,  running and stair climbing tasks were set manually with the software Nexus based on visual  inspection of the marker trajectories.\nWalking and stair climbing start events were set when  the right foot left the ground after the left foot had activated the first force plate and end  events were set just before the left foot strikes on the third step / force plate.\nTo account for  different running speeds, which the subjects were free to choose, the simulations included  only the flight phases and stance phase of the left foot on one single force plate, therefore the  start event was selected after foot off by the right foot and ended before the right foot strike  event.\nFor the standing up from a chair and lifting a box tasks, a custom MATLAB script  selected startand end-events by computationally analyzing the marker trajectories.\nThe box  lifting task used the C7 marker as reference.\nThe start event was defined after the vertical  marker velocity exceeded 5% of the maximal measured vertical velocity for the first time and  ended when the velocity fell below the 5% threshold.\nEvents for standing up from a chair used  the STERNUM marker as reference trajectory.\nStart events were defined when the horizontal  velocity exceeded 5% of the maximal horizontal velocity for the first time and end events  were set when the vertical velocity fell below 5% of the maximal vertical velocity after  reaching peak vertical velocity.\nInverse kinematic analysis to obtain joint angles at each timepoint, by solving a  weighted least squares error problem.\nMarker weights for the ankles (RTOE, LTOE, RANK,  LANK, RHEE and LHEE), the knees (RKNE, LKNE), the elbows (RELB, LELB), and the  fingers (RFIN, LFIN) were set at 10.\nAll other markers were assigned a weight of one, as they  either had a high risk for soft tissue artifacts and / or had many adjacent markers.\nThe  kinematic parameters, together with ground reaction forces, were used as input for performing  static optimization to estimate muscle activity and force by minimizing the sum of squared  muscle activations (Crowninshield and Brand et al.\nJoint reaction forces (joint  reaction analysis) were then computed by solving the static equations for each timepoint and  joint using the estimated muscle forces from static optimization, the experimental ground  reaction forces, and the segmental masses.\nOnly measurements with comparable conditions as defined in this study were  used for comparison, hence measurements with a different type of chair or lifting a different  kind of object were excluded.\nFor walking and stair climbing the subjects wore slippers or shoes.\nThe method estimated lumbar joint centers with an absolute average mean error of 0.\n68  cm in the frontal axis and 1.\n97 cm in the transverse axis (Figure 3 & 4).\nThe maximum  mean joint prediction errors were 1.\n73 cm in the frontal axis (T1/T2 joint) and 1.\nThe mean prediction orientation error for the  vertebral bodies in the sagittal plane was 4.\nThe maximum mean error was  calculated at the joint level of T10/T11 with 8.\nAlthough the errors in the lower  thoracic region were relatively large, the standard deviations were small, indicating systematic  errors in this region.\nThe standard deviation at the L5/S1 level was comparably large with  3.\nAlthough the average mean absolute error was 7.\nFor thoracic  kyphosis, the average mean absolute error is 7.\nThe signed prediction errors range  from +11.\n02, hence it seems that the method systematically overpredicts thoracic  kyphosis angles.\nSubject-specific spinal alignment models were created and used to simulate different  functional tasks using kinematic data collected in the laboratory.\nCompressive joint reaction  loads were calculated on all lumbar IVJ for all the different types of activities recorded  experimentally for all subjects (Figure 5).\n2017, including coordinate actuators, was sufficiently strong to satisfy equilibrium during  static optimization for gait, running, sit-to-stand, stair climbing and lifting a box.\nAs expected,  the lowest compressive loads are expressed during level walking, with a peak load of ~15  N/kg.\nThey increase in running, and during lifting they rise about three times higher than for  level walking.\nReproducibility of the tasks on an interand intra-subject level was verified qualitatively by  comparing the load curves in Figure 5 with each other.\nLoad curves of all seventeen subjects  showed similar shapes for all tasks.\nLargest observable differences were found for running,  where running techniques such as forefoot and heel strike running seemed to cause differently.\nThe objective of this study was to develop a robust full-body model to assess spine kinematics  and kinetics for a variety of functional activities.\nThis objective was achieved by combining  two previously validated OpenSim models and reducing the complexity of the combined  model by introducing new constraints and by adding actuators.\nA novel method of accounting  for subject-specificity was introduced by adjusting spinal curvature after standard inbuilt  OpenSim model scaling.\nThere are several advantages to this method: it does not require radiation  exposure, it is non-invasive and timesaving, as it only relies on static posture, recorded by a  default trial in each MoCap acquisition.\nThe comparison of the ground truth model, the  subject specific spinal alignment model, and the generic OpenSim model created for the  radiographic validation study showed that the joint center prediction is significantly improved  when using the presented method.\nA challenge for this study was to create a general model that can replicate and solve activities  which require a large range of motion.\nMost of the models published in literature have been  validated for one or two tasks (Raabe et al.\n, 2016, Beaucage et al.\nIn contrast, our model was able to  solve subject-specific joint reaction force estimations for level walking, running, rising from a  chair, lifting a 5 kg box and stair climbing using subject-specific kinematic data.\nWe  demonstrated that the intra-subject variability measured by our model for repetitions of a task  was minimal (Figure 5), but that there are inter-subject differences in loading curves,  indicating that the simulation pipeline and the reference model are robust.\nTherefore, the  entire workflow represents a powerful tool to answer specific research questions as well as for  clinical applications.\nThe radiographic validation of the  method was only done with three subjects, which is not sufficient to conclusively evaluate this  method.\nThe upright standing posture in the EOS (arms lifted in front of torso) was also  slightly different from the calibration static standing trial in the movement lab (arms hanging  on the side).\nThere might be differences in the spinal alignment for these two postures,  particularly in the upper thoracic segments.\nOur method also relies heavily on the distances between  marker and joint center of the base models, which were only set by drag and drop in the  OpenSim graphical user interface.\nFuture studies with larger sample sizes should implement  linear regression models to better predict distances from skin markers to joint center by  variables such as gender, height, weight, and age to increase the subject-specificity of the  model and to further improve joint center and vertebral orientation predictions.\nDespite the introduction of a subject-specific spinal curvature, the models created with this  method remain generic to some extent.\nTo prevent large errors caused by inaccurate marker  placements, the method does not adjust the vertical spacing of the vertebrae, which resulted in  some significant prediction errors (Figure 3 and Figure 4).\nThe length of the spine is predicted  only by the distance between the Sacrum and C7 marker and may lead to scaling errors, as  demonstrated by Subject 3 of the EOS validation study (Figure 3).\nThe center of mass for the trunk segments  vary from subject to subject only through the variation in spinal alignment and scaling.\nThe robustness of our model comes at the cost of including numerous artificial coordinate  actuators in the spine, which support movements that the optimizer cannot find solutions for  when using only the modeled muscles.\nThe necessity for this strategy is that the model does  not account for the mechanical properties of non-muscular soft tissue (e.\nThe absence of  these model parameters might be an explanation for the quantitative joint load difference  observed between the simulation results and the measured in vivo data retrieved from the  Orthoload database.\nOther possible explanations for this difference are that the in vivo  measurements were done with elderly patients after spinal surgery and might therefore not be.\ndirectly comparable to a healthy population with an average age of 28  4.\nMoreover, the design of the implants (external rods) suggest that the sensors do not account  for the entire load transferred through the vertebral body.\nHence, the real joint loads  probably lie somewhere between the in vivo measured data and the computationally estimated  values from this study.\nIn conclusion, this study introduces a novel method for creating subject-specific  musculoskeletal full-body models based on MoCap data.\nThe approach increases the subjectspecificity of the spinal curvature within the model and thereby improves the accuracy of the  inverse kinematics approach to assess spinal kinematics.\nOur novel methodology could  achieve both, therefore representing a powerful platform to answer a variety of issues relevant  to spinal loading in a scientific and clinical context.\nThe authors declare no conflict of interest.\nThis research was supported by the Swiss National Science Foundation (SNF, Bern,  Switzerland).\nMovement analysis was performed with support of the Swiss Center for Clinical  Movement Analysis, SCMA, Balgrist Campus AG, Zrich.\nThe authors especially thank  Marina Hitz, Linard Filli, and Marc Bolliger from the SCMA for their support.\n(2001), Dynamic optimization of human  walking.\nJournal of Biomechanical Engineering, 123:5, 381-390.\nBiomechanics of the Spine: Basic Concepts, Spinal Disorders  and Treatments.\nValidation of an OpenSim full-body model with detailed lumbar spine  for estimating lower lumbar spine loads during symmetric and asymmetric lifting tasks.\nDevelopment and validation of a musculoskeletal model of the fully articulated thoracolumbar  spine and rib cage.\nSpinal Loading Patterns from Biomechanical Modeling Explain  the High Incidence of Vertebral Fractures in the Thoracolumbar Region.\nJournal of Bone and  Mineral Research, 32:6: 1282-1290.\nA physiologically based criterion  of muscle force prediction in locomotion.\nAnalysis of musculoskeletal systems in the AnyBody  Modeling System.\nOpenSim:  open-source software to create and analyze dynamic simulations of movement.\nEstimation of lumbar spinal loading and trunk  muscle forces during asymmetric lifting tasks: application of whole-body musculoskeletal  modelling in OpenSim.\nAn investigation of jogging  biomechanics using the full-body lumbar spine model: Model development and validation.\nJournal of biomechanics, 49.\nSCHMID, Stefan; STUDER, Daniel; HASLER, Carol-Claudius; ROMKES, Jacqueline;  TAYLOR, William R.\nSCHMID, Stefan; BRUHIN, Bjrn; IGNASIAK, Dominika; ROMKES, Jacqueline;  TAYLOR, William R.\nSpinal kinematics during gait in healthy individuals across different age groups.\nThis article is a preprint and has not been certified by peer review.\nMusculoskeletal full-body models including a detailed  thoracolumbar spine for children and adolescents aged 618 years.\nPelvic incidencelumbar lordosis mismatch results in increased segmental joint  loads in the unfused and fused lumbar spine.\nMeasuring lumbar back motion during functional activities  using a portable strain gauge sensor-based system: A comparative evaluation and reliability  study.\nA planar model of the knee joint to  characterize the knee extensor mechanism.\nJournal of Biomechanics, 22:1, 1-10."}