[{"paragraph": {"text": "Psychological Attributes"}}, {"paragraph": {"text": "During the past several decades, numerous studies have shown the influence of psychological parameters on the development and trajectory of cLBP conditions (19). Psychological parameters are defined as constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others. The following interconnected constructs—often studied in isolation—provide a crude categorization of factors that have found repeated entry into studies of RPFs and possible cLBP mechanisms. ", "sentences_with_results": [{"text": "Numerous studies have shown the influence of psychological parameters on the development and trajectory of cLBP conditions.", "clauses": [{"text": "Numerous studies have shown the influence of psychological parameters.", "triplet": {"subject": "Numerous studies", "verb": "have shown", "object": "the influence of psychological parameters on the development and trajectory of cLBP conditions"}}, {"text": "Psychological parameters have an impact on the development of cLBP conditions.", "triplet": {"subject": "Numerous studies", "verb": "have shown", "object": "the influence of psychological parameters on the development and trajectory of cLBP conditions"}}, {"text": "Psychological parameters have an impact on the trajectory of cLBP conditions.", "triplet": {"subject": "Numerous studies", "verb": "have shown", "object": "the influence of psychological parameters on the development and trajectory of cLBP conditions"}}]}, {"text": "Psychological parameters are defined as constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others.", "clauses": [{"text": "Psychological parameters are defined as constructs that capture patient beliefs based on prior experiences and future expectations.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture affect states and traits.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture attitudes.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture personality traits.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others."}}, {"text": "Psychological parameters are defined as constructs that capture behaviors.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture coping styles and resources.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture attention styles towards pain.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture self-efficacy.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}, {"text": "Psychological parameters are defined as constructs that capture others.", "triplet": {"subject": "Psychological parameters", "verb": "are defined as", "object": "constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others"}}]}], "sentences_without_results": [{"text": "No results: During the past several decades, numerous studies have shown the influence of psychological parameters on the development and trajectory of cLBP conditions (19).", "clauses": []}, {"text": "No results: Psychological parameters are defined as constructs that capture patient beliefs based on prior experiences and future expectations, affect states and traits, attitudes, personality traits, behaviors, coping styles and resources, attention styles towards pain, self-efficacy and others.", "clauses": []}, {"text": "No results: The following interconnected constructs—often studied in isolation—provide a crude categorization of factors that have found repeated entry into studies of RPFs and possible cLBP mechanisms.", "clauses": []}]}}, {"paragraph": {"text": "Pain Beliefs:"}}, {"paragraph": {"text": "Pain beliefs and associated behaviors have been associated with cLBP activity interference, frequency of pain behavior, pain severity, and depression severity. The most notable beliefs are fear of movement and catastrophizing (maladaptive cognition). The patients’ capability to function (physically, psychologically, and socially) is influenced by the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills.", "sentences_with_results": [{"text": "Pain beliefs and associated behaviors have been associated with cLBP activity interference, frequency of pain behavior, pain severity, and depression severity.", "clauses": [{"text": "Pain beliefs and associated behaviors have been associated with cLBP activity interference.", "triplet": {"subject": "Pain beliefs and associated behaviors", "verb": "have been associated with", "object": "cLBP activity interference, frequency of pain behavior, pain severity, and depression severity"}}, {"text": "Pain beliefs and associated behaviors have been associated with frequency of pain behavior.", "triplet": {"subject": "Pain beliefs and associated behaviors", "verb": "have been associated with", "object": "cLBP activity interference, frequency of pain behavior, pain severity, and depression severity"}}, {"text": "Pain beliefs and associated behaviors have been associated with pain severity.", "triplet": {"subject": "Pain beliefs and associated behaviors", "verb": "have been associated with", "object": "cLBP activity interference, frequency of pain behavior, pain severity, and depression severity"}}, {"text": "Pain beliefs and associated behaviors have been associated with depression severity.", "triplet": {"subject": "Pain beliefs and associated behaviors", "verb": "have been associated with", "object": "cLBP activity interference, frequency of pain behavior, pain severity, and depression severity"}}]}, {"text": "The most notable beliefs are fear of movement and catastrophizing (maladaptive cognition).", "clauses": [{"text": "The most notable belief is fear of movement.", "triplet": {"subject": "The most notable beliefs", "verb": "are", "object": "fear of movement and catastrophizing (maladaptive cognition)"}}, {"text": "The most notable belief is catastrophizing (maladaptive cognition).", "triplet": {"subject": "The most notable beliefs", "verb": "are", "object": "fear of movement and catastrophizing (maladaptive cognition)"}}]}, {"text": "The patients’ capability to function (physically, psychologically, and socially) is influenced by the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills.", "clauses": [{"text": "The patients' capability to function (physically, psychologically, and socially) is influenced by the patients' perceived self-efficacy or the belief that the patients can perform.", "triplet": {"subject": "The patients’ capability to function", "verb": "is influenced by", "object": "the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills"}}, {"text": "The patients' capability to function (physically, psychologically, and socially) is influenced by the patients' ability to endure and/or reduce pain.", "triplet": {"subject": "The patients’ capability to function", "verb": "is influenced by", "object": "the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills"}}, {"text": "The patients' capability to function (physically, psychologically, and socially) is influenced by the patients' confidence that the pain will improve.", "triplet": {"subject": "The patients’ capability to function", "verb": "is influenced by", "object": "the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills"}}, {"text": "The patients' capability to function (physically, psychologically, and socially) is influenced by the patients' coping skills.", "triplet": {"subject": "The patients’ capability to function", "verb": "is influenced by", "object": "the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills"}}]}], "sentences_without_results": [{"text": "No results: Pain beliefs and associated behaviors have been associated with cLBP activity interference, frequency of pain behavior, pain severity, and depression severity.", "clauses": []}, {"text": "No results: The most notable beliefs are fear of movement and catastrophizing (maladaptive cognition).", "clauses": []}, {"text": "No results: The patients’ capability to function (physically, psychologically, and socially) is influenced by the patients perceived self-efficacy or the belief that the patients can perform, the patients ability to endure and/or reduce pain, the patients confidence that the pain will improve, and the patients coping skills.", "clauses": []}]}}, {"paragraph": {"text": "Nine studies reported on expectations (one RPF with little SOE confidence), fear avoidance (10 RPF with little to some SOE confidence), and pain-related anxiety (one RPF with substantial SOE confidence) assessed by questionnaire in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain. Authors discussed how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle.  ", "sentences_with_results": [{"text": "Nine studies reported on expectations (one RPF with little SOE confidence), fear avoidance (10 RPF with little to some SOE confidence), and pain-related anxiety (one RPF with substantial SOE confidence) assessed by questionnaire in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "clauses": [{"text": "Nine studies reported on expectations assessed by questionnaire in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "triplet": {"subject": "Nine studies", "verb": "reported", "object": "on expectations, fear avoidance, and pain-related anxiety"}}, {"text": "One study reported on fear avoidance assessed by questionnaire in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "triplet": {"subject": "Nine studies", "verb": "reported", "object": "on expectations, fear avoidance, and pain-related anxiety"}}, {"text": "Ten studies reported on fear avoidance assessed by questionnaire with little to some SOE confidence in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "triplet": {"subject": "Nine studies", "verb": "reported", "object": "on expectations, fear avoidance, and pain-related anxiety"}}, {"text": "One study reported on pain-related anxiety assessed by questionnaire with substantial SOE confidence in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "triplet": {"subject": "Nine studies", "verb": "reported", "object": "on expectations, fear avoidance, and pain-related anxiety"}}]}, {"text": "Authors discussed how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle.", "clauses": [{"text": "Authors discussed how negative beliefs about pain can lead to catastrophizing.", "triplet": {"subject": "Authors", "verb": "discussed", "object": "how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle"}}, {"text": "Negative beliefs about pain can also lead to fear avoidance.", "triplet": {"subject": "Authors", "verb": "discussed", "object": "how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle"}}, {"text": "Catastrophizing and fear avoidance can result in further distress.", "triplet": {"subject": "Authors", "verb": "discussed", "object": "how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle"}}, {"text": "Further distress can reinforce a deleterious cycle.", "triplet": {"subject": "Authors", "verb": "discussed", "object": "how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle"}}]}], "sentences_without_results": [{"text": "No results: Nine studies reported on expectations (one RPF with little SOE confidence), fear avoidance (10 RPF with little to some SOE confidence), and pain-related anxiety (one RPF with substantial SOE confidence) assessed by questionnaire in relationship to pain severity, disability, lifting capacity, or transition from acute to chronic pain.", "clauses": []}, {"text": "No results: Authors discussed how negative beliefs about pain can lead to catastrophizing and fear avoidance, which can result in further distress and reinforcement of a deleterious cycle.", "clauses": []}]}}, {"paragraph": {"text": "Affective State:"}}, {"paragraph": {"text": "Affect has components of valence (positive vs negative) and arousal (perceived intensity). Negative affect may constitute a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear. In contrast, positive affective states (e.g., joy, hope, love, enthusiasm) are associated with better pain outcomes in longitudinal and experimental studies. Affect balance style is a measure of the relative levels of positive and negative trait affect within an individual. Having a depressive style (low positive affect relative to negative affect) has been associated with greater pain severity, and/or perception of pain without any relation to nociception or bodily symptoms (somatization). Personality trait components can influence certain affective states that can, in turn, influence reported pain sensitivity. ", "sentences_with_results": [{"text": "Negative affect may constitute a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear.", "clauses": [{"text": "Negative affect may constitute a long-term, trait-like vulnerability.", "triplet": {"subject": "Negative affect", "verb": "may constitute", "object": "a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear."}}, {"text": "Negative affect has been found to be a risk factor for greater pain severity.", "triplet": {"subject": "Negative affect", "verb": "may constitute", "object": "a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear."}}, {"text": "Negative affect is associated with emotions such as anger, sadness, irritability, state anxiety, and fear.", "triplet": {"subject": "Negative affect", "verb": "may constitute", "object": "a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear."}}]}, {"text": "In contrast, positive affective states (e.g., joy, hope, love, enthusiasm) are associated with better pain outcomes in longitudinal and experimental studies.", "clauses": [{"text": "In contrast, positive affective states are associated with better pain outcomes.", "triplet": {"subject": "positive affective states", "verb": "are associated", "object": "with better pain outcomes in longitudinal and experimental studies"}}, {"text": "Positive affective states include joy, hope, love, and enthusiasm.", "triplet": {"subject": "positive affective states", "verb": "are associated", "object": "with better pain outcomes in longitudinal and experimental studies"}}, {"text": "Longitudinal and experimental studies have shown this association.", "triplet": {"subject": "positive affective states", "verb": "are associated", "object": "with better pain outcomes in longitudinal and experimental studies"}}]}, {"text": "Affect balance style is a measure of the relative levels of positive and negative trait affect within an individual.", "clauses": [{"text": "Affect balance style is a measure.", "triplet": {"subject": "Affect balance style", "verb": "is", "object": "a measure of the relative levels of positive and negative trait affect within an individual"}}, {"text": "The measure is of the relative levels of positive and negative trait affect.", "triplet": {"subject": "Affect balance style", "verb": "is", "object": "a measure of the relative levels of positive and negative trait affect within an individual"}}, {"text": "The measure is within an individual.", "triplet": {"subject": "Affect balance style", "verb": "is", "object": "a measure of the relative levels of positive and negative trait affect within an individual"}}]}, {"text": "Having a depressive style (low positive affect relative to negative affect) has been associated with greater pain severity, and/or perception of pain without any relation to nociception or bodily symptoms (somatization).", "clauses": [{"text": "Having a depressive style (low positive affect relative to negative affect) has been associated with greater pain severity.", "triplet": {"subject": "Having a depressive style", "verb": "has been associated with", "object": "greater pain severity, and/or perception of pain without any relation to nociception or bodily symptoms (somatization)"}}, {"text": "Having a depressive style (low positive affect relative to negative affect) has been associated with perception of pain without any relation to nociception or bodily symptoms (somatization).", "triplet": {"subject": "Having a depressive style", "verb": "has been associated with", "object": "greater pain severity, and/or perception of pain without any relation to nociception or bodily symptoms (somatization)"}}]}, {"text": "Personality trait components can influence certain affective states that can, in turn, influence reported pain sensitivity.", "clauses": [{"text": "Personality trait components can influence certain affective states.", "triplet": {"subject": "Personality trait components", "verb": "can influence", "object": "certain affective states that can, in turn, influence reported pain sensitivity"}}, {"text": "Certain affective states can influence reported pain sensitivity.", "triplet": {"subject": "Personality trait components", "verb": "can influence", "object": "certain affective states that can, in turn, influence reported pain sensitivity"}}]}], "sentences_without_results": [{"text": "No results: Affect has components of valence (positive vs negative) and arousal (perceived intensity).", "clauses": []}, {"text": "No results: Negative affect may constitute a long-term, trait-like vulnerability and has been found to be a risk factor for greater pain severity and is associated with emotions such as anger, sadness, irritability, state anxiety, and fear.", "clauses": []}, {"text": "No results: In contrast, positive affective states (e.g., joy, hope, love, enthusiasm) are associated with better pain outcomes in longitudinal and experimental studies.", "clauses": []}, {"text": "No results: Affect balance style is a measure of the relative levels of positive and negative trait affect within an individual.", "clauses": []}, {"text": "No results: Having a depressive style (low positive affect relative to negative affect) has been associated with greater pain severity, and/or perception of pain without any relation to nociception or bodily symptoms (somatization).", "clauses": []}, {"text": "No results: Personality trait components can influence certain affective states that can, in turn, influence reported pain sensitivity.", "clauses": []}]}}, {"paragraph": {"text": "Three studies summarized data regarding measures of affective state. three studies drew 8 depression-related conclusions (with little to some SOE confidence) in relationship to work status, opioid use, disability, lifting capacity, pain severity, and overall health status. The authors discuss how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models.  ", "sentences_with_results": [{"text": "Three studies summarized data regarding measures of affective state.", "clauses": [{"text": "Three studies were conducted.", "triplet": {"subject": "Three studies", "verb": "summarized", "object": "data regarding measures of affective state"}}, {"text": "The studies summarized data.", "triplet": {"subject": "Three studies", "verb": "summarized", "object": "data regarding measures of affective state"}}, {"text": "The data pertained to measures of affective state.", "triplet": {"subject": "Three studies", "verb": "summarized", "object": "data regarding measures of affective state"}}]}, {"text": "Three studies drew 8 depression-related conclusions (with little to some SOE confidence) in relationship to work status, opioid use, disability, lifting capacity, pain severity, and overall health status.", "clauses": [{"text": "Three studies drew 8 depression-related conclusions.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions had little to some SOE confidence.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to work status.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to opioid use.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to disability.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to lifting capacity.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to pain severity.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}, {"text": "The conclusions were in relationship to overall health status.", "triplet": {"subject": "Three studies", "verb": "drew", "object": "8 depression-related conclusions"}}]}, {"text": "The authors discuss how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models.", "clauses": [{"text": "The authors discuss how depression is a common comorbidity of cLBP conditions.", "triplet": {"subject": "authors", "verb": "discuss", "object": "how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models"}}, {"text": "The authors discuss how depression contributes via mechanisms included in the biopsychosocial model.", "triplet": {"subject": "authors", "verb": "discuss", "object": "how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models"}}, {"text": "The authors discuss how depression contributes via mechanisms included in the fear-avoidance model.", "triplet": {"subject": "authors", "verb": "discuss", "object": "how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models"}}]}], "sentences_without_results": [{"text": "No results: Three studies summarized data regarding measures of affective state.", "clauses": []}, {"text": "No results: three studies drew 8 depression-related conclusions (with little to some SOE confidence) in relationship to work status, opioid use, disability, lifting capacity, pain severity, and overall health status.", "clauses": []}, {"text": "No results: The authors discuss how depression is a common comorbidity of cLBP conditions and contributes via mechanisms included in the biopsychosocial and fear-avoidance models.", "clauses": []}]}}, {"paragraph": {"text": "Coping Skills:"}}, {"paragraph": {"text": "Coping with pain is an important element in pain perception and responses. The Coping theory by Lazarus and Folkman has become widely applied in behavioral medicine (20). Coping is the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition. Coping styles can be emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception). The behavioral active efforts refer to measures taken to reduce pain, and the cognitive ones are aimed at reinterpreting pain or distraction. The avoidance of activity element in the fear-avoidance model can be viewed as a maladaptive coping style and catastrophizing as an emotion-oriented coping style.", "sentences_with_results": [{"text": "Coping with pain is an important element in pain perception and responses.", "clauses": [{"text": "Coping with pain is an important element.", "triplet": {"subject": "Coping with pain", "verb": "is", "object": "an important element in pain perception and responses"}}, {"text": "Pain perception is an important element.", "triplet": {"subject": "Coping with pain", "verb": "is", "object": "an important element in pain perception and responses"}}, {"text": "Pain responses are an important element.", "triplet": {"subject": "Coping with pain", "verb": "is", "object": "an important element in pain perception and responses"}}]}, {"text": "The Coping theory by Lazarus and Folkman has become widely applied in behavioral medicine (20).", "clauses": [{"text": "The Coping theory by Lazarus and Folkman has become widely applied.", "triplet": {"subject": "The Coping theory by Lazarus and Folkman", "verb": "has become", "object": "widely applied in behavioral medicine"}}, {"text": "The theory is applied in behavioral medicine.", "triplet": {"subject": "The Coping theory by Lazarus and Folkman", "verb": "has become", "object": "widely applied in behavioral medicine"}}]}, {"text": "Coping is the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition.", "clauses": [{"text": "Coping is the behavioral response to pain.", "triplet": {"subject": "Coping", "verb": "is", "object": "the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition"}}, {"text": "Coping is aimed at generating psychological well-being.", "triplet": {"subject": "Coping", "verb": "is", "object": "the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition"}}, {"text": "Coping is aimed at maintaining psychological well-being.", "triplet": {"subject": "Coping", "verb": "is", "object": "the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition"}}, {"text": "Coping is aimed at generating psychological well-being despite living with a serious condition.", "triplet": {"subject": "Coping", "verb": "is", "object": "the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition"}}, {"text": "Coping is aimed at maintaining psychological well-being despite living with a serious condition.", "triplet": {"subject": "Coping", "verb": "is", "object": "the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition"}}]}, {"text": "Coping styles can be emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception).", "clauses": [{"text": "Coping styles can be emotion-oriented coping.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Emotion-oriented coping includes catastrophizing and avoidance.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Emotion-oriented coping also includes ignoring and distress endurance.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Coping styles can also be active-approach coping.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Active-approach coping includes reinterpreting.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Active-approach coping also includes diversion.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}, {"text": "Active-approach coping further includes acceptance and mindful interoception.", "triplet": {"subject": "Coping styles", "verb": "can be", "object": "emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception)"}}]}, {"text": "The behavioral active efforts refer to measures taken to reduce pain, and the cognitive ones are aimed at reinterpreting pain or distraction.", "clauses": [{"text": "The behavioral active efforts refer to measures taken to reduce pain.", "triplet": {"subject": "The behavioral active efforts", "verb": "refer to", "object": "measures taken to reduce pain"}}, {"text": "The cognitive ones are aimed at reinterpreting pain or distraction.", "triplet": {"subject": "The behavioral active efforts", "verb": "refer to", "object": "measures taken to reduce pain"}}]}, {"text": "The avoidance of activity element in the fear-avoidance model can be viewed as a maladaptive coping style and catastrophizing as an emotion-oriented coping style.", "clauses": [{"text": "The avoidance of activity element in the fear-avoidance model can be viewed as a maladaptive coping style.", "triplet": {"subject": "The avoidance of activity element", "verb": "can be viewed as", "object": "a maladaptive coping style and catastrophizing as an emotion-oriented coping style"}}, {"text": "Catastrophizing can be viewed as an emotion-oriented coping style.", "triplet": {"subject": "The avoidance of activity element", "verb": "can be viewed as", "object": "a maladaptive coping style and catastrophizing as an emotion-oriented coping style"}}]}], "sentences_without_results": [{"text": "No results: Coping with pain is an important element in pain perception and responses.", "clauses": []}, {"text": "No results: The Coping theory by Lazarus and Folkman has become widely applied in behavioral medicine (20).", "clauses": []}, {"text": "No results: Coping is the behavioral response to pain aimed at generating and maintaining psychological well-being despite living with a serious condition.", "clauses": []}, {"text": "No results: Coping styles can be emotion-oriented coping (such as catastrophizing and avoidance; ignoring and distress endurance) or active-approach coping (such as reinterpreting; diversion; acceptance and mindful interoception).", "clauses": []}, {"text": "No results: The behavioral active efforts refer to measures taken to reduce pain, and the cognitive ones are aimed at reinterpreting pain or distraction.", "clauses": []}, {"text": "No results: The avoidance of activity element in the fear-avoidance model can be viewed as a maladaptive coping style and catastrophizing as an emotion-oriented coping style.", "clauses": []}]}}, {"paragraph": {"text": "Three studies described research on coping skills that include coping strategies (2 RPF with little SOE confidence), catastrophizing (one RPF with little SOE confidence), and self-efficacy (2 RPF with little to some SOE confidence) in relationship to disability, functional limitation, lifting capacity, work status, and transition from acute to chronic LBP. Similar to pain beliefs, authors discuss how fear-avoidance and reduced activity can lead to worsening physical conditioning.  ", "sentences_with_results": [{"text": "Three studies described research on coping skills that include coping strategies (2 RPF with little SOE confidence), catastrophizing (one RPF with little SOE confidence), and self-efficacy (2 RPF with little to some SOE confidence) in relationship to disability, functional limitation, lifting capacity, work status, and transition from acute to chronic LBP.", "clauses": [{"text": "Three studies described research on coping skills that include coping strategies (2 RPF with little SOE confidence).", "triplet": {"subject": "Three studies", "verb": "described", "object": "research on coping skills"}}, {"text": "The studies also examined catastrophizing (one RPF with little SOE confidence) as a coping skill.", "triplet": {"subject": "Three studies", "verb": "described", "object": "research on coping skills"}}, {"text": "Additionally, the studies explored self-efficacy (2 RPF with little to some SOE confidence) in relation to disability, functional limitation, lifting capacity, work status, and transition from acute to chronic LBP.", "triplet": {"subject": "Three studies", "verb": "described", "object": "research on coping skills"}}]}], "sentences_without_results": [{"text": "No results: Three studies described research on coping skills that include coping strategies (2 RPF with little SOE confidence), catastrophizing (one RPF with little SOE confidence), and self-efficacy (2 RPF with little to some SOE confidence) in relationship to disability, functional limitation, lifting capacity, work status, and transition from acute to chronic LBP.", "clauses": []}, {"text": "No results: Similar to pain beliefs, authors discuss how fear-avoidance and reduced activity can lead to worsening physical conditioning.", "clauses": []}]}}, {"paragraph": {"text": "Psychological Resources:"}}, {"paragraph": {"text": "Coping style is dependent on an individual’s psychological resources and can be limited by numerous potentially modifiable traits. numerous potentially modifiable traits have been operationalized as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain. numerous potentially modifiable traits have shown strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness.\nOne study reported data regarding measures of negative psychological states (2 RPF with little SOE confidence) in relation to work status, pain, and functional limitations.", "sentences_with_results": [{"text": "Numerous potentially modifiable traits have been operationalized as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain.", "clauses": [{"text": "Numerous potentially modifiable traits have been operationalized as distinct psychological constructs.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have been operationalized", "object": "as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain"}}, {"text": "These constructs are often overlapping.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have been operationalized", "object": "as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain"}}, {"text": "These constructs are associated with resilience to pain.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have been operationalized", "object": "as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain"}}, {"text": "These constructs are also associated with vulnerability to pain.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have been operationalized", "object": "as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain"}}]}, {"text": "Numerous potentially modifiable traits have shown strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness.", "clauses": [{"text": "Numerous potentially modifiable traits have shown strong influences on the bothersomeness of pain.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include pain self-efficacy.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include resilience.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include the capacity to self-regulate.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include the capacity to regulate emotions.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include psychological flexibility.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include mindfulness.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}, {"text": "These traits include interoceptive awareness.", "triplet": {"subject": "Numerous potentially modifiable traits", "verb": "have shown", "object": "strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness."}}]}, {"text": "One study reported data regarding measures of negative psychological states (2 RPF with little SOE confidence) in relation to work status, pain, and functional limitations.", "clauses": [{"text": "One study reported data regarding measures of negative psychological states.", "triplet": {"subject": "One study", "verb": "reported", "object": "data regarding measures of negative psychological states (2 RPF with little SOE confidence) in relation to work status, pain, and functional limitations"}}, {"text": "The study reported data regarding work status, pain, and functional limitations.", "triplet": {"subject": "One study", "verb": "reported", "object": "data regarding measures of negative psychological states (2 RPF with little SOE confidence) in relation to work status, pain, and functional limitations"}}]}], "sentences_without_results": [{"text": "No results: Coping style is dependent on an individual’s psychological resources and can be limited by numerous potentially modifiable traits.", "clauses": []}, {"text": "No results: numerous potentially modifiable traits have been operationalized as distinct but often overlapping psychological constructs associated with resilience or vulnerability to pain.", "clauses": []}, {"text": "No results: numerous potentially modifiable traits have shown strong influences on the bothersomeness of pain, such as pain self-efficacy, resilience, the capacity to self-regulate, to regulate emotions, psychological flexibility, mindfulness, and interoceptive awareness.\nOne study reported data regarding measures of negative psychological states (2 RPF with little SOE confidence) in relation to work status, pain, and functional limitations.", "clauses": []}]}}, {"paragraph": {"text": "Personality Traits:"}}, {"paragraph": {"text": "Personality influences how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies.  Cognitive, emotional, and behavioral patterns influence pain perception. Personality traits represent a pattern of thinking that can influence processing and interpretation of one’s pain experience. Features linked to chronic pain sufferers include higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping). Trait neuroticism is known to increase vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing. Extroversion has been associated with more pain complaints. Trait anxiety is a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future. Positive traits include optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources).", "sentences_with_results": [{"text": "Personality influences how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies.", "clauses": [{"text": "Personality influences how people constitute the meanings and implications of pain.", "triplet": {"subject": "Personality", "verb": "influences", "object": "how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies"}}, {"text": "Personality influences the adoption of different types of pain-related beliefs.", "triplet": {"subject": "Personality", "verb": "influences", "object": "how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies"}}, {"text": "Personality influences the adoption of different types of pain-related coping strategies.", "triplet": {"subject": "Personality", "verb": "influences", "object": "how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies"}}]}, {"text": "Cognitive, emotional, and behavioral patterns influence pain perception.", "clauses": [{"text": "Cognitive patterns influence pain perception.", "triplet": {"subject": "Cognitive, emotional, and behavioral patterns", "verb": "influence", "object": "pain perception"}}, {"text": "Emotional patterns influence pain perception.", "triplet": {"subject": "Cognitive, emotional, and behavioral patterns", "verb": "influence", "object": "pain perception"}}, {"text": "Behavioral patterns influence pain perception.", "triplet": {"subject": "Cognitive, emotional, and behavioral patterns", "verb": "influence", "object": "pain perception"}}]}, {"text": "Personality traits represent a pattern of thinking that can influence processing and interpretation of one’s pain experience.", "clauses": [{"text": "Personality traits represent a pattern of thinking.", "triplet": {"subject": "Personality traits", "verb": "represent", "object": "a pattern of thinking that can influence processing and interpretation of one’s pain experience"}}, {"text": "Personality traits can influence processing of one's pain experience.", "triplet": {"subject": "Personality traits", "verb": "represent", "object": "a pattern of thinking that can influence processing and interpretation of one’s pain experience"}}, {"text": "Personality traits can influence interpretation of one's pain experience.", "triplet": {"subject": "Personality traits", "verb": "represent", "object": "a pattern of thinking that can influence processing and interpretation of one’s pain experience"}}]}, {"text": "Features linked to chronic pain sufferers include higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping).", "clauses": [{"text": "Features linked to chronic pain sufferers include higher harm avoidance.", "triplet": {"subject": "Features linked to chronic pain sufferers", "verb": "include", "object": "higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping)"}}, {"text": "Higher harm avoidance is characterized by being fearful, pessimistic, sensitive to criticism, and requiring high levels of reassurance.", "triplet": {"subject": "Features linked to chronic pain sufferers", "verb": "include", "object": "higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping)"}}, {"text": "Features linked to chronic pain sufferers also include lower self-directedness.", "triplet": {"subject": "Features linked to chronic pain sufferers", "verb": "include", "object": "higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping)"}}, {"text": "Lower self-directedness is manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping.", "triplet": {"subject": "Features linked to chronic pain sufferers", "verb": "include", "object": "higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping)"}}]}, {"text": "Trait neuroticism is known to increase vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing.", "clauses": [{"text": "Trait neuroticism is known to increase vulnerability to develop depression.", "triplet": {"subject": "Trait neuroticism", "verb": "is known to increase", "object": "vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing"}}, {"text": "Trait neuroticism is known to increase vulnerability to develop anxiety.", "triplet": {"subject": "Trait neuroticism", "verb": "is known to increase", "object": "vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing"}}, {"text": "Trait neuroticism is known to increase vulnerability to develop kinesiophobia.", "triplet": {"subject": "Trait neuroticism", "verb": "is known to increase", "object": "vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing"}}, {"text": "Trait neuroticism is known to increase vulnerability to develop pain catastrophizing.", "triplet": {"subject": "Trait neuroticism", "verb": "is known to increase", "object": "vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing"}}]}, {"text": "Extroversion has been associated with more pain complaints.", "clauses": [{"text": "Extroversion has been associated with pain complaints.", "triplet": {"subject": "Extroversion", "verb": "has been associated with", "object": "more pain complaints"}}, {"text": "More pain complaints have been associated with extroversion.", "triplet": {"subject": "Extroversion", "verb": "has been associated with", "object": "more pain complaints"}}]}, {"text": "Trait anxiety is a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future.", "clauses": [{"text": "Trait anxiety is a personality characteristic of constant high arousal.", "triplet": {"subject": "Trait anxiety", "verb": "is", "object": "a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future"}}, {"text": "Trait anxiety is a personality characteristic with a sense of tension, worry, or apprehension.", "triplet": {"subject": "Trait anxiety", "verb": "is", "object": "a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future"}}, {"text": "Trait anxiety is a personality characteristic relative to something adverse.", "triplet": {"subject": "Trait anxiety", "verb": "is", "object": "a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future"}}, {"text": "Trait anxiety is a personality characteristic that might happen in the future.", "triplet": {"subject": "Trait anxiety", "verb": "is", "object": "a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future"}}]}, {"text": "Positive traits include optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources).", "clauses": [{"text": "Positive traits include optimism.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "Positive traits include agreeableness.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "Positive traits include openness.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "Positive traits include emotional flexibility.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "Positive traits include conscientiousness.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "These traits help with social support network and acceptance of the situation.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}, {"text": "These traits add to coping resources.", "triplet": {"subject": "Positive traits", "verb": "include", "object": "optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources)"}}]}], "sentences_without_results": [{"text": "No results: Personality influences how people constitute the meanings and implications of pain, and the adoption of different types of pain-related beliefs and coping strategies.", "clauses": []}, {"text": "No results:  Cognitive, emotional, and behavioral patterns influence pain perception.", "clauses": []}, {"text": "No results: Personality traits represent a pattern of thinking that can influence processing and interpretation of one’s pain experience.", "clauses": []}, {"text": "No results: Features linked to chronic pain sufferers include higher harm avoidance (e.g., being fearful, pessimistic, sensitive to criticism, requiring high levels of reassurance), and lower self-directedness (manifested by difficulty in defining and setting meaningful goals, low motivation, and problems with adaptive coping).", "clauses": []}, {"text": "No results: Trait neuroticism is known to increase vulnerability to develop depression, anxiety, kinesiophobia and pain catastrophizing.", "clauses": []}, {"text": "No results: Extroversion has been associated with more pain complaints.", "clauses": []}, {"text": "No results: Trait anxiety is a personality characteristic of constant high arousal with a sense of tension, worry or apprehension relative to something adverse that might happen in the future.", "clauses": []}, {"text": "No results: Positive traits include optimism, agreeableness, openness, emotional flexibility, and conscientiousness that help with social support network and acceptance of the situation, and add to coping resources (see below Psychological Resources).", "clauses": []}]}}, {"paragraph": {"text": "None of the cites studies reported solely on personality traits.\n", "sentences_with_results": [{"text": "", "clauses": [{"text": "She went to the store to buy groceries.", "triplet": {"sentence": "The cat is sleeping.", "subject": "The cat", "verb": "is sleeping", "object": ""}}, {"text": "He called his mother to wish her a happy birthday.", "triplet": {"sentence": "The cat is sleeping.", "subject": "The cat", "verb": "is sleeping", "object": ""}}, {"text": "They decided to go on vacation to the beach.", "triplet": {"sentence": "The cat is sleeping.", "subject": "The cat", "verb": "is sleeping", "object": ""}}, {"text": "I ate dinner and then went for a walk.", "triplet": {"sentence": "The cat is sleeping.", "subject": "The cat", "verb": "is sleeping", "object": ""}}, {"text": "We watched a movie and then went to bed.", "triplet": {"sentence": "The cat is sleeping.", "subject": "The cat", "verb": "is sleeping", "object": ""}}]}], "sentences_without_results": [{"text": "No results: None of the cites studies reported solely on personality traits.", "clauses": []}]}}]